// profitTotal 128229.40293307074
// maxLossTotal -8015.37
// winRateTotal 2363.840000000001
// period month 53
// avgRate 44.60
// maxDrawdownTotal 46.3
// 趋势空且增强-1 总交易次数: 252 盈利: 171 亏损: 81 最大盈利: 3060.96 最大亏损: -8015.37 胜率: 67.86% 总收益: 9677.65
// 趋势多且增强-7 总交易次数: 270 盈利: 181 亏损: 89 最大盈利: 1699.60 最大亏损: -1208.82 胜率: 67.04% 总收益: 15497.30
// 趋势空且增强-11 总交易次数: 146 盈利: 89 亏损: 57 最大盈利: 778.33 最大亏损: -813.44 胜率: 60.96% 总收益: 2766.38
// 趋势空且增强-2 总交易次数: 166 盈利: 98 亏损: 68 最大盈利: 1750.26 最大亏损: -1724.13 胜率: 59.04% 总收益: 1835.80
// 趋势多且增强-3 总交易次数: 12 盈利: 7 亏损: 5 最大盈利: 405.27 最大亏损: -92.76 胜率: 58.33% 总收益: 642.52
// 趋势多且增强-8 总交易次数: 275 盈利: 155 亏损: 120 最大盈利: 3060.40 最大亏损: -1479.45 胜率: 56.36% 总收益: 1439.47
// 趋势多且增强-4 总交易次数: 785 盈利: 437 亏损: 348 最大盈利: 3373.87 最大亏损: -1173.74 胜率: 55.67% 总收益: 21416.80
// 趋势多且增强-11 总交易次数: 182 盈利: 100 亏损: 82 最大盈利: 2658.47 最大亏损: -907.40 胜率: 54.95% 总收益: 3391.26
// 趋势多且增强-1 总交易次数: 102 盈利: 47 亏损: 55 最大盈利: 3283.19 最大亏损: -1889.43 胜率: 46.08% 总收益: 6530.29
// 趋势空且增强-4 总交易次数: 76 盈利: 35 亏损: 41 最大盈利: 910.73 最大亏损: -292.60 胜率: 46.05% 总收益: 1609.29
// 趋势空且增强-7 总交易次数: 1465 盈利: 643 亏损: 822 最大盈利: 2350.99 最大亏损: -3479.07 胜率: 43.89% 总收益: 23983.70
// 趋势多且增强-2 总交易次数: 1204 盈利: 471 亏损: 733 最大盈利: 3114.40 最大亏损: -1401.52 胜率: 39.12% 总收益: 40899.91
// 趋势多且增强-10 总交易次数: 54 盈利: 21 亏损: 33 最大盈利: 1251.76 最大亏损: -797.76 胜率: 38.89% 总收益: 1629.24
// 趋势空且增强-3 总交易次数: 380 盈利: 140 亏损: 240 最大盈利: 1717.05 最大亏损: -1220.59 胜率: 36.84% 总收益: 5954.93
// 趋势多且增强-6 总交易次数: 916 盈利: 312 亏损: 604 最大盈利: 2117.62 最大亏损: -1603.63 胜率: 34.06% 总收益: 3968.27
// 趋势多且增强-5 总交易次数: 38 盈利: 9 亏损: 29 最大盈利: 275.93 最大亏损: -185.04 胜率: 23.68% 总收益: -305.40

/*
###################################################

趋势多且增强-1 总交易次数: 102 盈利: 15543.836700226399 亏损: -9013.549142325903 最大盈利: 3283.19 最大亏损: -1889.43 胜率: 46.08% 总收益: 6530.29 平均盈利: 64.02
趋势多且增强-7 总交易次数: 270 盈利: 39401.278935118884 亏损: -23903.97890286401 最大盈利: 1699.60 最大亏损: -1208.82 胜率: 67.04% 总收益: 15497.30 平均盈利: 57.40
趋势多且增强-3 总交易次数: 12 盈利: 802.7784718940346 亏损: -160.25659676774796 最大盈利: 405.27 最大亏损: -92.76 胜率: 58.33% 总收益: 642.52 平均盈利: 53.54
趋势空且增强-1 总交易次数: 252 盈利: 45986.12098660062 亏损: -36308.473752504535 最大盈利: 3060.96 最大亏损: -8015.37 胜率: 67.86% 总收益: 9677.65 平均盈利: 38.40
趋势多且增强-2 总交易次数: 1204 盈利: 136196.84061735877 亏损: -95296.93241461799 最大盈利: 3114.40 最大亏损: -1401.52 胜率: 39.12% 总收益: 40899.91 平均盈利: 33.97
趋势多且增强-10 总交易次数: 54 盈利: 4197.441592576286 亏损: -2568.205216179146 最大盈利: 1251.76 最大亏损: -797.76 胜率: 38.89% 总收益: 1629.24 平均盈利: 30.17
趋势多且增强-4 总交易次数: 785 盈利: 59600.76945481538 亏损: -38183.965008360436 最大盈利: 3373.87 最大亏损: -1173.74 胜率: 55.67% 总收益: 21416.80 平均盈利: 27.28
趋势空且增强-4 总交易次数: 76 盈利: 5795.6569336612 亏损: -4186.367615539448 最大盈利: 910.73 最大亏损: -292.60 胜率: 46.05% 总收益: 1609.29 平均盈利: 21.17
趋势空且增强-11 总交易次数: 146 盈利: 14149.47938334938 亏损: -11383.10405512391 最大盈利: 778.33 最大亏损: -813.44 胜率: 60.96% 总收益: 2766.38 平均盈利: 18.95
趋势多且增强-11 总交易次数: 182 盈利: 20517.223144383825 亏损: -17125.96673588096 最大盈利: 2658.47 最大亏损: -907.40 胜率: 54.95% 总收益: 3391.26 平均盈利: 18.63
趋势空且增强-7 总交易次数: 1465 盈利: 165861.3375531459 亏损: -141877.6423715744 最大盈利: 2350.99 最大亏损: -3479.07 胜率: 43.89% 总收益: 23983.70 平均盈利: 16.37
趋势空且增强-3 总交易次数: 380 盈利: 30163.064226270282 亏损: -24208.1294140455 最大盈利: 1717.05 最大亏损: -1220.59 胜率: 36.84% 总收益: 5954.93 平均盈利: 15.67
趋势空且增强-2 总交易次数: 166 盈利: 13108.576725370716 亏损: -11272.772603321857 最大盈利: 1750.26 最大亏损: -1724.13 胜率: 59.04% 总收益: 1835.80 平均盈利: 11.06
趋势多且增强-8 总交易次数: 275 盈利: 18957.67933200975 亏损: -17518.207981196203 最大盈利: 3060.40 最大亏损: -1479.45 胜率: 56.36% 总收益: 1439.47 平均盈利: 5.23
趋势多且增强-6 总交易次数: 916 盈利: 51025.907279950356 亏损: -47057.63398281573 最大盈利: 2117.62 最大亏损: -1603.63 胜率: 34.06% 总收益: 3968.27 平均盈利: 4.33
趋势多且增强-5 总交易次数: 38 盈利: 822.6398399342359 亏损: -1128.0424504778116 最大盈利: 275.93 最大亏损: -185.04 胜率: 23.68% 总收益: -305.40 平均盈利: -8.04

###############################################################################

趋势多且增强-7 总交易次数: 270 盈利: 39401.278935118884 亏损: -23903.97890286401 最大盈利: 1699.60 最大亏损: -1208.82 胜率: 67.04% 总收益: 15497.30 平均盈利: 57.40 typeA: 38.48
趋势多且增强-3 总交易次数: 12 盈利: 802.7784718940346 亏损: -160.25659676774796 最大盈利: 405.27 最大亏损: -92.76 胜率: 58.33% 总收益: 642.52 平均盈利: 53.54 typeA: 31.23
趋势多且增强-1 总交易次数: 102 盈利: 15543.836700226399 亏损: -9013.549142325903 最大盈利: 3283.19 最大亏损: -1889.43 胜率: 46.08% 总收益: 6530.29 平均盈利: 64.02 typeA: 29.50
趋势空且增强-1 总交易次数: 252 盈利: 45986.12098660062 亏损: -36308.473752504535 最大盈利: 3060.96 最大亏损: -8015.37 胜率: 67.86% 总收益: 9677.65 平均盈利: 38.40 typeA: 26.06
趋势多且增强-4 总交易次数: 785 盈利: 59600.76945481538 亏损: -38183.965008360436 最大盈利: 3373.87 最大亏损: -1173.74 胜率: 55.67% 总收益: 21416.80 平均盈利: 27.28 typeA: 15.19
趋势多且增强-2 总交易次数: 1204 盈利: 136196.84061735877 亏损: -95296.93241461799 最大盈利: 3114.40 最大亏损: -1401.52 胜率: 39.12% 总收益: 40899.91 平均盈利: 33.97 typeA: 13.29
趋势多且增强-10 总交易次数: 54 盈利: 4197.441592576286 亏损: -2568.205216179146 最大盈利: 1251.76 最大亏损: -797.76 胜率: 38.89% 总收益: 1629.24 平均盈利: 30.17 typeA: 11.73
趋势空且增强-11 总交易次数: 146 盈利: 14149.47938334938 亏损: -11383.10405512391 最大盈利: 778.33 最大亏损: -813.44 胜率: 60.96% 总收益: 2766.38 平均盈利: 18.95 typeA: 11.55
趋势多且增强-11 总交易次数: 182 盈利: 20517.223144383825 亏损: -17125.96673588096 最大盈利: 2658.47 最大亏损: -907.40 胜率: 54.95% 总收益: 3391.26 平均盈利: 18.63 typeA: 10.24
趋势空且增强-4 总交易次数: 76 盈利: 5795.6569336612 亏损: -4186.367615539448 最大盈利: 910.73 最大亏损: -292.60 胜率: 46.05% 总收益: 1609.29 平均盈利: 21.17 typeA: 9.75
趋势空且增强-7 总交易次数: 1465 盈利: 165861.3375531459 亏损: -141877.6423715744 最大盈利: 2350.99 最大亏损: -3479.07 胜率: 43.89% 总收益: 23983.70 平均盈利: 16.37 typeA: 7.19
趋势空且增强-2 总交易次数: 166 盈利: 13108.576725370716 亏损: -11272.772603321857 最大盈利: 1750.26 最大亏损: -1724.13 胜率: 59.04% 总收益: 1835.80 平均盈利: 11.06 typeA: 6.53
趋势空且增强-3 总交易次数: 380 盈利: 30163.064226270282 亏损: -24208.1294140455 最大盈利: 1717.05 最大亏损: -1220.59 胜率: 36.84% 总收益: 5954.93 平均盈利: 15.67 typeA: 5.77
趋势多且增强-8 总交易次数: 275 盈利: 18957.67933200975 亏损: -17518.207981196203 最大盈利: 3060.40 最大亏损: -1479.45 胜率: 56.36% 总收益: 1439.47 平均盈利: 5.23 typeA: 2.95
趋势多且增强-6 总交易次数: 916 盈利: 51025.907279950356 亏损: -47057.63398281573 最大盈利: 2117.62 最大亏损: -1603.63 胜率: 34.06% 总收益: 3968.27 平均盈利: 4.33 typeA: 1.48
趋势多且增强-5 总交易次数: 38 盈利: 822.6398399342359 亏损: -1128.0424504778116 最大盈利: 275.93 最大亏损: -185.04 胜率: 23.68% 总收益: -305.40 平均盈利: -8.04 typeA: -1.90


##################################################

profitTotal 128229.40293307074
maxLossTotal -8015.37
winRateTotal 2363.840000000001
period month 53
avgRate 44.60
maxDrawdownTotal 46.3
趋势多且增强-7 总交易次数: 270 盈利: 39401.278935118884 亏损: -23903.97890286401 最大盈利: 1699.60 最大亏损: -1208.82 胜率: 67.04% 总收益: 15497.30 平均盈利: 57.40 typeA: 38.48
趋势多且增强-3 总交易次数: 12 盈利: 802.7784718940346 亏损: -160.25659676774796 最大盈利: 405.27 最大亏损: -92.76 胜率: 58.33% 总收益: 642.52 平均盈利: 53.54 typeA: 31.23
趋势多且增强-1 总交易次数: 102 盈利: 15543.836700226399 亏损: -9013.549142325903 最大盈利: 3283.19 最大亏损: -1889.43 胜率: 46.08% 总收益: 6530.29 平均盈利: 64.02 typeA: 29.50
趋势空且增强-1 总交易次数: 252 盈利: 45986.12098660062 亏损: -36308.473752504535 最大盈利: 3060.96 最大亏损: -8015.37 胜率: 67.86% 总收益: 9677.65 平均盈利: 38.40 typeA: 26.06
趋势多且增强-4 总交易次数: 785 盈利: 59600.76945481538 亏损: -38183.965008360436 最大盈利: 3373.87 最大亏损: -1173.74 胜率: 55.67% 总收益: 21416.80 平均盈利: 27.28 typeA: 15.19
趋势多且增强-2 总交易次数: 1204 盈利: 136196.84061735877 亏损: -95296.93241461799 最大盈利: 3114.40 最大亏损: -1401.52 胜率: 39.12% 总收益: 40899.91 平均盈利: 33.97 typeA: 13.29
趋势多且增强-10 总交易次数: 54 盈利: 4197.441592576286 亏损: -2568.205216179146 最大盈利: 1251.76 最大亏损: -797.76 胜率: 38.89% 总收益: 1629.24 平均盈利: 30.17 typeA: 11.73
趋势空且增强-11 总交易次数: 146 盈利: 14149.47938334938 亏损: -11383.10405512391 最大盈利: 778.33 最大亏损: -813.44 胜率: 60.96% 总收益: 2766.38 平均盈利: 18.95 typeA: 11.55
趋势多且增强-11 总交易次数: 182 盈利: 20517.223144383825 亏损: -17125.96673588096 最大盈利: 2658.47 最大亏损: -907.40 胜率: 54.95% 总收益: 3391.26 平均盈利: 18.63 typeA: 10.24
趋势空且增强-4 总交易次数: 76 盈利: 5795.6569336612 亏损: -4186.367615539448 最大盈利: 910.73 最大亏损: -292.60 胜率: 46.05% 总收益: 1609.29 平均盈利: 21.17 typeA: 9.75
趋势空且增强-7 总交易次数: 1465 盈利: 165861.3375531459 亏损: -141877.6423715744 最大盈利: 2350.99 最大亏损: -3479.07 胜率: 43.89% 总收益: 23983.70 平均盈利: 16.37 typeA: 7.19
趋势空且增强-2 总交易次数: 166 盈利: 13108.576725370716 亏损: -11272.772603321857 最大盈利: 1750.26 最大亏损: -1724.13 胜率: 59.04% 总收益: 1835.80 平均盈利: 11.06 typeA: 6.53
趋势空且增强-3 总交易次数: 380 盈利: 30163.064226270282 亏损: -24208.1294140455 最大盈利: 1717.05 最大亏损: -1220.59 胜率: 36.84% 总收益: 5954.93 平均盈利: 15.67 typeA: 5.77
趋势多且增强-8 总交易次数: 275 盈利: 18957.67933200975 亏损: -17518.207981196203 最大盈利: 3060.40 最大亏损: -1479.45 胜率: 56.36% 总收益: 1439.47 平均盈利: 5.23 typeA: 2.95
趋势多且增强-6 总交易次数: 916 盈利: 51025.907279950356 亏损: -47057.63398281573 最大盈利: 2117.62 最大亏损: -1603.63 胜率: 34.06% 总收益: 3968.27 平均盈利: 4.33 typeA: 1.48
趋势多且增强-5 总交易次数: 38 盈利: 822.6398399342359 亏损: -1128.0424504778116 最大盈利: 275.93 最大亏损: -185.04 胜率: 23.68% 总收益: -305.40 平均盈利: -8.04 typeA: -1.90


###################################################

profitTotal 144034.70494669524
maxLossTotal -5425.95
winRateTotal 2260.7100000000005
period month 53
avgRate 42.65
maxDrawdownTotal 41.9
趋势多且增强-1 总交易次数: 58 盈利: 17878.374725835467 亏损: -9735.804410992057 最大盈利: 6150.71 最大亏损: -1889.43 胜率: 56.90% 总收益: 8142.57 平均盈利: 140.39 typeA: 79.88
趋势空且增强-1 总交易次数: 120 盈利: 31111.87932022779 亏损: -19991.228125900136 最大盈利: 3191.96 最大亏损: -5425.95 胜率: 62.50% 总收益: 11120.65 平均盈利: 92.67 typeA: 57.92
趋势多且增强-7 总交易次数: 270 盈利: 39487.316299317084 亏损: -23903.97890286401 最大盈利: 1699.60 最大亏损: -1208.82 胜率: 67.04% 总收益: 15583.34 平均盈利: 57.72 typeA: 38.69
趋势多且增强-4 总交易次数: 607 盈利: 60051.90442671677 亏损: -30139.898157963285 最大盈利: 9227.82 最大亏损: -1173.74 胜率: 52.88% 总收益: 29912.01 平均盈利: 49.28 typeA: 26.06
趋势多且增强-2 总交易次数: 1039 盈利: 129016.28703655387 亏损: -83039.08150993954 最大盈利: 9874.53 最大亏损: -1401.52 胜率: 36.48% 总收益: 45977.21 平均盈利: 44.25 typeA: 16.14
趋势多且增强-10 总交易次数: 54 盈利: 5032.707097453098 亏损: -2838.8038257945077 最大盈利: 2723.88 最大亏损: -797.76 胜率: 35.19% 总收益: 2193.90 平均盈利: 40.63 typeA: 14.30
趋势空且增强-11 总交易次数: 146 盈利: 14149.47938334938 亏损: -11383.10405512391 最大盈利: 778.33 最大亏损: -813.44 胜率: 60.96% 总收益: 2766.38 平均盈利: 18.95 typeA: 11.55
趋势空且增强-4 总交易次数: 76 盈利: 5795.6569336612 亏损: -4186.367615539448 最大盈利: 910.73 最大亏损: -292.60 胜率: 46.05% 总收益: 1609.29 平均盈利: 21.17 typeA: 9.75
趋势空且增强-7 总交易次数: 1465 盈利: 165861.3375531459 亏损: -141877.6423715744 最大盈利: 2350.99 最大亏损: -3479.07 胜率: 43.89% 总收益: 23983.70 平均盈利: 16.37 typeA: 7.19
趋势空且增强-2 总交易次数: 166 盈利: 13108.576725370716 亏损: -11272.772603321857 最大盈利: 1750.26 最大亏损: -1724.13 胜率: 59.04% 总收益: 1835.80 平均盈利: 11.06 typeA: 6.53
趋势多且增强-8 总交易次数: 275 盈利: 20514.748514673814 亏损: -17518.207981196203 最大盈利: 4561.65 最大亏损: -1479.45 胜率: 56.36% 总收益: 2996.54 平均盈利: 10.90 typeA: 6.14
趋势空且增强-3 总交易次数: 380 盈利: 30163.064226270282 亏损: -24208.1294140455 最大盈利: 1717.05 最大亏损: -1220.59 胜率: 36.84% 总收益: 5954.93 平均盈利: 15.67 typeA: 5.77
趋势多且增强-3 总交易次数: 12 盈利: 397.5066159653215 亏损: -286.16007499605973 最大盈利: 151.39 最大亏损: -125.90 胜率: 50.00% 总收益: 111.35 平均盈利: 9.28 typeA: 4.64
趋势多且增强-11 总交易次数: 172 盈利: 22745.325256324766 亏损: -21301.815662002093 最大盈利: 2331.42 最大亏损: -907.40 胜率: 43.02% 总收益: 1443.51 平均盈利: 8.39 typeA: 3.61
趋势多且增强-6 总交易次数: 881 盈利: 49755.747215755924 亏损: -47619.03342110404 最大盈利: 2117.62 最大亏损: -1603.63 胜率: 31.56% 总收益: 2136.71 平均盈利: 2.43 typeA: 0.77
趋势多且增强-5 总交易次数: 38 盈利: 982.8641989085944 亏损: -1128.0424504778116 最大盈利: 275.93 最大亏损: -185.04 胜率: 23.68% 总收益: -145.18 平均盈利: -3.82 typeA: -0.90

###########################################################################

profitTotal 148380.2293375683
maxLossTotal -3479.07
winRateTotal 2273.48
period month 53
avgRate 42.90
maxDrawdownTotal 44.3
趋势多且增强-7 总交易次数: 270 盈利: 39487.316299317084 亏损: -23903.97890286401 最大盈利: 1699.60 最大亏损: -1208.82 胜率: 67.04% 总收益: 15583.34 平均盈利: 57.72 typeA: 38.69
趋势多且增强-3 总交易次数: 12 盈利: 802.7784718940346 亏损: -160.25659676774796 最大盈利: 405.27 最大亏损: -92.76 胜率: 58.33% 总收益: 642.52 平均盈利: 53.54 typeA: 31.23
趋势多且增强-2 总交易次数: 1103 盈利: 173577.2724759525 亏损: -88391.39003756334 最大盈利: 41166.13 最大亏损: -1401.52 胜率: 37.90% 总收益: 85185.88 平均盈利: 77.23 typeA: 29.27
趋势多且增强-11 总交易次数: 181 盈利: 23175.845051034776 亏损: -18551.016628453748 最大盈利: 2331.42 最大亏损: -907.40 胜率: 49.72% 总收益: 4624.83 平均盈利: 25.55 typeA: 12.70
趋势空且增强-11 总交易次数: 146 盈利: 14149.47938334938 亏损: -11647.058051779211 最大盈利: 778.33 最大亏损: -897.70 胜率: 60.96% 总收益: 2502.42 平均盈利: 17.14 typeA: 10.45
趋势空且增强-4 总交易次数: 76 盈利: 5795.6569336612 亏损: -4186.367615539448 最大盈利: 910.73 最大亏损: -292.60 胜率: 46.05% 总收益: 1609.29 平均盈利: 21.17 typeA: 9.75
趋势空且增强-2 总交易次数: 166 盈利: 13108.576725370716 亏损: -11078.50583539961 最大盈利: 1750.26 最大亏损: -818.35 胜率: 59.04% 总收益: 2030.07 平均盈利: 12.23 typeA: 7.22
趋势多且增强-10 总交易次数: 54 盈利: 3731.834920204533 亏损: -2755.579305853593 最大盈利: 1251.76 最大亏损: -797.76 胜率: 37.04% 总收益: 976.26 平均盈利: 18.08 typeA: 6.70
趋势空且增强-7 总交易次数: 1467 盈利: 165861.3375531459 亏损: -144142.32283461362 最大盈利: 2350.99 最大亏损: -3479.07 胜率: 43.83% 总收益: 21719.01 平均盈利: 14.81 typeA: 6.49
趋势多且增强-8 总交易次数: 275 盈利: 20677.634858869253 亏损: -17518.207981196203 最大盈利: 4780.36 最大亏损: -1479.45 胜率: 56.36% 总收益: 3159.43 平均盈利: 11.49 typeA: 6.48
趋势多且增强-4 总交易次数: 657 盈利: 41378.95987003667 亏损: -34007.904189795496 最大盈利: 1855.48 最大亏损: -1173.74 胜率: 52.82% 总收益: 7371.06 平均盈利: 11.22 typeA: 5.93
趋势空且增强-3 总交易次数: 380 盈利: 30133.564474902803 亏损: -24262.45297253222 最大盈利: 1717.05 最大亏损: -1220.59 胜率: 36.58% 总收益: 5871.11 平均盈利: 15.45 typeA: 5.65
趋势多且增强-6 总交易次数: 914 盈利: 55993.55515001397 亏损: -47043.13926728289 最大盈利: 5340.69 最大亏损: -1603.63 胜率: 33.92% 总收益: 8950.42 平均盈利: 9.79 typeA: 3.32
趋势多且增强-5 总交易次数: 38 盈利: 822.6398399342359 亏损: -1128.0424504778116 最大盈利: 275.93 最大亏损: -185.04 胜率: 23.68% 总收益: -305.40 平均盈利: -8.04 typeA: -1.90

==================================================================




profitTotal 152640.6598333721
maxLossTotal -3479.07
winRateTotal 2306.8199999999997
period month 53
avgRate 43.52
maxDrawdownTotal 44.1
趋势多且增强-7 总交易次数: 270 盈利: 39487.316299317084 亏损: -23903.97890286401 最大盈利: 1699.60 最大亏损: -1208.82 胜率: 67.04% 总收益: 15583.34 平均盈利: 57.72 typeA: 38.69
趋势多且增强-2 总交易次数: 1095 盈利: 173476.31324507284 亏损: -87438.38568864955 最大盈利: 41166.13 最大亏损: -1401.52 胜率: 37.99% 总收益: 86037.93 平均盈利: 78.57 typeA: 29.85
趋势空且增强-4 总交易次数: 74 盈利: 6269.825815341308 亏损: -4300.131770564811 最大盈利: 910.73 最大亏损: -292.60 胜率: 50.00% 总收益: 1969.69 平均盈利: 26.62 typeA: 13.31
趋势多且增强-11 总交易次数: 181 盈利: 23175.845051034776 亏损: -18817.02540823572 最大盈利: 2331.42 最大亏损: -907.40 胜率: 49.72% 总收益: 4358.82 平均盈利: 24.08 typeA: 11.97
趋势多且增强-3 总交易次数: 68 盈利: 3860.982337820494 亏损: -2529.091636680612 最大盈利: 1049.40 最大亏损: -291.68 胜率: 44.12% 总收益: 1331.89 平均盈利: 19.59 typeA: 8.64
趋势空且增强-7 总交易次数: 1419 盈利: 169488.9051112377 亏损: -144593.44696635279 最大盈利: 2350.99 最大亏损: -3479.07 胜率: 45.53% 总收益: 24895.46 平均盈利: 17.54 typeA: 7.99
趋势空且增强-2 总交易次数: 161 盈利: 13255.933252049594 亏损: -11041.000895638583 最大盈利: 1750.26 最大亏损: -818.35 胜率: 57.76% 总收益: 2214.93 平均盈利: 13.76 typeA: 7.95
趋势空且增强-11 总交易次数: 141 盈利: 13615.384312665894 亏损: -12006.550750914672 最大盈利: 778.33 最大亏损: -897.70 胜率: 59.57% 总收益: 1608.83 平均盈利: 11.41 typeA: 6.80
趋势多且增强-10 总交易次数: 54 盈利: 3731.834920204533 亏损: -2755.579305853593 最大盈利: 1251.76 最大亏损: -797.76 胜率: 37.04% 总收益: 976.26 平均盈利: 18.08 typeA: 6.70
趋势多且增强-8 总交易次数: 273 盈利: 20671.546734610813 亏损: -17434.133911763944 最大盈利: 4780.36 最大亏损: -1479.45 胜率: 56.41% 总收益: 3237.41 平均盈利: 11.86 typeA: 6.69
趋势空且增强-3 总交易次数: 379 盈利: 33983.677524984254 亏损: -27889.90621432036 最大盈利: 1717.05 最大亏损: -1220.59 胜率: 37.47% 总收益: 6093.77 平均盈利: 16.08 typeA: 6.02
趋势多且增强-4 总交易次数: 658 盈利: 41384.59678919644 亏损: -34007.904189795496 最大盈利: 1855.48 最大亏损: -1173.74 胜率: 52.89% 总收益: 7376.69 平均盈利: 11.21 typeA: 5.93
趋势多且增强-6 总交易次数: 918 盈利: 55869.099142616215 亏损: -47469.465061145966 最大盈利: 5340.69 最大亏损: -1603.63 胜率: 33.77% 总收益: 8399.63 平均盈利: 9.15 typeA: 3.09


##################################################################

profitTotal 143653.08109252137
maxLossTotal -3479.07
winRateTotal 2308.840000000001
period month 53
avgRate 43.56
maxDrawdownTotal 41.4
趋势空且增强-1 总交易次数: 129 盈利: 25065.03397388836 亏损: -12138.772122165288 最大盈利: 3191.96 最大亏损: -1549.16 胜率: 66.67% 总收益: 12926.26 平均盈利: 100.20 typeA: 66.81
趋势多且增强-1 总交易次数: 61 盈利: 17296.407604573993 亏损: -11024.284352343619 最大盈利: 6150.71 最大亏损: -1889.43 胜率: 54.10% 总收益: 6272.12 平均盈利: 102.82 typeA: 55.63
趋势多且增强-4 总交易次数: 677 盈利: 60799.263356889176 亏损: -31407.4755182825 最大盈利: 9227.82 最大亏损: -923.52 胜率: 53.47% 总收益: 29391.79 平均盈利: 43.41 typeA: 23.21
趋势多且增强-7 总交易次数: 394 盈利: 34629.001903660406 亏损: -20858.86901926128 最大盈利: 1699.60 最大亏损: -1439.52 胜率: 59.90% 总收益: 13770.13 平均盈利: 34.95 typeA: 20.93
趋势多且增强-2 总交易次数: 1101 盈利: 134654.53460328118 亏损: -89942.89773736836 最大盈利: 9874.53 最大亏损: -1361.53 胜率: 37.69% 总收益: 44711.64 平均盈利: 40.61 typeA: 15.31
趋势多且增强-11 总交易次数: 181 盈利: 23903.226692041186 亏损: -19027.415892475776 最大盈利: 2331.42 最大亏损: -907.40 胜率: 50.28% 总收益: 4875.81 平均盈利: 26.94 typeA: 13.54
趋势空且增强-4 总交易次数: 74 盈利: 5860.906357711153 亏损: -4300.131770564811 最大盈利: 910.73 最大亏损: -292.60 胜率: 50.00% 总收益: 1560.77 平均盈利: 21.09 typeA: 10.55
趋势空且增强-2 总交易次数: 161 盈利: 13517.416236992509 亏损: -10868.272859624105 最大盈利: 1750.26 最大亏损: -726.46 胜率: 57.76% 总收益: 2649.14 平均盈利: 16.45 typeA: 9.50
趋势多且增强-3 总交易次数: 68 盈利: 3860.982337820494 亏损: -2529.091636680612 最大盈利: 1049.40 最大亏损: -291.68 胜率: 44.12% 总收益: 1331.89 平均盈利: 19.59 typeA: 8.64
趋势空且增强-11 总交易次数: 141 盈利: 14646.604414224088 亏损: -12618.447768094416 最大盈利: 778.33 最大亏损: -910.68 胜率: 55.32% 总收益: 2028.16 平均盈利: 14.38 typeA: 7.96
趋势空且增强-7 总交易次数: 1343 盈利: 164109.97955247574 亏损: -140110.4955749115 最大盈利: 2544.83 最大亏损: -3479.07 胜率: 43.78% 总收益: 23999.48 平均盈利: 17.87 typeA: 7.82
趋势多且增强-10 总交易次数: 54 盈利: 3731.834920204533 亏损: -2880.019601458416 最大盈利: 1251.76 最大亏损: -797.76 胜率: 37.04% 总收益: 851.82 平均盈利: 15.77 typeA: 5.84
趋势空且增强-3 总交易次数: 371 盈利: 32708.734204891476 亏损: -27240.79363795605 最大盈利: 2357.13 最大亏损: -1220.59 胜率: 37.20% 总收益: 5467.94 平均盈利: 14.74 typeA: 5.48
趋势多且增强-8 总交易次数: 273 盈利: 20436.229936523952 亏损: -19210.195059546815 最大盈利: 4561.65 最大亏损: -1479.45 胜率: 56.04% 总收益: 1226.03 平均盈利: 4.49 typeA: 2.52
趋势多且增强-6 总交易次数: 918 盈利: 52078.97503545774 亏损: -47540.887487381064 最大盈利: 2117.62 最大亏损: -1286.08 胜率: 33.77% 总收益: 4538.09 平均盈利: 4.94 typeA: 1.67



###########################################################################


*/
