// profitTotal 128229.40293307074
// maxLossTotal -8015.37
// winRateTotal 2363.840000000001
// period month 53
// avgRate 44.60
// maxDrawdownTotal 46.3
// 趋势空且增强-1 总交易次数: 252 盈利: 171 亏损: 81 最大盈利: 3060.96 最大亏损: -8015.37 胜率: 67.86% 总收益: 9677.65
// 趋势多且增强-7 总交易次数: 270 盈利: 181 亏损: 89 最大盈利: 1699.60 最大亏损: -1208.82 胜率: 67.04% 总收益: 15497.30
// 趋势空且增强-11 总交易次数: 146 盈利: 89 亏损: 57 最大盈利: 778.33 最大亏损: -813.44 胜率: 60.96% 总收益: 2766.38
// 趋势空且增强-2 总交易次数: 166 盈利: 98 亏损: 68 最大盈利: 1750.26 最大亏损: -1724.13 胜率: 59.04% 总收益: 1835.80
// 趋势多且增强-3 总交易次数: 12 盈利: 7 亏损: 5 最大盈利: 405.27 最大亏损: -92.76 胜率: 58.33% 总收益: 642.52
// 趋势多且增强-8 总交易次数: 275 盈利: 155 亏损: 120 最大盈利: 3060.40 最大亏损: -1479.45 胜率: 56.36% 总收益: 1439.47
// 趋势多且增强-4 总交易次数: 785 盈利: 437 亏损: 348 最大盈利: 3373.87 最大亏损: -1173.74 胜率: 55.67% 总收益: 21416.80
// 趋势多且增强-11 总交易次数: 182 盈利: 100 亏损: 82 最大盈利: 2658.47 最大亏损: -907.40 胜率: 54.95% 总收益: 3391.26
// 趋势多且增强-1 总交易次数: 102 盈利: 47 亏损: 55 最大盈利: 3283.19 最大亏损: -1889.43 胜率: 46.08% 总收益: 6530.29
// 趋势空且增强-4 总交易次数: 76 盈利: 35 亏损: 41 最大盈利: 910.73 最大亏损: -292.60 胜率: 46.05% 总收益: 1609.29
// 趋势空且增强-7 总交易次数: 1465 盈利: 643 亏损: 822 最大盈利: 2350.99 最大亏损: -3479.07 胜率: 43.89% 总收益: 23983.70
// 趋势多且增强-2 总交易次数: 1204 盈利: 471 亏损: 733 最大盈利: 3114.40 最大亏损: -1401.52 胜率: 39.12% 总收益: 40899.91
// 趋势多且增强-10 总交易次数: 54 盈利: 21 亏损: 33 最大盈利: 1251.76 最大亏损: -797.76 胜率: 38.89% 总收益: 1629.24
// 趋势空且增强-3 总交易次数: 380 盈利: 140 亏损: 240 最大盈利: 1717.05 最大亏损: -1220.59 胜率: 36.84% 总收益: 5954.93
// 趋势多且增强-6 总交易次数: 916 盈利: 312 亏损: 604 最大盈利: 2117.62 最大亏损: -1603.63 胜率: 34.06% 总收益: 3968.27
// 趋势多且增强-5 总交易次数: 38 盈利: 9 亏损: 29 最大盈利: 275.93 最大亏损: -185.04 胜率: 23.68% 总收益: -305.40

/*
###################################################

趋势多且增强-1 总交易次数: 102 盈利: 15543.836700226399 亏损: -9013.549142325903 最大盈利: 3283.19 最大亏损: -1889.43 胜率: 46.08% 总收益: 6530.29 平均盈利: 64.02
趋势多且增强-7 总交易次数: 270 盈利: 39401.278935118884 亏损: -23903.97890286401 最大盈利: 1699.60 最大亏损: -1208.82 胜率: 67.04% 总收益: 15497.30 平均盈利: 57.40
趋势多且增强-3 总交易次数: 12 盈利: 802.7784718940346 亏损: -160.25659676774796 最大盈利: 405.27 最大亏损: -92.76 胜率: 58.33% 总收益: 642.52 平均盈利: 53.54
趋势空且增强-1 总交易次数: 252 盈利: 45986.12098660062 亏损: -36308.473752504535 最大盈利: 3060.96 最大亏损: -8015.37 胜率: 67.86% 总收益: 9677.65 平均盈利: 38.40
趋势多且增强-2 总交易次数: 1204 盈利: 136196.84061735877 亏损: -95296.93241461799 最大盈利: 3114.40 最大亏损: -1401.52 胜率: 39.12% 总收益: 40899.91 平均盈利: 33.97
趋势多且增强-10 总交易次数: 54 盈利: 4197.441592576286 亏损: -2568.205216179146 最大盈利: 1251.76 最大亏损: -797.76 胜率: 38.89% 总收益: 1629.24 平均盈利: 30.17
趋势多且增强-4 总交易次数: 785 盈利: 59600.76945481538 亏损: -38183.965008360436 最大盈利: 3373.87 最大亏损: -1173.74 胜率: 55.67% 总收益: 21416.80 平均盈利: 27.28
趋势空且增强-4 总交易次数: 76 盈利: 5795.6569336612 亏损: -4186.367615539448 最大盈利: 910.73 最大亏损: -292.60 胜率: 46.05% 总收益: 1609.29 平均盈利: 21.17
趋势空且增强-11 总交易次数: 146 盈利: 14149.47938334938 亏损: -11383.10405512391 最大盈利: 778.33 最大亏损: -813.44 胜率: 60.96% 总收益: 2766.38 平均盈利: 18.95
趋势多且增强-11 总交易次数: 182 盈利: 20517.223144383825 亏损: -17125.96673588096 最大盈利: 2658.47 最大亏损: -907.40 胜率: 54.95% 总收益: 3391.26 平均盈利: 18.63
趋势空且增强-7 总交易次数: 1465 盈利: 165861.3375531459 亏损: -141877.6423715744 最大盈利: 2350.99 最大亏损: -3479.07 胜率: 43.89% 总收益: 23983.70 平均盈利: 16.37
趋势空且增强-3 总交易次数: 380 盈利: 30163.064226270282 亏损: -24208.1294140455 最大盈利: 1717.05 最大亏损: -1220.59 胜率: 36.84% 总收益: 5954.93 平均盈利: 15.67
趋势空且增强-2 总交易次数: 166 盈利: 13108.576725370716 亏损: -11272.772603321857 最大盈利: 1750.26 最大亏损: -1724.13 胜率: 59.04% 总收益: 1835.80 平均盈利: 11.06
趋势多且增强-8 总交易次数: 275 盈利: 18957.67933200975 亏损: -17518.207981196203 最大盈利: 3060.40 最大亏损: -1479.45 胜率: 56.36% 总收益: 1439.47 平均盈利: 5.23
趋势多且增强-6 总交易次数: 916 盈利: 51025.907279950356 亏损: -47057.63398281573 最大盈利: 2117.62 最大亏损: -1603.63 胜率: 34.06% 总收益: 3968.27 平均盈利: 4.33
趋势多且增强-5 总交易次数: 38 盈利: 822.6398399342359 亏损: -1128.0424504778116 最大盈利: 275.93 最大亏损: -185.04 胜率: 23.68% 总收益: -305.40 平均盈利: -8.04

###############################################################################

趋势多且增强-7 总交易次数: 270 盈利: 39401.278935118884 亏损: -23903.97890286401 最大盈利: 1699.60 最大亏损: -1208.82 胜率: 67.04% 总收益: 15497.30 平均盈利: 57.40 typeA: 38.48
趋势多且增强-3 总交易次数: 12 盈利: 802.7784718940346 亏损: -160.25659676774796 最大盈利: 405.27 最大亏损: -92.76 胜率: 58.33% 总收益: 642.52 平均盈利: 53.54 typeA: 31.23
趋势多且增强-1 总交易次数: 102 盈利: 15543.836700226399 亏损: -9013.549142325903 最大盈利: 3283.19 最大亏损: -1889.43 胜率: 46.08% 总收益: 6530.29 平均盈利: 64.02 typeA: 29.50
趋势空且增强-1 总交易次数: 252 盈利: 45986.12098660062 亏损: -36308.473752504535 最大盈利: 3060.96 最大亏损: -8015.37 胜率: 67.86% 总收益: 9677.65 平均盈利: 38.40 typeA: 26.06
趋势多且增强-4 总交易次数: 785 盈利: 59600.76945481538 亏损: -38183.965008360436 最大盈利: 3373.87 最大亏损: -1173.74 胜率: 55.67% 总收益: 21416.80 平均盈利: 27.28 typeA: 15.19
趋势多且增强-2 总交易次数: 1204 盈利: 136196.84061735877 亏损: -95296.93241461799 最大盈利: 3114.40 最大亏损: -1401.52 胜率: 39.12% 总收益: 40899.91 平均盈利: 33.97 typeA: 13.29
趋势多且增强-10 总交易次数: 54 盈利: 4197.441592576286 亏损: -2568.205216179146 最大盈利: 1251.76 最大亏损: -797.76 胜率: 38.89% 总收益: 1629.24 平均盈利: 30.17 typeA: 11.73
趋势空且增强-11 总交易次数: 146 盈利: 14149.47938334938 亏损: -11383.10405512391 最大盈利: 778.33 最大亏损: -813.44 胜率: 60.96% 总收益: 2766.38 平均盈利: 18.95 typeA: 11.55
趋势多且增强-11 总交易次数: 182 盈利: 20517.223144383825 亏损: -17125.96673588096 最大盈利: 2658.47 最大亏损: -907.40 胜率: 54.95% 总收益: 3391.26 平均盈利: 18.63 typeA: 10.24
趋势空且增强-4 总交易次数: 76 盈利: 5795.6569336612 亏损: -4186.367615539448 最大盈利: 910.73 最大亏损: -292.60 胜率: 46.05% 总收益: 1609.29 平均盈利: 21.17 typeA: 9.75
趋势空且增强-7 总交易次数: 1465 盈利: 165861.3375531459 亏损: -141877.6423715744 最大盈利: 2350.99 最大亏损: -3479.07 胜率: 43.89% 总收益: 23983.70 平均盈利: 16.37 typeA: 7.19
趋势空且增强-2 总交易次数: 166 盈利: 13108.576725370716 亏损: -11272.772603321857 最大盈利: 1750.26 最大亏损: -1724.13 胜率: 59.04% 总收益: 1835.80 平均盈利: 11.06 typeA: 6.53
趋势空且增强-3 总交易次数: 380 盈利: 30163.064226270282 亏损: -24208.1294140455 最大盈利: 1717.05 最大亏损: -1220.59 胜率: 36.84% 总收益: 5954.93 平均盈利: 15.67 typeA: 5.77
趋势多且增强-8 总交易次数: 275 盈利: 18957.67933200975 亏损: -17518.207981196203 最大盈利: 3060.40 最大亏损: -1479.45 胜率: 56.36% 总收益: 1439.47 平均盈利: 5.23 typeA: 2.95
趋势多且增强-6 总交易次数: 916 盈利: 51025.907279950356 亏损: -47057.63398281573 最大盈利: 2117.62 最大亏损: -1603.63 胜率: 34.06% 总收益: 3968.27 平均盈利: 4.33 typeA: 1.48
趋势多且增强-5 总交易次数: 38 盈利: 822.6398399342359 亏损: -1128.0424504778116 最大盈利: 275.93 最大亏损: -185.04 胜率: 23.68% 总收益: -305.40 平均盈利: -8.04 typeA: -1.90


##################################################

profitTotal 128229.40293307074
maxLossTotal -8015.37
winRateTotal 2363.840000000001
period month 53
avgRate 44.60
maxDrawdownTotal 46.3
趋势多且增强-7 总交易次数: 270 盈利: 39401.278935118884 亏损: -23903.97890286401 最大盈利: 1699.60 最大亏损: -1208.82 胜率: 67.04% 总收益: 15497.30 平均盈利: 57.40 typeA: 38.48
趋势多且增强-3 总交易次数: 12 盈利: 802.7784718940346 亏损: -160.25659676774796 最大盈利: 405.27 最大亏损: -92.76 胜率: 58.33% 总收益: 642.52 平均盈利: 53.54 typeA: 31.23
趋势多且增强-1 总交易次数: 102 盈利: 15543.836700226399 亏损: -9013.549142325903 最大盈利: 3283.19 最大亏损: -1889.43 胜率: 46.08% 总收益: 6530.29 平均盈利: 64.02 typeA: 29.50
趋势空且增强-1 总交易次数: 252 盈利: 45986.12098660062 亏损: -36308.473752504535 最大盈利: 3060.96 最大亏损: -8015.37 胜率: 67.86% 总收益: 9677.65 平均盈利: 38.40 typeA: 26.06
趋势多且增强-4 总交易次数: 785 盈利: 59600.76945481538 亏损: -38183.965008360436 最大盈利: 3373.87 最大亏损: -1173.74 胜率: 55.67% 总收益: 21416.80 平均盈利: 27.28 typeA: 15.19
趋势多且增强-2 总交易次数: 1204 盈利: 136196.84061735877 亏损: -95296.93241461799 最大盈利: 3114.40 最大亏损: -1401.52 胜率: 39.12% 总收益: 40899.91 平均盈利: 33.97 typeA: 13.29
趋势多且增强-10 总交易次数: 54 盈利: 4197.441592576286 亏损: -2568.205216179146 最大盈利: 1251.76 最大亏损: -797.76 胜率: 38.89% 总收益: 1629.24 平均盈利: 30.17 typeA: 11.73
趋势空且增强-11 总交易次数: 146 盈利: 14149.47938334938 亏损: -11383.10405512391 最大盈利: 778.33 最大亏损: -813.44 胜率: 60.96% 总收益: 2766.38 平均盈利: 18.95 typeA: 11.55
趋势多且增强-11 总交易次数: 182 盈利: 20517.223144383825 亏损: -17125.96673588096 最大盈利: 2658.47 最大亏损: -907.40 胜率: 54.95% 总收益: 3391.26 平均盈利: 18.63 typeA: 10.24
趋势空且增强-4 总交易次数: 76 盈利: 5795.6569336612 亏损: -4186.367615539448 最大盈利: 910.73 最大亏损: -292.60 胜率: 46.05% 总收益: 1609.29 平均盈利: 21.17 typeA: 9.75
趋势空且增强-7 总交易次数: 1465 盈利: 165861.3375531459 亏损: -141877.6423715744 最大盈利: 2350.99 最大亏损: -3479.07 胜率: 43.89% 总收益: 23983.70 平均盈利: 16.37 typeA: 7.19
趋势空且增强-2 总交易次数: 166 盈利: 13108.576725370716 亏损: -11272.772603321857 最大盈利: 1750.26 最大亏损: -1724.13 胜率: 59.04% 总收益: 1835.80 平均盈利: 11.06 typeA: 6.53
趋势空且增强-3 总交易次数: 380 盈利: 30163.064226270282 亏损: -24208.1294140455 最大盈利: 1717.05 最大亏损: -1220.59 胜率: 36.84% 总收益: 5954.93 平均盈利: 15.67 typeA: 5.77
趋势多且增强-8 总交易次数: 275 盈利: 18957.67933200975 亏损: -17518.207981196203 最大盈利: 3060.40 最大亏损: -1479.45 胜率: 56.36% 总收益: 1439.47 平均盈利: 5.23 typeA: 2.95
趋势多且增强-6 总交易次数: 916 盈利: 51025.907279950356 亏损: -47057.63398281573 最大盈利: 2117.62 最大亏损: -1603.63 胜率: 34.06% 总收益: 3968.27 平均盈利: 4.33 typeA: 1.48
趋势多且增强-5 总交易次数: 38 盈利: 822.6398399342359 亏损: -1128.0424504778116 最大盈利: 275.93 最大亏损: -185.04 胜率: 23.68% 总收益: -305.40 平均盈利: -8.04 typeA: -1.90

profitTotal 123311.20424917582
maxLossTotal -8015.37
winRateTotal 2525.339999999999
period month 53
avgRate 47.65
maxDrawdownTotal 48.1
趋势多且增强-7 总交易次数: 277 盈利: 40477.24804779003 亏损: -23903.97890286401 最大盈利: 1699.60 最大亏损: -1208.82 胜率: 67.87% 总收益: 16573.27 平均盈利: 59.83 typeA: 40.61
趋势多且增强-1 总交易次数: 102 盈利: 15543.836700226399 亏损: -9013.549142325903 最大盈利: 3283.19 最大亏损: -1889.43 胜率: 46.08% 总收益: 6530.29 平均盈利: 64.02 typeA: 29.50
趋势多且增强-3 总交易次数: 30 盈利: 1905.046707420294 亏损: -554.5855293079406 最大盈利: 405.27 最大亏损: -301.79 胜率: 60.00% 总收益: 1350.46 平均盈利: 45.02 typeA: 27.01
趋势空且增强-1 总交易次数: 236 盈利: 43572.07538848281 亏损: -37169.144680174526 最大盈利: 3060.96 最大亏损: -8015.37 胜率: 66.95% 总收益: 6402.93 平均盈利: 27.13 typeA: 18.16
趋势多且增强-4 总交易次数: 833 盈利: 64233.580833639826 亏损: -39789.90397430658 最大盈利: 3373.87 最大亏损: -1173.74 胜率: 56.30% 总收益: 24443.68 平均盈利: 29.34 typeA: 16.52
趋势空且增强-11 总交易次数: 144 盈利: 14427.505155070772 亏损: -11227.310250306979 最大盈利: 778.33 最大亏损: -813.44 胜率: 63.19% 总收益: 3200.19 平均盈利: 22.22 typeA: 14.04
趋势多且增强-2 总交易次数: 1419 盈利: 152141.2850768661 亏损: -113741.51604860113 最大盈利: 3114.40 最大亏损: -1655.50 胜率: 38.34% 总收益: 38399.77 平均盈利: 27.06 typeA: 10.38
趋势多且增强-10 总交易次数: 57 盈利: 4197.441592576286 亏损: -2705.179878742888 最大盈利: 1251.76 最大亏损: -797.76 胜率: 36.84% 总收益: 1492.26 平均盈利: 26.18 typeA: 9.64
趋势空且增强-7 总交易次数: 1417 盈利: 175315.18815082964 亏损: -148265.36187470023 最大盈利: 2350.99 最大亏损: -3573.64 胜率: 47.14% 总收益: 27049.83 平均盈利: 19.09 typeA: 9.00
趋势多且增强-11 总交易次数: 192 盈利: 20864.39440394509 亏损: -17951.870297275545 最大盈利: 2658.47 最大亏损: -907.40 胜率: 54.69% 总收益: 2912.52 平均盈利: 15.17 typeA: 8.30
趋势空且增强-2 总交易次数: 152 盈利: 13529.805710512484 亏损: -11200.42044027131 最大盈利: 1750.26 最大亏损: -1724.13 胜率: 53.95% 总收益: 2329.39 平均盈利: 15.32 typeA: 8.27
趋势多且增强-8 总交易次数: 285 盈利: 19975.899525452918 亏损: -17681.349465355248 最大盈利: 3060.40 最大亏损: -1479.45 胜率: 57.54% 总收益: 2294.55 平均盈利: 8.05 typeA: 4.63
趋势空且增强-4 总交易次数: 63 盈利: 4326.240199220328 亏损: -4086.7816036469508 最大盈利: 910.73 最大亏损: -373.35 胜率: 41.27% 总收益: 239.46 平均盈利: 3.80 typeA: 1.57
趋势空且增强-3 总交易次数: 285 盈利: 23864.490145006628 亏损: -22731.88129998497 最大盈利: 1616.46 最大亏损: -1775.49 胜率: 37.19% 总收益: 1132.61 平均盈利: 3.97 typeA: 1.48

###################################################







###################################################
*/
