/*  #################################


if (emaFast > emaSlow) {
  if (close > emaFast) {
    if (adxPlusDI > adxMinusDI) {
      if (rsi > 70) {
        marketType = adx >= 30 ? '趋势多' : '趋势空';
      } else if (rsi > 75) {
        marketType = '趋势空';
        if (
          emaSlope > config.emaSlope.emaSlopeThreshold * 2 &&
          adx >= 30
        )
          marketType =
            adxMinusDI > 10 && rsi > 80
              ? '趋势空且增强-1'
              : adxMinusDI < 10
              ? '趋势多且增强-1'
              : '';
      } else if (
        rsi < 60 &&
        emaSlope > config.emaSlope.emaSlopeThreshold / 2
      ) {
        marketType = '趋势多且增强-2';
      }
    } else {
      if (adx < 20 && adx > 15) {
        if (
          rsi > 60 &&
          emaSlope > config.emaSlope.emaSlopeThreshold * 2
        )
          marketType = '趋势空且增强-2';
      }
    }
  } else if (close < emaSlow) {
    if (adxPlusDI < adxMinusDI) {
      if (rsi < 50) marketType = '趋势空且增强-3';
    }
    if (adxPlusDI > adxMinusDI) {
      if (rsi > 50) marketType = '趋势多且增强-3';
    }
    if (adx >= 25) {
      if (rsi > 40) {
        marketType = '趋势多且增强-4';
      }
    }
    if (adx < 25) {
    }
    if (adx < 20) {
      if (adxPlusDI < adxMinusDI) {
        marketType = '趋势空';
      }
      if (rsi > 55 && adxPlusDI > adxMinusDI)
        marketType = '趋势多且增强-5';
      if (rsi < 45 && adxPlusDI < adxMinusDI)
        marketType = '趋势空且增强-4';
    }
  } else {
    if (adx < 25 && adx > 20) {
      if (rsi > 50) marketType = '趋势多且增强-6';
      if (rsi < 50) marketType = '趋势多且增强-5';
    }
  }
}

if (emaFast < emaSlow) {
  if (close < emaFast) {
    if (adxPlusDI < adxMinusDI) {
      if (rsi < 30) {
        marketType = '趋势多';
        if (
          rsi < 25 &&
          emaSlope < -config.emaSlope.emaSlopeThreshold * 2
        )
          marketType =
            adxPlusDI > 10 ? '趋势多且增强-7' : '趋势多';
      } else if (
        rsi > 40 &&
        emaSlope < -config.emaSlope.emaSlopeThreshold / 2
      ) {
        marketType = '趋势空且增强-7';
      }
    } else {
      if (adx < 20 && adx > 15) {
        if (
          rsi < 45 &&
          emaSlope < -config.emaSlope.emaSlopeThreshold * 2
        )
          marketType = '趋势多且增强-8';
      }
    }
  } else if (close > emaSlow) {
    if (adxPlusDI < adxMinusDI) {
      if (rsi < 50) marketType = '趋势空且增强-8';
    }
    if (adxPlusDI > adxMinusDI) {
      if (rsi > 50) marketType = '趋势空';
    }

    if (adx >= 25) {
      if (rsi < 60) marketType = '趋势空';
    }
    if (adx < 25) {
      marketType = rsi > 60 ? '趋势多' : '趋势空';
    }
    if (adx < 20) {
      if (rsi > 55 && adxPlusDI > adxMinusDI)
        marketType = '趋势多且增强-10';
      if (rsi < 45 && adxPlusDI < adxMinusDI)
        marketType = '趋势空且增强-10';
    }
  } else {
  }
}

if (
  adx < 25 &&
  adxPlusDI > adxMinusDI &&
  emaFast < emaSlow &&
  close < emaFast
) {
  if (rsi < 30 && emaSlope < -config.emaSlope.emaSlopeThreshold)
    marketType = '趋势空且增强-11';
}
if (
  adx < 25 &&
  adxPlusDI < adxMinusDI &&
  emaFast > emaSlow &&
  close > emaFast
) {
  if (rsi > 70 && emaSlope > config.emaSlope.emaSlopeThreshold)
    marketType = '趋势多且增强-11';
}



######################################################################

if (emaSlope > config.emaSlope.emaSlopeThreshold)
							if (
								emaSlope >
								config.emaSlope.emaSlopeThreshold * 3
							) {
								marketType =
									adxMinusDI > 10
										? rsi > 75
											? '趋势空且增强-L0-1-1-1'
											: ''
										: adxMinusDI < 10
										? rsi > 80
											? '趋势空且增强-L0-1-2-1'
											: '趋势空且增强-L0-1-2-2'
										: '';
							} else if (
								emaSlope >
								config.emaSlope.emaSlopeThreshold * 2
							) {
								marketType =
									adxMinusDI > 10
										? rsi > 75
											? '趋势空且增强-L0-2-1-1'
											: ''
										: adxMinusDI < 10
										? rsi > 80
											? '趋势空且增强-L0-2-2-1'
											: '趋势空且增强-L0-2-2-2'
										: '';
							} else {
								marketType =
									adxMinusDI > 10
										? rsi > 75
											? ''
											: '趋势空且增强-L0-3-1-2'
										: adxMinusDI < 10
										? rsi > 80
											? '趋势空且增强-L0-3-2-1'
											: '趋势空且增强-L0-3-2-2'
										: '';
							}


#######################################################################



/*


// profitTotal 128229.40293307074
// maxLossTotal -8015.37
// winRateTotal 2363.840000000001
// period month 53
// avgRate 44.60
// maxDrawdownTotal 46.3
// 趋势空且增强-1 总交易次数: 252 盈利: 171 亏损: 81 最大盈利: 3060.96 最大亏损: -8015.37 胜率: 67.86% 总收益: 9677.65
// 趋势多且增强-7 总交易次数: 270 盈利: 181 亏损: 89 最大盈利: 1699.60 最大亏损: -1208.82 胜率: 67.04% 总收益: 15497.30
// 趋势空且增强-11 总交易次数: 146 盈利: 89 亏损: 57 最大盈利: 778.33 最大亏损: -813.44 胜率: 60.96% 总收益: 2766.38
// 趋势空且增强-2 总交易次数: 166 盈利: 98 亏损: 68 最大盈利: 1750.26 最大亏损: -1724.13 胜率: 59.04% 总收益: 1835.80
// 趋势多且增强-3 总交易次数: 12 盈利: 7 亏损: 5 最大盈利: 405.27 最大亏损: -92.76 胜率: 58.33% 总收益: 642.52
// 趋势多且增强-8 总交易次数: 275 盈利: 155 亏损: 120 最大盈利: 3060.40 最大亏损: -1479.45 胜率: 56.36% 总收益: 1439.47
// 趋势多且增强-4 总交易次数: 785 盈利: 437 亏损: 348 最大盈利: 3373.87 最大亏损: -1173.74 胜率: 55.67% 总收益: 21416.80
// 趋势多且增强-11 总交易次数: 182 盈利: 100 亏损: 82 最大盈利: 2658.47 最大亏损: -907.40 胜率: 54.95% 总收益: 3391.26
// 趋势多且增强-1 总交易次数: 102 盈利: 47 亏损: 55 最大盈利: 3283.19 最大亏损: -1889.43 胜率: 46.08% 总收益: 6530.29
// 趋势空且增强-4 总交易次数: 76 盈利: 35 亏损: 41 最大盈利: 910.73 最大亏损: -292.60 胜率: 46.05% 总收益: 1609.29
// 趋势空且增强-7 总交易次数: 1465 盈利: 643 亏损: 822 最大盈利: 2350.99 最大亏损: -3479.07 胜率: 43.89% 总收益: 23983.70
// 趋势多且增强-2 总交易次数: 1204 盈利: 471 亏损: 733 最大盈利: 3114.40 最大亏损: -1401.52 胜率: 39.12% 总收益: 40899.91
// 趋势多且增强-10 总交易次数: 54 盈利: 21 亏损: 33 最大盈利: 1251.76 最大亏损: -797.76 胜率: 38.89% 总收益: 1629.24
// 趋势空且增强-3 总交易次数: 380 盈利: 140 亏损: 240 最大盈利: 1717.05 最大亏损: -1220.59 胜率: 36.84% 总收益: 5954.93
// 趋势多且增强-6 总交易次数: 916 盈利: 312 亏损: 604 最大盈利: 2117.62 最大亏损: -1603.63 胜率: 34.06% 总收益: 3968.27
// 趋势多且增强-5 总交易次数: 38 盈利: 9 亏损: 29 最大盈利: 275.93 最大亏损: -185.04 胜率: 23.68% 总收益: -305.40

/*
###################################################

趋势多且增强-1 总交易次数: 102 盈利: 15543.836700226399 亏损: -9013.549142325903 最大盈利: 3283.19 最大亏损: -1889.43 胜率: 46.08% 总收益: 6530.29 平均盈利: 64.02
趋势多且增强-7 总交易次数: 270 盈利: 39401.278935118884 亏损: -23903.97890286401 最大盈利: 1699.60 最大亏损: -1208.82 胜率: 67.04% 总收益: 15497.30 平均盈利: 57.40
趋势多且增强-3 总交易次数: 12 盈利: 802.7784718940346 亏损: -160.25659676774796 最大盈利: 405.27 最大亏损: -92.76 胜率: 58.33% 总收益: 642.52 平均盈利: 53.54
趋势空且增强-1 总交易次数: 252 盈利: 45986.12098660062 亏损: -36308.473752504535 最大盈利: 3060.96 最大亏损: -8015.37 胜率: 67.86% 总收益: 9677.65 平均盈利: 38.40
趋势多且增强-2 总交易次数: 1204 盈利: 136196.84061735877 亏损: -95296.93241461799 最大盈利: 3114.40 最大亏损: -1401.52 胜率: 39.12% 总收益: 40899.91 平均盈利: 33.97
趋势多且增强-10 总交易次数: 54 盈利: 4197.441592576286 亏损: -2568.205216179146 最大盈利: 1251.76 最大亏损: -797.76 胜率: 38.89% 总收益: 1629.24 平均盈利: 30.17
趋势多且增强-4 总交易次数: 785 盈利: 59600.76945481538 亏损: -38183.965008360436 最大盈利: 3373.87 最大亏损: -1173.74 胜率: 55.67% 总收益: 21416.80 平均盈利: 27.28
趋势空且增强-4 总交易次数: 76 盈利: 5795.6569336612 亏损: -4186.367615539448 最大盈利: 910.73 最大亏损: -292.60 胜率: 46.05% 总收益: 1609.29 平均盈利: 21.17
趋势空且增强-11 总交易次数: 146 盈利: 14149.47938334938 亏损: -11383.10405512391 最大盈利: 778.33 最大亏损: -813.44 胜率: 60.96% 总收益: 2766.38 平均盈利: 18.95
趋势多且增强-11 总交易次数: 182 盈利: 20517.223144383825 亏损: -17125.96673588096 最大盈利: 2658.47 最大亏损: -907.40 胜率: 54.95% 总收益: 3391.26 平均盈利: 18.63
趋势空且增强-7 总交易次数: 1465 盈利: 165861.3375531459 亏损: -141877.6423715744 最大盈利: 2350.99 最大亏损: -3479.07 胜率: 43.89% 总收益: 23983.70 平均盈利: 16.37
趋势空且增强-3 总交易次数: 380 盈利: 30163.064226270282 亏损: -24208.1294140455 最大盈利: 1717.05 最大亏损: -1220.59 胜率: 36.84% 总收益: 5954.93 平均盈利: 15.67
趋势空且增强-2 总交易次数: 166 盈利: 13108.576725370716 亏损: -11272.772603321857 最大盈利: 1750.26 最大亏损: -1724.13 胜率: 59.04% 总收益: 1835.80 平均盈利: 11.06
趋势多且增强-8 总交易次数: 275 盈利: 18957.67933200975 亏损: -17518.207981196203 最大盈利: 3060.40 最大亏损: -1479.45 胜率: 56.36% 总收益: 1439.47 平均盈利: 5.23
趋势多且增强-6 总交易次数: 916 盈利: 51025.907279950356 亏损: -47057.63398281573 最大盈利: 2117.62 最大亏损: -1603.63 胜率: 34.06% 总收益: 3968.27 平均盈利: 4.33
趋势多且增强-5 总交易次数: 38 盈利: 822.6398399342359 亏损: -1128.0424504778116 最大盈利: 275.93 最大亏损: -185.04 胜率: 23.68% 总收益: -305.40 平均盈利: -8.04

###############################################################################

趋势多且增强-7 总交易次数: 270 盈利: 39401.278935118884 亏损: -23903.97890286401 最大盈利: 1699.60 最大亏损: -1208.82 胜率: 67.04% 总收益: 15497.30 平均盈利: 57.40 typeA: 38.48
趋势多且增强-3 总交易次数: 12 盈利: 802.7784718940346 亏损: -160.25659676774796 最大盈利: 405.27 最大亏损: -92.76 胜率: 58.33% 总收益: 642.52 平均盈利: 53.54 typeA: 31.23
趋势多且增强-1 总交易次数: 102 盈利: 15543.836700226399 亏损: -9013.549142325903 最大盈利: 3283.19 最大亏损: -1889.43 胜率: 46.08% 总收益: 6530.29 平均盈利: 64.02 typeA: 29.50
趋势空且增强-1 总交易次数: 252 盈利: 45986.12098660062 亏损: -36308.473752504535 最大盈利: 3060.96 最大亏损: -8015.37 胜率: 67.86% 总收益: 9677.65 平均盈利: 38.40 typeA: 26.06
趋势多且增强-4 总交易次数: 785 盈利: 59600.76945481538 亏损: -38183.965008360436 最大盈利: 3373.87 最大亏损: -1173.74 胜率: 55.67% 总收益: 21416.80 平均盈利: 27.28 typeA: 15.19
趋势多且增强-2 总交易次数: 1204 盈利: 136196.84061735877 亏损: -95296.93241461799 最大盈利: 3114.40 最大亏损: -1401.52 胜率: 39.12% 总收益: 40899.91 平均盈利: 33.97 typeA: 13.29
趋势多且增强-10 总交易次数: 54 盈利: 4197.441592576286 亏损: -2568.205216179146 最大盈利: 1251.76 最大亏损: -797.76 胜率: 38.89% 总收益: 1629.24 平均盈利: 30.17 typeA: 11.73
趋势空且增强-11 总交易次数: 146 盈利: 14149.47938334938 亏损: -11383.10405512391 最大盈利: 778.33 最大亏损: -813.44 胜率: 60.96% 总收益: 2766.38 平均盈利: 18.95 typeA: 11.55
趋势多且增强-11 总交易次数: 182 盈利: 20517.223144383825 亏损: -17125.96673588096 最大盈利: 2658.47 最大亏损: -907.40 胜率: 54.95% 总收益: 3391.26 平均盈利: 18.63 typeA: 10.24
趋势空且增强-4 总交易次数: 76 盈利: 5795.6569336612 亏损: -4186.367615539448 最大盈利: 910.73 最大亏损: -292.60 胜率: 46.05% 总收益: 1609.29 平均盈利: 21.17 typeA: 9.75
趋势空且增强-7 总交易次数: 1465 盈利: 165861.3375531459 亏损: -141877.6423715744 最大盈利: 2350.99 最大亏损: -3479.07 胜率: 43.89% 总收益: 23983.70 平均盈利: 16.37 typeA: 7.19
趋势空且增强-2 总交易次数: 166 盈利: 13108.576725370716 亏损: -11272.772603321857 最大盈利: 1750.26 最大亏损: -1724.13 胜率: 59.04% 总收益: 1835.80 平均盈利: 11.06 typeA: 6.53
趋势空且增强-3 总交易次数: 380 盈利: 30163.064226270282 亏损: -24208.1294140455 最大盈利: 1717.05 最大亏损: -1220.59 胜率: 36.84% 总收益: 5954.93 平均盈利: 15.67 typeA: 5.77
趋势多且增强-8 总交易次数: 275 盈利: 18957.67933200975 亏损: -17518.207981196203 最大盈利: 3060.40 最大亏损: -1479.45 胜率: 56.36% 总收益: 1439.47 平均盈利: 5.23 typeA: 2.95
趋势多且增强-6 总交易次数: 916 盈利: 51025.907279950356 亏损: -47057.63398281573 最大盈利: 2117.62 最大亏损: -1603.63 胜率: 34.06% 总收益: 3968.27 平均盈利: 4.33 typeA: 1.48
趋势多且增强-5 总交易次数: 38 盈利: 822.6398399342359 亏损: -1128.0424504778116 最大盈利: 275.93 最大亏损: -185.04 胜率: 23.68% 总收益: -305.40 平均盈利: -8.04 typeA: -1.90


##################################################

profitTotal 128229.40293307074
maxLossTotal -8015.37
winRateTotal 2363.840000000001
period month 53
avgRate 44.60
maxDrawdownTotal 46.3
趋势多且增强-7 总交易次数: 270 盈利: 39401.278935118884 亏损: -23903.97890286401 最大盈利: 1699.60 最大亏损: -1208.82 胜率: 67.04% 总收益: 15497.30 平均盈利: 57.40 typeA: 38.48
趋势多且增强-3 总交易次数: 12 盈利: 802.7784718940346 亏损: -160.25659676774796 最大盈利: 405.27 最大亏损: -92.76 胜率: 58.33% 总收益: 642.52 平均盈利: 53.54 typeA: 31.23
趋势多且增强-1 总交易次数: 102 盈利: 15543.836700226399 亏损: -9013.549142325903 最大盈利: 3283.19 最大亏损: -1889.43 胜率: 46.08% 总收益: 6530.29 平均盈利: 64.02 typeA: 29.50
趋势空且增强-1 总交易次数: 252 盈利: 45986.12098660062 亏损: -36308.473752504535 最大盈利: 3060.96 最大亏损: -8015.37 胜率: 67.86% 总收益: 9677.65 平均盈利: 38.40 typeA: 26.06
趋势多且增强-4 总交易次数: 785 盈利: 59600.76945481538 亏损: -38183.965008360436 最大盈利: 3373.87 最大亏损: -1173.74 胜率: 55.67% 总收益: 21416.80 平均盈利: 27.28 typeA: 15.19
趋势多且增强-2 总交易次数: 1204 盈利: 136196.84061735877 亏损: -95296.93241461799 最大盈利: 3114.40 最大亏损: -1401.52 胜率: 39.12% 总收益: 40899.91 平均盈利: 33.97 typeA: 13.29
趋势多且增强-10 总交易次数: 54 盈利: 4197.441592576286 亏损: -2568.205216179146 最大盈利: 1251.76 最大亏损: -797.76 胜率: 38.89% 总收益: 1629.24 平均盈利: 30.17 typeA: 11.73
趋势空且增强-11 总交易次数: 146 盈利: 14149.47938334938 亏损: -11383.10405512391 最大盈利: 778.33 最大亏损: -813.44 胜率: 60.96% 总收益: 2766.38 平均盈利: 18.95 typeA: 11.55
趋势多且增强-11 总交易次数: 182 盈利: 20517.223144383825 亏损: -17125.96673588096 最大盈利: 2658.47 最大亏损: -907.40 胜率: 54.95% 总收益: 3391.26 平均盈利: 18.63 typeA: 10.24
趋势空且增强-4 总交易次数: 76 盈利: 5795.6569336612 亏损: -4186.367615539448 最大盈利: 910.73 最大亏损: -292.60 胜率: 46.05% 总收益: 1609.29 平均盈利: 21.17 typeA: 9.75
趋势空且增强-7 总交易次数: 1465 盈利: 165861.3375531459 亏损: -141877.6423715744 最大盈利: 2350.99 最大亏损: -3479.07 胜率: 43.89% 总收益: 23983.70 平均盈利: 16.37 typeA: 7.19
趋势空且增强-2 总交易次数: 166 盈利: 13108.576725370716 亏损: -11272.772603321857 最大盈利: 1750.26 最大亏损: -1724.13 胜率: 59.04% 总收益: 1835.80 平均盈利: 11.06 typeA: 6.53
趋势空且增强-3 总交易次数: 380 盈利: 30163.064226270282 亏损: -24208.1294140455 最大盈利: 1717.05 最大亏损: -1220.59 胜率: 36.84% 总收益: 5954.93 平均盈利: 15.67 typeA: 5.77
趋势多且增强-8 总交易次数: 275 盈利: 18957.67933200975 亏损: -17518.207981196203 最大盈利: 3060.40 最大亏损: -1479.45 胜率: 56.36% 总收益: 1439.47 平均盈利: 5.23 typeA: 2.95
趋势多且增强-6 总交易次数: 916 盈利: 51025.907279950356 亏损: -47057.63398281573 最大盈利: 2117.62 最大亏损: -1603.63 胜率: 34.06% 总收益: 3968.27 平均盈利: 4.33 typeA: 1.48
趋势多且增强-5 总交易次数: 38 盈利: 822.6398399342359 亏损: -1128.0424504778116 最大盈利: 275.93 最大亏损: -185.04 胜率: 23.68% 总收益: -305.40 平均盈利: -8.04 typeA: -1.90


###################################################

profitTotal 144034.70494669524
maxLossTotal -5425.95
winRateTotal 2260.7100000000005
period month 53
avgRate 42.65
maxDrawdownTotal 41.9
趋势多且增强-1 总交易次数: 58 盈利: 17878.374725835467 亏损: -9735.804410992057 最大盈利: 6150.71 最大亏损: -1889.43 胜率: 56.90% 总收益: 8142.57 平均盈利: 140.39 typeA: 79.88
趋势空且增强-1 总交易次数: 120 盈利: 31111.87932022779 亏损: -19991.228125900136 最大盈利: 3191.96 最大亏损: -5425.95 胜率: 62.50% 总收益: 11120.65 平均盈利: 92.67 typeA: 57.92
趋势多且增强-7 总交易次数: 270 盈利: 39487.316299317084 亏损: -23903.97890286401 最大盈利: 1699.60 最大亏损: -1208.82 胜率: 67.04% 总收益: 15583.34 平均盈利: 57.72 typeA: 38.69
趋势多且增强-4 总交易次数: 607 盈利: 60051.90442671677 亏损: -30139.898157963285 最大盈利: 9227.82 最大亏损: -1173.74 胜率: 52.88% 总收益: 29912.01 平均盈利: 49.28 typeA: 26.06
趋势多且增强-2 总交易次数: 1039 盈利: 129016.28703655387 亏损: -83039.08150993954 最大盈利: 9874.53 最大亏损: -1401.52 胜率: 36.48% 总收益: 45977.21 平均盈利: 44.25 typeA: 16.14
趋势多且增强-10 总交易次数: 54 盈利: 5032.707097453098 亏损: -2838.8038257945077 最大盈利: 2723.88 最大亏损: -797.76 胜率: 35.19% 总收益: 2193.90 平均盈利: 40.63 typeA: 14.30
趋势空且增强-11 总交易次数: 146 盈利: 14149.47938334938 亏损: -11383.10405512391 最大盈利: 778.33 最大亏损: -813.44 胜率: 60.96% 总收益: 2766.38 平均盈利: 18.95 typeA: 11.55
趋势空且增强-4 总交易次数: 76 盈利: 5795.6569336612 亏损: -4186.367615539448 最大盈利: 910.73 最大亏损: -292.60 胜率: 46.05% 总收益: 1609.29 平均盈利: 21.17 typeA: 9.75
趋势空且增强-7 总交易次数: 1465 盈利: 165861.3375531459 亏损: -141877.6423715744 最大盈利: 2350.99 最大亏损: -3479.07 胜率: 43.89% 总收益: 23983.70 平均盈利: 16.37 typeA: 7.19
趋势空且增强-2 总交易次数: 166 盈利: 13108.576725370716 亏损: -11272.772603321857 最大盈利: 1750.26 最大亏损: -1724.13 胜率: 59.04% 总收益: 1835.80 平均盈利: 11.06 typeA: 6.53
趋势多且增强-8 总交易次数: 275 盈利: 20514.748514673814 亏损: -17518.207981196203 最大盈利: 4561.65 最大亏损: -1479.45 胜率: 56.36% 总收益: 2996.54 平均盈利: 10.90 typeA: 6.14
趋势空且增强-3 总交易次数: 380 盈利: 30163.064226270282 亏损: -24208.1294140455 最大盈利: 1717.05 最大亏损: -1220.59 胜率: 36.84% 总收益: 5954.93 平均盈利: 15.67 typeA: 5.77
趋势多且增强-3 总交易次数: 12 盈利: 397.5066159653215 亏损: -286.16007499605973 最大盈利: 151.39 最大亏损: -125.90 胜率: 50.00% 总收益: 111.35 平均盈利: 9.28 typeA: 4.64
趋势多且增强-11 总交易次数: 172 盈利: 22745.325256324766 亏损: -21301.815662002093 最大盈利: 2331.42 最大亏损: -907.40 胜率: 43.02% 总收益: 1443.51 平均盈利: 8.39 typeA: 3.61
趋势多且增强-6 总交易次数: 881 盈利: 49755.747215755924 亏损: -47619.03342110404 最大盈利: 2117.62 最大亏损: -1603.63 胜率: 31.56% 总收益: 2136.71 平均盈利: 2.43 typeA: 0.77
趋势多且增强-5 总交易次数: 38 盈利: 982.8641989085944 亏损: -1128.0424504778116 最大盈利: 275.93 最大亏损: -185.04 胜率: 23.68% 总收益: -145.18 平均盈利: -3.82 typeA: -0.90

###########################################################################

profitTotal 148380.2293375683
maxLossTotal -3479.07
winRateTotal 2273.48
period month 53
avgRate 42.90
maxDrawdownTotal 44.3
趋势多且增强-7 总交易次数: 270 盈利: 39487.316299317084 亏损: -23903.97890286401 最大盈利: 1699.60 最大亏损: -1208.82 胜率: 67.04% 总收益: 15583.34 平均盈利: 57.72 typeA: 38.69
趋势多且增强-3 总交易次数: 12 盈利: 802.7784718940346 亏损: -160.25659676774796 最大盈利: 405.27 最大亏损: -92.76 胜率: 58.33% 总收益: 642.52 平均盈利: 53.54 typeA: 31.23
趋势多且增强-2 总交易次数: 1103 盈利: 173577.2724759525 亏损: -88391.39003756334 最大盈利: 41166.13 最大亏损: -1401.52 胜率: 37.90% 总收益: 85185.88 平均盈利: 77.23 typeA: 29.27
趋势多且增强-11 总交易次数: 181 盈利: 23175.845051034776 亏损: -18551.016628453748 最大盈利: 2331.42 最大亏损: -907.40 胜率: 49.72% 总收益: 4624.83 平均盈利: 25.55 typeA: 12.70
趋势空且增强-11 总交易次数: 146 盈利: 14149.47938334938 亏损: -11647.058051779211 最大盈利: 778.33 最大亏损: -897.70 胜率: 60.96% 总收益: 2502.42 平均盈利: 17.14 typeA: 10.45
趋势空且增强-4 总交易次数: 76 盈利: 5795.6569336612 亏损: -4186.367615539448 最大盈利: 910.73 最大亏损: -292.60 胜率: 46.05% 总收益: 1609.29 平均盈利: 21.17 typeA: 9.75
趋势空且增强-2 总交易次数: 166 盈利: 13108.576725370716 亏损: -11078.50583539961 最大盈利: 1750.26 最大亏损: -818.35 胜率: 59.04% 总收益: 2030.07 平均盈利: 12.23 typeA: 7.22
趋势多且增强-10 总交易次数: 54 盈利: 3731.834920204533 亏损: -2755.579305853593 最大盈利: 1251.76 最大亏损: -797.76 胜率: 37.04% 总收益: 976.26 平均盈利: 18.08 typeA: 6.70
趋势空且增强-7 总交易次数: 1467 盈利: 165861.3375531459 亏损: -144142.32283461362 最大盈利: 2350.99 最大亏损: -3479.07 胜率: 43.83% 总收益: 21719.01 平均盈利: 14.81 typeA: 6.49
趋势多且增强-8 总交易次数: 275 盈利: 20677.634858869253 亏损: -17518.207981196203 最大盈利: 4780.36 最大亏损: -1479.45 胜率: 56.36% 总收益: 3159.43 平均盈利: 11.49 typeA: 6.48
趋势多且增强-4 总交易次数: 657 盈利: 41378.95987003667 亏损: -34007.904189795496 最大盈利: 1855.48 最大亏损: -1173.74 胜率: 52.82% 总收益: 7371.06 平均盈利: 11.22 typeA: 5.93
趋势空且增强-3 总交易次数: 380 盈利: 30133.564474902803 亏损: -24262.45297253222 最大盈利: 1717.05 最大亏损: -1220.59 胜率: 36.58% 总收益: 5871.11 平均盈利: 15.45 typeA: 5.65
趋势多且增强-6 总交易次数: 914 盈利: 55993.55515001397 亏损: -47043.13926728289 最大盈利: 5340.69 最大亏损: -1603.63 胜率: 33.92% 总收益: 8950.42 平均盈利: 9.79 typeA: 3.32
趋势多且增强-5 总交易次数: 38 盈利: 822.6398399342359 亏损: -1128.0424504778116 最大盈利: 275.93 最大亏损: -185.04 胜率: 23.68% 总收益: -305.40 平均盈利: -8.04 typeA: -1.90

==================================================================




profitTotal 152640.6598333721
maxLossTotal -3479.07
winRateTotal 2306.8199999999997
period month 53
avgRate 43.52
maxDrawdownTotal 44.1
趋势多且增强-7 总交易次数: 270 盈利: 39487.316299317084 亏损: -23903.97890286401 最大盈利: 1699.60 最大亏损: -1208.82 胜率: 67.04% 总收益: 15583.34 平均盈利: 57.72 typeA: 38.69
趋势多且增强-2 总交易次数: 1095 盈利: 173476.31324507284 亏损: -87438.38568864955 最大盈利: 41166.13 最大亏损: -1401.52 胜率: 37.99% 总收益: 86037.93 平均盈利: 78.57 typeA: 29.85
趋势空且增强-4 总交易次数: 74 盈利: 6269.825815341308 亏损: -4300.131770564811 最大盈利: 910.73 最大亏损: -292.60 胜率: 50.00% 总收益: 1969.69 平均盈利: 26.62 typeA: 13.31
趋势多且增强-11 总交易次数: 181 盈利: 23175.845051034776 亏损: -18817.02540823572 最大盈利: 2331.42 最大亏损: -907.40 胜率: 49.72% 总收益: 4358.82 平均盈利: 24.08 typeA: 11.97
趋势多且增强-3 总交易次数: 68 盈利: 3860.982337820494 亏损: -2529.091636680612 最大盈利: 1049.40 最大亏损: -291.68 胜率: 44.12% 总收益: 1331.89 平均盈利: 19.59 typeA: 8.64
趋势空且增强-7 总交易次数: 1419 盈利: 169488.9051112377 亏损: -144593.44696635279 最大盈利: 2350.99 最大亏损: -3479.07 胜率: 45.53% 总收益: 24895.46 平均盈利: 17.54 typeA: 7.99
趋势空且增强-2 总交易次数: 161 盈利: 13255.933252049594 亏损: -11041.000895638583 最大盈利: 1750.26 最大亏损: -818.35 胜率: 57.76% 总收益: 2214.93 平均盈利: 13.76 typeA: 7.95
趋势空且增强-11 总交易次数: 141 盈利: 13615.384312665894 亏损: -12006.550750914672 最大盈利: 778.33 最大亏损: -897.70 胜率: 59.57% 总收益: 1608.83 平均盈利: 11.41 typeA: 6.80
趋势多且增强-10 总交易次数: 54 盈利: 3731.834920204533 亏损: -2755.579305853593 最大盈利: 1251.76 最大亏损: -797.76 胜率: 37.04% 总收益: 976.26 平均盈利: 18.08 typeA: 6.70
趋势多且增强-8 总交易次数: 273 盈利: 20671.546734610813 亏损: -17434.133911763944 最大盈利: 4780.36 最大亏损: -1479.45 胜率: 56.41% 总收益: 3237.41 平均盈利: 11.86 typeA: 6.69
趋势空且增强-3 总交易次数: 379 盈利: 33983.677524984254 亏损: -27889.90621432036 最大盈利: 1717.05 最大亏损: -1220.59 胜率: 37.47% 总收益: 6093.77 平均盈利: 16.08 typeA: 6.02
趋势多且增强-4 总交易次数: 658 盈利: 41384.59678919644 亏损: -34007.904189795496 最大盈利: 1855.48 最大亏损: -1173.74 胜率: 52.89% 总收益: 7376.69 平均盈利: 11.21 typeA: 5.93
趋势多且增强-6 总交易次数: 918 盈利: 55869.099142616215 亏损: -47469.465061145966 最大盈利: 5340.69 最大亏损: -1603.63 胜率: 33.77% 总收益: 8399.63 平均盈利: 9.15 typeA: 3.09


##################################################################

profitTotal 143653.08109252137
maxLossTotal -3479.07
winRateTotal 2308.840000000001
period month 53
avgRate 43.56
maxDrawdownTotal 41.4
趋势空且增强-1 总交易次数: 129 盈利: 25065.03397388836 亏损: -12138.772122165288 最大盈利: 3191.96 最大亏损: -1549.16 胜率: 66.67% 总收益: 12926.26 平均盈利: 100.20 typeA: 66.81
趋势多且增强-1 总交易次数: 61 盈利: 17296.407604573993 亏损: -11024.284352343619 最大盈利: 6150.71 最大亏损: -1889.43 胜率: 54.10% 总收益: 6272.12 平均盈利: 102.82 typeA: 55.63
趋势多且增强-4 总交易次数: 677 盈利: 60799.263356889176 亏损: -31407.4755182825 最大盈利: 9227.82 最大亏损: -923.52 胜率: 53.47% 总收益: 29391.79 平均盈利: 43.41 typeA: 23.21
趋势多且增强-7 总交易次数: 394 盈利: 34629.001903660406 亏损: -20858.86901926128 最大盈利: 1699.60 最大亏损: -1439.52 胜率: 59.90% 总收益: 13770.13 平均盈利: 34.95 typeA: 20.93
趋势多且增强-2 总交易次数: 1101 盈利: 134654.53460328118 亏损: -89942.89773736836 最大盈利: 9874.53 最大亏损: -1361.53 胜率: 37.69% 总收益: 44711.64 平均盈利: 40.61 typeA: 15.31
趋势多且增强-11 总交易次数: 181 盈利: 23903.226692041186 亏损: -19027.415892475776 最大盈利: 2331.42 最大亏损: -907.40 胜率: 50.28% 总收益: 4875.81 平均盈利: 26.94 typeA: 13.54
趋势空且增强-4 总交易次数: 74 盈利: 5860.906357711153 亏损: -4300.131770564811 最大盈利: 910.73 最大亏损: -292.60 胜率: 50.00% 总收益: 1560.77 平均盈利: 21.09 typeA: 10.55
趋势空且增强-2 总交易次数: 161 盈利: 13517.416236992509 亏损: -10868.272859624105 最大盈利: 1750.26 最大亏损: -726.46 胜率: 57.76% 总收益: 2649.14 平均盈利: 16.45 typeA: 9.50
趋势多且增强-3 总交易次数: 68 盈利: 3860.982337820494 亏损: -2529.091636680612 最大盈利: 1049.40 最大亏损: -291.68 胜率: 44.12% 总收益: 1331.89 平均盈利: 19.59 typeA: 8.64
趋势空且增强-11 总交易次数: 141 盈利: 14646.604414224088 亏损: -12618.447768094416 最大盈利: 778.33 最大亏损: -910.68 胜率: 55.32% 总收益: 2028.16 平均盈利: 14.38 typeA: 7.96
趋势空且增强-7 总交易次数: 1343 盈利: 164109.97955247574 亏损: -140110.4955749115 最大盈利: 2544.83 最大亏损: -3479.07 胜率: 43.78% 总收益: 23999.48 平均盈利: 17.87 typeA: 7.82
趋势多且增强-10 总交易次数: 54 盈利: 3731.834920204533 亏损: -2880.019601458416 最大盈利: 1251.76 最大亏损: -797.76 胜率: 37.04% 总收益: 851.82 平均盈利: 15.77 typeA: 5.84
趋势空且增强-3 总交易次数: 371 盈利: 32708.734204891476 亏损: -27240.79363795605 最大盈利: 2357.13 最大亏损: -1220.59 胜率: 37.20% 总收益: 5467.94 平均盈利: 14.74 typeA: 5.48
趋势多且增强-8 总交易次数: 273 盈利: 20436.229936523952 亏损: -19210.195059546815 最大盈利: 4561.65 最大亏损: -1479.45 胜率: 56.04% 总收益: 1226.03 平均盈利: 4.49 typeA: 2.52
趋势多且增强-6 总交易次数: 918 盈利: 52078.97503545774 亏损: -47540.887487381064 最大盈利: 2117.62 最大亏损: -1286.08 胜率: 33.77% 总收益: 4538.09 平均盈利: 4.94 typeA: 1.67

################################################################



profitTotal 147985.34578208814
maxLossTotal -3479.07
winRateTotal 2327.5000000000005
period month 53
avgRate 43.92
maxDrawdownTotal 42.7
趋势空且增强-1 总交易次数: 129 盈利: 25065.03397388836 亏损: -12138.772122165288 最大盈利: 3191.96 最大亏损: -1549.16 胜率: 66.67% 总收益: 12926.26 平均盈利: 100.20 typeA: 66.81
趋势多且增强-1 总交易次数: 61 盈利: 17296.407604573993 亏损: -11024.284352343619 最大盈利: 6150.71 最大亏损: -1889.43 胜率: 54.10% 总收益: 6272.12 平均盈利: 102.82 typeA: 55.63
趋势多且增强-7test2 总交易次数: 107 盈利: 12089.63784874288 亏损: -5979.998584044565 最大盈利: 1427.22 最大亏损: -1764.99 胜率: 69.16% 总收益: 6109.64 平均盈利: 57.10 typeA: 39.49
趋势多且增强-4 总交易次数: 678 盈利: 60939.73934432185 亏损: -31391.39323585886 最大盈利: 9227.82 最大亏损: -923.52 胜率: 53.54% 总收益: 29548.35 平均盈利: 43.58 typeA: 23.33
趋势多且增强-7test1 总交易次数: 327 盈利: 26386.87950334655 亏损: -15144.332728692547 最大盈利: 1699.60 最大亏损: -984.85 胜率: 61.47% 总收益: 11242.55 平均盈利: 34.38 typeA: 21.13
趋势多且增强-2 总交易次数: 1102 盈利: 134992.85933942435 亏损: -89942.89773736836 最大盈利: 9874.53 最大亏损: -1361.53 胜率: 37.75% 总收益: 45049.96 平均盈利: 40.88 typeA: 15.43
趋势多且增强-11 总交易次数: 181 盈利: 23903.226692041186 亏损: -19027.415892475776 最大盈利: 2331.42 最大亏损: -907.40 胜率: 50.28% 总收益: 4875.81 平均盈利: 26.94 typeA: 13.54
趋势空且增强-2 总交易次数: 161 盈利: 13517.416236992509 亏损: -10868.272859624105 最大盈利: 1750.26 最大亏损: -726.46 胜率: 57.76% 总收益: 2649.14 平均盈利: 16.45 typeA: 9.50
趋势空且增强-11 总交易次数: 141 盈利: 14811.612471406766 亏损: -12615.260446157094 最大盈利: 778.33 最大亏损: -910.68 胜率: 56.03% 总收益: 2196.35 平均盈利: 15.58 typeA: 8.73
趋势空且增强-4 总交易次数: 74 盈利: 5581.547946345316 亏损: -4300.131770564811 最大盈利: 910.73 最大亏损: -292.60 胜率: 50.00% 总收益: 1281.42 平均盈利: 17.32 typeA: 8.66
趋势多且增强-3 总交易次数: 68 盈利: 3860.982337820494 亏损: -2529.091636680612 最大盈利: 1049.40 最大亏损: -291.68 胜率: 44.12% 总收益: 1331.89 平均盈利: 19.59 typeA: 8.64
趋势空且增强-7 总交易次数: 1350 盈利: 164217.93487141497 亏损: -140540.29814902393 最大盈利: 2544.83 最大亏损: -3479.07 胜率: 43.70% 总收益: 23677.64 平均盈利: 17.54 typeA: 7.66
趋势空且增强-3 总交易次数: 372 盈利: 33532.57665524387 亏损: -27296.572146903964 最大盈利: 2357.13 最大亏损: -1220.59 胜率: 37.10% 总收益: 6236.00 平均盈利: 16.76 typeA: 6.22
趋势多且增强-10 总交易次数: 54 盈利: 3731.834920204533 亏损: -2880.019601458416 最大盈利: 1251.76 最大亏损: -797.76 胜率: 37.04% 总收益: 851.82 平均盈利: 15.77 typeA: 5.84
趋势多且增强-8 总交易次数: 274 盈利: 20436.229936523952 亏损: -19217.267611550873 最大盈利: 4561.65 最大亏损: -1479.45 胜率: 55.84% 总收益: 1218.96 平均盈利: 4.45 typeA: 2.48
趋势多且增强-6 总交易次数: 918 盈利: 52078.97503545774 亏损: -47509.54006074834 最大盈利: 2117.62 最大亏损: -1286.08 胜率: 33.77% 总收益: 4569.43 平均盈利: 4.98 typeA: 1.68

#############################################################


profitTotal 129728.46919851024
maxLossTotal -1889.43
winRateTotal 2606.68
period month 53
avgRate 49.18
maxDrawdownTotal 36.9
趋势空且增强-1 总交易次数: 131 盈利: 25069.644521439583 亏损: -12138.772122165288 最大盈利: 3191.96 最大亏损: -1549.16 胜率: 67.18% 总收益: 12930.87 平均盈利: 98.71 typeA: 66.31
趋势多且增强-1 总交易次数: 61 盈利: 17296.407604573993 亏损: -11024.284352343619 最大盈利: 6150.71 最大亏损: -1889.43 胜率: 54.10% 总收益: 6272.12 平均盈利: 102.82 typeA: 55.63
趋势多且增强-7test2 总交易次数: 108 盈利: 12096.200922277689 亏损: -5979.998584044565 最大盈利: 1427.22 最大亏损: -1764.99 胜率: 69.44% 总收益: 6116.20 平均盈利: 56.63 typeA: 39.32
趋势空且增强-2 总交易次数: 257 盈利: 27823.532690092812 亏损: -16246.026129281627 最大盈利: 3207.12 最大亏损: -726.46 胜率: 59.53% 总收益: 11577.51 平均盈利: 45.05 typeA: 26.82
趋势多且增强-4 总交易次数: 732 盈利: 65832.23969324383 亏损: -33041.186041826266 最大盈利: 9227.82 最大亏损: -923.52 胜率: 54.51% 总收益: 32791.05 平均盈利: 44.80 typeA: 24.42
趋势多且增强-7test1 总交易次数: 330 盈利: 26825.67298336487 亏损: -15144.332728692547 最大盈利: 1699.60 最大亏损: -984.85 胜率: 61.82% 总收益: 11681.34 平均盈利: 35.40 typeA: 21.88
趋势多且增强-2 总交易次数: 1355 盈利: 155491.96815233625 亏损: -110356.70829683944 最大盈利: 9874.53 最大亏损: -1361.53 胜率: 37.34% 总收益: 45135.26 平均盈利: 33.31 typeA: 12.44
趋势多且增强-11 总交易次数: 192 盈利: 24250.397951602452 亏损: -19823.260197738728 最大盈利: 2331.42 最大亏损: -907.40 胜率: 50.00% 总收益: 4427.14 平均盈利: 23.06 typeA: 11.53
趋势空且增强-4 总交易次数: 106 盈利: 8668.79092844931 亏损: -6807.499636916097 最大盈利: 910.73 最大亏损: -383.83 胜率: 49.06% 总收益: 1861.29 平均盈利: 17.56 typeA: 8.61
趋势空且增强-11 总交易次数: 187 盈利: 18140.163847941418 亏损: -15608.760783055459 最大盈利: 778.33 最大亏损: -910.68 胜率: 56.15% 总收益: 2531.40 平均盈利: 13.54 typeA: 7.60
趋势多且增强-8 总交易次数: 286 盈利: 21460.53825422555 亏损: -19528.25947813389 最大盈利: 4561.65 最大亏损: -1479.45 胜率: 56.99% 总收益: 1932.28 平均盈利: 6.76 typeA: 3.85


##################################################################



tradeNumTotal 3432
profitTotal 132016.74421826098
maxLossTotal -2110.94
winRateTotal 2630.6000000000004
period month 53
avgRate 49.63
maxDrawdownTotal 29.6
趋势空且增强-1 总交易次数: 131 盈利: 25069.644521439583 亏损: -12138.772122165288 最大盈利: 3191.96 最大亏损: -1549.16 胜率: 67.18% 总收益: 12930.87 平均盈利: 98.71 typeA: 66.31
趋势多且增强-1 总交易次数: 61 盈利: 17377.836074828952 亏损: -10363.964846442652 最大盈利: 6150.71 最大亏损: -1694.02 胜率: 54.10% 总收益: 7013.87 平均盈利: 114.98 typeA: 62.20
趋势空且增强-2 总交易次数: 253 盈利: 33096.78302448325 亏损: -16494.7582515435 最大盈利: 4403.10 最大亏损: -726.46 胜率: 58.50% 总收益: 16602.02 平均盈利: 65.62 typeA: 38.39
趋势多且增强-7test2 总交易次数: 107 盈利: 11805.060151029167 亏损: -6426.581956572068 最大盈利: 1427.22 最大亏损: -2088.31 胜率: 69.16% 总收益: 5378.48 平均盈利: 50.27 typeA: 34.76
趋势多且增强-4 总交易次数: 728 盈利: 68458.37403898448 亏损: -36129.53255468728 最大盈利: 9227.82 最大亏损: -1830.26 胜率: 58.65% 总收益: 32328.84 平均盈利: 44.41 typeA: 26.05
趋势多且增强-7test1 总交易次数: 325 盈利: 27370.293834378674 亏损: -16032.988709013554 最大盈利: 1699.60 最大亏损: -1818.29 胜率: 60.92% 总收益: 11337.31 平均盈利: 34.88 typeA: 21.25
趋势空且增强-11 总交易次数: 176 盈利: 20245.533582436612 亏损: -16118.435555699794 最大盈利: 778.33 最大亏损: -939.00 胜率: 60.23% 总收益: 4127.10 平均盈利: 23.45 typeA: 14.12
趋势多且增强-11 总交易次数: 191 盈利: 24318.588558067302 亏损: -19530.517990241584 最大盈利: 2331.42 最大亏损: -969.84 胜率: 50.79% 总收益: 4788.07 平均盈利: 25.07 typeA: 12.73
趋势多且增强-2 总交易次数: 1355 盈利: 157108.32198608658 亏损: -113107.7970063924 最大盈利: 9874.53 最大亏损: -2110.94 胜率: 37.93% 总收益: 44000.52 平均盈利: 32.47 typeA: 12.32
趋势空且增强-4 总交易次数: 105 盈利: 7857.864090514264 亏损: -7448.2066512298 最大盈利: 910.73 最大亏损: -383.83 胜率: 40.95% 总收益: 409.66 平均盈利: 3.90 typeA: 1.60

########################################################################


tradeNumTotal 3228
profitTotal 132766.42916718993
maxLossTotal -2110.94
winRateTotal 2593.26
period month 53
avgRate 48.93
maxDrawdownTotal 29
趋势空且增强-2 总交易次数: 253 盈利: 33096.78302448325 亏损: -17541.498080282247 最大盈利: 4403.10 最大亏损: -1403.32 胜率: 58.50% 总收益: 15555.28 平均盈利: 61.48 typeA: 35.97
趋势多且增强-7test2 总交易次数: 107 盈利: 11805.060151029167 亏损: -6426.581956572068 最大盈利: 1427.22 最大亏损: -2088.31 胜率: 69.16% 总收益: 5378.48 平均盈利: 50.27 typeA: 34.76
趋势多且增强-2 总交易次数: 1351 盈利: 195608.65999329046 亏损: -112082.08100695984 最大盈利: 41166.13 最大亏损: -2110.94 胜率: 38.12% 总收益: 83526.58 平均盈利: 61.83 typeA: 23.57
趋势多且增强-7test1 总交易次数: 325 盈利: 27370.293834378674 亏损: -16032.988709013554 最大盈利: 1699.60 最大亏损: -1818.29 胜率: 60.92% 总收益: 11337.31 平均盈利: 34.88 typeA: 21.25
趋势空且增强-11 总交易次数: 176 盈利: 20245.533582436612 亏损: -16529.16258259777 最大盈利: 778.33 最大亏损: -939.00 胜率: 60.23% 总收益: 3716.37 平均盈利: 21.12 typeA: 12.72
趋势多且增强-4 总交易次数: 720 盈利: 52450.368773133996 亏损: -37159.307707007894 最大盈利: 2081.23 最大亏损: -1830.26 胜率: 58.06% 总收益: 15291.06 平均盈利: 21.24 typeA: 12.33
趋势多且增强-11 总交易次数: 191 盈利: 23616.852678251096 亏损: -19573.16026666435 最大盈利: 2331.42 最大亏损: -969.84 胜率: 50.26% 总收益: 4043.69 平均盈利: 21.17 typeA: 10.64
趋势空且增强-4 总交易次数: 105 盈利: 7857.864090514264 亏损: -7448.2066512298 最大盈利: 910.73 最大亏损: -383.83 胜率: 40.95% 总收益: 409.66 平均盈利: 3.90 typeA: 1.60


###########################################################################


tradeNumTotal 3228
profitTotal 132766.42916718993
maxLossTotal -2110.94
winRateTotal 2593.26
period month 53
avgRate 48.93
maxDrawdownTotal 29
趋势多且增强-2testtest 总交易次数: 49 盈利: 49672.23323235777 亏损: -3942.0728500518744 最大盈利: 41166.13 最大亏损: -642.41 胜率: 42.86% 总收益: 45730.16 平均盈利: 933.27 typeA: 400.00
趋势空且增强-2 总交易次数: 253 盈利: 33096.78302448325 亏损: -17541.498080282247 最大盈利: 4403.10 最大亏损: -1403.32 胜率: 58.50% 总收益: 15555.28 平均盈利: 61.48 typeA: 35.97
趋势多且增强-7test2 总交易次数: 107 盈利: 11805.060151029167 亏损: -6426.581956572068 最大盈利: 1427.22 最大亏损: -2088.31 胜率: 69.16% 总收益: 5378.48 平均盈利: 50.27 typeA: 34.76
趋势多且增强-6test 总交易次数: 287 盈利: 45312.210772788916 亏损: -21788.355077462318 最大盈利: 16227.05 最大亏损: -1991.57 胜率: 37.63% 总收益: 23523.86 平均盈利: 81.96 typeA: 30.84
趋势多且增强-2 总交易次数: 36 盈利: 6726.833198832167 亏损: -4094.6226096474743 最大盈利: 3125.26 最大亏损: -2110.94 胜率: 36.11% 总收益: 2632.21 平均盈利: 73.12 typeA: 26.40
趋势多且增强-7test1 总交易次数: 325 盈利: 27370.293834378674 亏损: -16032.988709013554 最大盈利: 1699.60 最大亏损: -1818.29 胜率: 60.92% 总收益: 11337.31 平均盈利: 34.88 typeA: 21.25
趋势空且增强-11 总交易次数: 176 盈利: 20245.533582436612 亏损: -16529.16258259777 最大盈利: 778.33 最大亏损: -939.00 胜率: 60.23% 总收益: 3716.37 平均盈利: 21.12 typeA: 12.72
趋势多且增强-4 总交易次数: 720 盈利: 52450.368773133996 亏损: -37159.307707007894 最大盈利: 2081.23 最大亏损: -1830.26 胜率: 58.06% 总收益: 15291.06 平均盈利: 21.24 typeA: 12.33
趋势多且增强-11 总交易次数: 191 盈利: 23616.852678251096 亏损: -19573.16026666435 最大盈利: 2331.42 最大亏损: -969.84 胜率: 50.26% 总收益: 4043.69 平均盈利: 21.17 typeA: 10.64
趋势多且增强-4test 总交易次数: 268 盈利: 30313.472221118696 亏损: -23990.618786201678 最大盈利: 7630.31 最大亏损: -1322.90 胜率: 32.46% 总收益: 6322.85 平均盈利: 23.59 typeA: 7.66
趋势多且增强-2test 总交易次数: 91 盈利: 10834.56217779673 亏损: -9081.513102235545 最大盈利: 1856.25 最大亏损: -952.52 胜率: 39.56% 总收益: 1753.05 平均盈利: 19.26 typeA: 7.62
趋势多且增强-7test 总交易次数: 30 盈利: 2728.3485544577943 亏损: -2367.858819054945 最大盈利: 578.50 最大亏损: -447.75 胜率: 46.67% 总收益: 360.49 平均盈利: 12.02 typeA: 5.61
趋势多且增强-5test 总交易次数: 436 盈利: 35140.75989769567 亏损: -31298.326796084166 最大盈利: 1367.76 最大亏损: -1995.64 胜率: 40.14% 总收益: 3842.43 平均盈利: 8.81 typeA: 3.54
趋势空且增强-4 总交易次数: 105 盈利: 7857.864090514264 亏损: -7448.2066512298 最大盈利: 910.73 最大亏损: -383.83 胜率: 40.95% 总收益: 409.66 平均盈利: 3.90 typeA: 1.60
趋势多且增强-3test 总交易次数: 154 盈利: 14880.239938242872 亏损: -15518.712966221967 最大盈利: 1890.24 最大亏损: -1361.53 胜率: 39.61% 总收益: -638.47 平均盈利: -4.15 typeA: -1.64


#####################################################################

tradeNumTotal 3246
profitTotal 134241.8770664378
maxLossTotal -2110.94
winRateTotal 2591.3199999999997
period month 53
avgRate 48.89
maxDrawdownTotal 29
趋势多且增强-1-1 总交易次数: 49 盈利: 49672.23323235777 亏损: -4053.6170212722764 最大盈利: 41166.13 最大亏损: -642.41 胜率: 42.86% 总收益: 45618.62 平均盈利: 930.99 typeA: 399.02
趋势空且增强-2 总交易次数: 253 盈利: 33096.78302448325 亏损: -16680.410005015863 最大盈利: 4403.10 最大亏损: -818.35 胜率: 58.50% 总收益: 16416.37 平均盈利: 64.89 typeA: 37.96
趋势多且增强-7test2 总交易次数: 107 盈利: 11805.060151029167 亏损: -6426.581956572068 最大盈利: 1427.22 最大亏损: -2088.31 胜率: 69.16% 总收益: 5378.48 平均盈利: 50.27 typeA: 34.76
趋势多且增强-1-7 总交易次数: 287 盈利: 45312.210772788916 亏损: -21788.355077462318 最大盈利: 16227.05 最大亏损: -1991.57 胜率: 37.63% 总收益: 23523.86 平均盈利: 81.96 typeA: 30.84
趋势多且增强-1-2 总交易次数: 36 盈利: 6726.833198832167 亏损: -4107.430351225565 最大盈利: 3125.26 最大亏损: -2110.94 胜率: 36.11% 总收益: 2619.40 平均盈利: 72.76 typeA: 26.27
趋势多且增强-7test1 总交易次数: 325 盈利: 27370.293834378674 亏损: -16032.988709013554 最大盈利: 1699.60 最大亏损: -1818.29 胜率: 60.92% 总收益: 11337.31 平均盈利: 34.88 typeA: 21.25
趋势空且增强-11 总交易次数: 175 盈利: 20245.533582436612 亏损: -15715.718197125032 最大盈利: 778.33 最大亏损: -939.00 胜率: 60.57% 总收益: 4529.82 平均盈利: 25.88 typeA: 15.68
趋势多且增强-4 总交易次数: 720 盈利: 52371.54794407842 亏损: -37207.02676929187 最大盈利: 2081.23 最大亏损: -1830.26 胜率: 57.78% 总收益: 15164.52 平均盈利: 21.06 typeA: 12.17
趋势多且增强-11 总交易次数: 191 盈利: 23552.336645291703 亏损: -19155.5096038594 最大盈利: 2331.42 最大亏损: -907.40 胜率: 50.26% 总收益: 4396.83 平均盈利: 23.02 typeA: 11.57
趋势多且增强-1-3 总交易次数: 91 盈利: 10781.593703998973 亏损: -8791.8296269185 最大盈利: 1856.25 最大亏损: -952.52 胜率: 38.46% 总收益: 1989.76 平均盈利: 21.87 typeA: 8.41
趋势多且增强-1-5 总交易次数: 268 盈利: 30313.472221118696 亏损: -23861.152939649393 最大盈利: 7630.31 最大亏损: -1322.90 胜率: 32.46% 总收益: 6452.32 平均盈利: 24.08 typeA: 7.82
趋势多且增强-1-8 总交易次数: 30 盈利: 2728.3485544577943 亏损: -2367.858819054945 最大盈利: 578.50 最大亏损: -447.75 胜率: 46.67% 总收益: 360.49 平均盈利: 12.02 typeA: 5.61
趋势多且增强-1-6 总交易次数: 436 盈利: 35140.75989769567 亏损: -31298.326796084166 最大盈利: 1367.76 最大亏损: -1995.64 胜率: 40.14% 总收益: 3842.43 平均盈利: 8.81 typeA: 3.54
趋势空且增强-4 总交易次数: 102 盈利: 7517.814950465125 亏损: -7367.932747346985 最大盈利: 910.73 最大亏损: -383.83 胜率: 40.20% 总收益: 149.88 平均盈利: 1.47 typeA: 0.59
趋势多且增强-1-4 总交易次数: 154 盈利: 14880.239938242872 亏损: -15741.785862273235 最大盈利: 1890.24 最大亏损: -1361.53 胜率: 39.61% 总收益: -861.55 平均盈利: -5.59 typeA: -2.22
趋势空且增强-4test 总交易次数: 22 盈利: 2203.3162806176583 亏损: -2351.9763836703737 最大盈利: 523.86 最大亏损: -459.50 胜率: 54.55% 总收益: -148.66 平均盈利: -6.76 typeA: -3.69



###########################################################################


tradeNumTotal 3368
profitTotal 136044.26012056693
maxLossTotal -2110.94
winRateTotal 2536.7999999999993
period month 53
avgRate 47.86
maxDrawdownTotal 29
趋势多且增强-1-1 总交易次数: 49 盈利: 49672.23323235777 亏损: -3768.643567221994 最大盈利: 41166.13 最大亏损: -642.41 胜率: 42.86% 总收益: 45903.59 平均盈利: 936.81 typeA: 401.52
趋势多且增强-7test2 总交易次数: 107 盈利: 11805.060151029167 亏损: -6426.581956572068 最大盈利: 1427.22 最大亏损: -2088.31 胜率: 69.16% 总收益: 5378.48 平均盈利: 50.27 typeA: 34.76
趋势空且增强-2 总交易次数: 245 盈利: 29860.05268900044 亏损: -16118.376326280297 最大盈利: 4403.10 最大亏损: -818.35 胜率: 58.78% 总收益: 13741.68 平均盈利: 56.09 typeA: 32.97
趋势多且增强-4-3 总交易次数: 91 盈利: 8616.951875776456 亏损: -3711.9031643218045 最大盈利: 1285.64 最大亏损: -501.31 胜率: 53.85% 总收益: 4905.05 平均盈利: 53.90 typeA: 29.03
趋势多且增强-1-7 总交易次数: 287 盈利: 42079.4257587886 亏损: -21788.355077462318 最大盈利: 12994.26 最大亏损: -1991.57 胜率: 37.63% 总收益: 20291.07 平均盈利: 70.70 typeA: 26.60
趋势多且增强-1-2 总交易次数: 36 盈利: 6726.833198832167 亏损: -4175.562747859988 最大盈利: 3125.26 最大亏损: -2110.94 胜率: 36.11% 总收益: 2551.27 平均盈利: 70.87 typeA: 25.59
趋势多且增强-7test1 总交易次数: 328 盈利: 28027.162166437723 亏损: -16085.339556755705 最大盈利: 1699.60 最大亏损: -1818.29 胜率: 60.98% 总收益: 11941.82 平均盈利: 36.41 typeA: 22.20
趋势空且增强-4-5 总交易次数: 145 盈利: 18386.48759499155 亏损: -12313.170006209533 最大盈利: 2533.05 最大亏损: -727.25 胜率: 36.55% 总收益: 6073.32 平均盈利: 41.88 typeA: 15.31
趋势空且增强-11 总交易次数: 173 盈利: 19954.86121998568 亏损: -15715.718197125032 最大盈利: 778.33 最大亏损: -939.00 胜率: 60.12% 总收益: 4239.14 平均盈利: 24.50 typeA: 14.73
趋势多且增强-4-4 总交易次数: 614 盈利: 41549.03351082521 亏损: -29299.980041707073 最大盈利: 2081.23 最大亏损: -1830.26 胜率: 56.35% 总收益: 12249.05 平均盈利: 19.95 typeA: 11.24
趋势多且增强-1-5 总交易次数: 270 盈利: 30745.093138284767 亏损: -23311.1473278013 最大盈利: 7630.31 最大亏损: -1322.90 胜率: 32.96% 总收益: 7433.95 平均盈利: 27.53 typeA: 9.07
趋势多且增强-11 总交易次数: 192 盈利: 22395.958172817736 亏损: -19063.38053831145 最大盈利: 2061.31 最大亏损: -907.40 胜率: 49.48% 总收益: 3332.58 平均盈利: 17.36 typeA: 8.59
趋势多且增强-1-3 总交易次数: 91 盈利: 10045.08367598242 亏损: -8512.254343792036 最大盈利: 1856.25 最大亏损: -588.80 胜率: 36.26% 总收益: 1532.83 平均盈利: 16.84 typeA: 6.11
趋势多且增强-1-8 总交易次数: 30 盈利: 2728.3485544577943 亏损: -2367.858819054945 最大盈利: 578.50 最大亏损: -447.75 胜率: 46.67% 总收益: 360.49 平均盈利: 12.02 typeA: 5.61
趋势多且增强-1-6 总交易次数: 436 盈利: 34033.81730147873 亏损: -31363.820340921167 最大盈利: 1367.76 最大亏损: -1995.64 胜率: 39.68% 总收益: 2670.00 平均盈利: 6.12 typeA: 2.43
趋势空且增强-4 总交易次数: 99 盈利: 7639.9280357927455 亏损: -7273.25945608876 最大盈利: 910.73 最大亏损: -383.83 胜率: 39.39% 总收益: 366.67 平均盈利: 3.70 typeA: 1.46
趋势多且增强-1-4 总交易次数: 154 盈利: 14133.693400184304 亏损: -14241.150646372433 最大盈利: 1890.24 最大亏损: -943.77 胜率: 38.96% 总收益: -107.46 平均盈利: -0.70 typeA: -0.27
趋势空且增强-4test 总交易次数: 21 盈利: 2203.3162806176583 亏损: -2246.5777232160945 最大盈利: 523.86 最大亏损: -459.50 胜率: 57.14% 总收益: -43.26 平均盈利: -2.06 typeA: -1.18


#############################################################################



tradeNumTotal 3368
profitTotal 136044.26012056693
maxLossTotal -2110.94
winRateTotal 2536.7999999999993
period month 53
avgRate 47.86
maxDrawdownTotal 29
趋势多且增强-1-1 总交易次数: 49 盈利: 49672.23323235777 亏损: -3768.643567221994 最大盈利: 41166.13 最大亏损: -642.41 胜率: 42.86% 总收益: 45903.59 平均盈利: 936.81 typeA: 401.52
趋势多且增强-7test2 总交易次数: 107 盈利: 11805.060151029167 亏损: -6426.581956572068 最大盈利: 1427.22 最大亏损: -2088.31 胜率: 69.16% 总收益: 5378.48 平均盈利: 50.27 typeA: 34.76
趋势空且增强-2 总交易次数: 245 盈利: 29860.05268900044 亏损: -16118.376326280297 最大盈利: 4403.10 最大亏损: -818.35 胜率: 58.78% 总收益: 13741.68 平均盈利: 56.09 typeA: 32.97
趋势多且增强-4-3 总交易次数: 91 盈利: 8616.951875776456 亏损: -3711.9031643218045 最大盈利: 1285.64 最大亏损: -501.31 胜率: 53.85% 总收益: 4905.05 平均盈利: 53.90 typeA: 29.03
趋势多且增强-1-8 总交易次数: 287 盈利: 42079.4257587886 亏损: -21788.355077462318 最大盈利: 12994.26 最大亏损: -1991.57 胜率: 37.63% 总收益: 20291.07 平均盈利: 70.70 typeA: 26.60
趋势多且增强-1-2 总交易次数: 36 盈利: 6726.833198832167 亏损: -4175.562747859988 最大盈利: 3125.26 最大亏损: -2110.94 胜率: 36.11% 总收益: 2551.27 平均盈利: 70.87 typeA: 25.59
趋势多且增强-7test1 总交易次数: 328 盈利: 28027.162166437723 亏损: -16085.339556755705 最大盈利: 1699.60 最大亏损: -1818.29 胜率: 60.98% 总收益: 11941.82 平均盈利: 36.41 typeA: 22.20
趋势空且增强-4-6 总交易次数: 145 盈利: 18386.48759499155 亏损: -12313.170006209533 最大盈利: 2533.05 最大亏损: -727.25 胜率: 36.55% 总收益: 6073.32 平均盈利: 41.88 typeA: 15.31
趋势空且增强-11 总交易次数: 173 盈利: 19954.86121998568 亏损: -15715.718197125032 最大盈利: 778.33 最大亏损: -939.00 胜率: 60.12% 总收益: 4239.14 平均盈利: 24.50 typeA: 14.73
趋势多且增强-4-4 总交易次数: 465 盈利: 32874.174002960564 亏损: -23091.778131233437 最大盈利: 2081.23 最大亏损: -1830.26 胜率: 54.62% 总收益: 9782.40 平均盈利: 21.04 typeA: 11.49
趋势多且增强-4-5 总交易次数: 149 盈利: 8674.859507864634 亏损: -6208.201910473636 最大盈利: 1373.52 最大亏损: -390.73 胜率: 61.74% 总收益: 2466.66 平均盈利: 16.55 typeA: 10.22
趋势多且增强-1-5 总交易次数: 270 盈利: 30745.093138284767 亏损: -23311.1473278013 最大盈利: 7630.31 最大亏损: -1322.90 胜率: 32.96% 总收益: 7433.95 平均盈利: 27.53 typeA: 9.07
趋势多且增强-11 总交易次数: 192 盈利: 22395.958172817736 亏损: -19063.38053831145 最大盈利: 2061.31 最大亏损: -907.40 胜率: 49.48% 总收益: 3332.58 平均盈利: 17.36 typeA: 8.59
趋势多且增强-1-6 总交易次数: 220 盈利: 19866.417784875863 亏损: -16135.115693058819 最大盈利: 963.19 最大亏损: -879.16 胜率: 40.00% 总收益: 3731.30 平均盈利: 16.96 typeA: 6.78
趋势多且增强-1-3 总交易次数: 91 盈利: 10045.08367598242 亏损: -8512.254343792036 最大盈利: 1856.25 最大亏损: -588.80 胜率: 36.26% 总收益: 1532.83 平均盈利: 16.84 typeA: 6.11
趋势多且增强-1-9 总交易次数: 30 盈利: 2728.3485544577943 亏损: -2367.858819054945 最大盈利: 578.50 最大亏损: -447.75 胜率: 46.67% 总收益: 360.49 平均盈利: 12.02 typeA: 5.61
趋势空且增强-4 总交易次数: 99 盈利: 7639.9280357927455 亏损: -7273.25945608876 最大盈利: 910.73 最大亏损: -383.83 胜率: 39.39% 总收益: 366.67 平均盈利: 3.70 typeA: 1.46
趋势多且增强-1-4 总交易次数: 154 盈利: 14133.693400184304 亏损: -14241.150646372433 最大盈利: 1890.24 最大亏损: -943.77 胜率: 38.96% 总收益: -107.46 平均盈利: -0.70 typeA: -0.27
趋势空且增强-4test 总交易次数: 21 盈利: 2203.3162806176583 亏损: -2246.5777232160945 最大盈利: 523.86 最大亏损: -459.50 胜率: 57.14% 总收益: -43.26 平均盈利: -2.06 typeA: -1.18
趋势多且增强-1-7 总交易次数: 216 盈利: 14167.399516602884 亏损: -15228.704647862336 最大盈利: 1367.76 最大亏损: -1995.64 胜率: 39.35% 总收益: -1061.31 平均盈利: -4.91 typeA: -1.93


###################################################################



tradeNumTotal 4310
profitTotal 147083.94340294364
maxLossTotal -2197.24
winRateTotal 2634.3800000000006
period month 53
avgRate 49.71
maxDrawdownTotal 33.4
趋势多且增强-1-1-1 总交易次数: 41 盈利: 46630.546831319785 亏损: -2369.5280411846697 最大盈利: 41166.13 最大亏损: -455.43 胜率: 39.02% 总收益: 44261.02 平均盈利: 1079.54 typeA: 421.24
趋势多且增强-1-2 总交易次数: 19 盈利: 10776.172725511178 亏损: -3636.738244649015 最大盈利: 7049.81 最大亏损: -2197.24 胜率: 47.37% 总收益: 7139.43 平均盈利: 375.76 typeA: 178.00
趋势多且增强-1-8 总交易次数: 39 盈利: 8485.029709919974 亏损: -2552.6035297766375 最大盈利: 1199.40 最大亏损: -491.89 胜率: 56.41% 总收益: 5932.43 平均盈利: 152.11 typeA: 85.81
趋势多且增强-1-3 总交易次数: 53 盈利: 11529.231353435618 亏损: -4827.006901580487 最大盈利: 1856.25 最大亏损: -588.80 胜率: 50.94% 总收益: 6702.22 平均盈利: 126.46 typeA: 64.42
趋势多且增强-7test2 总交易次数: 107 盈利: 11894.336398796815 亏损: -6426.581956572068 最大盈利: 1427.22 最大亏损: -2088.31 胜率: 69.16% 总收益: 5467.75 平均盈利: 51.10 typeA: 35.34
趋势空且增强-2 总交易次数: 238 盈利: 28151.35749762982 亏损: -16118.376326280297 最大盈利: 4403.10 最大亏损: -818.35 胜率: 57.56% 总收益: 12032.98 平均盈利: 50.56 typeA: 29.10
趋势多且增强-1-1 总交易次数: 26 盈利: 4759.472699987232 亏损: -2891.8151384321427 最大盈利: 1348.53 最大亏损: -642.41 胜率: 38.46% 总收益: 1867.66 平均盈利: 71.83 typeA: 27.63
趋势多且增强-1-1-2 总交易次数: 31 盈利: 3516.0301591153875 亏损: -1386.9125301580052 最大盈利: 880.28 最大亏损: -296.01 胜率: 35.48% 总收益: 2129.12 平均盈利: 68.68 typeA: 24.37
趋势多且增强-7test1 总交易次数: 328 盈利: 28344.89060664494 亏损: -16085.339556755705 最大盈利: 1699.60 最大亏损: -1818.29 胜率: 60.98% 总收益: 12259.55 平均盈利: 37.38 typeA: 22.79
趋势多且增强-4-5 总交易次数: 168 盈利: 11829.468784381257 亏损: -7079.910629343406 最大盈利: 1655.83 最大亏损: -390.73 胜率: 64.29% 总收益: 4749.56 平均盈利: 28.27 typeA: 18.18
趋势多且增强-1-1-8 总交易次数: 247 盈利: 32044.332758094475 亏损: -19300.11432213677 最大盈利: 12994.26 最大亏损: -1991.57 胜率: 34.01% 总收益: 12744.22 平均盈利: 51.60 typeA: 17.55
趋势空且增强-11 总交易次数: 172 盈利: 19954.86121998568 亏损: -15424.95697344605 最大盈利: 778.33 最大亏损: -939.00 胜率: 60.47% 总收益: 4529.90 平均盈利: 26.34 typeA: 15.93
趋势多且增强-1-1-9 总交易次数: 28 盈利: 2868.8703863506585 亏损: -1920.1100002249473 最大盈利: 578.50 最大亏损: -426.30 胜率: 46.43% 总收益: 948.76 平均盈利: 33.88 typeA: 15.73
趋势多且增强-4-3 总交易次数: 105 盈利: 7957.953309388296 亏损: -5126.406126562657 最大盈利: 1601.48 最大亏损: -501.31 胜率: 53.33% 总收益: 2831.55 平均盈利: 26.97 typeA: 14.38
趋势多且增强-4-4 总交易次数: 502 盈利: 37424.73397184442 亏损: -24518.920717121186 最大盈利: 2081.23 最大亏损: -1830.26 胜率: 55.78% 总收益: 12905.81 平均盈利: 25.71 typeA: 14.34
趋势多且增强-1-6 总交易次数: 55 盈利: 6761.919854959909 亏损: -4849.473226437179 最大盈利: 963.19 最大亏损: -637.32 胜率: 38.18% 总收益: 1912.45 平均盈利: 34.77 typeA: 13.28
趋势空且增强-2-1 总交易次数: 781 盈利: 64309.00869370471 亏损: -51419.69531568101 最大盈利: 1969.37 最大亏损: -984.91 胜率: 57.36% 总收益: 12889.31 平均盈利: 16.50 typeA: 9.47
趋势多且增强-1-1-4 总交易次数: 128 盈利: 10518.74962531337 亏损: -7901.641098637103 最大盈利: 1890.24 最大亏损: -610.81 胜率: 41.41% 总收益: 2617.11 平均盈利: 20.45 typeA: 8.47
趋势多且增强-1-5 总交易次数: 80 盈利: 8242.913228276158 亏损: -6657.708240283488 最大盈利: 1183.30 最大亏损: -625.61 胜率: 37.50% 总收益: 1585.20 平均盈利: 19.82 typeA: 7.43
趋势空且增强-4-6 总交易次数: 131 盈利: 13516.426145239335 亏损: -11003.82436128702 最大盈利: 2533.05 最大亏损: -727.25 胜率: 35.11% 总收益: 2512.60 平均盈利: 19.18 typeA: 6.73
趋势多且增强-1-1-3 总交易次数: 68 盈利: 5959.35658420948 亏损: -4978.125289039102 最大盈利: 1586.90 最大亏损: -585.54 胜率: 38.24% 总收益: 981.23 平均盈利: 14.43 typeA: 5.52
趋势多且增强-1-1-6 总交易次数: 165 盈利: 13142.402337145506 亏损: -11039.204878014987 最大盈利: 880.39 最大亏损: -879.16 胜率: 42.42% 总收益: 2103.20 平均盈利: 12.75 typeA: 5.41
趋势多且增强-11 总交易次数: 194 盈利: 13731.285721314369 亏损: -12104.437717771236 最大盈利: 2143.30 最大亏损: -907.40 胜率: 52.06% 总收益: 1626.85 平均盈利: 8.39 typeA: 4.37
趋势空且增强-4 总交易次数: 97 盈利: 7639.9280357927455 亏损: -6836.992317326915 最大盈利: 910.73 最大亏损: -383.83 胜率: 40.21% 总收益: 802.94 平均盈利: 8.28 typeA: 3.33
趋势多且增强-1-1-7 总交易次数: 171 盈利: 9067.15334383683 亏损: -9062.514366483583 最大盈利: 725.34 最大亏损: -487.08 胜率: 41.52% 总收益: 4.64 平均盈利: 0.03 typeA: 0.01
趋势多且增强-1-1-5 总交易次数: 200 盈利: 15618.976923791302 亏损: -16169.999080369438 最大盈利: 1247.87 最大亏损: -1322.90 胜率: 35.00% 总收益: -551.02 平均盈利: -2.76 typeA: -0.96
趋势空且增强-4test 总交易次数: 17 盈利: 1613.9356930489962 亏损: -1917.195446525875 最大盈利: 523.86 最大亏损: -459.50 胜率: 58.82% 总收益: -303.26 平均盈利: -17.84 typeA: -10.49
趋势多且增强-1-4 总交易次数: 71 盈利: 5651.641657647966 亏损: -9473.62307368921 最大盈利: 502.50 最大亏损: -966.78 胜率: 39.44% 总收益: -3821.98 平均盈利: -53.83 typeA: -21.23
趋势多且增强-1-7 总交易次数: 46 盈利: 3058.5944795490223 亏损: -5784.696729323098 最大盈利: 506.34 最大亏损: -1995.64 胜率: 36.96% 总收益: -2726.10 平均盈利: -59.26 typeA: -21.90
趋势多且增强-1-9 总交易次数: 2 盈利: 64.56362063163954 亏损: -447.7488188299975 最大盈利: 64.56 最大亏损: -447.75 胜率: 50.00% 总收益: -383.19 平均盈利: -191.59 typeA: -95.80


#########################################################################


tradeNumTotal 3901
profitTotal 148002.35987915887
maxLossTotal -2197.24
winRateTotal 2714.1
period month 53
avgRate 51.21
maxDrawdownTotal 32.8
趋势多且增强-1-1-1 总交易次数: 42 盈利: 46630.546831319785 亏损: -2379.484367054646 最大盈利: 41166.13 最大亏损: -455.43 胜率: 38.10% 总收益: 44251.06 平均盈利: 1053.60 typeA: 401.42
趋势多且增强-1-2 总交易次数: 19 盈利: 10776.172725511178 亏损: -3636.738244649015 最大盈利: 7049.81 最大亏损: -2197.24 胜率: 47.37% 总收益: 7139.43 平均盈利: 375.76 typeA: 178.00
趋势多且增强-1-3 总交易次数: 54 盈利: 11206.428012732946 亏损: -5099.609154113886 最大盈利: 1856.25 最大亏损: -588.80 胜率: 48.15% 总收益: 6106.82 平均盈利: 113.09 typeA: 54.45
趋势空且增强-2 总交易次数: 231 盈利: 30723.043543508975 亏损: -16084.261751656948 最大盈利: 4403.10 最大亏损: -818.35 胜率: 56.71% 总收益: 14638.78 平均盈利: 63.37 typeA: 35.94
趋势多且增强-7test2 总交易次数: 107 盈利: 11894.336398796815 亏损: -6426.581956572068 最大盈利: 1427.22 最大亏损: -2088.31 胜率: 69.16% 总收益: 5467.75 平均盈利: 51.10 typeA: 35.34
趋势多且增强-1-1 总交易次数: 25 盈利: 4759.472699987232 亏损: -2616.4374256536835 最大盈利: 1348.53 最大亏损: -642.41 胜率: 40.00% 总收益: 2143.04 平均盈利: 85.72 typeA: 34.29
趋势多且增强-7test1 总交易次数: 332 盈利: 30052.831125459663 亏损: -16345.39616319728 最大盈利: 1699.60 最大亏损: -1818.29 胜率: 60.84% 总收益: 13707.43 平均盈利: 41.29 typeA: 25.12
趋势多且增强-1-1-2 总交易次数: 31 盈利: 3516.0301591153875 亏损: -1386.9125301580052 最大盈利: 880.28 最大亏损: -296.01 胜率: 35.48% 总收益: 2129.12 平均盈利: 68.68 typeA: 24.37
趋势空且增强-2-3 总交易次数: 147 盈利: 12012.74233719917 亏损: -7316.898342587241 最大盈利: 1221.70 最大亏损: -706.58 胜率: 63.95% 总收益: 4695.84 平均盈利: 31.94 typeA: 20.43
趋势空且增强-2-4 总交易次数: 74 盈利: 6876.402431489951 亏损: -4682.493392103459 最大盈利: 781.91 最大亏损: -922.87 胜率: 60.81% 总收益: 2193.91 平均盈利: 29.65 typeA: 18.03
趋势空且增强-11 总交易次数: 169 盈利: 19570.051674370952 亏损: -14893.978101430237 最大盈利: 750.81 最大亏损: -939.00 胜率: 62.13% 总收益: 4676.07 平均盈利: 27.67 typeA: 17.19
趋势多且增强-1-1-8 总交易次数: 279 盈利: 34748.83782334795 亏损: -20909.001659114456 最大盈利: 12994.26 最大亏损: -1991.57 胜率: 34.05% 总收益: 13839.84 平均盈利: 49.61 typeA: 16.89
趋势空且增强-2-1 总交易次数: 402 盈利: 37692.743706649046 亏损: -27022.23085550433 最大盈利: 1969.37 最大亏损: -835.02 胜率: 54.73% 总收益: 10670.51 平均盈利: 26.54 typeA: 14.53
趋势多且增强-4-4 总交易次数: 516 盈利: 36667.09275097297 亏损: -24604.176504891468 最大盈利: 2081.23 最大亏损: -1830.26 胜率: 56.59% 总收益: 12062.92 平均盈利: 23.38 typeA: 13.23
趋势多且增强-4-5 总交易次数: 173 盈利: 10688.486976643278 亏损: -7224.428363963552 最大盈利: 866.15 最大亏损: -390.73 胜率: 64.16% 总收益: 3464.06 平均盈利: 20.02 typeA: 12.85
趋势多且增强-1-1-9 总交易次数: 30 盈利: 2868.8703863506585 亏损: -2013.6396368250055 最大盈利: 578.50 最大亏损: -426.30 胜率: 43.33% 总收益: 855.23 平均盈利: 28.51 typeA: 12.35
趋势多且增强-4-3 总交易次数: 112 盈利: 7993.743656821589 亏损: -5537.801294080691 最大盈利: 1601.48 最大亏损: -501.31 胜率: 51.79% 总收益: 2455.94 平均盈利: 21.93 typeA: 11.36
趋势多且增强-1-6 总交易次数: 86 盈利: 9905.344001811847 亏损: -7867.296875541218 最大盈利: 963.19 最大亏损: -1091.73 胜率: 40.70% 总收益: 2038.05 平均盈利: 23.70 typeA: 9.65
趋势多且增强-1-5 总交易次数: 124 盈利: 12957.513363879754 亏损: -10568.179044949991 最大盈利: 1183.30 最大亏损: -1308.10 胜率: 39.52% 总收益: 2389.33 平均盈利: 19.27 typeA: 7.62
趋势多且增强-1-1-4 总交易次数: 159 盈利: 12199.194351004668 亏损: -10199.353643224453 最大盈利: 1890.24 最大亏损: -610.81 胜率: 40.25% 总收益: 1999.84 平均盈利: 12.58 typeA: 5.06
趋势空且增强-4-6 总交易次数: 131 盈利: 13466.683029417383 亏损: -11747.449611454816 最大盈利: 2533.05 最大亏损: -727.25 胜率: 35.88% 总收益: 1719.23 平均盈利: 13.12 typeA: 4.71
趋势空且增强-4 总交易次数: 90 盈利: 7370.714797442532 亏损: -6410.8326913159935 最大盈利: 910.73 最大亏损: -383.83 胜率: 41.11% 总收益: 959.88 平均盈利: 10.67 typeA: 4.38
趋势多且增强-11 总交易次数: 203 盈利: 13931.01832761969 亏损: -12641.25124749825 最大盈利: 2143.30 最大亏损: -907.40 胜率: 51.72% 总收益: 1289.77 平均盈利: 6.35 typeA: 3.29
趋势多且增强-1-1-3 总交易次数: 73 盈利: 6193.340551516161 亏损: -5579.8282801915875 最大盈利: 1586.90 最大亏损: -585.54 胜率: 38.36% 总收益: 613.51 平均盈利: 8.40 typeA: 3.22
趋势空且增强-2-5 总交易次数: 1 盈利: 0 亏损: -212.41591943716355 最大盈利: -212.42 最大亏损: -212.42 胜率: 0.00% 总收益: -212.42 平均盈利: -212.42 typeA: 0.00
趋势空且增强-2-2 总交易次数: 198 盈利: 12552.430995356002 亏损: -15302.186107221314 最大盈利: 654.93 最大亏损: -984.91 胜率: 59.09% 总收益: -2749.76 平均盈利: -13.89 typeA: -8.21
趋势空且增强-4test 总交易次数: 17 盈利: 1613.9356930489962 亏损: -1880.15617877853 最大盈利: 523.86 最大亏损: -459.50 胜率: 58.82% 总收益: -266.22 平均盈利: -15.66 typeA: -9.21
趋势多且增强-1-4 总交易次数: 76 盈利: 7108.609239840191 亏损: -9539.23836888652 最大盈利: 535.92 最大亏损: -966.78 胜率: 42.11% 总收益: -2430.63 平均盈利: -31.98 typeA: -13.47


################################################################


######################################################################

tradeNumTotal 4015
profitTotal 169622.8773785019
maxLossTotal -2088.31
winRateTotal 2873.480000000001
period month 53
avgRate 54.22
maxDrawdownTotal 36.1
趋势多且增强-L-3-1 总交易次数: 39 盈利: 46734.311752840695 亏损: -1853.9459182721039 最大盈利: 41166.13 最大亏损: -281.54 胜率: 41.03% 总收益: 44880.37 平均盈利: 1150.78 typeA: 472.16
趋势多且增强-L-2-2 总交易次数: 11 盈利: 10463.568812160125 亏损: -731.8088541712134 最大盈利: 7106.66 最大亏损: -315.45 胜率: 45.45% 总收益: 9731.76 平均盈利: 884.71 typeA: 402.10
趋势多且增强-R-1-2-1 总交易次数: 8 盈利: 2079.6347737771307 亏损: -14.567478002513882 最大盈利: 903.48 最大亏损: -14.57 胜率: 87.50% 总收益: 2065.07 平均盈利: 258.13 typeA: 225.87
趋势多且增强-L-2-1 总交易次数: 7 盈利: 1859.604771694 亏损: -350.4566031446385 最大盈利: 766.72 最大亏损: -165.71 胜率: 57.14% 总收益: 1509.15 平均盈利: 215.59 typeA: 123.19
趋势空且增强-1-3 总交易次数: 71 盈利: 8766.093316892162 亏损: -1924.064828385387 最大盈利: 1220.97 最大亏损: -673.69 胜率: 76.06% 总收益: 6842.03 平均盈利: 96.37 typeA: 73.30
趋势空且增强-L-1-2 总交易次数: 39 盈利: 7032.488841019735 亏损: -3768.569829967331 最大盈利: 2068.45 最大亏损: -808.06 胜率: 66.67% 总收益: 3263.92 平均盈利: 83.69 typeA: 55.80
趋势多且增强-R-1-1-1 总交易次数: 39 盈利: 5290.831108692588 亏损: -2642.3740117617376 最大盈利: 1148.20 最大亏损: -711.96 胜率: 69.23% 总收益: 2648.46 平均盈利: 67.91 typeA: 47.01
趋势多且增强-R-2-2 总交易次数: 26 盈利: 2141.404376679049 亏损: -522.2550632676632 最大盈利: 369.72 最大亏损: -162.39 胜率: 73.08% 总收益: 1619.15 平均盈利: 62.27 typeA: 45.51
趋势多且增强-L-1-6 总交易次数: 60 盈利: 10355.19037605873 亏损: -5086.558935081293 最大盈利: 963.19 最大亏损: -381.66 胜率: 46.67% 总收益: 5268.63 平均盈利: 87.81 typeA: 40.98
趋势空且增强-2 总交易次数: 228 盈利: 31688.312188265423 亏损: -15979.400162124695 最大盈利: 4403.10 最大亏损: -818.35 胜率: 57.89% 总收益: 15708.91 平均盈利: 68.90 typeA: 39.89
趋势多且增强-L-3-2 总交易次数: 32 盈利: 3590.794533718919 亏损: -1313.820727792057 最大盈利: 880.28 最大亏损: -296.01 胜率: 40.63% 总收益: 2276.97 平均盈利: 71.16 typeA: 28.91
趋势空且增强-2-3 总交易次数: 43 盈利: 3432.4195698885806 亏损: -1771.629959201227 最大盈利: 1142.40 最大亏损: -375.86 胜率: 67.44% 总收益: 1660.79 平均盈利: 38.62 typeA: 26.05
趋势多且增强-4-3 总交易次数: 136 盈利: 12924.668582098015 亏损: -6063.2427148998795 最大盈利: 2591.16 最大亏损: -501.31 胜率: 50.74% 总收益: 6861.43 平均盈利: 50.45 typeA: 25.60
趋势多且增强-R-1-1-2 总交易次数: 236 盈利: 24192.82042325656 亏损: -14244.554445946786 最大盈利: 1933.32 最大亏损: -1818.29 胜率: 58.90% 总收益: 9948.27 平均盈利: 42.15 typeA: 24.83
趋势多且增强-R-3-2 总交易次数: 17 盈利: 1085.8038354650619 亏损: -442.66717463488214 最大盈利: 266.93 最大亏损: -157.60 胜率: 58.82% 总收益: 643.14 平均盈利: 37.83 typeA: 22.25
趋势多且增强-R-2-1 总交易次数: 73 盈利: 5934.387902969092 亏损: -3571.243485923923 最大盈利: 1699.60 最大亏损: -444.10 胜率: 58.90% 总收益: 2363.14 平均盈利: 32.37 typeA: 19.07
趋势空且增强-4-6 总交易次数: 130 盈利: 16426.430056135432 亏损: -10594.4777100857 最大盈利: 2533.05 最大亏损: -727.25 胜率: 38.46% 总收益: 5831.95 平均盈利: 44.86 typeA: 17.25
趋势多且增强-4-5 总交易次数: 206 盈利: 12314.41979231835 亏损: -7174.357046610934 最大盈利: 1373.52 最大亏损: -395.22 胜率: 66.99% 总收益: 5140.06 平均盈利: 24.95 typeA: 16.72
趋势多且增强-R-1-2-2 总交易次数: 65 盈利: 7194.893169650456 亏损: -5590.453759250537 最大盈利: 1427.22 最大亏损: -2088.31 胜率: 67.69% 总收益: 1604.44 平均盈利: 24.68 typeA: 16.71
趋势多且增强-L-3-8 总交易次数: 281 盈利: 32795.856947935084 亏损: -21008.78507513147 最大盈利: 9134.79 最大亏损: -1991.57 胜率: 34.16% 总收益: 11787.07 平均盈利: 41.95 typeA: 14.33
趋势空且增强-11 总交易次数: 173 盈利: 19653.87932790941 亏损: -16240.530635701953 最大盈利: 750.81 最大亏损: -939.00 胜率: 61.27% 总收益: 3413.35 平均盈利: 19.73 typeA: 12.09
趋势多且增强-11 总交易次数: 206 盈利: 24395.071443983372 亏损: -19282.029632499187 最大盈利: 2423.17 最大亏损: -907.40 胜率: 48.54% 总收益: 5113.04 平均盈利: 24.82 typeA: 12.05
趋势空且增强-3-4 总交易次数: 536 盈利: 31976.636892046754 亏损: -21306.564476398795 最大盈利: 2433.03 最大亏损: -647.04 胜率: 57.09% 总收益: 10670.07 平均盈利: 19.91 typeA: 11.36
趋势多且增强-4-4 总交易次数: 576 盈利: 38309.46322249057 亏损: -28500.74819852229 最大盈利: 2081.23 最大亏损: -1830.26 胜率: 61.11% 总收益: 9808.72 平均盈利: 17.03 typeA: 10.41
趋势多且增强-L-3-9 总交易次数: 30 盈利: 2663.784933826155 亏损: -2013.6396368250055 最大盈利: 578.50 最大亏损: -426.30 胜率: 43.33% 总收益: 650.15 平均盈利: 21.67 typeA: 9.39
趋势多且增强-R-3-1 总交易次数: 108 盈利: 6938.221229166604 亏损: -5288.091654207932 最大盈利: 1447.78 最大亏损: -837.68 胜率: 58.33% 总收益: 1650.13 平均盈利: 15.28 typeA: 8.91
趋势多且增强-L-2-5 总交易次数: 79 盈利: 7275.9985942132025 亏损: -5582.0390802460915 最大盈利: 1183.30 最大亏损: -341.13 胜率: 35.44% 总收益: 1693.96 平均盈利: 21.44 typeA: 7.60
趋势空且增强-3-3 总交易次数: 378 盈利: 19137.474925678493 亏损: -17176.329166611442 最大盈利: 836.27 最大亏损: -774.78 胜率: 59.26% 总收益: 1961.15 平均盈利: 5.19 typeA: 3.07
趋势多且增强-L-3-4 总交易次数: 182 盈利: 12678.248822054817 亏损: -11596.630879713899 最大盈利: 905.14 最大亏损: -610.81 胜率: 39.56% 总收益: 1081.62 平均盈利: 5.94 typeA: 2.35


###############################################################################


tradeNumTotal 3660
profitTotal 162929.5514844662
maxLossTotal -2061.77
winRateTotal 2985.4099999999994
period month 53
avgRate 56.33
maxDrawdownTotal 32.8
趋势多且增强-L1-3-1 总交易次数: 40 盈利: 46734.311752840695 亏损: -1859.18421181273 最大盈利: 41166.13 最大亏损: -281.54 胜率: 40.00% 总收益: 44875.13 平均盈利: 1121.88 typeA: 448.75
趋势多且增强-L1-2-2 总交易次数: 11 盈利: 10463.568812160125 亏损: -731.8088541712134 最大盈利: 7106.66 最大亏损: -315.45 胜率: 45.45% 总收益: 9731.76 平均盈利: 884.71 typeA: 402.10
趋势多且增强-L1-2-1 总交易次数: 7 盈利: 1859.604771694 亏损: -350.4566031446385 最大盈利: 766.72 最大亏损: -165.71 胜率: 57.14% 总收益: 1509.15 平均盈利: 215.59 typeA: 123.19
趋势多且增强-L1-1-6 总交易次数: 56 盈利: 17036.94718852432 亏损: -4842.990263642759 最大盈利: 8558.15 最大亏损: -381.66 胜率: 46.43% 总收益: 12193.96 平均盈利: 217.75 typeA: 101.10
趋势空且增强-L2-1-3 总交易次数: 68 盈利: 8718.160334688237 亏损: -1529.8398031870045 最大盈利: 1220.97 最大亏损: -673.69 胜率: 77.94% 总收益: 7188.32 平均盈利: 105.71 typeA: 82.39
趋势多且增强-R-2-2 总交易次数: 26 盈利: 2141.404376679049 亏损: -522.2550632676632 最大盈利: 369.72 最大亏损: -162.39 胜率: 73.08% 总收益: 1619.15 平均盈利: 62.27 typeA: 45.51
趋势多且增强-R-1-1-1 总交易次数: 37 盈利: 4842.114794767353 亏损: -2563.0091203399047 最大盈利: 1148.20 最大亏损: -711.96 胜率: 70.27% 总收益: 2279.11 平均盈利: 61.60 typeA: 43.28
趋势空且增强-L1-1-2 总交易次数: 37 盈利: 6171.886933348584 亏损: -3768.569829967331 最大盈利: 2068.45 最大亏损: -808.06 胜率: 64.86% 总收益: 2403.32 平均盈利: 64.95 typeA: 42.13
趋势空且增强-2 总交易次数: 204 盈利: 30474.691664170303 亏损: -16339.645202314798 最大盈利: 4403.10 最大亏损: -818.35 胜率: 53.92% 总收益: 14135.05 平均盈利: 69.29 typeA: 37.36
趋势空且增强-L2-2-3 总交易次数: 42 盈利: 3969.3079347707303 亏损: -1717.2953279040744 最大盈利: 1142.40 最大亏损: -375.86 胜率: 69.05% 总收益: 2252.01 平均盈利: 53.62 typeA: 37.02
趋势多且增强-L1-3-9 总交易次数: 34 盈利: 4504.662928826276 亏损: -2376.1925635612447 最大盈利: 1115.35 最大亏损: -426.30 胜率: 47.06% 总收益: 2128.47 平均盈利: 62.60 typeA: 29.46
趋势多且增强-L1-3-2 总交易次数: 32 盈利: 3590.794533718919 亏损: -1313.820727792057 最大盈利: 880.28 最大亏损: -296.01 胜率: 40.63% 总收益: 2276.97 平均盈利: 71.16 typeA: 28.91
趋势多且增强-L3-1-3 总交易次数: 133 盈利: 12748.244735457449 亏损: -6379.577262327933 最大盈利: 2591.16 最大亏损: -695.46 胜率: 50.38% 总收益: 6368.67 平均盈利: 47.88 typeA: 24.12
趋势多且增强-L3-1-4-1 总交易次数: 198 盈利: 21122.163376752545 亏损: -14013.64490372997 最大盈利: 1855.48 最大亏损: -1830.26 胜率: 63.13% 总收益: 7108.52 平均盈利: 35.90 typeA: 22.66
趋势多且增强-R-3-2 总交易次数: 17 盈利: 1085.8038354650619 亏损: -442.66717463488214 最大盈利: 266.93 最大亏损: -157.60 胜率: 58.82% 总收益: 643.14 平均盈利: 37.83 typeA: 22.25
趋势空且增强-11 总交易次数: 164 盈利: 19259.91998717781 亏损: -13767.80045244885 最大盈利: 750.81 最大亏损: -897.70 胜率: 62.80% 总收益: 5492.12 平均盈利: 33.49 typeA: 21.03
趋势多且增强-R-2-1 总交易次数: 73 盈利: 5934.387902969092 亏损: -3571.243485923923 最大盈利: 1699.60 最大亏损: -444.10 胜率: 58.90% 总收益: 2363.14 平均盈利: 32.37 typeA: 19.07
趋势多且增强-11 总交易次数: 211 盈利: 26668.566299347636 亏损: -18759.202629305317 最大盈利: 2423.17 最大亏损: -907.40 胜率: 50.71% 总收益: 7909.36 平均盈利: 37.49 typeA: 19.01
趋势多且增强-L3-1-5 总交易次数: 203 盈利: 12219.253871431454 亏损: -7100.633028324683 最大盈利: 1373.52 最大亏损: -395.22 胜率: 67.00% 总收益: 5118.62 平均盈利: 25.21 typeA: 16.89
趋势空且增强-L3-1-6 总交易次数: 127 盈利: 16133.641899806447 亏损: -10681.185829152897 最大盈利: 2533.05 最大亏损: -727.25 胜率: 37.80% 总收益: 5452.46 平均盈利: 42.93 typeA: 16.23
趋势多且增强-R-1-2-2 总交易次数: 59 盈利: 4850.272918087848 亏损: -3496.552045928097 最大盈利: 1403.49 最大亏损: -879.35 胜率: 67.80% 总收益: 1353.72 平均盈利: 22.94 typeA: 15.56
趋势多且增强-R-1-1-2 总交易次数: 235 盈利: 23246.9654464987 亏损: -16834.305407373617 最大盈利: 1933.32 最大亏损: -2061.77 胜率: 56.60% 总收益: 6412.66 平均盈利: 27.29 typeA: 15.44
趋势空且增强-L2-3-4 总交易次数: 529 盈利: 31972.380351989614 亏损: -22072.74528942542 最大盈利: 2433.03 最大亏损: -647.04 胜率: 57.28% 总收益: 9899.64 平均盈利: 18.71 typeA: 10.72
趋势多且增强-R-3-1 总交易次数: 108 盈利: 6938.221229166604 亏损: -5288.091654207932 最大盈利: 1447.78 最大亏损: -837.68 胜率: 58.33% 总收益: 1650.13 平均盈利: 15.28 typeA: 8.91
趋势多且增强-L1-2-5 总交易次数: 80 盈利: 7473.877834924026 亏损: -5742.841312810793 最大盈利: 1183.30 最大亏损: -341.13 胜率: 36.25% 总收益: 1731.04 平均盈利: 21.64 typeA: 7.84
趋势多且增强-L3-1-4-3 总交易次数: 372 盈利: 16756.409808171757 亏损: -13474.74257122807 最大盈利: 2081.23 最大亏损: -521.42 胜率: 60.48% 总收益: 3281.67 平均盈利: 8.82 typeA: 5.34
趋势空且增强-L2-3-3 总交易次数: 373 盈利: 19199.188290987404 亏损: -17322.235068714126 最大盈利: 836.27 最大亏损: -774.78 胜率: 59.25% 总收益: 1876.95 平均盈利: 5.03 typeA: 2.98
趋势多且增强-L1-3-4 总交易次数: 184 盈利: 12959.77251926955 亏损: -11922.439162583438 最大盈利: 905.14 最大亏损: -610.81 胜率: 39.67% 总收益: 1037.33 平均盈利: 5.64 typeA: 2.24

#############################################################################

tradeNumTotal 3660
profitTotal 162929.5514844662
maxLossTotal -2061.77
winRateTotal 2985.4099999999994
period month 53
avgRate 56.33
maxDrawdownTotal 32.8
趋势空且增强-L2-1-3 总交易次数: 68 盈利: 8718.160334688237 亏损: -1529.8398031870045 最大盈利: 1220.97 最大亏损: -673.69 胜率: 77.94% 总收益: 7188.32 平均盈利: 105.71 typeA: 82.39
趋势多且增强-R-2-2 总交易次数: 26 盈利: 2141.404376679049 亏损: -522.2550632676632 最大盈利: 369.72 最大亏损: -162.39 胜率: 73.08% 总收益: 1619.15 平均盈利: 62.27 typeA: 45.51
趋势多且增强-R-1-1-1 总交易次数: 37 盈利: 4842.114794767353 亏损: -2563.0091203399047 最大盈利: 1148.20 最大亏损: -711.96 胜率: 70.27% 总收益: 2279.11 平均盈利: 61.60 typeA: 43.28
趋势空且增强-L2-2-3 总交易次数: 42 盈利: 3969.3079347707303 亏损: -1717.2953279040744 最大盈利: 1142.40 最大亏损: -375.86 胜率: 69.05% 总收益: 2252.01 平均盈利: 53.62 typeA: 37.02
趋势多且增强-R-1-2-2 总交易次数: 59 盈利: 4850.272918087848 亏损: -3496.552045928097 最大盈利: 1403.49 最大亏损: -879.35 胜率: 67.80% 总收益: 1353.72 平均盈利: 22.94 typeA: 15.56
趋势多且增强-L3-1-5 总交易次数: 203 盈利: 12219.253871431454 亏损: -7100.633028324683 最大盈利: 1373.52 最大亏损: -395.22 胜率: 67.00% 总收益: 5118.62 平均盈利: 25.21 typeA: 16.89
趋势空且增强-L1-1-2 总交易次数: 37 盈利: 6171.886933348584 亏损: -3768.569829967331 最大盈利: 2068.45 最大亏损: -808.06 胜率: 64.86% 总收益: 2403.32 平均盈利: 64.95 typeA: 42.13
趋势多且增强-L3-1-4-1 总交易次数: 198 盈利: 21122.163376752545 亏损: -14013.64490372997 最大盈利: 1855.48 最大亏损: -1830.26 胜率: 63.13% 总收益: 7108.52 平均盈利: 35.90 typeA: 22.66
趋势空且增强-11 总交易次数: 164 盈利: 19259.91998717781 亏损: -13767.80045244885 最大盈利: 750.81 最大亏损: -897.70 胜率: 62.80% 总收益: 5492.12 平均盈利: 33.49 typeA: 21.03
趋势多且增强-L3-1-4-3 总交易次数: 372 盈利: 16756.409808171757 亏损: -13474.74257122807 最大盈利: 2081.23 最大亏损: -521.42 胜率: 60.48% 总收益: 3281.67 平均盈利: 8.82 typeA: 5.34
趋势空且增强-L2-3-3 总交易次数: 373 盈利: 19199.188290987404 亏损: -17322.235068714126 最大盈利: 836.27 最大亏损: -774.78 胜率: 59.25% 总收益: 1876.95 平均盈利: 5.03 typeA: 2.98
趋势多且增强-R-2-1 总交易次数: 73 盈利: 5934.387902969092 亏损: -3571.243485923923 最大盈利: 1699.60 最大亏损: -444.10 胜率: 58.90% 总收益: 2363.14 平均盈利: 32.37 typeA: 19.07
趋势多且增强-R-3-2 总交易次数: 17 盈利: 1085.8038354650619 亏损: -442.66717463488214 最大盈利: 266.93 最大亏损: -157.60 胜率: 58.82% 总收益: 643.14 平均盈利: 37.83 typeA: 22.25
趋势多且增强-R-3-1 总交易次数: 108 盈利: 6938.221229166604 亏损: -5288.091654207932 最大盈利: 1447.78 最大亏损: -837.68 胜率: 58.33% 总收益: 1650.13 平均盈利: 15.28 typeA: 8.91
趋势空且增强-L2-3-4 总交易次数: 333 盈利: 18160.345671961277 亏损: -14508.467355075654 最大盈利: 1020.85 最大亏损: -647.04 胜率: 57.66% 总收益: 3651.88 平均盈利: 10.97 typeA: 6.32
趋势多且增强-L1-2-1 总交易次数: 7 盈利: 1859.604771694 亏损: -350.4566031446385 最大盈利: 766.72 最大亏损: -165.71 胜率: 57.14% 总收益: 1509.15 平均盈利: 215.59 typeA: 123.19
趋势空且增强-L2-3-5 总交易次数: 196 盈利: 13812.034680028319 亏损: -7564.277934349762 最大盈利: 2433.03 最大亏损: -633.58 胜率: 56.63% 总收益: 6247.76 平均盈利: 31.88 typeA: 18.05
趋势多且增强-R-1-1-2 总交易次数: 235 盈利: 23246.9654464987 亏损: -16834.305407373617 最大盈利: 1933.32 最大亏损: -2061.77 胜率: 56.60% 总收益: 6412.66 平均盈利: 27.29 typeA: 15.44
趋势空且增强-2 总交易次数: 204 盈利: 30474.691664170303 亏损: -16339.645202314798 最大盈利: 4403.10 最大亏损: -818.35 胜率: 53.92% 总收益: 14135.05 平均盈利: 69.29 typeA: 37.36
趋势多且增强-11 总交易次数: 211 盈利: 26668.566299347636 亏损: -18759.202629305317 最大盈利: 2423.17 最大亏损: -907.40 胜率: 50.71% 总收益: 7909.36 平均盈利: 37.49 typeA: 19.01
趋势多且增强-L3-1-3 总交易次数: 133 盈利: 12748.244735457449 亏损: -6379.577262327933 最大盈利: 2591.16 最大亏损: -695.46 胜率: 50.38% 总收益: 6368.67 平均盈利: 47.88 typeA: 24.12
趋势多且增强-L1-3-9 总交易次数: 34 盈利: 4504.662928826276 亏损: -2376.1925635612447 最大盈利: 1115.35 最大亏损: -426.30 胜率: 47.06% 总收益: 2128.47 平均盈利: 62.60 typeA: 29.46
趋势多且增强-L1-1-6 总交易次数: 56 盈利: 17036.94718852432 亏损: -4842.990263642759 最大盈利: 8558.15 最大亏损: -381.66 胜率: 46.43% 总收益: 12193.96 平均盈利: 217.75 typeA: 101.10
趋势多且增强-L1-2-2 总交易次数: 11 盈利: 10463.568812160125 亏损: -731.8088541712134 最大盈利: 7106.66 最大亏损: -315.45 胜率: 45.45% 总收益: 9731.76 平均盈利: 884.71 typeA: 402.10
趋势多且增强-L1-3-2 总交易次数: 32 盈利: 3590.794533718919 亏损: -1313.820727792057 最大盈利: 880.28 最大亏损: -296.01 胜率: 40.63% 总收益: 2276.97 平均盈利: 71.16 typeA: 28.91
趋势多且增强-L1-3-1 总交易次数: 40 盈利: 46734.311752840695 亏损: -1859.18421181273 最大盈利: 41166.13 最大亏损: -281.54 胜率: 40.00% 总收益: 44875.13 平均盈利: 1121.88 typeA: 448.75
趋势多且增强-L1-3-4 总交易次数: 184 盈利: 12959.77251926955 亏损: -11922.439162583438 最大盈利: 905.14 最大亏损: -610.81 胜率: 39.67% 总收益: 1037.33 平均盈利: 5.64 typeA: 2.24
趋势空且增强-L3-1-6 总交易次数: 127 盈利: 16133.641899806447 亏损: -10681.185829152897 最大盈利: 2533.05 最大亏损: -727.25 胜率: 37.80% 总收益: 5452.46 平均盈利: 42.93 typeA: 16.23
趋势多且增强-L1-2-5 总交易次数: 80 盈利: 7473.877834924026 亏损: -5742.841312810793 最大盈利: 1183.30 最大亏损: -341.13 胜率: 36.25% 总收益: 1731.04 平均盈利: 21.64 typeA: 7.84

#####################################################################

tradeNumTotal 3755
profitTotal 172619.89907913224
maxLossTotal -2061.77
winRateTotal 2983.93
period month 53
avgRate 56.30
maxDrawdownTotal 34.5
趋势空且增强-L2-1-3 总交易次数: 68 盈利: 9124.174455835286 亏损: -1529.8398031870045 最大盈利: 1220.97 最大亏损: -673.69 总收益: 7594.33 平均盈利: 111.68 typeA: 87.04 胜率: 77.94%
趋势多且增强-R-1-1-1 总交易次数: 34 盈利: 4907.429210512164 亏损: -1682.5991224617235 最大盈利: 1148.20 最大亏损: -694.30 总收益: 3224.83 平均盈利: 94.85 typeA: 66.95 胜率: 70.59%
趋势空且增强-L2-2-3 总交易次数: 42 盈利: 3918.190387922348 亏损: -1717.2953279040744 最大盈利: 1142.40 最大亏损: -375.86 总收益: 2200.90 平均盈利: 52.40 typeA: 36.18 胜率: 69.05%
趋势多且增强-L3-1-5 总交易次数: 203 盈利: 12219.253871431454 亏损: -7128.534423673521 最大盈利: 1373.52 最大亏损: -395.22 总收益: 5090.72 平均盈利: 25.08 typeA: 16.80 胜率: 67.00%
趋势多且增强-R-2-2 总交易次数: 23 盈利: 2065.323624484191 亏损: -767.6799062384537 最大盈利: 369.72 最大亏损: -277.05 总收益: 1297.64 平均盈利: 56.42 typeA: 36.80 胜率: 65.22%
趋势空且增强-L1-1-2 总交易次数: 37 盈利: 6171.886933348584 亏损: -3768.569829967331 最大盈利: 2068.45 最大亏损: -808.06 总收益: 2403.32 平均盈利: 64.95 typeA: 42.13 胜率: 64.86%
趋势空且增强-11 总交易次数: 164 盈利: 19324.35083210607 亏损: -13737.03923781807 最大盈利: 892.06 最大亏损: -897.70 总收益: 5587.31 平均盈利: 34.07 typeA: 21.60 胜率: 63.41%
趋势多且增强-L3-1-4-1 总交易次数: 198 盈利: 21122.163376752545 亏损: -12879.562782224652 最大盈利: 1855.48 最大亏损: -1830.26 总收益: 8242.60 平均盈利: 41.63 typeA: 26.28 胜率: 63.13%
趋势多且增强-R-1-2-2 总交易次数: 72 盈利: 7413.508445869265 亏损: -4792.24720589423 最大盈利: 1403.49 最大亏损: -830.33 总收益: 2621.26 平均盈利: 36.41 typeA: 22.25 胜率: 61.11%
趋势多且增强-L3-1-4-3 总交易次数: 372 盈利: 16756.409808171757 亏损: -13372.66561676283 最大盈利: 2081.23 最大亏损: -521.42 总收益: 3383.74 平均盈利: 9.10 typeA: 5.50 胜率: 60.48%
趋势空且增强-L2-3-3 总交易次数: 377 盈利: 21820.686421375674 亏损: -17367.95965887806 最大盈利: 1862.45 最大亏损: -774.78 总收益: 4452.73 平均盈利: 11.81 typeA: 7.02 胜率: 59.42%
趋势多且增强-R-2-1 总交易次数: 88 盈利: 7429.779535403549 亏损: -4996.536565567239 最大盈利: 1699.60 最大亏损: -912.30 总收益: 2433.24 平均盈利: 27.65 typeA: 16.34 胜率: 59.09%
趋势多且增强-R-3-1 总交易次数: 136 盈利: 8368.29203923189 亏损: -6946.908067631695 最大盈利: 1253.97 最大亏损: -837.68 总收益: 1421.38 平均盈利: 10.45 typeA: 6.15 胜率: 58.82%
趋势空且增强-L2-3-4 总交易次数: 337 盈利: 17910.99056872444 亏损: -14555.695014088586 最大盈利: 1020.85 最大亏损: -647.04 总收益: 3355.30 平均盈利: 9.96 typeA: 5.76 胜率: 57.86%
趋势多且增强-L1-2-1 总交易次数: 7 盈利: 1859.604771694 亏损: -350.4566031446385 最大盈利: 766.72 最大亏损: -165.71 总收益: 1509.15 平均盈利: 215.59 typeA: 123.19 胜率: 57.14%
趋势空且增强-L2-3-5 总交易次数: 197 盈利: 12705.027995188673 亏损: -7564.277934349762 最大盈利: 1298.29 最大亏损: -633.58 总收益: 5140.75 平均盈利: 26.10 typeA: 14.84 胜率: 56.85%
趋势多且增强-R-1-1-2 总交易次数: 261 盈利: 31856.349556815832 亏损: -20717.266333926524 最大盈利: 2358.53 最大亏损: -2061.77 总收益: 11139.08 平均盈利: 42.68 typeA: 24.20 胜率: 56.70%
趋势空且增强-2 总交易次数: 204 盈利: 31055.52115507377 亏损: -16339.645202314798 最大盈利: 4403.10 最大亏损: -818.35 总收益: 14715.88 平均盈利: 72.14 typeA: 38.90 胜率: 53.92%
趋势多且增强-R-3-2 总交易次数: 27 盈利: 1440.7887485268834 亏损: -566.2214381222441 最大盈利: 266.93 最大亏损: -157.60 总收益: 874.57 平均盈利: 32.39 typeA: 16.79 胜率: 51.85%
趋势多且增强-11 总交易次数: 211 盈利: 26618.557065026747 亏损: -18759.202629305317 最大盈利: 2423.17 最大亏损: -907.40 总收益: 7859.35 平均盈利: 37.25 typeA: 18.89 胜率: 50.71%
趋势多且增强-L3-1-3 总交易次数: 133 盈利: 12748.244735457449 亏损: -6374.742812669993 最大盈利: 2591.16 最大亏损: -695.46 总收益: 6373.50 平均盈利: 47.92 typeA: 24.14 胜率: 50.38%
趋势多且增强-L1-3-9 总交易次数: 34 盈利: 4504.662928826276 亏损: -2576.536609655994 最大盈利: 1115.35 最大亏损: -462.86 总收益: 1928.13 平均盈利: 56.71 typeA: 26.69 胜率: 47.06%
趋势多且增强-L1-1-6 总交易次数: 56 盈利: 17036.94718852432 亏损: -4842.990263642759 最大盈利: 8558.15 最大亏损: -381.66 总收益: 12193.96 平均盈利: 217.75 typeA: 101.10 胜率: 46.43%
趋势多且增强-L1-2-2 总交易次数: 11 盈利: 10463.568812160125 亏损: -731.8088541712134 最大盈利: 7106.66 最大亏损: -315.45 总收益: 9731.76 平均盈利: 884.71 typeA: 402.10 胜率: 45.45%
趋势多且增强-L1-3-2 总交易次数: 32 盈利: 3590.794533718919 亏损: -1313.820727792057 最大盈利: 880.28 最大亏损: -296.01 总收益: 2276.97 平均盈利: 71.16 typeA: 28.91 胜率: 40.63%
趋势多且增强-L1-3-1 总交易次数: 40 盈利: 46734.311752840695 亏损: -1859.18421181273 最大盈利: 41166.13 最大亏损: -281.54 总收益: 44875.13 平均盈利: 1121.88 typeA: 448.75 胜率: 40.00%
趋势多且增强-L1-3-4 总交易次数: 184 盈利: 12959.77251926955 亏损: -12002.37660279198 最大盈利: 905.14 最大亏损: -610.81 总收益: 957.40 平均盈利: 5.20 typeA: 2.06 胜率: 39.67%
趋势空且增强-L3-1-6 总交易次数: 127 盈利: 16239.119897877028 亏损: -10681.185829152897 最大盈利: 2533.05 最大亏损: -727.25 总收益: 5557.93 平均盈利: 43.76 typeA: 16.54 胜率: 37.80%
趋势多且增强-L1-2-5 总交易次数: 80 盈利: 7473.877834924026 亏损: -5742.841312810793 最大盈利: 1183.30 最大亏损: -341.13 总收益: 1731.04 平均盈利: 21.64 typeA: 7.84 胜率: 36.25%

######################################################################

tradeNumTotal 3834
profitTotal 174011.75651851852
maxLossTotal -2080.1
winRateTotal 2994.88
period month 53
avgRate 56.51
maxDrawdownTotal 40.9
趋势空且增强-L2-1-3 总交易次数: 69 盈利: 9050.148669468577 亏损: -1785.9458151066906 最大盈利: 1220.97 最大亏损: -673.69 总收益: 7264.20 平均盈利: 105.28 typeA: 80.86 胜率: 76.81%
趋势多且增强-R-1-1-1 总交易次数: 30 盈利: 4300.2708395469745 亏损: -1583.2039562437558 最大盈利: 1148.20 最大亏损: -694.30 总收益: 2717.07 平均盈利: 90.57 typeA: 63.40 胜率: 70.00%
趋势空且增强-L2-2-3 总交易次数: 42 盈利: 3918.190387922348 亏损: -1717.2953279040744 最大盈利: 1142.40 最大亏损: -375.86 总收益: 2200.90 平均盈利: 52.40 typeA: 36.18 胜率: 69.05%
趋势多且增强-L3-1-5 总交易次数: 203 盈利: 12219.253871431454 亏损: -7036.84727640932 最大盈利: 1373.52 最大亏损: -395.22 总收益: 5182.41 平均盈利: 25.53 typeA: 17.10 胜率: 67.00%
趋势空且增强-11 总交易次数: 164 盈利: 19754.859529036265 亏损: -12970.552219074863 最大盈利: 892.06 最大亏损: -897.70 总收益: 6784.31 平均盈利: 41.37 typeA: 26.99 胜率: 65.24%
趋势空且增强-L1-1-2 总交易次数: 37 盈利: 6171.886933348584 亏损: -3768.569829967331 最大盈利: 2068.45 最大亏损: -808.06 总收益: 2403.32 平均盈利: 64.95 typeA: 42.13 胜率: 64.86%
趋势多且增强-L3-1-4-1 总交易次数: 198 盈利: 21122.163376752545 亏损: -12879.562782224652 最大盈利: 1855.48 最大亏损: -1830.26 总收益: 8242.60 平均盈利: 41.63 typeA: 26.28 胜率: 63.13%
趋势多且增强-L3-1-4-3 总交易次数: 372 盈利: 16756.409808171757 亏损: -13610.040930215519 最大盈利: 2081.23 最大亏损: -704.59 总收益: 3146.37 平均盈利: 8.46 typeA: 5.12 胜率: 60.48%
趋势多且增强-R-3-1 总交易次数: 165 盈利: 11909.441531073393 亏损: -8150.451713045528 最大盈利: 1253.97 最大亏损: -837.68 总收益: 3758.99 平均盈利: 22.78 typeA: 13.53 胜率: 59.39%
趋势空且增强-L2-3-3 总交易次数: 382 盈利: 22041.63889096286 亏损: -17543.54316744506 最大盈利: 1862.45 最大亏损: -774.78 总收益: 4498.10 平均盈利: 11.78 typeA: 6.97 胜率: 59.16%
趋势空且增强-L2-3-4 总交易次数: 340 盈利: 17987.286421559755 亏损: -14555.695014088586 最大盈利: 1020.85 最大亏损: -647.04 总收益: 3431.59 平均盈利: 10.09 typeA: 5.88 胜率: 58.24%
趋势多且增强-R-1-1-2 总交易次数: 288 盈利: 33791.64473491562 亏损: -24773.009084950685 最大盈利: 2358.53 最大亏损: -2080.10 总收益: 9018.64 平均盈利: 31.31 typeA: 18.16 胜率: 57.99%
趋势多且增强-R-1-2-2 总交易次数: 75 盈利: 9521.59701676472 亏损: -5576.884689171755 最大盈利: 1403.49 最大亏损: -830.33 总收益: 3944.71 平均盈利: 52.60 typeA: 30.15 胜率: 57.33%
趋势多且增强-R-2-1 总交易次数: 98 盈利: 8595.801104474654 亏损: -6235.348256472766 最大盈利: 1699.60 最大亏损: -912.30 总收益: 2360.45 平均盈利: 24.09 typeA: 13.76 胜率: 57.14%
趋势多且增强-R-3-2 总交易次数: 35 盈利: 2755.6306314025724 亏损: -1253.0387730625812 最大盈利: 1074.40 最大亏损: -363.03 总收益: 1502.59 平均盈利: 42.93 typeA: 24.53 胜率: 57.14%
趋势多且增强-L1-2-1 总交易次数: 7 盈利: 1859.604771694 亏损: -350.4566031446385 最大盈利: 766.72 最大亏损: -165.71 总收益: 1509.15 平均盈利: 215.59 typeA: 123.19 胜率: 57.14%
趋势空且增强-L2-3-5 总交易次数: 198 盈利: 12770.116620469942 亏损: -7770.251614217748 最大盈利: 1298.29 最大亏损: -633.58 总收益: 4999.87 平均盈利: 25.25 typeA: 14.28 胜率: 56.57%
趋势空且增强-2 总交易次数: 204 盈利: 30995.41790359483 亏损: -16339.645202314798 最大盈利: 4403.10 最大亏损: -818.35 总收益: 14655.77 平均盈利: 71.84 typeA: 38.74 胜率: 53.92%
趋势多且增强-11 总交易次数: 211 盈利: 26650.38521924276 亏损: -18645.035591641707 最大盈利: 2423.17 最大亏损: -907.40 总收益: 8005.35 平均盈利: 37.94 typeA: 19.42 胜率: 51.18%
趋势多且增强-L3-1-3 总交易次数: 132 盈利: 12748.244735457449 亏损: -6736.723419578412 最大盈利: 2591.16 最大亏损: -747.58 总收益: 6011.52 平均盈利: 45.54 typeA: 23.12 胜率: 50.76%
趋势多且增强-R-2-2 总交易次数: 20 盈利: 1610.993942329978 亏损: -1278.0235222031129 最大盈利: 369.72 最大亏损: -329.80 总收益: 332.97 平均盈利: 16.65 typeA: 8.32 胜率: 50.00%
趋势多且增强-L1-3-9 总交易次数: 34 盈利: 4504.662928826276 亏损: -2576.536609655994 最大盈利: 1115.35 最大亏损: -462.86 总收益: 1928.13 平均盈利: 56.71 typeA: 26.69 胜率: 47.06%
趋势多且增强-L1-1-6 总交易次数: 56 盈利: 17036.94718852432 亏损: -4842.990263642759 最大盈利: 8558.15 最大亏损: -381.66 总收益: 12193.96 平均盈利: 217.75 typeA: 101.10 胜率: 46.43%
趋势多且增强-L1-2-2 总交易次数: 11 盈利: 10463.568812160125 亏损: -731.8088541712134 最大盈利: 7106.66 最大亏损: -315.45 总收益: 9731.76 平均盈利: 884.71 typeA: 402.10 胜率: 45.45%
趋势多且增强-L1-3-2 总交易次数: 32 盈利: 3590.794533718919 亏损: -1313.820727792057 最大盈利: 880.28 最大亏损: -296.01 总收益: 2276.97 平均盈利: 71.16 typeA: 28.91 胜率: 40.63%
趋势多且增强-L1-3-1 总交易次数: 40 盈利: 46734.311752840695 亏损: -1859.18421181273 最大盈利: 41166.13 最大亏损: -281.54 总收益: 44875.13 平均盈利: 1121.88 typeA: 448.75 胜率: 40.00%
趋势多且增强-L1-3-4 总交易次数: 184 盈利: 12959.77251926955 亏损: -11600.473442176552 最大盈利: 905.14 最大亏损: -610.81 总收益: 1359.30 平均盈利: 7.39 typeA: 2.93 胜率: 39.67%
趋势空且增强-L3-1-6 总交易次数: 127 盈利: 16156.391976583234 亏损: -10499.777757404016 最大盈利: 2533.05 最大亏损: -727.25 总收益: 5656.61 平均盈利: 44.54 typeA: 17.18 胜率: 38.58%
趋势多且增强-L1-2-5 总交易次数: 80 盈利: 7473.877834924026 亏损: -5742.841312810793 最大盈利: 1183.30 最大亏损: -341.13 总收益: 1731.04 平均盈利: 21.64 typeA: 7.84 胜率: 36.25%

############################################################

tradeNumTotal 3778
profitTotal 170886.6177107092
maxLossTotal -1955.45
winRateTotal 3008.8299999999995
period month 53
avgRate 56.77
maxDrawdownTotal 38.5
趋势空且增强-L2-1-3 总交易次数: 68 盈利: 8934.703693110976 亏损: -1529.8398031870045 最大盈利: 1220.97 最大亏损: -673.69 总收益: 7404.86 平均盈利: 108.90 typeA: 84.87 胜率: 77.94%
趋势多且增强-R-2-2 总交易次数: 23 盈利: 1831.5583805862184 亏损: -605.6407534113362 最大盈利: 369.72 最大亏损: -277.05 总收益: 1225.92 平均盈利: 53.30 typeA: 37.08 胜率: 69.57%
趋势空且增强-L2-2-3 总交易次数: 42 盈利: 3735.2414608497375 亏损: -1717.2953279040744 最大盈利: 1142.40 最大亏损: -375.86 总收益: 2017.95 平均盈利: 48.05 typeA: 33.18 胜率: 69.05%
趋势多且增强-R-1-1-1 总交易次数: 34 盈利: 4471.551837261043 亏损: -1923.0130631975912 最大盈利: 1148.20 最大亏损: -694.30 总收益: 2548.54 平均盈利: 74.96 typeA: 50.71 胜率: 67.65%
趋势多且增强-L3-1-5 总交易次数: 203 盈利: 12219.253871431454 亏损: -7074.968158794047 最大盈利: 1373.52 最大亏损: -395.22 总收益: 5144.29 平均盈利: 25.34 typeA: 16.98 胜率: 67.00%
趋势多且增强-R-3-1 总交易次数: 138 盈利: 8144.735698512918 亏损: -5982.606475947894 最大盈利: 1253.97 最大亏损: -732.80 总收益: 2162.13 平均盈利: 15.67 typeA: 10.22 胜率: 65.22%
趋势空且增强-L1-1-2 总交易次数: 37 盈利: 6171.886933348584 亏损: -3768.569829967331 最大盈利: 2068.45 最大亏损: -808.06 总收益: 2403.32 平均盈利: 64.95 typeA: 42.13 胜率: 64.86%
趋势空且增强-11 总交易次数: 164 盈利: 18386.86128853576 亏损: -13536.301458363241 最大盈利: 892.06 最大亏损: -897.70 总收益: 4850.56 平均盈利: 29.58 typeA: 18.93 胜率: 64.02%
趋势多且增强-L3-1-4-1 总交易次数: 198 盈利: 21122.163376752545 亏损: -13205.793108520238 最大盈利: 1855.48 最大亏损: -1830.26 总收益: 7916.37 平均盈利: 39.98 typeA: 25.24 胜率: 63.13%
趋势多且增强-R-2-1 总交易次数: 90 盈利: 6868.631552065839 亏损: -4696.435774538009 最大盈利: 1699.60 最大亏损: -912.30 总收益: 2172.20 平均盈利: 24.14 typeA: 14.75 胜率: 61.11%
趋势多且增强-L3-1-4-3 总交易次数: 372 盈利: 16756.409808171757 亏损: -13343.307979406016 最大盈利: 2081.23 最大亏损: -508.18 总收益: 3413.10 平均盈利: 9.18 typeA: 5.55 胜率: 60.48%
趋势空且增强-L2-3-3 总交易次数: 379 盈利: 22206.574582336925 亏损: -17367.95965887806 最大盈利: 1862.45 最大亏损: -774.78 总收益: 4838.61 平均盈利: 12.77 typeA: 7.61 胜率: 59.63%
趋势多且增强-R-1-1-2 总交易次数: 265 盈利: 29204.238230893032 亏损: -17663.896473316232 最大盈利: 2358.53 最大亏损: -1955.45 总收益: 11540.34 平均盈利: 43.55 typeA: 25.64 胜率: 58.87%
趋势多且增强-R-1-2-2 总交易次数: 77 盈利: 7461.405630940764 亏损: -5302.987644565079 最大盈利: 1403.49 最大亏损: -830.33 总收益: 2158.42 平均盈利: 28.03 typeA: 16.38 胜率: 58.44%
趋势空且增强-L2-3-4 总交易次数: 342 盈利: 17864.224418259037 亏损: -14564.521179114226 最大盈利: 1020.85 最大亏损: -647.04 总收益: 3299.70 平均盈利: 9.65 typeA: 5.56 胜率: 57.60%
趋势多且增强-R-3-2 总交易次数: 28 盈利: 1378.8865202429658 亏损: -453.9793487391378 最大盈利: 266.93 最大亏损: -132.34 总收益: 924.91 平均盈利: 33.03 typeA: 18.87 胜率: 57.14%
趋势多且增强-L1-2-1 总交易次数: 7 盈利: 1859.604771694 亏损: -350.4566031446385 最大盈利: 766.72 最大亏损: -165.71 总收益: 1509.15 平均盈利: 215.59 typeA: 123.19 胜率: 57.14%

################################################################################

tradeNumTotal 5665
profitTotal 143499.01763233176
maxLossTotal -2457.54
winRateTotal 3248.75
period month 53
avgRate 61.30
maxDrawdownTotal 51.4
趋势空且增强-L2-1-3 总交易次数: 70 盈利: 7553.191315381429 亏损: -1785.9458151066906 最大盈利: 982.63 最大亏损: -673.69 总收益: 5767.25 平均盈利: 82.39 typeA: 63.56 胜率: 77.14%
趋势多且增强-R-1-1-1 总交易次数: 29 盈利: 4761.419452379669 亏损: -1142.0218368984006 最大盈利: 1148.20 最大亏损: -694.30 总收益: 3619.40 平均盈利: 124.81 typeA: 94.68 胜率: 75.86%
趋势空且增强-L2-2-3 总交易次数: 43 盈利: 2846.1253279999673 亏损: -1288.5871463682722 最大盈利: 257.45 最大亏损: -375.86 总收益: 1557.54 平均盈利: 36.22 typeA: 26.96 胜率: 74.42%
趋势多且增强-R-4-1 总交易次数: 1895 盈利: 117761.3116688078 亏损: -129370.53262994623 最大盈利: 3002.38 最大亏损: -2457.54 总收益: -11609.22 平均盈利: -6.13 typeA: -4.36 胜率: 71.13%
趋势多且增强-L3-1-5 总交易次数: 203 盈利: 12219.253871431454 亏损: -7128.534423673521 最大盈利: 1373.52 最大亏损: -395.22 总收益: 5090.72 平均盈利: 25.08 typeA: 16.80 胜率: 67.00%
趋势空且增强-L1-1-2 总交易次数: 37 盈利: 4892.425464849273 亏损: -3768.569829967331 最大盈利: 788.99 最大亏损: -808.06 总收益: 1123.86 平均盈利: 30.37 typeA: 19.70 胜率: 64.86%
趋势空且增强-L2-3-5 总交易次数: 204 盈利: 10849.797318839419 亏损: -5911.22812700946 最大盈利: 1298.29 最大亏损: -633.58 总收益: 4938.57 平均盈利: 24.21 typeA: 15.67 胜率: 64.71%
趋势多且增强-R-1-2-2 总交易次数: 68 盈利: 7413.508445869265 亏损: -3798.8911099852135 最大盈利: 1403.49 最大亏损: -830.33 总收益: 3614.62 平均盈利: 53.16 typeA: 34.40 胜率: 64.71%
趋势多且增强-L3-1-4-1 总交易次数: 194 盈利: 21002.851752505354 亏损: -12569.759376971086 最大盈利: 1855.48 最大亏损: -1830.26 总收益: 8433.09 平均盈利: 43.47 typeA: 27.79 胜率: 63.92%
趋势多且增强-R-2-1 总交易次数: 73 盈利: 6614.884666707928 亏损: -3834.074020386682 最大盈利: 1699.60 最大亏损: -912.30 总收益: 2780.81 平均盈利: 38.09 typeA: 24.00 胜率: 63.01%
趋势空且增强-L2-3-4 总交易次数: 369 盈利: 19100.584958345295 亏损: -14256.962821869038 最大盈利: 1147.99 最大亏损: -647.04 总收益: 4843.62 平均盈利: 13.13 typeA: 8.18 胜率: 62.33%
趋势多且增强-R-2-2 总交易次数: 21 盈利: 1904.545628984098 亏损: -767.6799062384537 最大盈利: 369.72 最大亏损: -277.05 总收益: 1136.87 平均盈利: 54.14 typeA: 33.51 胜率: 61.90%
趋势多且增强-R-3-1 总交易次数: 118 盈利: 7541.897800373762 亏损: -5726.232444978998 最大盈利: 1253.97 最大亏损: -837.68 总收益: 1815.67 平均盈利: 15.39 typeA: 9.39 胜率: 61.02%
趋势多且增强-L3-1-4-3 总交易次数: 372 盈利: 16756.409808171757 亏损: -13372.66561676283 最大盈利: 2081.23 最大亏损: -521.42 总收益: 3383.74 平均盈利: 9.10 typeA: 5.50 胜率: 60.48%
趋势空且增强-L2-3-3 总交易次数: 420 盈利: 23108.562221694832 亏损: -17203.396092131014 最大盈利: 1862.45 最大亏损: -774.78 总收益: 5905.17 平均盈利: 14.06 typeA: 8.47 胜率: 60.24%
趋势空且增强-2 总交易次数: 234 盈利: 27798.391031264844 亏损: -16866.75241144892 最大盈利: 3130.79 最大亏损: -818.35 总收益: 10931.64 平均盈利: 46.72 typeA: 27.95 胜率: 59.83%
趋势多且增强-L1-2-1 总交易次数: 7 盈利: 1859.604771694 亏损: -350.4566031446385 最大盈利: 766.72 最大亏损: -165.71 总收益: 1509.15 平均盈利: 215.59 typeA: 123.19 胜率: 57.14%
趋势多且增强-R-1-1-2 总交易次数: 209 盈利: 25784.07337683327 亏损: -15778.317274225275 最大盈利: 2358.53 最大亏损: -2061.77 总收益: 10005.76 平均盈利: 47.87 typeA: 27.26 胜率: 56.94%
趋势空且增强-11 总交易次数: 178 盈利: 15383.353503451073 亏损: -12650.957639038652 最大盈利: 892.06 最大亏损: -939.00 总收益: 2732.40 平均盈利: 15.35 typeA: 7.85 胜率: 51.12%
趋势多且增强-11 总交易次数: 206 盈利: 26460.140149270883 亏损: -18157.34349265181 最大盈利: 2423.17 最大亏损: -907.40 总收益: 8302.80 平均盈利: 40.30 typeA: 20.54 胜率: 50.97%
趋势多且增强-L3-1-3 总交易次数: 130 盈利: 12481.540620828733 亏损: -6065.682744062607 最大盈利: 2591.16 最大亏损: -695.46 总收益: 6415.86 平均盈利: 49.35 typeA: 25.06 胜率: 50.77%
趋势多且增强-R-3-2 总交易次数: 25 盈利: 1134.1265950611878 亏损: -566.2214381222441 最大盈利: 242.90 最大亏损: -157.60 总收益: 567.91 平均盈利: 22.72 typeA: 10.90 胜率: 48.00%
趋势空且增强-L3-1-6 总交易次数: 127 盈利: 9263.99397195235 亏损: -9330.78709590138 最大盈利: 1197.14 最大亏损: -969.94 总收益: -66.79 平均盈利: -0.53 typeA: -0.25 胜率: 47.24%
趋势多且增强-L1-3-9 总交易次数: 34 盈利: 4504.662928826276 亏损: -2576.536609655994 最大盈利: 1115.35 最大亏损: -462.86 总收益: 1928.13 平均盈利: 56.71 typeA: 26.69 胜率: 47.06%
趋势多且增强-L1-2-2 总交易次数: 11 盈利: 10463.568812160125 亏损: -731.8088541712134 最大盈利: 7106.66 最大亏损: -315.45 总收益: 9731.76 平均盈利: 884.71 typeA: 402.10 胜率: 45.45%
趋势多且增强-L1-1-6 总交易次数: 54 盈利: 15921.104275320831 亏损: -5480.307846028045 最大盈利: 8558.15 最大亏损: -637.32 总收益: 10440.80 平均盈利: 193.35 typeA: 82.35 胜率: 42.59%
趋势多且增强-L1-3-1 总交易次数: 39 盈利: 46734.311752840695 亏损: -1853.9459182721039 最大盈利: 41166.13 最大亏损: -281.54 总收益: 44880.37 平均盈利: 1150.78 typeA: 472.16 胜率: 41.03%
趋势多且增强-L1-3-2 总交易次数: 32 盈利: 3590.794533718919 亏损: -1313.820727792057 最大盈利: 880.28 最大亏损: -296.01 总收益: 2276.97 平均盈利: 71.16 typeA: 28.91 胜率: 40.63%
趋势多且增强-L1-3-4 总交易次数: 184 盈利: 12959.77251926955 亏损: -12002.37660279198 最大盈利: 905.14 最大亏损: -610.81 总收益: 957.40 平均盈利: 5.20 typeA: 2.06 胜率: 39.67%
趋势多且增强-L1-2-5 总交易次数: 79 盈利: 7473.877834924026 亏损: -5612.672291826063 最大盈利: 1183.30 最大亏损: -341.13 总收益: 1861.21 平均盈利: 23.56 typeA: 8.65 胜率: 36.71%


################################################################


tradeNumTotal 6043
profitTotal 149783.3079150441
maxLossTotal -2457.54
winRateTotal 3293.01
period month 53
avgRate 62.13
maxDrawdownTotal 59.8
趋势多且增强-R-1-1-1 总交易次数: 29 盈利: 4761.419452379669 亏损: -1142.0218368984006 最大盈利: 1148.20 最大亏损: -694.30 总收益: 3619.40 平均盈利: 124.81 typeA: 94.68 胜率: 75.86%
趋势空且增强-L2-1-3 总交易次数: 66 盈利: 6927.056923294431 亏损: -1785.9458151066906 最大盈利: 982.63 最大亏损: -673.69 总收益: 5141.11 平均盈利: 77.90 typeA: 59.01 胜率: 75.76%
趋势空且增强-L2-2-3 总交易次数: 43 盈利: 3328.0419089856355 亏损: -1288.5871463682722 最大盈利: 367.86 最大亏损: -375.86 总收益: 2039.45 平均盈利: 47.43 typeA: 35.30 胜率: 74.42%
趋势空且增强-R-4-1 总交易次数: 619 盈利: 41518.77133766797 亏损: -31890.465642156076 最大盈利: 1412.64 最大亏损: -957.24 总收益: 9628.31 平均盈利: 15.55 typeA: 11.53 胜率: 74.15%
趋势多且增强-R-4-2 总交易次数: 1775 盈利: 104934.36667181735 亏损: -113700.08665554508 最大盈利: 3002.38 最大亏损: -2457.54 总收益: -8765.72 平均盈利: -4.94 typeA: -3.57 胜率: 72.39%
趋势空且增强-L1-1-2 总交易次数: 37 盈利: 4892.425464849273 亏损: -3768.569829967331 最大盈利: 788.99 最大亏损: -808.06 总收益: 1123.86 平均盈利: 30.37 typeA: 19.70 胜率: 64.86%
趋势多且增强-R-1-2-2 总交易次数: 68 盈利: 7413.508445869265 亏损: -3835.1157476663725 最大盈利: 1403.49 最大亏损: -830.33 总收益: 3578.39 平均盈利: 52.62 typeA: 34.05 胜率: 64.71%
趋势多且增强-L3-1-5 总交易次数: 202 盈利: 11292.128009415974 亏损: -7039.780854847265 最大盈利: 1373.52 最大亏损: -395.22 总收益: 4252.35 平均盈利: 21.05 typeA: 13.55 胜率: 64.36%
趋势空且增强-L2-3-5 总交易次数: 193 盈利: 9957.665808136813 亏损: -6345.7628774706955 最大盈利: 1298.29 最大亏损: -633.58 总收益: 3611.90 平均盈利: 18.71 typeA: 11.73 胜率: 62.69%
趋势多且增强-L3-1-4-1 总交易次数: 192 盈利: 20539.642237183205 亏损: -12163.719617942495 最大盈利: 1855.48 最大亏损: -1830.26 总收益: 8375.92 平均盈利: 43.62 typeA: 27.27 胜率: 62.50%
趋势多且增强-R-2-1 总交易次数: 74 盈利: 6510.356168361264 亏损: -4012.6844753522773 最大盈利: 1699.60 最大亏损: -912.30 总收益: 2497.67 平均盈利: 33.75 typeA: 20.98 胜率: 62.16%
趋势多且增强-R-2-2 总交易次数: 21 盈利: 1904.545628984098 亏损: -767.6799062384537 最大盈利: 369.72 最大亏损: -277.05 总收益: 1136.87 平均盈利: 54.14 typeA: 33.51 胜率: 61.90%
趋势空且增强-L2-3-4 总交易次数: 344 盈利: 18900.460170950548 亏损: -13661.426312081001 最大盈利: 1383.76 最大亏损: -647.04 总收益: 5239.03 平均盈利: 15.23 typeA: 9.25 胜率: 60.76%
趋势多且增强-R-3-1 总交易次数: 119 盈利: 7541.897800373762 亏损: -6056.633904833013 最大盈利: 1253.97 最大亏损: -837.68 总收益: 1485.26 平均盈利: 12.48 typeA: 7.55 胜率: 60.50%
趋势多且增强-L3-1-4-3 总交易次数: 372 盈利: 16756.409808171757 亏损: -13423.439795749402 最大盈利: 2081.23 最大亏损: -521.42 总收益: 3332.97 平均盈利: 8.96 typeA: 5.42 胜率: 60.48%
趋势空且增强-2 总交易次数: 188 盈利: 17828.750116474937 亏损: -12955.200745720038 最大盈利: 3130.79 最大亏损: -818.35 总收益: 4873.55 平均盈利: 25.92 typeA: 15.44 胜率: 59.57%
趋势空且增强-L2-3-3 总交易次数: 401 盈利: 23954.786833630875 亏损: -16668.829670482748 最大盈利: 2588.25 最大亏损: -774.78 总收益: 7285.96 平均盈利: 18.17 typeA: 10.74 胜率: 59.10%
趋势多且增强-L1-2-1 总交易次数: 7 盈利: 1859.604771694 亏损: -350.4566031446385 最大盈利: 766.72 最大亏损: -165.71 总收益: 1509.15 平均盈利: 215.59 typeA: 123.19 胜率: 57.14%
趋势多且增强-R-1-1-2 总交易次数: 213 盈利: 27130.648202051896 亏损: -15918.267322166035 最大盈利: 2358.53 最大亏损: -2061.77 总收益: 11212.38 平均盈利: 52.64 typeA: 29.90 胜率: 56.81%
趋势空且增强-11 总交易次数: 158 盈利: 13802.241726352127 亏损: -10385.902928492456 最大盈利: 892.06 最大亏损: -897.70 总收益: 3416.34 平均盈利: 21.62 typeA: 11.49 胜率: 53.16%
趋势多且增强-11 总交易次数: 207 盈利: 26525.55465603317 亏损: -17598.358938286732 最大盈利: 2423.17 最大亏损: -907.40 总收益: 8927.20 平均盈利: 43.13 typeA: 22.09 胜率: 51.21%
趋势多且增强-L3-1-3 总交易次数: 130 盈利: 12481.540620828733 亏损: -6065.682744062607 最大盈利: 2591.16 最大亏损: -695.46 总收益: 6415.86 平均盈利: 49.35 typeA: 25.06 胜率: 50.77%
趋势空且增强-L3-1-6 总交易次数: 127 盈利: 9749.358489073265 亏损: -10390.846552634237 最大盈利: 1197.14 最大亏损: -969.94 总收益: -641.49 平均盈利: -5.05 typeA: -2.43 胜率: 48.03%
趋势多且增强-R-3-2 总交易次数: 25 盈利: 1134.1265950611878 亏损: -566.2214381222441 最大盈利: 242.90 最大亏损: -157.60 总收益: 567.91 平均盈利: 22.72 typeA: 10.90 胜率: 48.00%
趋势多且增强-L1-2-2 总交易次数: 11 盈利: 10463.568812160125 亏损: -731.8088541712134 最大盈利: 7106.66 最大亏损: -315.45 总收益: 9731.76 平均盈利: 884.71 typeA: 402.10 胜率: 45.45%
趋势多且增强-L1-1-6 总交易次数: 54 盈利: 15856.89478979737 亏损: -4727.771382910262 最大盈利: 8558.15 最大亏损: -381.66 总收益: 11129.12 平均盈利: 206.09 typeA: 91.59 胜率: 44.44%
趋势多且增强-L1-3-9 总交易次数: 34 盈利: 3926.1676745224204 亏损: -2623.519763398422 最大盈利: 1115.35 最大亏损: -462.86 总收益: 1302.65 平均盈利: 38.31 typeA: 16.90 胜率: 44.12%
趋势多且增强-L1-3-1 总交易次数: 39 盈利: 46734.311752840695 亏损: -1853.9459182721039 最大盈利: 41166.13 最大亏损: -281.54 总收益: 44880.37 平均盈利: 1150.78 typeA: 472.16 胜率: 41.03%
趋势多且增强-L1-3-2 总交易次数: 32 盈利: 3590.794533718919 亏损: -1313.820727792057 最大盈利: 880.28 最大亏损: -296.01 总收益: 2276.97 平均盈利: 71.16 typeA: 28.91 胜率: 40.63%
趋势多且增强-L1-3-4 总交易次数: 184 盈利: 13018.82235668411 亏损: -12127.073361461236 最大盈利: 912.94 最大亏损: -610.81 总收益: 891.75 平均盈利: 4.85 typeA: 1.92 胜率: 39.67%
趋势多且增强-L1-2-5 总交易次数: 79 盈利: 7473.877834924026 亏损: -5632.810317904724 最大盈利: 1183.30 最大亏损: -341.13 总收益: 1841.07 平均盈利: 23.30 typeA: 8.56 胜率: 36.71%


###########################################################


tradeNumTotal 3901
profitTotal 173396.87468350198
maxLossTotal -2061.77
winRateTotal 2992.9200000000005
period month 53
avgRate 56.47
maxDrawdownTotal 34.5
趋势空且增强-L2-1-3 总交易次数: 67 盈利: 9076.716191995756 亏损: -1529.8398031870045 最大盈利: 1220.97 最大亏损: -673.69 总收益: 7546.88 平均盈利: 112.64 typeA: 87.42 胜率: 77.61%
趋势多且增强-R-1-1-1 总交易次数: 34 盈利: 4907.429210512164 亏损: -1682.5991224617235 最大盈利: 1148.20 最大亏损: -694.30 总收益: 3224.83 平均盈利: 94.85 typeA: 66.95 胜率: 70.59%
趋势空且增强-L2-2-3 总交易次数: 37 盈利: 3841.5974671037648 亏损: -1707.3428063229749 最大盈利: 1142.40 最大亏损: -375.86 总收益: 2134.25 平均盈利: 57.68 typeA: 38.98 胜率: 67.57%
趋势多且增强-L3-1-5 总交易次数: 203 盈利: 12092.009654797055 亏损: -7128.534423673521 最大盈利: 1373.52 最大亏损: -395.22 总收益: 4963.48 平均盈利: 24.45 typeA: 16.38 胜率: 67.00%
趋势多且增强-R-2-2 总交易次数: 23 盈利: 2065.323624484191 亏损: -767.6799062384537 最大盈利: 369.72 最大亏损: -277.05 总收益: 1297.64 平均盈利: 56.42 typeA: 36.80 胜率: 65.22%
趋势空且增强-L1-1-2 总交易次数: 37 盈利: 6171.886933348584 亏损: -3768.569829967331 最大盈利: 2068.45 最大亏损: -808.06 总收益: 2403.32 平均盈利: 64.95 typeA: 42.13 胜率: 64.86%
趋势空且增强-11 总交易次数: 162 盈利: 19445.478498454362 亏损: -13192.231385022344 最大盈利: 892.06 最大亏损: -897.70 总收益: 6253.25 平均盈利: 38.60 typeA: 25.02 胜率: 64.81%
趋势多且增强-L3-1-4-1 总交易次数: 199 盈利: 20565.89067675627 亏损: -12879.562782224652 最大盈利: 1855.48 最大亏损: -1830.26 总收益: 7686.33 平均盈利: 38.62 typeA: 24.46 胜率: 63.32%
趋势空且增强-L-4-2-3 总交易次数: 152 盈利: 6195.090813764246 亏损: -5159.136609023309 最大盈利: 568.78 最大亏损: -590.13 总收益: 1035.95 平均盈利: 6.82 typeA: 4.17 胜率: 61.18%
趋势多且增强-R-1-2-2 总交易次数: 72 盈利: 7413.508445869265 亏损: -4792.24720589423 最大盈利: 1403.49 最大亏损: -830.33 总收益: 2621.26 平均盈利: 36.41 typeA: 22.25 胜率: 61.11%
趋势多且增强-L3-1-4-3 总交易次数: 373 盈利: 16353.38823423628 亏损: -13385.562619487626 最大盈利: 2081.23 最大亏损: -521.42 总收益: 2967.83 平均盈利: 7.96 typeA: 4.80 胜率: 60.32%
趋势空且增强-L2-3-3 总交易次数: 375 盈利: 21748.29293198653 亏损: -17451.27231641494 最大盈利: 1862.45 最大亏损: -774.78 总收益: 4297.02 平均盈利: 11.46 typeA: 6.84 胜率: 59.73%
趋势多且增强-R-2-1 总交易次数: 88 盈利: 7429.779535403549 亏损: -4996.536565567239 最大盈利: 1699.60 最大亏损: -912.30 总收益: 2433.24 平均盈利: 27.65 typeA: 16.34 胜率: 59.09%
趋势多且增强-R-3-1 总交易次数: 136 盈利: 8368.29203923189 亏损: -6946.908067631695 最大盈利: 1253.97 最大亏损: -837.68 总收益: 1421.38 平均盈利: 10.45 typeA: 6.15 胜率: 58.82%
趋势空且增强-L2-3-4 总交易次数: 334 盈利: 17889.041751263583 亏损: -14630.898062021874 最大盈利: 1020.85 最大亏损: -647.04 总收益: 3258.14 平均盈利: 9.75 typeA: 5.64 胜率: 57.78%
趋势空且增强-L2-3-5 总交易次数: 196 盈利: 12705.027995188673 亏损: -7838.376420824306 最大盈利: 1298.29 最大亏损: -633.58 总收益: 4866.65 平均盈利: 24.83 typeA: 14.19 胜率: 57.14%
趋势多且增强-L1-2-1 总交易次数: 7 盈利: 1859.604771694 亏损: -350.4566031446385 最大盈利: 766.72 最大亏损: -165.71 总收益: 1509.15 平均盈利: 215.59 typeA: 123.19 胜率: 57.14%
趋势多且增强-R-1-1-2 总交易次数: 261 盈利: 31856.349556815832 亏损: -20717.266333926524 最大盈利: 2358.53 最大亏损: -2061.77 总收益: 11139.08 平均盈利: 42.68 typeA: 24.20 胜率: 56.70%
趋势空且增强-2 总交易次数: 200 盈利: 30892.008822511783 亏损: -16213.758213292116 最大盈利: 4403.10 最大亏损: -818.35 总收益: 14678.25 平均盈利: 73.39 typeA: 40.00 胜率: 54.50%
趋势多且增强-R-3-2 总交易次数: 27 盈利: 1440.7887485268834 亏损: -566.2214381222441 最大盈利: 266.93 最大亏损: -157.60 总收益: 874.57 平均盈利: 32.39 typeA: 16.79 胜率: 51.85%
趋势多且增强-L3-1-3 总交易次数: 133 盈利: 12858.911398938828 亏损: -6374.742812669993 最大盈利: 2591.16 最大亏损: -695.46 总收益: 6484.17 平均盈利: 48.75 typeA: 24.56 胜率: 50.38%
趋势多且增强-11 总交易次数: 212 盈利: 26407.899679590453 亏损: -17300.4204439692 最大盈利: 2423.17 最大亏损: -907.40 总收益: 9107.48 平均盈利: 42.96 typeA: 21.08 胜率: 49.06%
趋势多且增强-L1-3-9 总交易次数: 34 盈利: 4504.662928826276 亏损: -2576.536609655994 最大盈利: 1115.35 最大亏损: -462.86 总收益: 1928.13 平均盈利: 56.71 typeA: 26.69 胜率: 47.06%
趋势多且增强-L1-1-6 总交易次数: 56 盈利: 17036.94718852432 亏损: -4842.990263642759 最大盈利: 8558.15 最大亏损: -381.66 总收益: 12193.96 平均盈利: 217.75 typeA: 101.10 胜率: 46.43%
趋势多且增强-L1-2-2 总交易次数: 11 盈利: 10463.568812160125 亏损: -731.8088541712134 最大盈利: 7106.66 最大亏损: -315.45 总收益: 9731.76 平均盈利: 884.71 typeA: 402.10 胜率: 45.45%
趋势多且增强-L1-3-4 总交易次数: 190 盈利: 13272.260748972361 亏损: -11868.150711910703 最大盈利: 905.14 最大亏损: -610.81 总收益: 1404.11 平均盈利: 7.39 typeA: 3.11 胜率: 42.11%
趋势多且增强-L1-3-2 总交易次数: 32 盈利: 3452.6893903046007 亏损: -1313.820727792057 最大盈利: 880.28 最大亏损: -296.01 总收益: 2138.87 平均盈利: 66.84 typeA: 27.16 胜率: 40.63%
趋势多且增强-L1-3-1 总交易次数: 41 盈利: 46747.01393121207 亏损: -2341.8041698191405 最大盈利: 41166.13 最大亏损: -482.62 总收益: 44405.21 平均盈利: 1083.05 typeA: 422.61 胜率: 39.02%
趋势空且增强-L3-1-6 总交易次数: 127 盈利: 16412.917819586226 亏损: -10920.347641760676 最大盈利: 2533.05 最大亏损: -727.25 总收益: 5492.57 平均盈利: 43.25 typeA: 16.01 胜率: 37.01%
趋势多且增强-L1-2-5 总交易次数: 82 盈利: 7496.068981625502 亏损: -5751.949350342932 最大盈利: 1183.30 最大亏损: -341.13 总收益: 1744.12 平均盈利: 21.27 typeA: 7.26 胜率: 34.15%

#############################################################################


tradeNumTotal 3942
profitTotal 169896.4625283887
maxLossTotal -1830.26
winRateTotal 3032.220000000002
period month 53
avgRate 57.21
maxDrawdownTotal 31
趋势空且增强-L2-1-3 总交易次数: 69 盈利: 9110.352549079766 亏损: -1529.8398031870045 最大盈利: 1220.97 最大亏损: -673.69 总收益: 7580.51 平均盈利: 109.86 typeA: 85.98 胜率: 78.26%
趋势多且增强-R-2-2 总交易次数: 23 盈利: 1863.6922008930114 亏损: -605.6407534113362 最大盈利: 369.72 最大亏损: -277.05 总收益: 1258.05 平均盈利: 54.70 typeA: 38.05 胜率: 69.57%
趋势多且增强-R-1-1-1 总交易次数: 34 盈利: 3697.8613784211357 亏损: -1202.1936169414757 最大盈利: 740.00 最大亏损: -306.76 总收益: 2495.67 平均盈利: 73.40 typeA: 49.66 胜率: 67.65%
趋势空且增强-L2-2-3 总交易次数: 37 盈利: 3658.6485400311544 亏损: -1707.3428063229749 最大盈利: 1142.40 最大亏损: -375.86 总收益: 1951.31 平均盈利: 52.74 typeA: 35.64 胜率: 67.57%
趋势多且增强-L3-1-5 总交易次数: 203 盈利: 12092.009654797055 亏损: -7264.687361848929 最大盈利: 1373.52 最大亏损: -395.22 总收益: 4827.32 平均盈利: 23.78 typeA: 15.93 胜率: 67.00%
趋势空且增强-11 总交易次数: 164 盈利: 17842.19952307535 亏损: -12197.062480346065 最大盈利: 750.81 最大亏损: -897.70 总收益: 5645.14 平均盈利: 34.42 typeA: 22.67 胜率: 65.85%
趋势多且增强-R-3-2 总交易次数: 29 盈利: 1265.0238847744145 亏损: -341.1947765410041 最大盈利: 266.93 最大亏损: -132.34 总收益: 923.83 平均盈利: 31.86 typeA: 20.87 胜率: 65.52%
趋势多且增强-R-3-1 总交易次数: 138 盈利: 7511.248874854834 亏损: -5649.284828011537 最大盈利: 1253.97 最大亏损: -732.80 总收益: 1861.96 平均盈利: 13.49 typeA: 8.80 胜率: 65.22%
趋势空且增强-L1-1-2 总交易次数: 37 盈利: 6171.886933348584 亏损: -3768.569829967331 最大盈利: 2068.45 最大亏损: -808.06 总收益: 2403.32 平均盈利: 64.95 typeA: 42.13 胜率: 64.86%
趋势多且增强-R-1-2-2 总交易次数: 81 盈利: 6978.357135032484 亏损: -4447.048885122961 最大盈利: 1403.49 最大亏损: -830.33 总收益: 2531.31 平均盈利: 31.25 typeA: 20.06 胜率: 64.20%
趋势多且增强-L3-1-4-1 总交易次数: 199 盈利: 20565.89067675627 亏损: -13053.559713898312 最大盈利: 1855.48 最大亏损: -1830.26 总收益: 7512.33 平均盈利: 37.75 typeA: 23.90 胜率: 63.32%
趋势多且增强-R-1-1-2 总交易次数: 269 盈利: 28604.90540025022 亏损: -16393.030690001364 最大盈利: 2358.53 最大亏损: -1197.29 总收益: 12211.87 平均盈利: 45.40 typeA: 27.85 胜率: 61.34%
趋势空且增强-L-4-2-3 总交易次数: 152 盈利: 5988.917977604469 亏损: -5159.136609023309 最大盈利: 491.90 最大亏损: -590.13 总收益: 829.78 平均盈利: 5.46 typeA: 3.34 胜率: 61.18%
趋势多且增强-L3-1-4-3 总交易次数: 373 盈利: 16324.602423175804 亏损: -13179.722799988516 最大盈利: 2081.23 最大亏损: -508.18 总收益: 3144.88 平均盈利: 8.43 typeA: 5.06 胜率: 60.05%
趋势空且增强-L2-3-3 总交易次数: 378 盈利: 21975.502392819275 亏损: -17517.854193009476 最大盈利: 1862.45 最大亏损: -774.78 总收益: 4457.65 平均盈利: 11.79 typeA: 7.05 胜率: 59.79%
趋势多且增强-R-2-1 总交易次数: 91 盈利: 6297.082321821887 亏损: -4182.062421833551 最大盈利: 1699.60 最大亏损: -463.83 总收益: 2115.02 平均盈利: 23.24 typeA: 13.79 胜率: 59.34%
趋势空且增强-L2-3-4 总交易次数: 340 盈利: 17137.442714218545 亏损: -14639.724227047514 最大盈利: 1020.85 最大亏损: -647.04 总收益: 2497.72 平均盈利: 7.35 typeA: 4.24 胜率: 57.65%
趋势空且增强-L2-3-5 总交易次数: 197 盈利: 13534.191536790833 亏损: -7860.120599523915 最大盈利: 1298.29 最大亏损: -633.58 总收益: 5674.07 平均盈利: 28.80 typeA: 16.52 胜率: 57.36%
趋势多且增强-L1-2-1 总交易次数: 7 盈利: 1859.604771694 亏损: -350.4566031446385 最大盈利: 766.72 最大亏损: -165.71 总收益: 1509.15 平均盈利: 215.59 typeA: 123.19 胜率: 57.14%
趋势空且增强-2 总交易次数: 202 盈利: 28385.88522744279 亏损: -16213.758213292116 最大盈利: 3889.49 最大亏损: -818.35 总收益: 12172.13 平均盈利: 60.26 typeA: 33.11 胜率: 54.95%
趋势多且增强-L3-1-3 总交易次数: 133 盈利: 12858.911398938828 亏损: -6720.092620809396 最大盈利: 2591.16 最大亏损: -785.09 总收益: 6138.82 平均盈利: 46.16 typeA: 23.25 胜率: 50.38%
趋势多且增强-11 总交易次数: 212 盈利: 26588.702295981377 亏损: -17259.465728605086 最大盈利: 2423.17 最大亏损: -907.40 总收益: 9329.24 平均盈利: 44.01 typeA: 21.59 胜率: 49.06%
趋势多且增强-L1-3-9 总交易次数: 34 盈利: 4504.662928826276 亏损: -2320.5058798224477 最大盈利: 1115.35 最大亏损: -426.30 总收益: 2184.16 平均盈利: 64.24 typeA: 30.23 胜率: 47.06%
趋势多且增强-L1-1-6 总交易次数: 56 盈利: 17036.94718852432 亏损: -4842.990263642759 最大盈利: 8558.15 最大亏损: -381.66 总收益: 12193.96 平均盈利: 217.75 typeA: 101.10 胜率: 46.43%
趋势多且增强-L1-2-2 总交易次数: 11 盈利: 10463.568812160125 亏损: -731.8088541712134 最大盈利: 7106.66 最大亏损: -315.45 总收益: 9731.76 平均盈利: 884.71 typeA: 402.10 胜率: 45.45%
趋势多且增强-L1-3-4 总交易次数: 191 盈利: 13578.926185368991 亏损: -12291.457308847343 最大盈利: 905.14 最大亏损: -610.81 总收益: 1287.47 平均盈利: 6.74 typeA: 2.82 胜率: 41.88%
趋势多且增强-L1-3-2 总交易次数: 32 盈利: 3452.6893903046007 亏损: -1313.820727792057 最大盈利: 880.28 最大亏损: -296.01 总收益: 2138.87 平均盈利: 66.84 typeA: 27.16 胜率: 40.63%
趋势多且增强-L1-3-1 总交易次数: 41 盈利: 46747.01393121207 亏损: -2479.182604967049 最大盈利: 41166.13 最大亏损: -482.62 总收益: 44267.83 平均盈利: 1079.70 typeA: 421.30 胜率: 39.02%
趋势空且增强-L3-1-6 总交易次数: 127 盈利: 16011.768936195958 亏损: -10810.539086167695 最大盈利: 2533.05 最大亏损: -727.25 总收益: 5201.23 平均盈利: 40.95 typeA: 15.48 胜率: 37.80%
趋势多且增强-L1-2-5 总交易次数: 82 盈利: 7496.068981625502 亏损: -5751.949350342932 最大盈利: 1183.30 最大亏损: -341.13 总收益: 1744.12 平均盈利: 21.27 typeA: 7.26 胜率: 34.15%

#####################################################################


tradeNumTotal 3811
profitTotal 79700.18170643883
maxLossTotal -915.13
winRateTotal 3087.159999999999
period month 53
avgRate 58.25
maxDrawdownTotal 14.9
趋势多且增强-L1-2-1 总交易次数: 2 盈利: 495.59575625959405 亏损: 0 最大盈利: 358.99 最大亏损: 136.60 总收益: 495.60 平均盈利: 247.80 typeA: 247.80 胜率: 100.00%
趋势空且增强-L1-1-2 总交易次数: 15 盈利: 2112.7303195442 亏损: -19.519604240282373 最大盈利: 1034.22 最大亏损: -19.52 总收益: 2093.21 平均盈利: 139.55 typeA: 130.24 胜率: 93.33%
趋势空且增强-L2-1-3 总交易次数: 69 盈利: 4579.461695562502 亏损: -762.0187421181175 最大盈利: 610.49 最大亏损: -336.84 总收益: 3817.44 平均盈利: 55.33 typeA: 44.10 胜率: 79.71%
趋势空且增强-L2-2-3 总交易次数: 37 盈利: 1850.4964455253682 亏损: -785.733546277339 最大盈利: 571.20 最大亏损: -187.93 总收益: 1064.76 平均盈利: 28.78 typeA: 21.78 胜率: 75.68%
趋势多且增强-R-2-2 总交易次数: 23 盈利: 931.8461004465057 亏损: -302.8203767056681 最大盈利: 184.86 最大亏损: -138.53 总收益: 629.03 平均盈利: 27.35 typeA: 19.03 胜率: 69.57%
趋势多且增强-R-1-1-1 总交易次数: 34 盈利: 1848.9306892105678 亏损: -601.0968084707379 最大盈利: 370.00 最大亏损: -153.38 总收益: 1247.83 平均盈利: 36.70 typeA: 24.83 胜率: 67.65%
趋势多且增强-L3-1-5 总交易次数: 213 盈利: 6596.443829922632 亏损: -3775.048866136727 最大盈利: 686.76 最大亏损: -197.61 总收益: 2821.39 平均盈利: 13.25 typeA: 8.83 胜率: 66.67%
趋势空且增强-11 总交易次数: 164 盈利: 8921.099761537675 亏损: -6080.096261676207 最大盈利: 375.41 最大亏损: -448.85 总收益: 2841.00 平均盈利: 17.32 typeA: 11.41 胜率: 65.85%
趋势多且增强-R-3-2 总交易次数: 29 盈利: 632.5119423872072 亏损: -170.59738827050205 最大盈利: 133.46 最大亏损: -66.17 总收益: 461.91 平均盈利: 15.93 typeA: 10.44 胜率: 65.52%
趋势多且增强-R-3-1 总交易次数: 138 盈利: 3755.624437427417 亏损: -2824.6424140057684 最大盈利: 626.99 最大亏损: -366.40 总收益: 930.98 平均盈利: 6.75 typeA: 4.40 胜率: 65.22%
趋势多且增强-R-1-2-2 总交易次数: 81 盈利: 3489.178567516242 亏损: -2223.5244425614806 最大盈利: 701.75 最大亏损: -415.17 总收益: 1265.65 平均盈利: 15.63 typeA: 10.03 胜率: 64.20%
趋势多且增强-L3-1-4-1 总交易次数: 202 盈利: 10050.111131579333 亏损: -6821.149680781886 最大盈利: 927.74 最大亏损: -915.13 总收益: 3228.96 平均盈利: 15.98 typeA: 9.97 胜率: 62.38%
趋势空且增强-L-4-2-3 总交易次数: 151 盈利: 3011.3708799197134 亏损: -2492.174620442866 最大盈利: 245.95 最大亏损: -295.06 总收益: 519.20 平均盈利: 3.44 typeA: 2.14 胜率: 62.25%
趋势多且增强-L3-1-4-3 总交易次数: 406 盈利: 10092.659696009738 亏损: -7218.675474906265 最大盈利: 1040.62 最大亏损: -276.78 总收益: 2873.98 平均盈利: 7.08 typeA: 4.36 胜率: 61.58%
趋势多且增强-R-1-1-2 总交易次数: 269 盈利: 14302.45270012511 亏损: -8196.515345000682 最大盈利: 1179.26 最大亏损: -598.64 总收益: 6105.94 平均盈利: 22.70 typeA: 13.92 胜率: 61.34%
趋势空且增强-L2-3-3 总交易次数: 376 盈利: 11205.939318250472 亏损: -8701.537755614061 最大盈利: 931.23 最大亏损: -387.39 总收益: 2504.40 平均盈利: 6.66 typeA: 4.04 胜率: 60.64%
趋势多且增强-R-2-1 总交易次数: 91 盈利: 3148.5411609109433 亏损: -2091.0312109167753 最大盈利: 849.80 最大亏损: -231.91 总收益: 1057.51 平均盈利: 11.62 typeA: 6.90 胜率: 59.34%
趋势空且增强-L2-3-4 总交易次数: 340 盈利: 8580.885182629454 亏损: -7260.063661301895 最大盈利: 510.43 最大亏损: -323.52 总收益: 1320.82 平均盈利: 3.88 typeA: 2.25 胜率: 57.94%
趋势空且增强-L2-3-5 总交易次数: 197 盈利: 6780.150245753265 亏损: -3883.0265299092284 最大盈利: 649.15 最大亏损: -316.79 总收益: 2897.12 平均盈利: 14.71 typeA: 8.44 胜率: 57.36%
趋势多且增强-L1-2-2 总交易次数: 7 盈利: 247.4780730515394 亏损: -245.24391826467846 最大盈利: 131.66 最大亏损: -157.73 总收益: 2.23 平均盈利: 0.32 typeA: 0.18 胜率: 57.14%
趋势空且增强-2 总交易次数: 197 盈利: 14203.27642782797 亏损: -8288.810421838723 最大盈利: 1944.74 最大亏损: -409.17 总收益: 5914.47 平均盈利: 30.02 typeA: 16.16 胜率: 53.81%
趋势多且增强-11 总交易次数: 214 盈利: 12831.264784596395 亏损: -8564.230764467602 最大盈利: 1211.58 最大亏损: -453.70 总收益: 4267.03 平均盈利: 19.94 typeA: 9.97 胜率: 50.00%
趋势多且增强-L3-1-3 总交易次数: 147 盈利: 9082.526332395842 亏损: -3972.0315808055366 最大盈利: 2420.08 最大亏损: -392.55 总收益: 5110.49 平均盈利: 34.77 typeA: 17.03 胜率: 48.98%
趋势多且增强-L1-3-9 总交易次数: 30 盈利: 2096.2018718137047 亏损: -1029.8450770382367 最大盈利: 557.68 最大亏损: -213.15 总收益: 1066.36 平均盈利: 35.55 typeA: 16.59 胜率: 46.67%
趋势多且增强-L1-1-6 总交易次数: 34 盈利: 3087.413042346599 亏损: -1568.3379376241082 最大盈利: 481.59 最大亏损: -190.83 总收益: 1519.08 平均盈利: 44.68 typeA: 19.71 胜率: 44.12%
趋势多且增强-L1-3-4 总交易次数: 132 盈利: 5252.301104131454 亏损: -4029.441082043297 最大盈利: 945.12 最大亏损: -281.08 总收益: 1222.86 平均盈利: 9.26 typeA: 4.00 胜率: 43.18%
趋势空且增强-L3-1-6 总交易次数: 127 盈利: 8240.472879023557 亏损: -5315.460874548921 最大盈利: 1266.52 最大亏损: -363.63 总收益: 2925.01 平均盈利: 23.03 typeA: 8.89 胜率: 38.58%
趋势多且增强-L1-3-1 总交易次数: 26 盈利: 23117.589129741296 亏损: -764.8113164068232 最大盈利: 20421.90 最大亏损: -241.31 总收益: 22352.78 平均盈利: 859.72 typeA: 330.65 胜率: 38.46%
趋势多且增强-L1-3-2 总交易次数: 15 盈利: 614.2008838301538 亏损: -334.64947769708004 最大盈利: 440.14 最大亏损: -74.20 总收益: 279.55 平均盈利: 18.64 typeA: 6.21 胜率: 33.33%
趋势多且增强-L1-2-5 总交易次数: 45 盈利: 1752.4958999699631 亏损: -1057.933402736129 最大盈利: 591.65 最大亏损: -94.43 总收益: 694.56 平均盈利: 15.43 typeA: 5.14 胜率: 33.33%

######################################################################

tradeNumTotal 3942
profitTotal 49261.9357540243
maxLossTotal -1985.95
winRateTotal 3032.220000000002
period month 53
avgRate 57.21
maxDrawdownTotal 31.4
趋势空且增强-L2-1-3 总交易次数: 69 盈利: 2276.3182323539872 亏损: -404.5068946179635 最大盈利: 1228.74 最大亏损: -213.37 总收益: 1871.81 平均盈利: 27.13 typeA: 21.23 胜率: 78.26%
趋势多且增强-R-2-2 总交易次数: 23 盈利: 194.6721754319223 亏损: -61.29220864751612 最大盈利: 43.22 最大亏损: -28.57 总收益: 133.38 平均盈利: 5.80 typeA: 4.03 胜率: 69.57%
趋势多且增强-R-1-1-1 总交易次数: 34 盈利: 513.0927828831543 亏损: -149.18242880288886 最大盈利: 125.27 最大亏损: -41.96 总收益: 363.91 平均盈利: 10.70 typeA: 7.24 胜率: 67.65%
趋势空且增强-L2-2-3 总交易次数: 37 盈利: 412.26835403037353 亏损: -174.7569842007645 最大盈利: 122.88 最大亏损: -36.34 总收益: 237.51 平均盈利: 6.42 typeA: 4.34 胜率: 67.57%
趋势多且增强-L3-1-5 总交易次数: 203 盈利: 2860.439949927136 亏损: -848.7686942344884 最大盈利: 1521.91 最大亏损: -96.99 总收益: 2011.67 平均盈利: 9.91 typeA: 6.64 胜率: 67.00%
趋势空且增强-11 总交易次数: 164 盈利: 3283.9925800390465 亏损: -1315.2664449281872 最大盈利: 1232.75 最大亏损: -112.65 总收益: 1968.73 平均盈利: 12.00 typeA: 7.90 胜率: 65.85%
趋势多且增强-R-3-2 总交易次数: 29 盈利: 132.5746006513735 亏损: -33.59553784813859 最大盈利: 29.69 最大亏损: -11.47 总收益: 98.98 平均盈利: 3.41 typeA: 2.24 胜率: 65.52%
趋势多且增强-R-3-1 总交易次数: 138 盈利: 937.630714562614 亏损: -574.5371461822805 最大盈利: 288.90 最大亏损: -78.31 总收益: 363.09 平均盈利: 2.63 typeA: 1.72 胜率: 65.22%
趋势空且增强-L1-1-2 总交易次数: 37 盈利: 2954.134223093221 亏损: -506.545463929589 最大盈利: 2374.77 最大亏损: -127.15 总收益: 2447.59 平均盈利: 66.15 typeA: 42.91 胜率: 64.86%
趋势多且增强-R-1-2-2 总交易次数: 81 盈利: 1197.4243525120191 亏损: -476.3824894642802 最大盈利: 391.57 最大亏损: -71.48 总收益: 721.04 平均盈利: 8.90 typeA: 5.71 胜率: 64.20%
趋势多且增强-L3-1-4-1 总交易次数: 199 盈利: 2899.322583904431 亏损: -2143.3323375573846 最大盈利: 241.05 最大亏损: -354.44 总收益: 755.99 平均盈利: 3.80 typeA: 2.41 胜率: 63.32%
趋势多且增强-R-1-1-2 总交易次数: 269 盈利: 8592.594717689874 亏损: -3585.5811017206943 最大盈利: 2708.52 最大亏损: -1345.10 总收益: 5007.01 平均盈利: 18.61 typeA: 11.42 胜率: 61.34%
趋势空且增强-L-4-2-3 总交易次数: 152 盈利: 622.1431428157777 亏损: -543.9700885326382 最大盈利: 44.21 最大亏损: -71.31 总收益: 78.17 平均盈利: 0.51 typeA: 0.31 胜率: 61.18%
趋势多且增强-L3-1-4-3 总交易次数: 373 盈利: 1788.3849633533825 亏损: -1389.2309668958853 最大盈利: 232.50 最大亏损: -52.76 总收益: 399.15 平均盈利: 1.07 typeA: 0.64 胜率: 60.05%
趋势空且增强-L2-3-3 总交易次数: 378 盈利: 3531.556646019716 亏损: -2365.8961778388693 最大盈利: 762.74 最大亏损: -465.54 总收益: 1165.66 平均盈利: 3.08 typeA: 1.84 胜率: 59.79%
趋势多且增强-R-2-1 总交易次数: 91 盈利: 745.5392892886603 亏损: -445.5348526682577 最大盈利: 236.97 最大亏损: -44.35 总收益: 300.00 平均盈利: 3.30 typeA: 1.96 胜率: 59.34%
趋势空且增强-L2-3-4 总交易次数: 340 盈利: 2159.2736854628574 亏损: -1702.443443907531 最大盈利: 176.44 最大亏损: -170.23 总收益: 456.83 平均盈利: 1.34 typeA: 0.77 胜率: 57.65%
趋势空且增强-L2-3-5 总交易次数: 197 盈利: 1586.167973306893 亏损: -852.520008488848 最大盈利: 223.25 最大亏损: -76.21 总收益: 733.65 平均盈利: 3.72 typeA: 2.14 胜率: 57.36%
趋势多且增强-L1-2-1 总交易次数: 7 盈利: 193.44387038577855 亏损: -40.00277508824064 最大盈利: 78.63 最大亏损: -22.88 总收益: 153.44 平均盈利: 21.92 typeA: 12.53 胜率: 57.14%
趋势空且增强-2 总交易次数: 202 盈利: 14343.596973343387 亏损: -2561.046664424741 最大盈利: 6034.58 最大亏损: -410.01 总收益: 11782.55 平均盈利: 58.33 typeA: 32.05 胜率: 54.95%
趋势多且增强-L3-1-3 总交易次数: 133 盈利: 2006.2817297212184 亏损: -755.0326605230354 最大盈利: 845.92 最大亏损: -91.39 总收益: 1251.25 平均盈利: 9.41 typeA: 4.74 胜率: 50.38%
趋势多且增强-11 总交易次数: 212 盈利: 2767.105528972621 亏损: -4320.7164895069245 最大盈利: 246.78 最大亏损: -1985.95 总收益: -1553.61 平均盈利: -7.33 typeA: -3.60 胜率: 49.06%
趋势多且增强-L1-3-9 总交易次数: 34 盈利: 1120.0527946018124 亏损: -421.57829148966084 最大盈利: 574.68 最大亏损: -129.27 总收益: 698.47 平均盈利: 20.54 typeA: 9.67 胜率: 47.06%
趋势多且增强-L1-1-6 总交易次数: 56 盈利: 3880.631054935085 亏损: -731.6471033939977 最大盈利: 1440.26 最大亏损: -88.68 总收益: 3148.98 平均盈利: 56.23 typeA: 26.11 胜率: 46.43%
趋势多且增强-L1-2-2 总交易次数: 11 盈利: 1075.3125258990776 亏损: -75.43464609489752 最大盈利: 699.85 最大亏损: -36.16 总收益: 999.88 平均盈利: 90.90 typeA: 41.31 胜率: 45.45%
趋势多且增强-L1-3-4 总交易次数: 191 盈利: 1496.249508597641 亏损: -1328.031393104364 最大盈利: 125.81 最大亏损: -81.56 总收益: 168.22 平均盈利: 0.88 typeA: 0.37 胜率: 41.88%
趋势多且增强-L1-3-2 总交易次数: 32 盈利: 342.3382567391884 亏损: -131.4611069207179 最大盈利: 74.78 最大亏损: -29.01 总收益: 210.88 平均盈利: 6.59 typeA: 2.68 胜率: 40.63%
趋势多且增强-L1-3-1 总交易次数: 41 盈利: 12120.115607594698 亏损: -257.8052736076951 最大盈利: 11496.96 最大亏损: -45.99 总收益: 11862.31 平均盈利: 289.32 typeA: 112.89 胜率: 39.02%
趋势空且增强-L3-1-6 总交易次数: 127 盈利: 1694.5760375137384 亏损: -1486.5434282742106 最大盈利: 218.18 最大亏损: -298.89 总收益: 208.03 平均盈利: 1.64 typeA: 0.62 胜率: 37.80%
趋势多且增强-L1-2-5 总交易次数: 82 盈利: 3278.32099388353 亏损: -1060.1260502458 最大盈利: 2044.86 最大亏损: -394.99 总收益: 2218.19 平均盈利: 27.05 typeA: 9.24 胜率: 34.15%

#############################################################

tradeNumTotal 3800
profitTotal 50389.89037799775
maxLossTotal -1240.35
winRateTotal 3120.779999999999
period month 53
avgRate 58.88
maxDrawdownTotal 29.6
趋势空且增强-L2-1-3 总交易次数: 73 盈利: 2231.256590402356 亏损: -473.2263987766962 最大盈利: 1133.05 最大亏损: -253.05 总收益: 1758.03 平均盈利: 24.08 typeA: 19.13 胜率: 79.45%
趋势多且增强-R-2-2 总交易次数: 23 盈利: 193.4481363024574 亏损: -60.80118355571684 最大盈利: 43.78 最大亏损: -27.96 总收益: 132.65 平均盈利: 5.77 typeA: 4.01 胜率: 69.57%
趋势空且增强-L2-2-3 总交易次数: 39 盈利: 426.61101410874943 亏损: -174.04359320002305 最大盈利: 122.64 最大亏损: -36.18 总收益: 252.57 平均盈利: 6.48 typeA: 4.48 胜率: 69.23%
趋势多且增强-R-1-1-1 总交易次数: 35 盈利: 522.0025134442146 亏损: -144.19397587498628 最大盈利: 121.24 最大亏损: -42.78 总收益: 377.81 平均盈利: 10.79 typeA: 7.40 胜率: 68.57%
趋势多且增强-L3-1-5 总交易次数: 220 盈利: 3327.3404023392495 亏损: -920.3410966739925 最大盈利: 1811.04 最大亏损: -89.44 总收益: 2407.00 平均盈利: 10.94 typeA: 7.41 胜率: 67.73%
趋势空且增强-11 总交易次数: 176 盈利: 3322.9632934697106 亏损: -1377.5525472251004 最大盈利: 1136.76 最大亏损: -115.73 总收益: 1945.41 平均盈利: 11.05 typeA: 7.35 胜率: 66.48%
趋势多且增强-R-3-2 总交易次数: 29 盈利: 133.72369385923938 亏损: -33.244790636580056 最大盈利: 30.44 最大亏损: -11.18 总收益: 100.48 平均盈利: 3.46 typeA: 2.27 胜率: 65.52%
趋势多且增强-R-3-1 总交易次数: 138 盈利: 908.1405240962824 亏损: -573.1918803174611 最大盈利: 261.24 最大亏损: -79.61 总收益: 334.95 平均盈利: 2.43 typeA: 1.58 胜率: 65.22%
趋势多且增强-R-1-2-2 总交易次数: 82 盈利: 1226.5685022837538 亏损: -475.62427907800753 最大盈利: 389.60 最大亏损: -75.39 总收益: 750.94 平均盈利: 9.16 typeA: 5.92 胜率: 64.63%
趋势多且增强-L3-1-4-1 总交易次数: 231 盈利: 3440.811122346302 亏损: -2296.3469423449633 最大盈利: 272.38 最大亏损: -353.92 总收益: 1144.46 平均盈利: 4.95 typeA: 3.15 胜率: 63.64%
趋势空且增强-L1-1-2 总交易次数: 41 盈利: 3487.602769678665 亏损: -543.1723462921191 最大盈利: 2816.40 最大亏损: -126.86 总收益: 2944.43 平均盈利: 71.82 typeA: 45.54 胜率: 63.41%
趋势空且增强-L-4-2-3 总交易次数: 162 盈利: 701.3767886226292 亏损: -578.9766229585113 最大盈利: 44.12 最大亏损: -72.74 总收益: 122.40 平均盈利: 0.76 typeA: 0.48 胜率: 62.96%
趋势多且增强-R-1-1-2 总交易次数: 284 盈利: 9798.58118889579 亏损: -3542.1262942426206 最大盈利: 3279.12 最大亏损: -1240.35 总收益: 6256.45 平均盈利: 22.03 typeA: 13.57 胜率: 61.62%
趋势空且增强-L2-3-3 总交易次数: 403 盈利: 3808.057254184407 亏损: -2563.0559054717696 最大盈利: 703.34 最大亏损: -552.12 总收益: 1245.00 平均盈利: 3.09 typeA: 1.86 胜率: 60.30%
趋势多且增强-L3-1-4-3 总交易次数: 388 盈利: 1842.5479946020912 亏损: -1517.2977743285123 最大盈利: 232.50 最大亏损: -62.13 总收益: 325.25 平均盈利: 0.84 typeA: 0.50 胜率: 59.79%
趋势多且增强-R-2-1 总交易次数: 91 盈利: 722.0315287222612 亏损: -440.1450958559828 最大盈利: 214.28 最大亏损: -44.27 总收益: 281.89 平均盈利: 3.10 typeA: 1.84 胜率: 59.34%
趋势空且增强-L2-3-4 总交易次数: 352 盈利: 2144.3365758928276 亏损: -1724.4322217693896 最大盈利: 185.14 最大亏损: -153.93 总收益: 419.90 平均盈利: 1.19 typeA: 0.68 胜率: 57.10%
趋势空且增强-L2-3-5 总交易次数: 204 盈利: 1544.7599741370534 亏损: -942.6800360469163 最大盈利: 201.87 最大亏损: -76.10 总收益: 602.08 平均盈利: 2.95 typeA: 1.65 胜率: 55.88%
趋势空且增强-2 总交易次数: 230 盈利: 15138.977293595768 亏损: -3169.6320698410927 最大盈利: 5564.65 最大亏损: -463.30 总收益: 11969.35 平均盈利: 52.04 typeA: 28.96 胜率: 55.65%
趋势多且增强-L3-1-3 总交易次数: 154 盈利: 2085.7597724296666 亏损: -862.4851346157019 最大盈利: 886.16 最大亏损: -91.39 总收益: 1223.27 平均盈利: 7.94 typeA: 3.97 胜率: 50.00%
趋势多且增强-L1-2-2 总交易次数: 14 盈利: 1194.8377252694906 亏损: -88.23320073450081 最大盈利: 733.15 最大亏损: -36.16 总收益: 1106.60 平均盈利: 79.04 typeA: 39.52 胜率: 50.00%
趋势多且增强-L1-1-6 总交易次数: 74 盈利: 4760.720442721893 亏损: -1330.9214761289631 最大盈利: 1508.78 最大亏损: -256.49 总收益: 3429.80 平均盈利: 46.35 typeA: 21.30 胜率: 45.95%
趋势多且增强-L1-2-1 总交易次数: 11 盈利: 252.42517713687846 亏损: -71.64923075071906 最大盈利: 78.71 最大亏损: -22.45 总收益: 180.78 平均盈利: 16.43 typeA: 7.47 胜率: 45.45%
趋势多且增强-L1-3-9 总交易次数: 38 盈利: 1228.6438973660124 亏损: -453.6121715521656 最大盈利: 691.10 最大亏损: -128.62 总收益: 775.03 平均盈利: 20.40 typeA: 9.12 胜率: 44.74%
趋势多且增强-L1-3-4-1 总交易次数: 107 盈利: 953.1958037770944 亏损: -706.4447938319606 最大盈利: 98.43 最大亏损: -96.88 总收益: 246.75 平均盈利: 2.31 typeA: 1.01 胜率: 43.93%
趋势多且增强-L1-3-4-2 总交易次数: 112 盈利: 699.1476583586639 亏损: -848.5753262415881 最大盈利: 125.52 最大亏损: -82.25 总收益: -149.43 平均盈利: -1.33 typeA: -0.54 胜率: 40.18%
趋势多且增强-L1-3-2 总交易次数: 40 盈利: 399.04917838604547 亏损: -188.25943608738265 最大盈利: 75.87 最大亏损: -29.01 总收益: 210.79 平均盈利: 5.27 typeA: 2.11 胜率: 40.00%
趋势多且增强-L1-3-1 总交易次数: 48 盈利: 11288.329747491418 亏损: -325.35896719245835 最大盈利: 10601.66 最大亏损: -46.29 总收益: 10962.97 平均盈利: 228.40 typeA: 80.90 胜率: 35.42%
趋势多且增强-L3-1-2 总交易次数: 1 盈利: 0 亏损: -15.325662272441905 最大盈利: -15.33 最大亏损: -15.33 总收益: -15.33 平均盈利: -15.33 typeA: 0.00 胜率: 0.00%

##########################################################################################


tradeNumTotal 3909
profitTotal 16390.267607836988
maxLossTotal -183.03
winRateTotal 3209.210000000001
period month 53
avgRate 60.55
maxDrawdownTotal 28.3
趋势空且增强-L2-1-3 总交易次数: 73 盈利: 958.8373035427859 亏损: -192.00938853436762 最大盈利: 122.10 最大亏损: -67.37 总收益: 766.83 平均盈利: 10.50 typeA: 8.20 胜率: 78.08%
趋势空且增强-L2-2-3 总交易次数: 39 盈利: 395.3730473711797 亏损: -169.2635210343179 最大盈利: 114.24 最大亏损: -37.59 总收益: 226.11 平均盈利: 5.80 typeA: 4.31 胜率: 74.36%
趋势多且增强-L3-1-4-2 总交易次数: 114 盈利: 1003.1725102393915 亏损: -614.1445699964848 最大盈利: 127.84 最大亏损: -183.03 总收益: 389.03 平均盈利: 3.41 typeA: 2.39 胜率: 70.18%
趋势多且增强-R-2-2 总交易次数: 23 盈利: 186.36922008930114 亏损: -60.56407534113363 最大盈利: 36.97 最大亏损: -27.71 总收益: 125.81 平均盈利: 5.47 typeA: 3.81 胜率: 69.57%
趋势多且增强-R-1-1-1 总交易次数: 35 盈利: 387.35138476111456 亏损: -120.21936169414755 最大盈利: 74.00 最大亏损: -30.68 总收益: 267.13 平均盈利: 7.63 typeA: 5.23 胜率: 68.57%
趋势多且增强-L3-1-5 总交易次数: 257 盈利: 1691.056376201543 亏损: -919.3520404250016 最大盈利: 137.35 最大亏损: -48.06 总收益: 771.70 平均盈利: 3.00 typeA: 2.06 胜率: 68.48%
趋势空且增强-11 总交易次数: 174 盈利: 1934.508977834908 亏损: -1302.0696640532474 最大盈利: 77.83 最大亏损: -89.77 总收益: 632.44 平均盈利: 3.63 typeA: 2.42 胜率: 66.67%
趋势多且增强-R-3-2 总交易次数: 29 盈利: 126.50238847744141 亏损: -34.11947765410041 最大盈利: 26.69 最大亏损: -13.23 总收益: 92.38 平均盈利: 3.19 typeA: 2.09 胜率: 65.52%
趋势空且增强-L-4-2-3 总交易次数: 160 盈利: 670.4156142534715 亏损: -534.4731410046844 最大盈利: 49.19 最大亏损: -59.01 总收益: 135.94 平均盈利: 0.85 typeA: 0.55 胜率: 65.00%
趋势多且增强-R-3-1 总交易次数: 140 盈利: 765.3131262173113 亏损: -573.757150718602 最大盈利: 125.40 最大亏损: -73.28 总收益: 191.56 平均盈利: 1.37 typeA: 0.89 胜率: 65.00%
趋势多且增强-R-1-2-2 总交易次数: 82 盈利: 739.4968391357269 亏损: -444.7048885122962 最大盈利: 140.35 最大亏损: -83.03 总收益: 294.79 平均盈利: 3.60 typeA: 2.32 胜率: 64.63%
趋势多且增强-L3-1-4-3 总交易次数: 442 盈利: 1978.5650732908118 亏损: -1601.3433911255413 最大盈利: 127.27 最大亏损: -60.90 总收益: 377.22 平均盈利: 0.85 typeA: 0.54 胜率: 62.90%
趋势空且增强-L1-1-2 总交易次数: 40 盈利: 677.9637673401679 亏损: -424.6528576920251 最大盈利: 206.84 最大亏损: -80.81 总收益: 253.31 平均盈利: 6.33 typeA: 3.96 胜率: 62.50%
趋势空且增强-L2-3-3 总交易次数: 396 盈利: 2692.4557212094323 亏损: -1788.7217221500089 最大盈利: 258.83 最大亏损: -77.48 总收益: 903.73 平均盈利: 2.28 typeA: 1.42 胜率: 62.37%
趋势空且增强-L1-3-4-2 总交易次数: 191 盈利: 776.9844277217862 亏损: -731.076569326022 最大盈利: 132.66 最大亏损: -58.81 总收益: 45.91 平均盈利: 0.24 typeA: 0.15 胜率: 62.30%
趋势多且增强-R-1-1-2 总交易次数: 284 盈利: 3017.9751019704067 亏损: -1688.4347967311514 最大盈利: 235.85 最大亏损: -119.73 总收益: 1329.54 平均盈利: 4.68 typeA: 2.88 胜率: 61.62%
趋势多且增强-R-2-1 总交易次数: 91 盈利: 629.7082321821886 亏损: -418.206242183355 最大盈利: 169.96 最大亏损: -46.38 总收益: 211.50 平均盈利: 2.32 typeA: 1.38 胜率: 59.34%
趋势多且增强-L3-1-4-1 总交易次数: 136 盈利: 1604.7761603838812 亏损: -970.6666503397933 最大盈利: 185.55 最大亏损: -90.48 总收益: 634.11 平均盈利: 4.66 typeA: 2.74 胜率: 58.82%
趋势空且增强-L2-3-4 总交易次数: 352 盈利: 1733.2594379885227 亏损: -1493.6801639380394 最大盈利: 102.09 最大亏损: -64.70 总收益: 239.58 平均盈利: 0.68 typeA: 0.39 胜率: 57.10%
趋势空且增强-L2-3-5 总交易次数: 203 盈利: 1357.272977081407 亏损: -859.309805073269 最大盈利: 129.83 最大亏损: -63.36 总收益: 497.96 平均盈利: 2.45 typeA: 1.38 胜率: 56.16%
趋势空且增强-2 总交易次数: 230 盈利: 3076.397685158427 亏损: -2041.8792836563355 最大盈利: 388.95 最大亏损: -140.33 总收益: 1034.52 平均盈利: 4.50 typeA: 2.50 胜率: 55.65%
趋势多且增强-L1-2-1 总交易次数: 13 盈利: 220.72503108222404 亏损: -66.2813069632484 最大盈利: 76.67 最大亏损: -18.51 总收益: 154.44 平均盈利: 11.88 typeA: 6.40 胜率: 53.85%
趋势多且增强-L3-1-3 总交易次数: 175 盈利: 1340.2393472030117 亏损: -828.9412024233372 最大盈利: 259.12 最大亏损: -78.51 总收益: 511.30 平均盈利: 2.92 typeA: 1.47 胜率: 50.29%
趋势多且增强-L1-1-6 总交易次数: 74 盈利: 2065.908577318098 亏损: -673.3697564086867 最大盈利: 855.81 最大亏损: -63.73 总收益: 1392.54 平均盈利: 18.82 typeA: 8.65 胜率: 45.95%
趋势多且增强-L1-3-9 总交易次数: 38 盈利: 465.32079721247135 亏损: -249.81155155221612 最大盈利: 111.54 最大亏损: -42.63 总收益: 215.51 平均盈利: 5.67 typeA: 2.54 胜率: 44.74%
趋势多且增强-L1-2-2 总交易次数: 20 盈利: 1163.1322099112742 亏损: -162.21477539442756 最大盈利: 710.67 最大亏损: -57.31 总收益: 1000.92 平均盈利: 50.05 typeA: 20.02 胜率: 40.00%
趋势多且增强-L1-3-2 总交易次数: 45 盈利: 409.42904360752016 亏损: -182.0288922336568 最大盈利: 88.03 最大亏损: -29.60 总收益: 227.40 平均盈利: 5.05 typeA: 1.91 胜率: 37.78%
趋势多且增强-L1-3-1 总交易次数: 53 盈利: 4615.165450647675 亏损: -363.71197543683473 最大盈利: 4116.61 最大亏损: -48.26 总收益: 4251.45 平均盈利: 80.22 typeA: 27.24 胜率: 33.96%




##################################################################

tradeNumTotal 4329
profitTotal 17211.058392844207
maxLossTotal -183.03
winRateTotal 3172.440000000001
period month 53
avgRate 59.86
maxDrawdownTotal 25.2
趋势多且增强-L1-3-1 总交易次数: 52 盈利: 4608.7535356109665 亏损: -363.71197543683473 最大盈利: 4116.61 最大亏损: -48.26 总收益: 4245.04 平均盈利: 81.64 typeA: 26.69 胜率: 32.69%
趋势多且增强-L1-2-2 总交易次数: 20 盈利: 1163.1322099112742 亏损: -162.21477539442756 最大盈利: 710.67 最大亏损: -57.31 总收益: 1000.92 平均盈利: 50.05 typeA: 20.02 胜率: 40.00%
趋势空且增强-L2-1-3 总交易次数: 68 盈利: 940.050492412507 亏损: -189.96313413325393 最大盈利: 122.10 最大亏损: -67.37 总收益: 750.09 平均盈利: 11.03 typeA: 8.76 胜率: 79.41%
趋势多且增强-L1-2-1 总交易次数: 13 盈利: 220.72503108222404 亏损: -66.2813069632484 最大盈利: 76.67 最大亏损: -18.51 总收益: 154.44 平均盈利: 11.88 typeA: 6.40 胜率: 53.85%
趋势多且增强-R-1-1-1 总交易次数: 35 盈利: 387.35138476111456 亏损: -120.21936169414755 最大盈利: 74.00 最大亏损: -30.68 总收益: 267.13 平均盈利: 7.63 typeA: 5.23 胜率: 68.57%
趋势多且增强-L1-1-6 总交易次数: 51 盈利: 1072.4336790175616 亏损: -543.6361812331684 最大盈利: 105.79 最大亏损: -63.73 总收益: 528.80 平均盈利: 10.37 typeA: 4.68 胜率: 45.10%
趋势空且增强-L-PLUS-4-3 总交易次数: 60 盈利: 761.8341934093417 亏损: -292.71132795058827 最大盈利: 64.48 最大亏损: -38.34 总收益: 469.12 平均盈利: 7.82 typeA: 4.04 胜率: 51.67%
趋势多且增强-L1-4-1 总交易次数: 120 盈利: 2211.492780771707 亏损: -1124.634522996722 最大盈利: 849.74 最大亏损: -123.58 总收益: 1086.86 平均盈利: 9.06 typeA: 3.92 胜率: 43.33%
趋势多且增强-R-2-2 总交易次数: 23 盈利: 186.36922008930114 亏损: -60.56407534113363 最大盈利: 36.97 最大亏损: -27.71 总收益: 125.81 平均盈利: 5.47 typeA: 3.81 胜率: 69.57%
趋势空且增强-L1-1-2 总交易次数: 42 盈利: 677.9637673401679 亏损: -460.6696705397751 最大盈利: 206.84 最大亏损: -80.81 总收益: 217.29 平均盈利: 5.17 typeA: 3.08 胜率: 59.52%
趋势多且增强-R-1-1-2 总交易次数: 282 盈利: 2994.1544944325733 亏损: -1688.4347967311514 最大盈利: 235.85 最大亏损: -119.73 总收益: 1305.72 平均盈利: 4.63 typeA: 2.84 胜率: 61.35%
趋势空且增强-11 总交易次数: 163 盈利: 1855.2220251853576 亏损: -1212.49441814825 最大盈利: 77.83 最大亏损: -89.77 总收益: 642.73 平均盈利: 3.94 typeA: 2.64 胜率: 66.87%
趋势多且增强-L3-1-4-1 总交易次数: 134 盈利: 1557.1548004589652 亏损: -970.6666503397933 最大盈利: 185.55 最大亏损: -90.48 总收益: 586.49 平均盈利: 4.38 typeA: 2.55 胜率: 58.21%
趋势多且增强-L1-3-9 总交易次数: 38 盈利: 465.32079721247135 亏损: -249.81155155221612 最大盈利: 111.54 最大亏损: -42.63 总收益: 215.51 平均盈利: 5.67 typeA: 2.54 胜率: 44.74%
趋势空且增强-L2-2-3 总交易次数: 35 盈利: 311.8026729868076 亏损: -187.78064198832124 最大盈利: 114.24 最大亏损: -37.59 总收益: 124.02 平均盈利: 3.54 typeA: 2.43 胜率: 68.57%
趋势多且增强-R-1-2-2 总交易次数: 82 盈利: 739.4968391357269 亏损: -444.7048885122962 最大盈利: 140.35 最大亏损: -83.03 总收益: 294.79 平均盈利: 3.60 typeA: 2.32 胜率: 64.63%
趋势空且增强-L2-4-1 总交易次数: 228 盈利: 2970.2541805016026 亏损: -1936.0591705943916 最大盈利: 388.95 最大亏损: -140.33 总收益: 1034.20 平均盈利: 4.54 typeA: 2.27 胜率: 50.00%
趋势多且增强-R-3-2 总交易次数: 29 盈利: 126.50238847744141 亏损: -34.11947765410041 最大盈利: 26.69 最大亏损: -13.23 总收益: 92.38 平均盈利: 3.19 typeA: 2.09 胜率: 65.52%
趋势多且增强-L3-1-5 总交易次数: 258 盈利: 1689.515835471602 亏损: -928.3562493802257 最大盈利: 137.35 最大亏损: -48.06 总收益: 761.16 平均盈利: 2.95 typeA: 2.01 胜率: 68.22%
趋势多且增强-L1-3-2 总交易次数: 45 盈利: 409.42904360752016 亏损: -182.0288922336568 最大盈利: 88.03 最大亏损: -29.60 总收益: 227.40 平均盈利: 5.05 typeA: 1.91 胜率: 37.78%
趋势空且增强-L-PLUS-3-1 总交易次数: 336 盈利: 2211.402398305817 亏损: -1353.6057848179507 最大盈利: 144.27 最大亏损: -60.93 总收益: 857.80 平均盈利: 2.55 typeA: 1.58 胜率: 61.90%
趋势多且增强-L3-1-3 总交易次数: 173 盈利: 1313.9199135863055 亏损: -825.4421383889367 最大盈利: 259.12 最大亏损: -78.51 总收益: 488.48 平均盈利: 2.82 typeA: 1.44 胜率: 50.87%
趋势多且增强-R-2-1 总交易次数: 91 盈利: 629.7082321821886 亏损: -418.206242183355 最大盈利: 169.96 最大亏损: -46.38 总收益: 211.50 平均盈利: 2.32 typeA: 1.38 胜率: 59.34%
趋势空且增强-L2-3-5 总交易次数: 203 盈利: 1357.272977081407 亏损: -863.1703774641844 最大盈利: 129.83 最大亏损: -63.36 总收益: 494.10 平均盈利: 2.43 typeA: 1.37 胜率: 56.16%
趋势空且增强-L2-3-3 总交易次数: 379 盈利: 2514.8026730639644 亏损: -1777.679678868438 最大盈利: 258.83 最大亏损: -77.48 总收益: 737.12 平均盈利: 1.94 typeA: 1.19 胜率: 61.21%
趋势多且增强-L3-1-4-2 总交易次数: 113 盈利: 797.3017362852216 亏损: -614.1445699964848 最大盈利: 113.50 最大亏损: -183.03 总收益: 183.16 平均盈利: 1.62 typeA: 1.13 胜率: 69.91%
趋势多且增强-R-3-1 总交易次数: 140 盈利: 765.3131262173113 亏损: -573.757150718602 最大盈利: 125.40 最大亏损: -73.28 总收益: 191.56 平均盈利: 1.37 typeA: 0.89 胜率: 65.00%
趋势空且增强-L-4-2-3 总交易次数: 145 盈利: 585.2989989106428 亏损: -467.9389182724575 最大盈利: 49.19 最大亏损: -59.01 总收益: 117.36 平均盈利: 0.81 typeA: 0.53 胜率: 65.52%
趋势多且增强-L3-1-4-3 总交易次数: 136 盈利: 732.4093728446803 亏损: -615.8882598441543 最大盈利: 97.68 最大亏损: -55.36 总收益: 116.52 平均盈利: 0.86 typeA: 0.52 胜率: 60.29%
趋势多且增强-L3-1-4-4 总交易次数: 305 盈利: 1218.7923477229645 亏损: -980.1910800053884 最大盈利: 127.27 最大亏损: -60.90 总收益: 238.60 平均盈利: 0.78 typeA: 0.51 胜率: 65.57%
趋势空且增强-L2-3-4 总交易次数: 348 盈利: 1716.0850173104545 亏损: -1444.8072893977483 最大盈利: 102.09 最大亏损: -64.70 总收益: 271.28 平均盈利: 0.78 typeA: 0.45 胜率: 57.47%
趋势空且增强-L1-3-4-2 总交易次数: 182 盈利: 750.5054456407095 亏损: -707.8186594081164 最大盈利: 132.66 最大亏损: -58.81 总收益: 42.69 平均盈利: 0.23 typeA: 0.14 胜率: 61.54%

##############################################################################################


tradeNumTotal 4214
profitTotal 17302.10967045238
maxLossTotal -123.58
winRateTotal 3155.7399999999993
period month 53
avgRate 59.54
maxDrawdownTotal 25.6
趋势多且增强-L1-3-1 总交易次数: 53 盈利: 4608.7535356109665 亏损: -365.82387225512747 最大盈利: 4116.61 最大亏损: -48.26 总收益: 4242.93 平均盈利: 80.06 typeA: 25.68 胜率: 32.08%
趋势多且增强-L1-2-2 总交易次数: 20 盈利: 1163.1322099112742 亏损: -162.21477539442756 最大盈利: 710.67 最大亏损: -57.31 总收益: 1000.92 平均盈利: 50.05 typeA: 20.02 胜率: 40.00%
趋势空且增强-L2-1-3 总交易次数: 69 盈利: 940.050492412507 亏损: -215.5737353252225 最大盈利: 122.10 最大亏损: -67.37 总收益: 724.48 平均盈利: 10.50 typeA: 8.22 胜率: 78.26%
趋势多且增强-L1-2-1 总交易次数: 13 盈利: 220.72503108222404 亏损: -66.2813069632484 最大盈利: 76.67 最大亏损: -18.51 总收益: 154.44 平均盈利: 11.88 typeA: 6.40 胜率: 53.85%
趋势多且增强-R-1-1-1 总交易次数: 35 盈利: 399.7936970854823 亏损: -120.21936169414755 最大盈利: 74.00 最大亏损: -30.68 总收益: 279.57 平均盈利: 7.99 typeA: 5.48 胜率: 68.57%
趋势多且增强-L1-1-6 总交易次数: 51 盈利: 1075.093078786497 亏损: -543.6361812331684 最大盈利: 105.79 最大亏损: -63.73 总收益: 531.46 平均盈利: 10.42 typeA: 4.70 胜率: 45.10%
趋势空且增强-L-PLUS-4-3 总交易次数: 60 盈利: 744.9041970364726 亏损: -292.71132795058827 最大盈利: 64.48 最大亏损: -38.34 总收益: 452.19 平均盈利: 7.54 typeA: 3.89 胜率: 51.67%
趋势多且增强-L1-4-1 总交易次数: 118 盈利: 2221.6836734431945 亏损: -1152.8788767779974 最大盈利: 849.74 最大亏损: -123.58 总收益: 1068.80 平均盈利: 9.06 typeA: 3.84 胜率: 42.37%
趋势多且增强-R-2-2 总交易次数: 23 盈利: 185.71534700022434 亏损: -75.36337094234466 最大盈利: 36.97 最大亏损: -27.71 总收益: 110.35 平均盈利: 4.80 typeA: 3.13 胜率: 65.22%
趋势空且增强-L1-1-2 总交易次数: 42 盈利: 677.9637673401679 亏损: -460.6696705397751 最大盈利: 206.84 最大亏损: -80.81 总收益: 217.29 平均盈利: 5.17 typeA: 3.08 胜率: 59.52%
趋势多且增强-R-1-1-2 总交易次数: 277 盈利: 3083.016435870865 亏损: -1686.6453711054498 最大盈利: 235.85 最大亏损: -119.73 总收益: 1396.37 平均盈利: 5.04 typeA: 3.02 胜率: 59.93%
趋势空且增强-L2-4-2 总交易次数: 173 盈利: 2484.5017444384016 亏损: -1429.4261875447153 最大盈利: 388.95 最大亏损: -110.69 总收益: 1055.08 平均盈利: 6.10 typeA: 2.93 胜率: 47.98%
趋势空且增强-11 总交易次数: 163 盈利: 1875.9134801313835 亏损: -1181.7873596918164 最大盈利: 77.83 最大亏损: -89.77 总收益: 694.13 平均盈利: 4.26 typeA: 2.85 胜率: 66.87%
趋势空且增强-L2-2-3 总交易次数: 36 盈利: 321.74008513447353 亏损: -187.78064198832124 最大盈利: 114.24 最大亏损: -37.59 总收益: 133.96 平均盈利: 3.72 typeA: 2.58 胜率: 69.44%
趋势多且增强-R-1-2-2 总交易次数: 82 盈利: 739.4968391357269 亏损: -444.7048885122962 最大盈利: 140.35 最大亏损: -83.03 总收益: 294.79 平均盈利: 3.60 typeA: 2.32 胜率: 64.63%
趋势多且增强-L3-1-4-1 总交易次数: 135 盈利: 1557.1548004589652 亏损: -1024.175708410389 最大盈利: 185.55 最大亏损: -90.48 总收益: 532.98 平均盈利: 3.95 typeA: 2.28 胜率: 57.78%
趋势多且增强-R-3-2 总交易次数: 29 盈利: 131.08862700955152 亏损: -34.11947765410041 最大盈利: 26.69 最大亏损: -13.23 总收益: 96.97 平均盈利: 3.34 typeA: 2.19 胜率: 65.52%
趋势多且增强-L3-1-5 总交易次数: 276 盈利: 1885.1495896695446 亏损: -1013.9761719241185 最大盈利: 137.35 最大亏损: -66.32 总收益: 871.17 平均盈利: 3.16 typeA: 2.14 胜率: 67.75%
趋势多且增强-L1-3-9 总交易次数: 38 盈利: 440.62181092156345 亏损: -275.4146245355708 最大盈利: 111.54 最大亏损: -46.29 总收益: 165.21 平均盈利: 4.35 typeA: 1.95 胜率: 44.74%
趋势多且增强-L1-3-2 总交易次数: 48 盈利: 419.4361279691434 亏损: -193.96439924376438 最大盈利: 88.03 最大亏损: -29.60 总收益: 225.47 平均盈利: 4.70 typeA: 1.86 胜率: 39.58%
趋势空且增强-L-PLUS-3-1 总交易次数: 336 盈利: 2247.987587773639 亏损: -1320.482907248692 最大盈利: 144.27 最大亏损: -60.93 总收益: 927.50 平均盈利: 2.76 typeA: 1.72 胜率: 62.20%
趋势空且增强-L2-3-5 总交易次数: 204 盈利: 1419.3379028239813 亏损: -863.1703774641844 最大盈利: 129.83 最大亏损: -63.36 总收益: 556.17 平均盈利: 2.73 typeA: 1.54 胜率: 56.37%
趋势多且增强-R-2-1 总交易次数: 89 盈利: 638.2826777030565 亏损: -441.96667776738195 最大盈利: 169.96 最大亏损: -46.38 总收益: 196.32 平均盈利: 2.21 typeA: 1.26 胜率: 57.30%
趋势空且增强-L2-3-3 总交易次数: 383 盈利: 2545.2671853685424 亏损: -1784.4517840010935 最大盈利: 258.83 最大亏损: -77.48 总收益: 760.82 平均盈利: 1.99 typeA: 1.22 胜率: 61.36%
趋势多且增强-L3-1-3 总交易次数: 179 盈利: 1364.7937083837264 亏损: -941.4466244617197 最大盈利: 259.12 最大亏损: -78.51 总收益: 423.35 平均盈利: 2.37 typeA: 1.18 胜率: 49.72%
趋势多且增强-R-3-1 总交易次数: 139 盈利: 769.0097775705856 亏损: -588.4762426425618 最大盈利: 125.40 最大亏损: -73.28 总收益: 180.53 平均盈利: 1.30 typeA: 0.84 胜率: 64.75%
趋势多且增强-L3-1-4-3 总交易次数: 152 盈利: 820.8590052876782 亏损: -627.8407476073028 最大盈利: 97.68 最大亏损: -55.36 总收益: 193.02 平均盈利: 1.27 typeA: 0.79 胜率: 62.50%
趋势多且增强-L3-1-4-4 总交易次数: 311 盈利: 1275.880478519772 亏损: -989.4222937060584 最大盈利: 127.27 最大亏损: -60.90 总收益: 286.46 平均盈利: 0.92 typeA: 0.61 胜率: 66.24%
趋势空且增强-L-4-2-3 总交易次数: 147 盈利: 581.9133122574774 亏损: -467.9389182724575 最大盈利: 41.42 最大亏损: -59.01 总收益: 113.97 平均盈利: 0.78 typeA: 0.51 胜率: 65.99%
趋势空且增强-L2-3-4 总交易次数: 351 盈利: 1714.60367921434 亏损: -1491.809100718503 最大盈利: 102.09 最大亏损: -64.70 总收益: 222.79 平均盈利: 0.63 typeA: 0.37 胜率: 57.55%
趋势空且增强-L1-3-4-2 总交易次数: 182 盈利: 746.4314280857784 亏损: -707.8186594081164 最大盈利: 132.66 最大亏损: -58.81 总收益: 38.61 平均盈利: 0.21 typeA: 0.13 胜率: 61.54%


###################################################################


tradeNumTotal 4142
profitTotal 17076.64075932038
maxLossTotal -119.73
winRateTotal 3165.8199999999997
period month 53
avgRate 59.73
maxDrawdownTotal 24.5
趋势多且增强-L1-3-1 总交易次数: 54 盈利: 4615.165450647675 亏损: -365.82387225512747 最大盈利: 4116.61 最大亏损: -48.26 总收益: 4249.34 平均盈利: 78.69 typeA: 26.23 胜率: 33.33%
趋势多且增强-L1-2-2 总交易次数: 20 盈利: 1163.1322099112742 亏损: -162.21477539442756 最大盈利: 710.67 最大亏损: -57.31 总收益: 1000.92 平均盈利: 50.05 typeA: 20.02 胜率: 40.00%
趋势多且增强-L1-1-6 总交易次数: 74 盈利: 2054.410833867447 亏损: -687.5464099669767 最大盈利: 855.81 最大亏损: -63.73 总收益: 1366.86 平均盈利: 18.47 typeA: 8.24 胜率: 44.59%
趋势空且增强-L2-1-3 总交易次数: 70 盈利: 940.050492412507 亏损: -216.90582361045173 最大盈利: 122.10 最大亏损: -67.37 总收益: 723.14 平均盈利: 10.33 typeA: 7.97 胜率: 77.14%
趋势多且增强-L1-2-1 总交易次数: 13 盈利: 220.72503108222404 亏损: -66.2813069632484 最大盈利: 76.67 最大亏损: -18.51 总收益: 154.44 平均盈利: 11.88 typeA: 6.40 胜率: 53.85%
趋势多且增强-R-1-1-1 总交易次数: 35 盈利: 399.7936970854823 亏损: -120.21936169414755 最大盈利: 74.00 最大亏损: -30.68 总收益: 279.57 平均盈利: 7.99 typeA: 5.48 胜率: 68.57%
趋势空且增强-L-PLUS-4-3 总交易次数: 60 盈利: 744.9041970364726 亏损: -293.72000806136214 最大盈利: 64.48 最大亏损: -38.34 总收益: 451.18 平均盈利: 7.52 typeA: 3.89 胜率: 51.67%
趋势多且增强-R-2-2 总交易次数: 23 盈利: 185.71534700022434 亏损: -75.36337094234466 最大盈利: 36.97 最大亏损: -27.71 总收益: 110.35 平均盈利: 4.80 typeA: 3.13 胜率: 65.22%
趋势空且增强-L1-1-2 总交易次数: 42 盈利: 677.9637673401679 亏损: -460.6696705397751 最大盈利: 206.84 最大亏损: -80.81 总收益: 217.29 平均盈利: 5.17 typeA: 3.08 胜率: 59.52%
趋势多且增强-R-1-1-2 总交易次数: 279 盈利: 3106.837043408698 亏损: -1686.6453711054498 最大盈利: 235.85 最大亏损: -119.73 总收益: 1420.19 平均盈利: 5.09 typeA: 3.07 胜率: 60.22%
趋势空且增强-L2-4-2 总交易次数: 175 盈利: 2492.793095847271 亏损: -1427.6963182746074 最大盈利: 388.95 最大亏损: -110.69 总收益: 1065.10 平均盈利: 6.09 typeA: 2.85 胜率: 46.86%
趋势空且增强-L2-2-3 总交易次数: 36 盈利: 321.74008513447353 亏损: -187.78064198832124 最大盈利: 114.24 最大亏损: -37.59 总收益: 133.96 平均盈利: 3.72 typeA: 2.58 胜率: 69.44%
趋势空且增强-11 总交易次数: 166 盈利: 1859.9711969181453 亏损: -1232.4846971913585 最大盈利: 77.83 最大亏损: -89.77 总收益: 627.49 平均盈利: 3.78 typeA: 2.48 胜率: 65.66%
趋势多且增强-L3-1-4-1 总交易次数: 137 盈利: 1577.6481693814912 亏损: -1024.175708410389 最大盈利: 185.55 最大亏损: -90.48 总收益: 553.47 平均盈利: 4.04 typeA: 2.36 胜率: 58.39%
趋势多且增强-R-1-2-2 总交易次数: 82 盈利: 739.4968391357269 亏损: -444.7048885122962 最大盈利: 140.35 最大亏损: -83.03 总收益: 294.79 平均盈利: 3.60 typeA: 2.32 胜率: 64.63%
趋势多且增强-R-3-2 总交易次数: 29 盈利: 131.08862700955152 亏损: -34.11947765410041 最大盈利: 26.69 最大亏损: -13.23 总收益: 96.97 平均盈利: 3.34 typeA: 2.19 胜率: 65.52%
趋势多且增强-L3-1-5 总交易次数: 276 盈利: 1885.1495896695446 亏损: -1013.9761719241185 最大盈利: 137.35 最大亏损: -66.32 总收益: 871.17 平均盈利: 3.16 typeA: 2.14 胜率: 67.75%
趋势多且增强-L1-3-9 总交易次数: 38 盈利: 440.62181092156345 亏损: -275.4146245355708 最大盈利: 111.54 最大亏损: -46.29 总收益: 165.21 平均盈利: 4.35 typeA: 1.95 胜率: 44.74%
趋势多且增强-L1-3-2 总交易次数: 48 盈利: 419.4361279691434 亏损: -193.96439924376438 最大盈利: 88.03 最大亏损: -29.60 总收益: 225.47 平均盈利: 4.70 typeA: 1.86 胜率: 39.58%
趋势空且增强-L-PLUS-3-1 总交易次数: 336 盈利: 2247.987587773639 亏损: -1297.7830269895674 最大盈利: 144.27 最大亏损: -60.93 总收益: 950.20 平均盈利: 2.83 typeA: 1.76 胜率: 62.20%
趋势空且增强-L2-3-5 总交易次数: 204 盈利: 1389.3635417210069 亏损: -801.9879025031587 最大盈利: 129.83 最大亏损: -63.36 总收益: 587.38 平均盈利: 2.88 typeA: 1.61 胜率: 55.88%
趋势多且增强-R-2-1 总交易次数: 89 盈利: 638.2826777030565 亏损: -441.96667776738195 最大盈利: 169.96 最大亏损: -46.38 总收益: 196.32 平均盈利: 2.21 typeA: 1.26 胜率: 57.30%
趋势多且增强-L3-1-3 总交易次数: 181 盈利: 1378.9754399309709 亏损: -942.2605259722197 最大盈利: 259.12 最大亏损: -78.51 总收益: 436.71 平均盈利: 2.41 typeA: 1.20 胜率: 49.72%
趋势空且增强-L2-3-3 总交易次数: 384 盈利: 2386.790533735419 亏损: -1751.675826256028 最大盈利: 258.83 最大亏损: -77.48 总收益: 635.11 平均盈利: 1.65 typeA: 1.00 胜率: 60.42%
趋势多且增强-R-3-1 总交易次数: 139 盈利: 769.0097775705856 亏损: -588.4762426425618 最大盈利: 125.40 最大亏损: -73.28 总收益: 180.53 平均盈利: 1.30 typeA: 0.84 胜率: 64.75%
趋势多且增强-L3-1-4-3 总交易次数: 152 盈利: 820.8590052876782 亏损: -627.8407476073028 最大盈利: 97.68 最大亏损: -55.36 总收益: 193.02 平均盈利: 1.27 typeA: 0.79 胜率: 62.50%
趋势多且增强-L3-1-4-4 总交易次数: 312 盈利: 1284.5865675984785 亏损: -989.4222937060584 最大盈利: 127.27 最大亏损: -60.90 总收益: 295.16 平均盈利: 0.95 typeA: 0.63 胜率: 66.35%
趋势空且增强-L-4-2-3 总交易次数: 154 盈利: 601.0640540543837 亏损: -481.8919433842852 最大盈利: 41.42 最大亏损: -59.01 总收益: 119.17 平均盈利: 0.77 typeA: 0.51 胜率: 65.58%
趋势空且增强-L2-3-4 总交易次数: 351 盈利: 1715.3835757579564 亏损: -1448.6167820560433 最大盈利: 102.09 最大亏损: -64.70 总收益: 266.77 平均盈利: 0.76 typeA: 0.44 胜率: 57.83%
趋势空且增强-L1-3-4-2 总交易次数: 183 盈利: 748.7419129688362 亏损: -707.8186594081164 最大盈利: 132.66 最大亏损: -58.81 总收益: 40.92 平均盈利: 0.22 typeA: 0.14 胜率: 61.75%





######################################################################


tradeNumTotal 4063
profitTotal 15684.454723228231
maxLossTotal -119.73
winRateTotal 3215.6900000000005
period month 53
avgRate 60.67
maxDrawdownTotal 24.3
趋势多且增强-L3-1-4-4 总交易次数: 319 盈利: 5336.048800237448 亏损: -1003.5152532609486 最大盈利: 4013.75 最大亏损: -60.90 总收益: 4332.53 平均盈利: 13.58 typeA: 9.03 胜率: 66.46%
趋势空且增强-L2-1-3 总交易次数: 70 盈利: 940.050492412507 亏损: -216.90582361045173 最大盈利: 122.10 最大亏损: -67.37 总收益: 723.14 平均盈利: 10.33 typeA: 7.97 胜率: 77.14%
趋势多且增强-R-1-1-1 总交易次数: 35 盈利: 399.7936970854823 亏损: -120.21936169414755 最大盈利: 74.00 最大亏损: -30.68 总收益: 279.57 平均盈利: 7.99 typeA: 5.48 胜率: 68.57%
趋势空且增强-L-PLUS-4-3 总交易次数: 60 盈利: 744.9041970364726 亏损: -293.72000806136214 最大盈利: 64.48 最大亏损: -38.34 总收益: 451.18 平均盈利: 7.52 typeA: 3.89 胜率: 51.67%
趋势多且增强-L1-3-2 总交易次数: 66 盈利: 900.4101901083701 亏损: -321.3931068436742 最大盈利: 298.52 最大亏损: -29.60 总收益: 579.02 平均盈利: 8.77 typeA: 3.46 胜率: 39.39%
趋势多且增强-R-2-2 总交易次数: 23 盈利: 185.71534700022434 亏损: -75.36337094234466 最大盈利: 36.97 最大亏损: -27.71 总收益: 110.35 平均盈利: 4.80 typeA: 3.13 胜率: 65.22%
趋势空且增强-L1-1-2 总交易次数: 42 盈利: 677.9637673401679 亏损: -460.6696705397751 最大盈利: 206.84 最大亏损: -80.81 总收益: 217.29 平均盈利: 5.17 typeA: 3.08 胜率: 59.52%
趋势多且增强-R-1-1-2 总交易次数: 279 盈利: 3106.837043408698 亏损: -1686.6453711054498 最大盈利: 235.85 最大亏损: -119.73 总收益: 1420.19 平均盈利: 5.09 typeA: 3.07 胜率: 60.22%
趋势多且增强-L3-1-3 总交易次数: 197 盈利: 2189.426854280943 亏损: -1056.1416383875592 最大盈利: 484.02 最大亏损: -78.51 总收益: 1133.29 平均盈利: 5.75 typeA: 2.92 胜率: 50.76%
趋势空且增强-L2-4-2 总交易次数: 175 盈利: 2492.793095847271 亏损: -1427.6963182746074 最大盈利: 388.95 最大亏损: -110.69 总收益: 1065.10 平均盈利: 6.09 typeA: 2.85 胜率: 46.86%
趋势多且增强-L3-1-4-1 总交易次数: 142 盈利: 1695.4601749808648 亏损: -1024.175708410389 最大盈利: 185.55 最大亏损: -90.48 总收益: 671.28 平均盈利: 4.73 typeA: 2.83 胜率: 59.86%
趋势空且增强-L2-2-3 总交易次数: 36 盈利: 321.74008513447353 亏损: -187.78064198832124 最大盈利: 114.24 最大亏损: -37.59 总收益: 133.96 平均盈利: 3.72 typeA: 2.58 胜率: 69.44%
趋势空且增强-11 总交易次数: 166 盈利: 1859.9711969181453 亏损: -1232.4846971913585 最大盈利: 77.83 最大亏损: -89.77 总收益: 627.49 平均盈利: 3.78 typeA: 2.48 胜率: 65.66%
趋势多且增强-R-1-2-2 总交易次数: 82 盈利: 739.4968391357269 亏损: -444.7048885122962 最大盈利: 140.35 最大亏损: -83.03 总收益: 294.79 平均盈利: 3.60 typeA: 2.32 胜率: 64.63%
趋势多且增强-R-3-2 总交易次数: 29 盈利: 131.08862700955152 亏损: -34.11947765410041 最大盈利: 26.69 最大亏损: -13.23 总收益: 96.97 平均盈利: 3.34 typeA: 2.19 胜率: 65.52%
趋势多且增强-L3-1-5 总交易次数: 293 盈利: 1956.7859165590612 亏损: -1056.8367935238439 最大盈利: 137.35 最大亏损: -66.32 总收益: 899.95 平均盈利: 3.07 typeA: 2.10 胜率: 68.26%
趋势多且增强-L1-3-9 总交易次数: 38 盈利: 440.62181092156345 亏损: -275.4146245355708 最大盈利: 111.54 最大亏损: -46.29 总收益: 165.21 平均盈利: 4.35 typeA: 1.95 胜率: 44.74%
趋势空且增强-L-PLUS-3-1 总交易次数: 336 盈利: 2247.987587773639 亏损: -1297.7830269895674 最大盈利: 144.27 最大亏损: -60.93 总收益: 950.20 平均盈利: 2.83 typeA: 1.76 胜率: 62.20%
趋势空且增强-L2-3-5 总交易次数: 204 盈利: 1389.3635417210069 亏损: -801.9879025031587 最大盈利: 129.83 最大亏损: -63.36 总收益: 587.38 平均盈利: 2.88 typeA: 1.61 胜率: 55.88%
趋势多且增强-R-2-1 总交易次数: 89 盈利: 638.2826777030565 亏损: -441.96667776738195 最大盈利: 169.96 最大亏损: -46.38 总收益: 196.32 平均盈利: 2.21 typeA: 1.26 胜率: 57.30%
趋势多且增强-L3-1-4-3 总交易次数: 171 盈利: 987.9221107127103 亏损: -665.3953686428324 最大盈利: 97.68 最大亏损: -55.36 总收益: 322.53 平均盈利: 1.89 typeA: 1.24 胜率: 65.50%
趋势空且增强-L2-3-3 总交易次数: 384 盈利: 2386.790533735419 亏损: -1751.675826256028 最大盈利: 258.83 最大亏损: -77.48 总收益: 635.11 平均盈利: 1.65 typeA: 1.00 胜率: 60.42%
趋势多且增强-R-3-1 总交易次数: 139 盈利: 769.0097775705856 亏损: -588.4762426425618 最大盈利: 125.40 最大亏损: -73.28 总收益: 180.53 平均盈利: 1.30 typeA: 0.84 胜率: 64.75%
趋势空且增强-L-4-2-3 总交易次数: 154 盈利: 601.0640540543837 亏损: -481.8919433842852 最大盈利: 41.42 最大亏损: -59.01 总收益: 119.17 平均盈利: 0.77 typeA: 0.51 胜率: 65.58%
趋势空且增强-L2-3-4 总交易次数: 351 盈利: 1715.3835757579564 亏损: -1448.6167820560433 最大盈利: 102.09 最大亏损: -64.70 总收益: 266.77 平均盈利: 0.76 typeA: 0.44 胜率: 57.83%
趋势空且增强-L1-3-4-2 总交易次数: 183 盈利: 748.7419129688362 亏损: -707.8186594081164 最大盈利: 132.66 最大亏损: -58.81 总收益: 40.92 平均盈利: 0.22 typeA: 0.14 胜率: 61.75%


##################################################################################


tradeNumTotal 3754
profitTotal 16897.952297992906
maxLossTotal -119.73
winRateTotal 3176.880000000001
period month 53
avgRate 59.94
maxDrawdownTotal 23.6
趋势多且增强-L1-3-1 总交易次数: 54 盈利: 4615.165450647675 亏损: -370.42232299344755 最大盈利: 4116.61 最大亏损: -48.26 总收益: 4244.74 平均盈利: 78.61 typeA: 26.20 胜率: 33.33%
趋势多且增强-L1-2-2 总交易次数: 20 盈利: 1163.1322099112742 亏损: -162.21477539442756 最大盈利: 710.67 最大亏损: -57.31 总收益: 1000.92 平均盈利: 50.05 typeA: 20.02 胜率: 40.00%
趋势多且增强-L1-1-6 总交易次数: 74 盈利: 2054.410833867447 亏损: -687.5464099669767 最大盈利: 855.81 最大亏损: -63.73 总收益: 1366.86 平均盈利: 18.47 typeA: 8.24 胜率: 44.59%
趋势多且增强-L1-2-1 总交易次数: 13 盈利: 220.72503108222404 亏损: -66.2813069632484 最大盈利: 76.67 最大亏损: -18.51 总收益: 154.44 平均盈利: 11.88 typeA: 6.40 胜率: 53.85%
趋势空且增强-L2-1-3 总交易次数: 113 盈利: 1435.4352605909346 亏损: -524.3428451879372 最大盈利: 122.17 最大亏损: -70.66 总收益: 911.09 平均盈利: 8.06 typeA: 5.78 胜率: 71.68%
趋势多且增强-R-1-1-1 总交易次数: 35 盈利: 399.7936970854823 亏损: -120.21936169414755 最大盈利: 74.00 最大亏损: -30.68 总收益: 279.57 平均盈利: 7.99 typeA: 5.48 胜率: 68.57%
趋势空且增强-L-PLUS-4-3 总交易次数: 61 盈利: 744.9041970364726 亏损: -296.8578124916643 最大盈利: 64.48 最大亏损: -38.34 总收益: 448.05 平均盈利: 7.35 typeA: 3.73 胜率: 50.82%
趋势多且增强-R-2-2 总交易次数: 23 盈利: 185.71534700022434 亏损: -75.36337094234466 最大盈利: 36.97 最大亏损: -27.71 总收益: 110.35 平均盈利: 4.80 typeA: 3.13 胜率: 65.22%
趋势空且增强-L1-1-2 总交易次数: 42 盈利: 677.9637673401679 亏损: -460.6696705397751 最大盈利: 206.84 最大亏损: -80.81 总收益: 217.29 平均盈利: 5.17 typeA: 3.08 胜率: 59.52%
趋势多且增强-R-1-1-2 总交易次数: 279 盈利: 3106.837043408698 亏损: -1693.220629271398 最大盈利: 235.85 最大亏损: -119.73 总收益: 1413.62 平均盈利: 5.07 typeA: 3.05 胜率: 60.22%
趋势空且增强-L2-4-2 总交易次数: 179 盈利: 2555.4927459360047 亏损: -1427.6963182746074 最大盈利: 388.95 最大亏损: -110.69 总收益: 1127.80 平均盈利: 6.30 typeA: 3.03 胜率: 48.04%
趋势空且增强-11 总交易次数: 169 盈利: 1911.2974643188243 亏损: -1253.3879459919067 最大盈利: 77.83 最大亏损: -89.77 总收益: 657.91 平均盈利: 3.89 typeA: 2.56 胜率: 65.68%
趋势多且增强-L3-1-4-1 总交易次数: 137 盈利: 1569.942670616002 亏损: -1024.175708410389 最大盈利: 185.55 最大亏损: -90.48 总收益: 545.77 平均盈利: 3.98 typeA: 2.33 胜率: 58.39%
趋势多且增强-R-1-2-2 总交易次数: 82 盈利: 739.4968391357269 亏损: -444.7048885122962 最大盈利: 140.35 最大亏损: -83.03 总收益: 294.79 平均盈利: 3.60 typeA: 2.32 胜率: 64.63%
趋势多且增强-R-3-2 总交易次数: 29 盈利: 131.08862700955152 亏损: -34.11947765410041 最大盈利: 26.69 最大亏损: -13.23 总收益: 96.97 平均盈利: 3.34 typeA: 2.19 胜率: 65.52%
趋势多且增强-L3-1-5 总交易次数: 272 盈利: 1909.785946244772 亏损: -1068.4808302373458 最大盈利: 137.35 最大亏损: -66.32 总收益: 841.31 平均盈利: 3.09 typeA: 2.06 胜率: 66.54%
趋势多且增强-L1-3-9 总交易次数: 38 盈利: 440.62181092156345 亏损: -275.4146245355708 最大盈利: 111.54 最大亏损: -46.29 总收益: 165.21 平均盈利: 4.35 typeA: 1.95 胜率: 44.74%
趋势空且增强-L2-3-5 总交易次数: 327 盈利: 2342.9685799678473 亏损: -1271.9977740355162 最大盈利: 251.08 最大亏损: -65.63 总收益: 1070.97 平均盈利: 3.28 typeA: 1.92 胜率: 58.72%
趋势多且增强-L1-3-2 总交易次数: 48 盈利: 421.77552545378796 亏损: -199.13062170772957 最大盈利: 88.03 最大亏损: -29.60 总收益: 222.64 平均盈利: 4.64 typeA: 1.84 胜率: 39.58%
趋势多且增强-L3-1-4-3 总交易次数: 152 盈利: 963.5146689599396 亏损: -628.4176750342585 最大盈利: 97.68 最大亏损: -55.36 总收益: 335.10 平均盈利: 2.20 typeA: 1.36 胜率: 61.84%
趋势多且增强-R-2-1 总交易次数: 89 盈利: 638.2826777030565 亏损: -441.96667776738195 最大盈利: 169.96 最大亏损: -46.38 总收益: 196.32 平均盈利: 2.21 typeA: 1.26 胜率: 57.30%
趋势多且增强-L3-1-3 总交易次数: 177 盈利: 1353.4379238931147 亏损: -928.5073330526589 最大盈利: 259.12 最大亏损: -78.51 总收益: 424.93 平均盈利: 2.40 typeA: 1.18 胜率: 49.15%
趋势空且增强-L-PLUS-3-1 总交易次数: 422 盈利: 2450.1022657287745 亏损: -1718.7927005401027 最大盈利: 144.27 最大亏损: -60.93 总收益: 731.31 平均盈利: 1.73 typeA: 1.05 胜率: 60.66%
趋势多且增强-R-3-1 总交易次数: 138 盈利: 784.7994992534334 亏损: -575.966584823566 最大盈利: 125.40 最大亏损: -73.28 总收益: 208.83 平均盈利: 1.51 typeA: 0.99 胜率: 65.22%
趋势多且增强-L3-1-4-4 总交易次数: 303 盈利: 1272.6948770910408 亏损: -990.9308737815325 最大盈利: 127.27 最大亏损: -60.90 总收益: 281.76 平均盈利: 0.93 typeA: 0.58 胜率: 62.71%
趋势空且增强-L-4-2-3 总交易次数: 165 盈利: 638.0852725627292 亏损: -507.50878567733713 最大盈利: 41.42 最大亏损: -59.01 总收益: 130.58 平均盈利: 0.79 typeA: 0.52 胜率: 66.06%
趋势空且增强-L2-2-3 总交易次数: 120 盈利: 628.8562914766005 亏损: -565.3262881759407 最大盈利: 114.24 最大亏损: -62.86 总收益: 63.53 平均盈利: 0.53 typeA: 0.37 胜率: 69.17%
趋势空且增强-L1-3-4-2 总交易次数: 193 盈利: 821.7502692075666 亏损: -712.8608818002701 最大盈利: 132.66 最大亏损: -58.81 总收益: 108.89 平均盈利: 0.56 typeA: 0.35 胜率: 62.69%



###############################################################################################


tradeNumTotal 3322
profitTotal 15190.508020195628
maxLossTotal -119.73
winRateTotal 3220.9300000000003
period month 53
avgRate 60.77
maxDrawdownTotal 16.5
趋势多且增强-L1-3-1 总交易次数: 47 盈利: 4523.8766161017065 亏损: -280.92218120325316 最大盈利: 4116.61 最大亏损: -33.44 总收益: 4242.95 平均盈利: 90.28 typeA: 30.73 胜率: 34.04%
趋势空且增强-L2-1-3 总交易次数: 92 盈利: 1257.0048437701812 亏损: -208.41524785121575 最大盈利: 122.17 最大亏损: -21.37 总收益: 1048.59 平均盈利: 11.40 typeA: 8.67 胜率: 76.09%
趋势多且增强-L1-2-2 总交易次数: 17 盈利: 452.4657720785475 亏损: -155.9718932889033 最大盈利: 312.53 最大亏损: -57.31 总收益: 296.49 平均盈利: 17.44 typeA: 7.18 胜率: 41.18%
趋势多且增强-R-1-1-1 总交易次数: 35 盈利: 426.56994747720535 亏损: -94.9701642768599 最大盈利: 74.00 最大亏损: -20.93 总收益: 331.60 平均盈利: 9.47 typeA: 6.77 胜率: 71.43%
趋势多且增强-L1-2-1 总交易次数: 10 盈利: 176.46050651041 亏损: -49.71070356435595 最大盈利: 76.67 最大亏损: -18.51 总收益: 126.75 平均盈利: 12.67 typeA: 6.34 胜率: 50.00%
趋势空且增强-11 总交易次数: 148 盈利: 1724.8505661152653 亏损: -567.8758602816031 最大盈利: 77.83 最大亏损: -24.73 总收益: 1156.97 平均盈利: 7.82 typeA: 5.28 胜率: 67.57%
趋势空且增强-L1-1-2 总交易次数: 23 盈利: 234.22429256707383 亏损: -43.44174316770668 最大盈利: 36.28 最大亏损: -16.10 总收益: 190.78 平均盈利: 8.29 typeA: 5.05 胜率: 60.87%
趋势空且增强-L-PLUS-4-3 总交易次数: 56 盈利: 691.3663695603179 亏损: -235.70393899970026 最大盈利: 64.48 最大亏损: -22.59 总收益: 455.66 平均盈利: 8.14 typeA: 4.21 胜率: 51.79%
趋势多且增强-L1-1-6 总交易次数: 50 盈利: 813.3587549791699 亏损: -441.89258472586874 最大盈利: 105.79 最大亏损: -63.73 总收益: 371.47 平均盈利: 7.43 typeA: 3.57 胜率: 48.00%
趋势空且增强-L2-4-2 总交易次数: 122 盈利: 1388.7844935534001 亏损: -521.3728277802185 最大盈利: 388.95 最大亏损: -25.19 总收益: 867.41 平均盈利: 7.11 typeA: 3.55 胜率: 50.00%
趋势多且增强-R-2-2 总交易次数: 23 盈利: 185.71534700022434 亏损: -75.36337094234466 最大盈利: 36.97 最大亏损: -27.71 总收益: 110.35 平均盈利: 4.80 typeA: 3.13 胜率: 65.22%
趋势空且增强-L2-3-5 总交易次数: 307 盈利: 2458.5239341589536 亏损: -882.0452587714886 最大盈利: 251.08 最大亏损: -23.87 总收益: 1576.48 平均盈利: 5.14 typeA: 3.08 胜率: 59.93%
趋势多且增强-L3-1-4-1 总交易次数: 104 盈利: 1197.5642070905244 亏损: -776.0516883070976 最大盈利: 185.55 最大亏损: -90.48 总收益: 421.51 平均盈利: 4.05 typeA: 2.30 胜率: 56.73%
趋势多且增强-R-3-2 总交易次数: 29 盈利: 131.08862700955152 亏损: -34.11947765410041 最大盈利: 26.69 最大亏损: -13.23 总收益: 96.97 平均盈利: 3.34 typeA: 2.19 胜率: 65.52%
趋势多且增强-R-1-2-2 总交易次数: 81 盈利: 697.8357135032479 亏损: -444.7048885122962 最大盈利: 140.35 最大亏损: -83.03 总收益: 253.13 平均盈利: 3.13 typeA: 2.01 胜率: 64.20%
趋势多且增强-L3-1-5 总交易次数: 243 盈利: 1608.579987980669 亏损: -977.9520953407585 最大盈利: 137.35 最大亏损: -66.32 总收益: 630.63 平均盈利: 2.60 typeA: 1.71 胜率: 65.84%
趋势空且增强-L2-2-3 总交易次数: 111 盈利: 586.8078891536811 亏损: -315.6180567713042 最大盈利: 114.24 最大亏损: -24.97 总收益: 271.19 平均盈利: 2.44 typeA: 1.69 胜率: 69.37%
趋势空且增强-L-PLUS-3-1 总交易次数: 395 盈利: 2353.247170299773 亏损: -1264.6141951064924 最大盈利: 144.27 最大亏损: -25.03 总收益: 1088.63 平均盈利: 2.76 typeA: 1.67 胜率: 60.76%
趋势多且增强-R-1-1-2 总交易次数: 239 盈利: 2105.6458802357856 亏损: -1493.5293504267222 最大盈利: 100.70 最大亏损: -119.73 总收益: 612.12 平均盈利: 2.56 typeA: 1.55 胜率: 60.67%
趋势多且增强-L3-1-4-3 总交易次数: 144 盈利: 923.7211636843896 亏损: -618.0594373162207 最大盈利: 97.68 最大亏损: -55.36 总收益: 305.66 平均盈利: 2.12 typeA: 1.31 胜率: 61.81%
趋势空且增强-L1-3-4-2 总交易次数: 172 盈利: 736.3602966604856 亏损: -384.35364738609064 最大盈利: 132.66 最大亏损: -21.25 总收益: 352.01 平均盈利: 2.05 typeA: 1.30 胜率: 63.37%
趋势多且增强-R-2-1 总交易次数: 86 盈利: 615.6763372273205 亏损: -424.76489050408793 最大盈利: 169.96 最大亏损: -46.38 总收益: 190.91 平均盈利: 2.22 typeA: 1.26 胜率: 56.98%
趋势空且增强-L-4-2-3 总交易次数: 151 盈利: 584.4495406195388 亏损: -318.2139067592779 最大盈利: 41.42 最大亏损: -20.50 总收益: 266.24 平均盈利: 1.76 typeA: 1.16 胜率: 65.56%
趋势多且增强-R-3-1 总交易次数: 130 盈利: 749.2297676143 亏损: -549.4437101228417 最大盈利: 125.40 最大亏损: -73.28 总收益: 199.79 平均盈利: 1.54 typeA: 0.99 胜率: 64.62%
趋势多且增强-L3-1-3 总交易次数: 153 盈利: 988.0444183728115 亏损: -811.5349840703548 最大盈利: 127.27 最大亏损: -78.51 总收益: 176.51 平均盈利: 1.15 typeA: 0.57 胜率: 49.67%
趋势多且增强-L1-3-2 总交易次数: 42 盈利: 246.2454659298908 亏损: -190.29211022229555 最大盈利: 88.03 最大亏损: -29.60 总收益: 55.95 平均盈利: 1.33 typeA: 0.48 胜率: 35.71%
趋势多且增强-L3-1-4-4 总交易次数: 288 盈利: 1193.0058620675627 亏损: -970.387391948989 最大盈利: 127.27 最大亏损: -60.90 总收益: 222.62 平均盈利: 0.77 typeA: 0.47 胜率: 61.11%
趋势多且增强-L1-3-9 总交易次数: 24 盈利: 175.29659998562929 亏损: -234.96674580940257 最大盈利: 57.85 最大亏损: -46.29 总收益: -59.67 平均盈利: -2.49 typeA: -1.04 胜率: 41.67%


#################################################################


    ========== 回测结果 ==========
          总交易次数:     137
    盈利次数:       56
    亏损次数:       81
          胜率:          40.88%
          总收益:        189.83 USDT
          盈亏比:        1.38
    rw:        0.0122
    rl:        0.0061
    carry:        18.29
          =============================

tradeNumTotal 137
profitTotal 162.22944903738062
maxLossTotal -23.1
winRateTotal 40.88
period month 1
avgRate 40.88
maxDrawdownTotal 10.8
趋势空且增强-R-2 总交易次数: 2 盈利: 44.31517495662257 亏损: 0 最大盈利: 37.29 最大亏损: 7.03 总收益: 44.32 平均盈利: 22.16 typeA: 22.16 胜率: 100.00%
趋势空且增强-L-4 总交易次数: 8 盈利: 83.07916994367326 亏损: -16.2791692855594 最大盈利: 19.68 最大亏损: -8.30 总收益: 66.80 平均盈利: 8.35 typeA: 5.22 胜率: 62.50%
趋势空且增强-L-3 总交易次数: 4 盈利: 20.072828712141515 亏损: 0 最大盈利: 9.03 最大亏损: 1.25 总收益: 20.07 平均盈利: 5.02 typeA: 5.02 胜率: 100.00%
趋势多且增强-R-8 总交易次数: 7 盈利: 58.08196039298871 亏损: -9.887533390844936 最大盈利: 36.03 最大亏损: -6.10 总收益: 48.19 平均盈利: 6.88 typeA: 4.92 胜率: 71.43%
趋势多且增强-L-8 总交易次数: 18 盈利: 255.04697771383184 亏损: -60.90802476649725 最大盈利: 47.82 最大亏损: -16.81 总收益: 194.14 平均盈利: 10.79 typeA: 4.79 胜率: 44.44%
趋势多且增强-R-9 总交易次数: 6 盈利: 51.17023595842475 亏损: -6.256323936237603 最大盈利: 29.71 最大亏损: -4.07 总收益: 44.91 平均盈利: 7.49 typeA: 3.74 胜率: 50.00%
趋势多且增强-R-4 总交易次数: 6 盈利: 18.553577477832476 亏损: -11.899183513076956 最大盈利: 9.66 最大亏损: -11.90 总收益: 6.65 平均盈利: 1.11 typeA: 0.92 胜率: 83.33%
趋势空且增强-R-3 总交易次数: 8 盈利: 25.450732439501863 亏损: -16.531294139859472 最大盈利: 19.00 最大亏损: -7.92 总收益: 8.92 平均盈利: 1.11 typeA: 0.56 胜率: 50.00%
趋势多且增强-L-9 总交易次数: 12 盈利: 0 亏损: -100.708986882555 最大盈利: -1.40 最大亏损: -23.10 总收益: -100.71 平均盈利: -8.39 typeA: 0.00 胜率: 0.00%
趋势多且增强-L-7 总交易次数: 7 盈利: 0 亏损: -37.73002105758395 最大盈利: -3.22 最大亏损: -11.08 总收益: -37.73 平均盈利: -5.39 typeA: 0.00 胜率: 0.00%
趋势空且增强-R-10 总交易次数: 2 盈利: 0 亏损: -8.313140261951323 最大盈利: -0.95 最大亏损: -7.37 总收益: -8.31 平均盈利: -4.16 typeA: 0.00 胜率: 0.00%
趋势多且增强-L-2 总交易次数: 2 盈利: 0 亏损: -5.676404702846632 最大盈利: -2.83 最大亏损: -2.85 总收益: -5.68 平均盈利: -2.84 typeA: 0.00 胜率: 0.00%
趋势多且增强-R-6 总交易次数: 12 盈利: 18.39783396022094 亏损: -28.29569245580707 最大盈利: 10.79 最大亏损: -14.89 总收益: -9.90 平均盈利: -0.82 typeA: -0.34 胜率: 41.67%
趋势多且增强-L-6 总交易次数: 13 盈利: 34.350934581027055 亏损: -60.662324488451254 最大盈利: 17.97 最大亏损: -14.79 总收益: -26.31 平均盈利: -2.02 typeA: -0.47 胜率: 23.08%
趋势空且增强-L-5 总交易次数: 11 盈利: 43.49193948755489 亏损: -57.438283036119834 最大盈利: 20.23 最大亏损: -16.21 总收益: -13.95 平均盈利: -1.27 typeA: -0.58 胜率: 45.45%
趋势空且增强-R-5 总交易次数: 10 盈利: 21.710355220245734 亏损: -46.46243297633758 最大盈利: 11.84 最大亏损: -15.31 总收益: -24.75 平均盈利: -2.48 typeA: -0.74 胜率: 30.00%
趋势多且增强-R-7 总交易次数: 9 盈利: 9.756187120381231 亏损: -26.59964403333111 最大盈利: 5.92 最大亏损: -14.39 总收益: -16.84 平均盈利: -1.87 typeA: -0.83 胜率: 44.44%

##################################################################

   ========== 回测结果 ==========
          总交易次数:     3770
    盈利次数:       998
    亏损次数:       2772
          胜率:          26.47%
          总收益:        6513.39 USDT
          盈亏比:        1.22
    rw:        0.0361
    rl:        0.0107
    carry:        4.26
          =============================

tradeNumTotal 3770
profitTotal 5752.787070190502
maxLossTotal -143.14
winRateTotal 1466.3899999999994
period month 54
avgRate 27.16
maxDrawdownTotal 54.9
趋势多且增强-L-2 总交易次数: 14 盈利: 1147.8710014855517 亏损: -74.05404725241634 最大盈利: 741.41 最大亏损: -34.16 总收益: 1073.82 平均盈利: 76.70 typeA: 43.83 胜率: 57.14%
趋势多且增强-L-1 总交易次数: 2 盈利: 115.76642736374335 亏损: -2.4006719184429537 最大盈利: 115.77 最大亏损: -2.40 总收益: 113.37 平均盈利: 56.68 typeA: 28.34 胜率: 50.00%
趋势多且增强-L-3 总交易次数: 52 盈利: 3741.178705862508 亏损: -491.24821330087553 最大盈利: 2903.42 最大亏损: -115.00 总收益: 3249.93 平均盈利: 62.50 typeA: 27.64 胜率: 44.23%
趋势多且增强-L-7 总交易次数: 296 盈利: 4511.560961461264 亏损: -2949.4630606342366 最大盈利: 1522.31 最大亏损: -143.14 总收益: 1562.10 平均盈利: 5.28 typeA: 1.46 胜率: 27.70%
趋势空且增强-R-7 总交易次数: 315 盈利: 2941.616765373088 亏损: -2500.281460931684 最大盈利: 214.95 最大亏损: -61.90 总收益: 441.34 平均盈利: 1.40 typeA: 0.40 胜率: 28.89%
趋势多且增强-L-8 总交易次数: 655 盈利: 5692.117771730412 亏损: -4755.704859241892 最大盈利: 392.38 最大亏损: -113.62 总收益: 936.41 平均盈利: 1.43 typeA: 0.36 胜率: 25.19%
趋势多且增强-L-9 总交易次数: 513 盈利: 4032.721395662266 亏损: -3276.5162822241377 最大盈利: 280.49 最大亏损: -73.37 总收益: 756.21 平均盈利: 1.47 typeA: 0.32 胜率: 22.03%
趋势多且增强-L-4 总交易次数: 49 盈利: 605.8295999852879 亏损: -574.1866941363127 最大盈利: 203.29 最大亏损: -56.19 总收益: 31.64 平均盈利: 0.65 typeA: 0.20 胜率: 30.61%
趋势空且增强-R-9 总交易次数: 461 盈利: 3687.118113577923 亏损: -3321.4199755828563 最大盈利: 348.31 最大亏损: -86.55 总收益: 365.70 平均盈利: 0.79 typeA: 0.20 胜率: 24.73%
趋势空且增强-R-3 总交易次数: 82 盈利: 741.7478722206943 亏损: -736.9107923556588 最大盈利: 132.25 最大亏损: -74.62 总收益: 4.84 平均盈利: 0.06 typeA: 0.02 胜率: 32.93%
趋势空且增强-R-5 总交易次数: 106 盈利: 926.6600348467028 亏损: -976.2984912061152 最大盈利: 118.62 最大亏损: -74.29 总收益: -49.64 平均盈利: -0.47 typeA: -0.15 胜率: 31.13%
趋势空且增强-R-8 总交易次数: 572 盈利: 3775.537643615874 亏损: -4181.067581033291 最大盈利: 174.80 最大亏损: -62.32 总收益: -405.53 平均盈利: -0.71 typeA: -0.19 胜率: 27.10%
趋势多且增强-L-10 总交易次数: 46 盈利: 28.61035071842572 亏损: -254.94046967098754 最大盈利: 20.14 最大亏损: -26.25 总收益: -226.33 平均盈利: -4.92 typeA: -0.21 胜率: 4.35%
趋势空且增强-R-6 总交易次数: 189 盈利: 1436.6718706894765 亏损: -1633.3524833404324 最大盈利: 123.62 最大亏损: -95.14 总收益: -196.68 平均盈利: -1.04 typeA: -0.31 胜率: 29.63%
趋势多且增强-L-6 总交易次数: 150 盈利: 1304.2349619480237 亏损: -1488.1101989571332 最大盈利: 283.56 最大亏损: -89.07 总收益: -183.88 平均盈利: -1.23 typeA: -0.36 胜率: 29.33%
趋势空且增强-R-1 总交易次数: 10 盈利: 124.31350594926602 亏损: -134.0734881215084 最大盈利: 59.91 最大亏损: -28.47 总收益: -9.76 平均盈利: -0.98 typeA: -0.39 胜率: 40.00%
趋势空且增强-R-4 总交易次数: 75 盈利: 469.6038035590538 亏损: -642.4739794504184 最大盈利: 211.45 最大亏损: -40.13 总收益: -172.87 平均盈利: -2.30 typeA: -0.58 胜率: 25.33%
趋势多且增强-L-5 总交易次数: 100 盈利: 788.2397505578306 亏损: -1028.5197253047231 最大盈利: 87.00 最大亏损: -86.34 总收益: -240.28 平均盈利: -2.40 typeA: -0.79 胜率: 33.00%
趋势空且增强-R-10 总交易次数: 62 盈利: 156.32306418288925 亏损: -441.11451623497965 最大盈利: 36.56 最大亏损: -39.95 总收益: -284.79 平均盈利: -4.59 typeA: -0.81 胜率: 17.74%
趋势空且增强-R-2 总交易次数: 21 盈利: 66.51327102861724 亏损: -318.7128107301477 最大盈利: 53.70 最大亏损: -60.14 总收益: -252.20 平均盈利: -12.01 typeA: -1.14 胜率: 9.52%


############################################################

    ========== 回测结果 ==========
          总交易次数:     1437
    盈利次数:       439
    亏损次数:       998
          胜率:          30.55%
          总收益:        6557.49 USDT
          盈亏比:        1.61
    rw:        0.0378
    rl:        0.0108
    carry:        9.90
          =============================

tradeNumTotal 1437
profitTotal 6267.689637458898
maxLossTotal -185.62
winRateTotal 1652.7700000000002
period month 54
avgRate 30.61
maxDrawdownTotal 22.8
趋势空且增强-R1-5-3 总交易次数: 5 盈利: 233.61194114819676 亏损: -68.65994970446482 最大盈利: 163.85 最大亏损: -48.96 总收益: 164.95 平均盈利: 32.99 typeA: 19.79 胜率: 60.00%
趋势多且增强-L1-5-1 总交易次数: 117 盈利: 3390.2510935369423 亏损: -1525.4558432538927 最大盈利: 929.24 最大亏损: -82.83 总收益: 1864.80 平均盈利: 15.94 typeA: 6.95 胜率: 43.59%
趋势多且增强-L1-5-3 总交易次数: 189 盈利: 5105.899086109286 亏损: -1648.6825691681256 最大盈利: 3521.33 最大亏损: -185.62 总收益: 3457.22 平均盈利: 18.29 typeA: 6.39 胜率: 34.92%
趋势多且增强-L1-5-4 总交易次数: 246 盈利: 2633.5864923550175 亏损: -1905.5695171375892 最大盈利: 269.33 最大亏损: -81.72 总收益: 728.02 平均盈利: 2.96 typeA: 0.85 胜率: 28.86%
趋势多且增强-L1-5-5 总交易次数: 773 盈利: 4858.837696550831 亏损: -4364.907772432759 最大盈利: 1025.93 最大亏损: -84.50 总收益: 493.93 平均盈利: 0.64 typeA: 0.18 胜率: 28.46%
趋势多且增强-L1-5-2 总交易次数: 107 盈利: 1007.9122268064572 亏损: -1159.3332473509365 最大盈利: 246.83 最大亏损: -47.99 总收益: -151.42 平均盈利: -1.42 typeA: -0.37 胜率: 26.17%


        ========== 回测结果 ==========
          总交易次数:     1445
    盈利次数:       438
    亏损次数:       1007
          胜率:          30.31%
          总收益:        6644.24 USDT
          盈亏比:        1.63
    rw:        0.0379
    rl:        0.0106
    carry:        10.10
          =============================

tradeNumTotal 1445
profitTotal 6352.839852130162
maxLossTotal -185.62
winRateTotal 1640.4100000000003
period month 54
avgRate 30.38
maxDrawdownTotal 21.6
趋势空且增强-R1-5-3 总交易次数: 5 盈利: 233.61194114819676 亏损: -68.65994970446482 最大盈利: 163.85 最大亏损: -48.96 总收益: 164.95 平均盈利: 32.99 typeA: 19.79 胜率: 60.00%
趋势多且增强-L1-5-1 总交易次数: 117 盈利: 3397.9145076302293 亏损: -1457.817809497072 最大盈利: 929.24 最大亏损: -82.83 总收益: 1940.10 平均盈利: 16.58 typeA: 7.23 胜率: 43.59%
趋势多且增强-L1-5-3 总交易次数: 190 盈利: 5119.568038252834 亏损: -1649.4193546449198 最大盈利: 3521.33 最大亏损: -185.62 总收益: 3470.15 平均盈利: 18.26 typeA: 6.44 胜率: 35.26%
趋势多且增强-L1-5-4 总交易次数: 246 盈利: 2635.9755769707417 亏损: -1907.4942816896955 最大盈利: 269.33 最大亏损: -81.72 总收益: 728.48 平均盈利: 2.96 typeA: 0.85 胜率: 28.86%
趋势多且增强-L1-5-5 总交易次数: 780 盈利: 4872.67091342028 亏损: -4375.76295350795 最大盈利: 1025.93 最大亏损: -84.50 总收益: 496.91 平均盈利: 0.64 typeA: 0.18 胜率: 28.08%
趋势多且增强-L1-5-2 总交易次数: 107 盈利: 995.8560454107356 亏损: -1152.202821658684 最大盈利: 246.83 最大亏损: -47.99 总收益: -156.35 平均盈利: -1.46 typeA: -0.37 胜率: 25.23%


    ========== 回测结果 ==========
          总交易次数:     2403
    盈利次数:       806
    亏损次数:       1597
          胜率:          33.54%
          总收益:        10713.75 USDT
          盈亏比:        1.50
    rw:        0.0391
    rl:        0.0135
    carry:        7.94
          =============================

tradeNumTotal 2403
profitTotal 10228.152423677366
maxLossTotal -145.68
winRateTotal 1810.79
period month 54
avgRate 33.53
maxDrawdownTotal 39.5
趋势多且增强-R-2-4 总交易次数: 793 盈利: 12043.865927614846 亏损: -5574.99441252996 最大盈利: 4757.46 最大亏损: -145.68 总收益: 6468.87 平均盈利: 8.16 typeA: 2.45 胜率: 30.01%
趋势多且增强-R-2-2 总交易次数: 286 盈利: 4748.453850937002 亏损: -2586.927056238636 最大盈利: 989.88 最大亏损: -116.52 总收益: 2161.53 平均盈利: 7.56 typeA: 2.03 胜率: 26.92%
趋势空且增强-R-1-1 总交易次数: 78 盈利: 1433.0270309975283 亏损: -1155.6191660694617 最大盈利: 172.68 最大亏损: -135.54 总收益: 277.41 平均盈利: 3.56 typeA: 1.82 胜率: 51.28%
趋势多且增强-R-2-3 总交易次数: 320 盈利: 3580.1624810056387 亏损: -2645.8758978873834 最大盈利: 508.99 最大亏损: -49.54 总收益: 934.29 平均盈利: 2.92 typeA: 0.79 胜率: 27.19%
趋势多且增强-R-2-1 总交易次数: 281 盈利: 3184.269804905269 亏损: -2653.2634215486746 最大盈利: 444.78 最大亏损: -98.88 总收益: 531.01 平均盈利: 1.89 typeA: 0.61 胜率: 32.38%
趋势空且增强-R-1-4 总交易次数: 343 盈利: 3539.54428622326 亏损: -3162.2963619323623 最大盈利: 165.56 最大亏损: -121.14 总收益: 377.25 平均盈利: 1.10 typeA: 0.50 胜率: 45.19%
趋势空且增强-R-1-3 总交易次数: 232 盈利: 2653.8149173356837 亏损: -2605.355313510181 最大盈利: 265.88 最大亏损: -83.11 总收益: 48.46 平均盈利: 0.21 typeA: 0.08 胜率: 36.64%
趋势空且增强-R-1-2 总交易次数: 70 盈利: 955.3940309939862 亏损: -1040.4482766191006 最大盈利: 213.34 最大亏损: -96.26 总收益: -85.05 平均盈利: -1.22 typeA: -0.57 胜率: 47.14%


     ========== 回测结果 ==========
          总交易次数:     3893
    盈利次数:       1152
    亏损次数:       2741
          胜率:          29.59%
          总收益:        12139.16 USDT
          盈亏比:        1.49
    rw:        0.0315
    rl:        0.0090
    carry:        10.58
          =============================

tradeNumTotal 3893
profitTotal 11354.964407428846
maxLossTotal -209.33
winRateTotal 1584.45
period month 54
avgRate 29.34
maxDrawdownTotal 63.3
趋势多且增强-R-2-1 总交易次数: 410 盈利: 5039.121870001548 亏损: -3147.601570154759 最大盈利: 1454.15 最大亏损: -139.15 总收益: 1891.52 平均盈利: 4.61 typeA: 1.40 胜率: 30.24%
趋势空且增强-R-1-1 总交易次数: 126 盈利: 1991.6524313292807 亏损: -1603.8468489671031 最大盈利: 359.44 最大亏损: -135.54 总收益: 387.81 平均盈利: 3.08 typeA: 1.27 胜率: 41.27%
趋势多且增强-R-2-4 总交易次数: 1323 盈利: 13026.331919144077 亏损: -5814.12851332683 最大盈利: 5355.48 最大亏损: -81.15 总收益: 7212.20 平均盈利: 5.45 typeA: 1.26 胜率: 23.20%
趋势多且增强-R-2-3 总交易次数: 521 盈利: 4078.2146168202894 亏损: -2776.261381275345 最大盈利: 508.99 最大亏损: -118.03 总收益: 1301.95 平均盈利: 2.50 typeA: 0.69 胜率: 27.45%
趋势空且增强-R-1-3 总交易次数: 364 盈利: 3319.0459073435895 亏损: -2835.032343852644 最大盈利: 265.88 最大亏损: -83.11 总收益: 484.01 平均盈利: 1.33 typeA: 0.47 胜率: 35.71%
趋势多且增强-R-2-2 总交易次数: 440 盈利: 3287.8719950167856 亏损: -2762.716924309179 最大盈利: 696.08 最大亏损: -94.83 总收益: 525.16 平均盈利: 1.19 typeA: 0.33 胜率: 27.95%
趋势空且增强-R-1-4 总交易次数: 580 盈利: 4683.868391246378 亏损: -4224.076976359729 最大盈利: 277.93 最大亏损: -121.14 总收益: 459.79 平均盈利: 0.79 typeA: 0.31 胜率: 38.97%
趋势空且增强-R-1-2 总交易次数: 129 盈利: 1301.9745922358647 亏损: -1425.2527574632365 最大盈利: 213.34 最大亏损: -209.33 总收益: -123.28 平均盈利: -0.96 typeA: -0.35 胜率: 36.43%


  ========== 回测结果 ==========
          总交易次数:     4245
    盈利次数:       1281
    亏损次数:       2964
          胜率:          30.18%
          总收益:        13131.61 USDT
          盈亏比:        1.52
    rw:        0.0298
    rl:        0.0086
    carry:        11.76
          =============================

tradeNumTotal 4245
profitTotal 12276.809146405132
maxLossTotal -145.68
winRateTotal 1636.1100000000001
period month 54
avgRate 30.30
maxDrawdownTotal 48.4
趋势空且增强-R-1-1 总交易次数: 66 盈利: 1344.3055816150982 亏损: -902.6613411600279 最大盈利: 172.68 最大亏损: -135.54 总收益: 441.64 平均盈利: 6.69 typeA: 3.55 胜率: 53.03%
趋势多且增强-R-2-1 总交易次数: 380 盈利: 5195.224959677611 亏损: -2849.6051705158616 最大盈利: 1634.88 最大亏损: -115.31 总收益: 2345.62 平均盈利: 6.17 typeA: 1.90 胜率: 30.79%
趋势多且增强-R-2-4 总交易次数: 1228 盈利: 12321.309227351196 亏损: -5761.187079969851 最大盈利: 5355.48 最大亏损: -145.68 总收益: 6560.12 平均盈利: 5.34 typeA: 1.27 胜率: 23.78%
趋势多且增强-R-2-3 总交易次数: 468 盈利: 4152.057237163438 亏损: -2567.9310606570975 最大盈利: 508.99 最大亏损: -79.82 总收益: 1584.13 平均盈利: 3.38 typeA: 1.00 胜率: 29.49%
趋势多且增强-R-2-2 总交易次数: 399 盈利: 3984.544271375804 亏损: -2672.797322431227 最大盈利: 810.14 最大亏损: -94.83 总收益: 1311.75 平均盈利: 3.29 typeA: 0.90 胜率: 27.32%
趋势空且增强-R-1-3 总交易次数: 187 盈利: 2444.87066719916 亏损: -2056.670254060641 最大盈利: 265.88 最大亏损: -83.11 总收益: 388.20 平均盈利: 2.08 typeA: 0.81 胜率: 39.04%
趋势空且增强-R-3-1 总交易次数: 49 盈利: 613.7917097332653 亏损: -500.07441761009534 最大盈利: 359.44 最大亏损: -107.67 总收益: 113.72 平均盈利: 2.32 typeA: 0.71 胜率: 30.61%
趋势空且增强-R-3-4 总交易次数: 192 盈利: 1154.985821706772 亏损: -922.8309379423832 最大盈利: 277.93 最大亏损: -115.68 总收益: 232.15 平均盈利: 1.21 typeA: 0.38 胜率: 31.77%
趋势空且增强-R-3-2 总交易次数: 55 盈利: 317.15248388401926 亏损: -256.27487824792905 最大盈利: 126.46 最大亏损: -38.22 总收益: 60.88 平均盈利: 1.11 typeA: 0.30 胜率: 27.27%
趋势空且增强-R-3-3 总交易次数: 122 盈利: 646.2793582439672 亏损: -596.7192314542144 最大盈利: 123.26 最大亏损: -42.61 总收益: 49.56 平均盈利: 0.41 typeA: 0.13 胜率: 31.15%
趋势空且增强-R-3-5 总交易次数: 747 盈利: 2938.754694092465 亏损: -2709.3628370445745 最大盈利: 218.05 最大亏损: -115.89 总收益: 229.39 平均盈利: 0.31 typeA: 0.09 胜率: 30.92%
趋势空且增强-R-1-4 总交易次数: 294 盈利: 2784.9339261625505 亏损: -2729.317377335624 最大盈利: 150.44 最大亏损: -121.14 总收益: 55.62 平均盈利: 0.19 typeA: 0.08 胜率: 44.56%
趋势空且增强-R-1-2 总交易次数: 58 盈利: 616.6594939027195 亏损: -857.8283772732557 最大盈利: 130.62 最大亏损: -96.26 总收益: -241.17 平均盈利: -4.16 typeA: -1.86 胜率: 44



          ========== 回测结果 ==========
          总交易次数:     4231
    盈利次数:       1284
    亏损次数:       2947
          胜率:          30.35%
          总收益:        13246.44 USDT
          盈亏比:        1.52
    rw:        0.0298
    rl:        0.0086
    carry:        11.78
          =============================

tradeNumTotal 4231
profitTotal 12394.244629538369
maxLossTotal -145.68
winRateTotal 1644.9400000000003
period month 54
avgRate 30.46
maxDrawdownTotal 50.2
趋势空且增强-R-1-1 总交易次数: 66 盈利: 1344.3055816150982 亏损: -902.6613411600279 最大盈利: 172.68 最大亏损: -135.54 总收益: 441.64 平均盈利: 6.69 typeA: 3.55 胜率: 53.03%
趋势多且增强-R-2-1 总交易次数: 380 盈利: 5210.66282755687 亏损: -2843.1071846073437 最大盈利: 1634.88 最大亏损: -115.31 总收益: 2367.56 平均盈利: 6.23 typeA: 1.93 胜率: 31.05%
趋势多且增强-R-2-4 总交易次数: 1223 盈利: 12426.096052522253 亏损: -5750.620717107794 最大盈利: 5355.48 最大亏损: -145.68 总收益: 6675.48 平均盈利: 5.46 typeA: 1.32 胜率: 24.20%
趋势多且增强-R-2-3 总交易次数: 463 盈利: 4208.292974420045 亏损: -2607.292750413255 最大盈利: 508.99 最大亏损: -79.82 总收益: 1601.00 平均盈利: 3.46 typeA: 1.03 胜率: 29.81%
趋势多且增强-R-2-2 总交易次数: 396 盈利: 3969.8470826645907 亏损: -2712.1156325244556 最大盈利: 810.14 最大亏损: -94.83 总收益: 1257.73 平均盈利: 3.18 typeA: 0.87 胜率: 27.27%
趋势空且增强-R-1-3 总交易次数: 187 盈利: 2444.87066719916 亏损: -2056.670254060641 最大盈利: 265.88 最大亏损: -83.11 总收益: 388.20 平均盈利: 2.08 typeA: 0.81 胜率: 39.04%
趋势空且增强-R-3-1 总交易次数: 49 盈利: 613.7917097332653 亏损: -500.07441761009534 最大盈利: 359.44 最大亏损: -107.67 总收益: 113.72 平均盈利: 2.32 typeA: 0.71 胜率: 30.61%
趋势空且增强-R-3-4 总交易次数: 192 盈利: 1154.985821706772 亏损: -922.8309379423832 最大盈利: 277.93 最大亏损: -115.68 总收益: 232.15 平均盈利: 1.21 typeA: 0.38 胜率: 31.77%
趋势空且增强-R-3-2 总交易次数: 55 盈利: 317.15248388401926 亏损: -256.27487824792905 最大盈利: 126.46 最大亏损: -38.22 总收益: 60.88 平均盈利: 1.11 typeA: 0.30 胜率: 27.27%
趋势空且增强-R-3-3 总交易次数: 122 盈利: 646.2793582439672 亏损: -596.7192314542144 最大盈利: 123.26 最大亏损: -42.61 总收益: 49.56 平均盈利: 0.41 typeA: 0.13 胜率: 31.15%
趋势空且增强-R-3-5 总交易次数: 746 盈利: 2953.4425867087984 亏损: -2709.3628370445745 最大盈利: 218.05 最大亏损: -115.89 总收益: 244.08 平均盈利: 0.33 typeA: 0.10 胜率: 30.83%
趋势空且增强-R-1-4 总交易次数: 294 盈利: 2784.9339261625505 亏损: -2729.317377335624 最大盈利: 150.44 最大亏损: -121.14 总收益: 55.62 平均盈利: 0.19 typeA: 0.08 胜率: 44.56%
趋势空且增强-R-1-2 总交易次数: 58 盈利: 616.6594939027195 亏损: -857.8283772732557 最大盈利: 130.62 最大亏损: -96.26 总收益: -241.17 平均盈利: -4.16 typeA: -1.86 胜率: 44.83%




          ========== 回测结果 ==========
          总交易次数:     4238
    盈利次数:       1287
    亏损次数:       2951
          胜率:          30.37%
          总收益:        13284.95 USDT
          盈亏比:        1.52
    rw:        0.0298
    rl:        0.0087
    carry:        11.77
          =============================

tradeNumTotal 4238
profitTotal 12431.35480455341
maxLossTotal -145.68
winRateTotal 1645.8000000000002
period month 54
avgRate 30.48
maxDrawdownTotal 50.2
趋势空且增强-R-1-1 总交易次数: 67 盈利: 1382.3282779651465 亏损: -902.6613411600279 最大盈利: 172.68 最大亏损: -135.54 总收益: 479.67 平均盈利: 7.16 typeA: 3.85 胜率: 53.73%
趋势多且增强-L-2-4 总交易次数: 8 盈利: 104.39655162569177 亏损: -30.74537885943802 最大盈利: 77.09 最大亏损: -15.61 总收益: 73.65 平均盈利: 9.21 typeA: 3.45 胜率: 37.50%
趋势多且增强-R-2-1 总交易次数: 379 盈利: 5210.66282755687 亏损: -2838.4675753711094 最大盈利: 1634.88 最大亏损: -115.31 总收益: 2372.20 平均盈利: 6.26 typeA: 1.95 胜率: 31.13%
趋势多且增强-L-2-2 总交易次数: 3 盈利: 33.39395028638319 亏损: -19.297584465305665 最大盈利: 33.39 最大亏损: -13.68 总收益: 14.10 平均盈利: 4.70 typeA: 1.57 胜率: 33.33%
趋势多且增强-R-2-4 总交易次数: 1220 盈利: 12426.096052522253 亏损: -5740.490898703261 最大盈利: 5355.48 最大亏损: -145.68 总收益: 6685.61 平均盈利: 5.48 typeA: 1.33 胜率: 24.26%
趋势多且增强-R-2-3 总交易次数: 462 盈利: 4188.480096088921 亏损: -2607.292750413255 最大盈利: 508.99 最大亏损: -79.82 总收益: 1581.19 平均盈利: 3.42 typeA: 1.01 胜率: 29.65%
趋势多且增强-R-2-2 总交易次数: 395 盈利: 3969.8470826645907 亏损: -2707.5168530751225 最大盈利: 810.14 最大亏损: -94.83 总收益: 1262.33 平均盈利: 3.20 typeA: 0.87 胜率: 27.34%
趋势空且增强-R-1-3 总交易次数: 187 盈利: 2444.87066719916 亏损: -2056.670254060641 最大盈利: 265.88 最大亏损: -83.11 总收益: 388.20 平均盈利: 2.08 typeA: 0.81 胜率: 39.04%
趋势空且增强-R-3-1 总交易次数: 49 盈利: 613.7917097332653 亏损: -500.07441761009534 最大盈利: 359.44 最大亏损: -107.67 总收益: 113.72 平均盈利: 2.32 typeA: 0.71 胜率: 30.61%
趋势空且增强-R-3-4 总交易次数: 192 盈利: 1154.985821706772 亏损: -922.8309379423832 最大盈利: 277.93 最大亏损: -115.68 总收益: 232.15 平均盈利: 1.21 typeA: 0.38 胜率: 31.77%
趋势空且增强-R-3-2 总交易次数: 55 盈利: 317.15248388401926 亏损: -256.27487824792905 最大盈利: 126.46 最大亏损: -38.22 总收益: 60.88 平均盈利: 1.11 typeA: 0.30 胜率: 27.27%
趋势空且增强-R-3-5 总交易次数: 746 盈利: 2953.4425867087984 亏损: -2709.3628370445745 最大盈利: 218.05 最大亏损: -115.89 总收益: 244.08 平均盈利: 0.33 typeA: 0.10 胜率: 30.83%
趋势空且增强-R-1-4 总交易次数: 294 盈利: 2796.6965337430797 亏损: -2730.938469444503 最大盈利: 150.44 最大亏损: -121.14 总收益: 65.76 平均盈利: 0.22 typeA: 0.10 胜率: 44.22%
趋势多且增强-L-2-1 总交易次数: 1 盈利: 0 亏损: -30.35269841269853 最大盈利: -30.35 最大亏损: -30.35 总收益: -30.35 平均盈利: -30.35 typeA: 0.00 胜率: 0.00%
趋势空且增强-R-3-3 总交易次数: 122 盈利: 579.6751525037001 亏损: -596.7192314542144 最大盈利: 123.26 最大亏损: -42.61 总收益: -17.04 平均盈利: -0.14 typeA: -0.04 胜率: 31.15%
趋势空且增强-R-1-2 总交易次数: 58 盈利: 616.6594939027195 亏损: -857.8283772732557 最大盈利: 130.62 最大亏损: -96.26 总收益: -241.17 平均盈利: -4.16 typeA: -1.86 胜率: 44.83%


      ========== 回测结果 ==========
          总交易次数:     4034
    盈利次数:       1253
    亏损次数:       2781
          胜率:          31.06%
          总收益:        13302.76 USDT
          盈亏比:        1.51
    rw:        0.0310
    rl:        0.0093
    carry:        11.02
          =============================

tradeNumTotal 4034
profitTotal 12489.761648102247
maxLossTotal -145.68
winRateTotal 1682.6699999999998
period month 54
avgRate 31.16
maxDrawdownTotal 42.6
趋势空且增强-R-1-1 总交易次数: 66 盈利: 1344.3055816150982 亏损: -902.6613411600279 最大盈利: 172.68 最大亏损: -135.54 总收益: 441.64 平均盈利: 6.69 typeA: 3.55 胜率: 53.03%
趋势多且增强-R-2-1 总交易次数: 345 盈利: 5705.2529780989225 亏损: -3057.38156645674 最大盈利: 1634.88 最大亏损: -115.31 总收益: 2647.87 平均盈利: 7.67 typeA: 2.49 胜率: 32.46%
趋势多且增强-R-2-3 总交易次数: 417 盈利: 4618.864538772853 亏损: -2519.3412802035446 最大盈利: 803.23 最大亏损: -79.82 总收益: 2099.52 平均盈利: 5.03 typeA: 1.51 胜率: 29.98%
趋势多且增强-R-2-4 总交易次数: 1133 盈利: 12620.733789947142 亏损: -6098.217527354867 最大盈利: 5355.48 最大亏损: -145.68 总收益: 6522.52 平均盈利: 5.76 typeA: 1.45 胜率: 25.15%
趋势空且增强-R-1-3 总交易次数: 187 盈利: 2450.718448960865 亏损: -2030.3119222833116 最大盈利: 265.88 最大亏损: -83.11 总收益: 420.41 平均盈利: 2.25 typeA: 0.90 胜率: 40.11%
趋势空且增强-R-3-1 总交易次数: 49 盈利: 613.7917097332653 亏损: -498.5392304826234 最大盈利: 359.44 最大亏损: -107.67 总收益: 115.25 平均盈利: 2.35 typeA: 0.72 胜率: 30.61%
趋势多且增强-R-2-2 总交易次数: 368 盈利: 3414.40658089654 亏损: -2770.9866388730384 最大盈利: 758.02 最大亏损: -94.83 总收益: 643.42 平均盈利: 1.75 typeA: 0.51 胜率: 29.35%
趋势空且增强-R-3-4 总交易次数: 192 盈利: 1154.985821706772 亏损: -911.9945990636905 最大盈利: 277.93 最大亏损: -115.68 总收益: 242.99 平均盈利: 1.27 typeA: 0.40 胜率: 31.77%
趋势空且增强-R-3-2 总交易次数: 55 盈利: 317.15248388401926 亏损: -256.27487824792905 最大盈利: 126.46 最大亏损: -38.22 总收益: 60.88 平均盈利: 1.11 typeA: 0.30 胜率: 27.27%
趋势空且增强-R-3-3 总交易次数: 122 盈利: 652.6702143233717 亏损: -596.7192314542144 最大盈利: 123.26 最大亏损: -42.61 总收益: 55.95 平均盈利: 0.46 typeA: 0.14 胜率: 31.15%
趋势空且增强-R-3-5 总交易次数: 747 盈利: 2945.698721017934 亏损: -2698.122645677666 最大盈利: 218.05 最大亏损: -115.89 总收益: 247.58 平均盈利: 0.33 typeA: 0.10 胜率: 30.39%
趋势空且增强-R-1-4 总交易次数: 294 盈利: 2781.6597807521407 亏损: -2729.274733025896 最大盈利: 150.44 最大亏损: -121.14 总收益: 52.39 平均盈利: 0.18 typeA: 0.08 胜率: 44.56%
趋势空且增强-R-1-2 总交易次数: 59 盈利: 616.6594939027195 亏损: -864.3129012257111 最大盈利: 130.62 最大亏损: -96.26 总收益: -247.65 平均盈利: -4.20 typeA: -1.85 胜率: 44.07%


      ========== 回测结果 ==========
          总交易次数:     4109
    盈利次数:       1272
    亏损次数:       2837
          胜率:          30.96%
          总收益:        13895.88 USDT
          盈亏比:        1.54
    rw:        0.0307
    rl:        0.0090
    carry:        11.83
          =============================

tradeNumTotal 4109
profitTotal 13068.28311649008
maxLossTotal -145.68
winRateTotal 1677.4700000000005
period month 54
avgRate 31.06
maxDrawdownTotal 43.7
趋势空且增强-R-1-1 总交易次数: 68 盈利: 1425.622994474202 亏损: -958.9995529014274 最大盈利: 172.68 最大亏损: -135.54 总收益: 466.62 平均盈利: 6.86 typeA: 3.63 胜率: 52.94%
趋势多且增强-R-2-1 总交易次数: 357 盈利: 5647.616450027253 亏损: -2906.9391680353006 最大盈利: 1634.88 最大亏损: -85.06 总收益: 2740.68 平均盈利: 7.68 typeA: 2.49 胜率: 32.49%
趋势多且增强-R-2-3 总交易次数: 430 盈利: 4741.512163134641 亏损: -2547.810957405324 最大盈利: 803.23 最大亏损: -79.82 总收益: 2193.70 平均盈利: 5.10 typeA: 1.54 胜率: 30.23%
趋势多且增强-R-2-4 总交易次数: 1153 盈利: 12531.060279244652 亏损: -5887.836044899114 最大盈利: 5355.48 最大亏损: -145.68 总收益: 6643.22 平均盈利: 5.76 typeA: 1.41 胜率: 24.46%
趋势空且增强-R-3-4 总交易次数: 192 盈利: 1219.70427120913 亏损: -783.743649280123 最大盈利: 277.93 最大亏损: -86.06 总收益: 435.96 平均盈利: 2.27 typeA: 0.74 胜率: 32.81%
趋势空且增强-R-3-1 总交易次数: 49 盈利: 613.7917097332653 亏损: -498.5392304826234 最大盈利: 359.44 最大亏损: -107.67 总收益: 115.25 平均盈利: 2.35 typeA: 0.72 胜率: 30.61%
趋势空且增强-R-1-3 总交易次数: 195 盈利: 2497.206742999198 亏损: -2156.089535169964 最大盈利: 265.88 最大亏损: -83.11 总收益: 341.12 平均盈利: 1.75 typeA: 0.69 胜率: 39.49%
趋势空且增强-R-3-2 总交易次数: 55 盈利: 368.6891984697081 亏损: -256.27487824792905 最大盈利: 178.00 最大亏损: -38.22 总收益: 112.41 平均盈利: 2.04 typeA: 0.56 胜率: 27.27%
趋势多且增强-R-2-2 总交易次数: 378 盈利: 3388.986361801996 亏损: -2755.0616410069306 最大盈利: 810.14 最大亏损: -94.83 总收益: 633.92 平均盈利: 1.68 typeA: 0.49 胜率: 29.10%
趋势空且增强-R-3-3 总交易次数: 122 盈利: 652.6702143233717 亏损: -596.7192314542144 最大盈利: 123.26 最大亏损: -42.61 总收益: 55.95 平均盈利: 0.46 typeA: 0.14 胜率: 31.15%
趋势空且增强-R-3-5 总交易次数: 748 盈利: 2901.8578824567116 亏损: -2574.6605041990783 最大盈利: 218.05 最大亏损: -56.82 总收益: 327.20 平均盈利: 0.44 typeA: 0.13 胜率: 30.61%
趋势空且增强-R-1-4 总交易次数: 302 盈利: 2747.6559161139867 亏损: -2796.340621596105 最大盈利: 128.62 最大亏损: -121.14 总收益: -48.68 平均盈利: -0.16 typeA: -0.07 胜率: 44.37%
趋势空且增强-R-1-2 总交易次数: 60 盈利: 742.8368484059588 亏损: -864.3129012257111 最大盈利: 130.62 最大亏损: -96.26 总收益: -121.48 平均盈利: -2.02 typeA: -0.91 胜率: 45.00%


          ========== 回测结果 ==========
          总交易次数:     4145
    盈利次数:       1294
    亏损次数:       2851
          胜率:          31.22%
          总收益:        14559.15 USDT
          盈亏比:        1.55
    rw:        0.0314
    rl:        0.0093
    carry:        11.58
          =============================

tradeNumTotal 4145
profitTotal 13723.34710372533
maxLossTotal -145.68
winRateTotal 1697.46
period month 54
avgRate 31.43
maxDrawdownTotal 47.7
趋势空且增强-R-1-1 总交易次数: 68 盈利: 1425.622994474202 亏损: -958.9995529014274 最大盈利: 172.68 最大亏损: -135.54 总收益: 466.62 平均盈利: 6.86 typeA: 3.63 胜率: 52.94%
趋势多且增强-R-2-1 总交易次数: 366 盈利: 5952.029991568966 亏损: -3270.5140216609025 最大盈利: 1634.88 最大亏损: -85.06 总收益: 2681.52 平均盈利: 7.33 typeA: 2.42 胜率: 33.06%
趋势多且增强-R-2-2 总交易次数: 384 盈利: 4953.187617556215 亏损: -3043.35383412738 最大盈利: 929.24 最大亏损: -94.83 总收益: 1909.83 平均盈利: 4.97 typeA: 1.46 胜率: 29.43%
趋势多且增强-R-2-4 总交易次数: 1160 盈利: 12685.67949499089 亏损: -6049.907537870074 最大盈利: 5355.48 最大亏损: -145.68 总收益: 6635.77 平均盈利: 5.72 typeA: 1.41 胜率: 24.66%
趋势多且增强-R-2-3 总交易次数: 441 盈利: 4359.832952492308 亏损: -2771.550993850986 最大盈利: 508.99 最大亏损: -79.82 总收益: 1588.28 平均盈利: 3.60 typeA: 1.14 胜率: 31.52%
趋势空且增强-R-1-3 总交易次数: 196 盈利: 2485.710272624827 亏损: -2100.7901271428505 最大盈利: 265.88 最大亏损: -83.11 总收益: 384.92 平均盈利: 1.96 typeA: 0.78 胜率: 39.80%
趋势空且增强-R-3-4 总交易次数: 192 盈利: 1219.70427120913 亏损: -773.0357665050034 最大盈利: 277.93 最大亏损: -86.06 总收益: 446.67 平均盈利: 2.33 typeA: 0.76 胜率: 32.81%
趋势空且增强-R-3-1 总交易次数: 49 盈利: 613.7917097332653 亏损: -498.5392304826234 最大盈利: 359.44 最大亏损: -107.67 总收益: 115.25 平均盈利: 2.35 typeA: 0.72 胜率: 30.61%
趋势空且增强-R-3-2 总交易次数: 55 盈利: 368.6891984697081 亏损: -256.27487824792905 最大盈利: 178.00 最大亏损: -38.22 总收益: 112.41 平均盈利: 2.04 typeA: 0.56 胜率: 27.27%
趋势空且增强-R-3-3 总交易次数: 122 盈利: 652.6702143233717 亏损: -596.7192314542144 最大盈利: 123.26 最大亏损: -42.61 总收益: 55.95 平均盈利: 0.46 typeA: 0.14 胜率: 31.15%
趋势空且增强-R-3-5 总交易次数: 750 盈利: 2899.9923017553933 亏损: -2562.115717203097 最大盈利: 218.05 最大亏损: -56.82 总收益: 337.88 平均盈利: 0.45 typeA: 0.14 胜率: 30.53%
趋势空且增强-R-1-4 总交易次数: 302 盈利: 2754.5428786106254 亏损: -2792.7453689632785 最大盈利: 128.62 最大亏损: -121.14 总收益: -38.20 平均盈利: -0.13 typeA: -0.06 胜率: 44.37%
趋势空且增强-R-1-2 总交易次数: 60 盈利: 738.2511790321051 亏损: -876.011712705764 最大盈利: 130.62 最大亏损: -96.26 总收益: -137.76 平均盈利: -2.30 typeA: -1.03 胜率: 45.00%


    ========== 回测结果 ==========
          总交易次数:     4163
    盈利次数:       1300
    亏损次数:       2863
          胜率:          31.23%
          总收益:        14731.97 USDT
          盈亏比:        1.54
    rw:        0.0319
    rl:        0.0095
    carry:        11.20
          =============================

tradeNumTotal 4163
profitTotal 13892.369525498947
maxLossTotal -145.68
winRateTotal 1698.3300000000004
period month 54
avgRate 31.45
maxDrawdownTotal 47.7
趋势空且增强-R-1-1 总交易次数: 68 盈利: 1407.5513790262519 亏损: -961.7802728715841 最大盈利: 172.68 最大亏损: -135.54 总收益: 445.77 平均盈利: 6.56 typeA: 3.37 胜率: 51.47%
趋势多且增强-R-2-1 总交易次数: 416 盈利: 7488.399034340635 亏损: -4034.1033368309563 最大盈利: 1634.88 最大亏损: -85.06 总收益: 3454.30 平均盈利: 8.30 typeA: 2.73 胜率: 32.93%
趋势多且增强-R-2-2 总交易次数: 403 盈利: 5630.974822981062 亏损: -3184.983958906147 最大盈利: 929.24 最大亏损: -94.83 总收益: 2445.99 平均盈利: 6.07 typeA: 1.90 胜率: 31.27%
趋势多且增强-R-2-4 总交易次数: 1091 盈利: 11933.600099550884 亏损: -5591.259248852121 最大盈利: 5355.48 最大亏损: -145.68 总收益: 6342.34 平均盈利: 5.81 typeA: 1.42 胜率: 24.38%
趋势空且增强-R-1-3 总交易次数: 196 盈利: 2479.424377094749 亏损: -2089.129547276999 最大盈利: 265.88 最大亏损: -83.11 总收益: 390.29 平均盈利: 1.99 typeA: 0.79 胜率: 39.80%
趋势空且增强-R-3-4 总交易次数: 192 盈利: 1221.3671938343784 亏损: -771.7937928332542 最大盈利: 277.93 最大亏损: -86.06 总收益: 449.57 平均盈利: 2.34 typeA: 0.78 胜率: 33.33%
趋势空且增强-R-3-1 总交易次数: 49 盈利: 613.7917097332653 亏损: -498.5392304826234 最大盈利: 359.44 最大亏损: -107.67 总收益: 115.25 平均盈利: 2.35 typeA: 0.72 胜率: 30.61%
趋势空且增强-R-3-2 总交易次数: 55 盈利: 368.6891984697081 亏损: -256.27487824792905 最大盈利: 178.00 最大亏损: -38.22 总收益: 112.41 平均盈利: 2.04 typeA: 0.56 胜率: 27.27%
趋势多且增强-R-2-3 总交易次数: 458 盈利: 3790.588451452216 亏损: -3012.8484063295596 最大盈利: 432.41 最大亏损: -79.82 总收益: 777.74 平均盈利: 1.70 typeA: 0.50 胜率: 29.48%
趋势空且增强-R-3-3 总交易次数: 122 盈利: 652.6702143233717 亏损: -596.7192314542144 最大盈利: 123.26 最大亏损: -42.61 总收益: 55.95 平均盈利: 0.46 typeA: 0.14 胜率: 31.15%
趋势空且增强-R-3-5 总交易次数: 751 盈利: 2902.6039165134193 亏损: -2581.9781571831545 最大盈利: 218.05 最大亏损: -56.82 总收益: 320.63 平均盈利: 0.43 typeA: 0.13 胜率: 30.63%
趋势空且增强-R-1-4 总交易次数: 302 盈利: 2769.9124337816365 亏损: -2815.2767236264103 最大盈利: 150.20 最大亏损: -121.14 总收益: -45.36 平均盈利: -0.15 typeA: -0.07 胜率: 44.37%
趋势空且增强-R-1-2 总交易次数: 60 盈利: 738.2511790321051 亏损: -871.1676997396312 最大盈利: 130.62 最大亏损: -96.26 总收益: -132.92 平均盈利: -2.22 typeA: -1.00 胜率: 45.00%


          ========== 回测结果 ==========
          总交易次数:     4776
    盈利次数:       1604
    亏损次数:       3172
          胜率:          33.58%
          总收益:        16686.97 USDT
          盈亏比:        1.53
    rw:        0.0296
    rl:        0.0099
    carry:        11.67
          =============================

tradeNumTotal 4776
profitTotal 15724.365655049778
maxLossTotal -145.68
winRateTotal 1833.5199999999998
period month 54
avgRate 33.95
maxDrawdownTotal 46.9
趋势多且增强-R-2-1 总交易次数: 445 盈利: 8421.229566917842 亏损: -4526.060414675606 最大盈利: 1634.88 最大亏损: -93.73 总收益: 3895.17 平均盈利: 8.75 typeA: 2.99 胜率: 34.16%
趋势空且增强-R-2-1 总交易次数: 170 盈利: 1985.1662977929905 亏损: -1294.414600023733 最大盈利: 204.45 最大亏损: -83.73 总收益: 690.75 平均盈利: 4.06 typeA: 2.06 胜率: 50.59%
趋势空且增强-R-1-1 总交易次数: 66 盈利: 1232.9693149952136 亏损: -961.7802728715841 最大盈利: 172.68 最大亏损: -135.54 总收益: 271.19 平均盈利: 4.11 typeA: 2.05 胜率: 50.00%
趋势多且增强-R-2-4 总交易次数: 1143 盈利: 13487.150589454104 亏损: -5636.649806709434 最大盈利: 6941.14 最大亏损: -145.68 总收益: 7850.50 平均盈利: 6.87 typeA: 1.74 胜率: 25.37%
趋势空且增强-R-1-3 总交易次数: 181 盈利: 2395.1139796928246 亏损: -1923.2214418522049 最大盈利: 265.88 最大亏损: -83.11 总收益: 471.89 平均盈利: 2.61 typeA: 1.04 胜率: 39.78%
趋势多且增强-R-2-2 总交易次数: 430 盈利: 4703.588883649104 亏损: -3397.487138441013 最大盈利: 810.14 最大亏损: -94.83 总收益: 1306.10 平均盈利: 3.04 typeA: 0.96 胜率: 31.63%
趋势空且增强-R-3-4 总交易次数: 191 盈利: 1221.3671938343784 亏损: -771.104697478731 最大盈利: 277.93 最大亏损: -86.06 总收益: 450.26 平均盈利: 2.36 typeA: 0.79 胜率: 33.51%
趋势空且增强-R-3-1 总交易次数: 49 盈利: 613.7917097332653 亏损: -498.5392304826234 最大盈利: 359.44 最大亏损: -107.67 总收益: 115.25 平均盈利: 2.35 typeA: 0.72 胜率: 30.61%
趋势多且增强-R-2-3 总交易次数: 485 盈利: 3995.419889062464 亏损: -2984.580692438114 最大盈利: 432.41 最大亏损: -79.82 总收益: 1010.84 平均盈利: 2.08 typeA: 0.66 胜率: 31.55%
趋势空且增强-R-3-2 总交易次数: 55 盈利: 368.6891984697081 亏损: -256.27487824792905 最大盈利: 178.00 最大亏损: -38.22 总收益: 112.41 平均盈利: 2.04 typeA: 0.56 胜率: 27.27%
趋势空且增强-R-2-2 总交易次数: 90 盈利: 720.028328345395 亏损: -624.6063838772451 最大盈利: 98.43 最大亏损: -77.48 总收益: 95.42 平均盈利: 1.06 typeA: 0.55 胜率: 52.22%
趋势空且增强-R-2-4 总交易次数: 204 盈利: 1480.2673851284683 亏损: -1281.2527168856273 最大盈利: 169.75 最大亏损: -66.96 总收益: 199.01 平均盈利: 0.98 typeA: 0.46 胜率: 47.06%
趋势空且增强-R-2-3 总交易次数: 80 盈利: 645.2890038897286 亏损: -570.7071840735448 最大盈利: 100.33 最大亏损: -56.06 总收益: 74.58 平均盈利: 0.93 typeA: 0.43 胜率: 46.25%
趋势空且增强-R-3-3 总交易次数: 121 盈利: 652.6702143233717 亏损: -591.0670265482113 最大盈利: 123.26 最大亏损: -42.61 总收益: 61.60 平均盈利: 0.51 typeA: 0.16 胜率: 31.40%
趋势空且增强-R-3-5 总交易次数: 735 盈利: 2838.8651947889934 亏损: -2486.1820217313666 最大盈利: 218.05 最大亏损: -56.82 总收益: 352.68 平均盈利: 0.48 typeA: 0.15 胜率: 30.34%
趋势空且增强-R-1-4 总交易次数: 279 盈利: 2623.635450722424 亏损: -2630.3995108345475 最大盈利: 150.20 最大亏损: -121.14 总收益: -6.76 平均盈利: -0.02 typeA: -0.01 胜率: 44.44%
趋势空且增强-R-1-2 总交易次数: 52 盈利: 533.0866893864344 亏损: -797.0352179652361 最大盈利: 130.62 最大亏损: -96.26 总收益: -263.95 平均盈利: -5.08 typeA: -2.25 胜率: 44.23%

    ========== 回测结果 ==========
          总交易次数:     3594
    盈利次数:       1316
    亏损次数:       2278
          胜率:          36.62%
          总收益:        14157.92 USDT
          盈亏比:        1.54
    rw:        0.0307
    rl:        0.0116
    carry:        11.00
          =============================

tradeNumTotal 3594
profitTotal 13432.92223921894
maxLossTotal -135.54
winRateTotal 1999.29
period month 54
avgRate 37.02
maxDrawdownTotal 39.1
趋势多且增强-L-2-4 总交易次数: 178 盈利: 3016.2561458106793 亏损: -1051.7610914451377 最大盈利: 1003.61 最大亏损: -54.69 总收益: 1964.50 平均盈利: 11.04 typeA: 4.09 胜率: 37.08%
趋势多且增强-L-2-2 总交易次数: 511 盈利: 10104.790946525687 亏损: -4179.102939779114 最大盈利: 4176.39 最大亏损: -100.52 总收益: 5925.69 平均盈利: 11.60 typeA: 3.68 胜率: 31.70%
趋势多且增强-L-2-1 总交易次数: 501 盈利: 8964.512986239013 亏损: -5371.356023177453 最大盈利: 1634.88 最大亏损: -93.73 总收益: 3593.16 平均盈利: 7.17 typeA: 2.45 胜率: 34.13%
趋势空且增强-R-2-1 总交易次数: 170 盈利: 1985.1662977929905 亏损: -1294.414600023733 最大盈利: 204.45 最大亏损: -83.73 总收益: 690.75 平均盈利: 4.06 typeA: 2.06 胜率: 50.59%
趋势空且增强-R-1-1 总交易次数: 66 盈利: 1232.9693149952136 亏损: -961.7802728715841 最大盈利: 172.68 最大亏损: -135.54 总收益: 271.19 平均盈利: 4.11 typeA: 2.05 胜率: 50.00%
趋势空且增强-R-1-3 总交易次数: 181 盈利: 2395.1139796928246 亏损: -1923.2214418522049 最大盈利: 265.88 最大亏损: -83.11 总收益: 471.89 平均盈利: 2.61 typeA: 1.04 胜率: 39.78%
趋势空且增强-R-3-4 总交易次数: 191 盈利: 1221.3671938343784 亏损: -771.104697478731 最大盈利: 277.93 最大亏损: -86.06 总收益: 450.26 平均盈利: 2.36 typeA: 0.79 胜率: 33.51%
趋势空且增强-R-3-1 总交易次数: 49 盈利: 613.7917097332653 亏损: -498.5392304826234 最大盈利: 359.44 最大亏损: -107.67 总收益: 115.25 平均盈利: 2.35 typeA: 0.72 胜率: 30.61%
趋势空且增强-R-3-2 总交易次数: 55 盈利: 368.6891984697081 亏损: -256.27487824792905 最大盈利: 178.00 最大亏损: -38.22 总收益: 112.41 平均盈利: 2.04 typeA: 0.56 胜率: 27.27%
趋势空且增强-R-2-2 总交易次数: 90 盈利: 720.028328345395 亏损: -624.6063838772451 最大盈利: 98.43 最大亏损: -77.48 总收益: 95.42 平均盈利: 1.06 typeA: 0.55 胜率: 52.22%
趋势空且增强-R-2-4 总交易次数: 204 盈利: 1480.2673851284683 亏损: -1281.2527168856273 最大盈利: 169.75 最大亏损: -66.96 总收益: 199.01 平均盈利: 0.98 typeA: 0.46 胜率: 47.06%
趋势空且增强-R-2-3 总交易次数: 80 盈利: 645.2890038897286 亏损: -570.7071840735448 最大盈利: 100.33 最大亏损: -56.06 总收益: 74.58 平均盈利: 0.93 typeA: 0.43 胜率: 46.25%
趋势空且增强-R-3-3 总交易次数: 121 盈利: 652.6702143233717 亏损: -591.0670265482113 最大盈利: 123.26 最大亏损: -42.61 总收益: 61.60 平均盈利: 0.51 typeA: 0.16 胜率: 31.40%
趋势空且增强-R-3-5 总交易次数: 735 盈利: 2838.8651947889934 亏损: -2486.1820217313666 最大盈利: 218.05 最大亏损: -56.82 总收益: 352.68 平均盈利: 0.48 typeA: 0.15 胜率: 30.34%
趋势多且增强-L-2-3 总交易次数: 131 盈利: 1142.7453061814297 亏损: -1092.5178693666574 最大盈利: 98.93 最大亏损: -39.53 总收益: 50.23 平均盈利: 0.38 typeA: 0.13 胜率: 33.59%
趋势空且增强-R-1-4 总交易次数: 279 盈利: 2623.635450722424 亏损: -2630.3995108345475 最大盈利: 150.20 最大亏损: -121.14 总收益: -6.76 平均盈利: -0.02 typeA: -0.01 胜率: 44.44%
趋势空且增强-R-1-2 总交易次数: 52 盈利: 533.0866893864344 亏损: -797.0352179652361 最大盈利: 130.62 最大亏损: -96.26 总收益: -263.95 平均盈利: -5.08 typeA: -2.25 胜率: 44.23%




          ========== 回测结果 ==========
          总交易次数:     3545
    盈利次数:       1315
    亏损次数:       2230
          胜率:          37.09%
          总收益:        14563.67 USDT
          盈亏比:        1.55
    rw:        0.0310
    rl:        0.0118
    carry:        11.08
          =============================

tradeNumTotal 3545
profitTotal 13847.87336744707
maxLossTotal -135.54
winRateTotal 2026.0399999999997
period month 54
avgRate 37.52
maxDrawdownTotal 39.1
趋势多且增强-L-2-4 总交易次数: 178 盈利: 3016.2561458106793 亏损: -1051.7610914451377 最大盈利: 1003.61 最大亏损: -54.69 总收益: 1964.50 平均盈利: 11.04 typeA: 4.09 胜率: 37.08%
趋势多且增强-L-2-2 总交易次数: 509 盈利: 10104.790946525687 亏损: -4020.28744966155 最大盈利: 4176.39 最大亏损: -100.52 总收益: 6084.50 平均盈利: 11.95 typeA: 3.80 胜率: 31.83%
趋势空且增强-R-1-1 总交易次数: 64 盈利: 1287.9944735179522 亏损: -896.1099427027015 最大盈利: 173.75 最大亏损: -135.54 总收益: 391.88 平均盈利: 6.12 typeA: 3.06 胜率: 50.00%
趋势多且增强-L-2-1 总交易次数: 503 盈利: 8964.512986239013 亏损: -5430.240915124982 最大盈利: 1634.88 最大亏损: -93.73 总收益: 3534.27 平均盈利: 7.03 typeA: 2.39 胜率: 34.00%
趋势空且增强-R-2-1 总交易次数: 167 盈利: 1945.309396208147 亏损: -1307.159035693498 最大盈利: 204.45 最大亏损: -83.73 总收益: 638.15 平均盈利: 3.82 typeA: 1.85 胜率: 48.50%
趋势空且增强-R-3-4 总交易次数: 187 盈利: 1347.1704111958181 亏损: -807.8933325313334 最大盈利: 277.93 最大亏损: -86.06 总收益: 539.28 平均盈利: 2.88 typeA: 0.99 胜率: 34.22%
趋势空且增强-R-1-3 总交易次数: 177 盈利: 2453.379095909736 亏损: -2044.6947864330045 最大盈利: 265.88 最大亏损: -105.61 总收益: 408.68 平均盈利: 2.31 typeA: 0.93 胜率: 40.11%
趋势空且增强-R-2-4 总交易次数: 201 盈利: 1542.0103103619927 亏损: -1229.4482048773898 最大盈利: 169.75 最大亏损: -66.96 总收益: 312.56 平均盈利: 1.56 typeA: 0.77 胜率: 49.25%
趋势空且增强-R-2-3 总交易次数: 80 盈利: 710.9650930694128 亏损: -593.6395556982989 最大盈利: 100.33 最大亏损: -56.06 总收益: 117.33 平均盈利: 1.47 typeA: 0.68 胜率: 46.25%
趋势空且增强-R-3-1 总交易次数: 49 盈利: 613.7917097332653 亏损: -514.0947707039668 最大盈利: 359.44 最大亏损: -107.67 总收益: 99.70 平均盈利: 2.03 typeA: 0.62 胜率: 30.61%
趋势空且增强-R-3-2 总交易次数: 55 盈利: 368.6891984697081 亏损: -256.27487824792905 最大盈利: 178.00 最大亏损: -38.22 总收益: 112.41 平均盈利: 2.04 typeA: 0.56 胜率: 27.27%
趋势空且增强-R-2-2 总交易次数: 90 盈利: 726.0098177850731 亏损: -636.3961902583852 最大盈利: 98.43 最大亏损: -77.48 总收益: 89.61 平均盈利: 1.00 typeA: 0.50 胜率: 50.00%
趋势空且增强-R-3-5 总交易次数: 705 盈利: 2969.6718717954855 亏损: -2494.8924255616726 最大盈利: 218.05 最大亏损: -76.37 总收益: 474.78 平均盈利: 0.67 typeA: 0.22 胜率: 32.48%
趋势空且增强-R-3-3 总交易次数: 121 盈利: 669.1092924619473 亏损: -591.3422301581606 最大盈利: 123.26 最大亏损: -42.61 总收益: 77.77 平均盈利: 0.64 typeA: 0.20 胜率: 31.40%
趋势多且增强-L-2-3 总交易次数: 131 盈利: 1142.7453061814297 亏损: -1092.5178693666574 最大盈利: 98.93 最大亏损: -39.53 总收益: 50.23 平均盈利: 0.38 typeA: 0.13 胜率: 33.59%
趋势空且增强-R-1-4 总交易次数: 276 盈利: 2587.754116492523 亏损: -2635.9643792411025 最大盈利: 150.20 最大亏损: -121.14 总收益: -48.21 平均盈利: -0.17 typeA: -0.08 胜率: 44.57%
趋势空且增强-R-1-2 总交易次数: 52 盈利: 533.0866893864344 亏损: -816.856435991346 最大盈利: 130.62 最大亏损: -96.26 总收益: -283.77 平均盈利: -5.46 typeA: -2.41 胜率: 44.23%


   ========== 回测结果 ==========
          总交易次数:     3634
    盈利次数:       1355
    亏损次数:       2279
          胜率:          37.29%
          总收益:        12749.58 USDT
          盈亏比:        1.46
    rw:        0.0296
    rl:        0.0120
    carry:        9.78
          =============================

tradeNumTotal 3634
profitTotal 12016.57687478143
maxLossTotal -141.32
winRateTotal 2031.4399999999998
period month 54
avgRate 37.62
maxDrawdownTotal 36.4
趋势空且增强-R-1-1 总交易次数: 64 盈利: 1287.9944735179522 亏损: -898.8390538052726 最大盈利: 173.75 最大亏损: -135.54 总收益: 389.16 平均盈利: 6.08 typeA: 3.04 胜率: 50.00%
趋势多且增强-L-2-4 总交易次数: 188 盈利: 2499.7145141201863 亏损: -1126.9788102840823 最大盈利: 435.28 最大亏损: -54.69 总收益: 1372.74 平均盈利: 7.30 typeA: 2.80 胜率: 38.30%
趋势多且增强-L-2-2 总交易次数: 534 盈利: 8811.60004546094 亏损: -4373.665426839916 最大盈利: 2508.15 最大亏损: -141.32 总收益: 4437.93 平均盈利: 8.31 typeA: 2.66 胜率: 32.02%
趋势多且增强-L-2-1 总交易次数: 547 盈利: 9500.746239642733 亏损: -5906.560590180803 最大盈利: 444.78 最大亏损: -96.70 总收益: 3594.19 平均盈利: 6.57 typeA: 2.32 胜率: 35.28%
趋势空且增强-R-2-1 总交易次数: 164 盈利: 1924.7864801137073 亏损: -1242.6432303677657 最大盈利: 204.45 最大亏损: -83.73 总收益: 682.14 平均盈利: 4.16 typeA: 2.03 胜率: 48.78%
趋势空且增强-R-3-4 总交易次数: 187 盈利: 1347.1704111958181 亏损: -807.8933325313334 最大盈利: 277.93 最大亏损: -86.06 总收益: 539.28 平均盈利: 2.88 typeA: 0.99 胜率: 34.22%
趋势空且增强-R-1-3 总交易次数: 177 盈利: 2453.379095909736 亏损: -2048.0096714028864 最大盈利: 265.88 最大亏损: -105.61 总收益: 405.37 平均盈利: 2.29 typeA: 0.92 胜率: 40.11%
趋势多且增强-L-2-3 总交易次数: 144 盈利: 1654.5983498578992 亏损: -1279.5472832836263 最大盈利: 224.16 最大亏损: -48.17 总收益: 375.05 平均盈利: 2.60 typeA: 0.87 胜率: 33.33%
趋势空且增强-R-2-4 总交易次数: 201 盈利: 1542.0103103619927 亏损: -1212.9107168010785 最大盈利: 169.75 最大亏损: -66.96 总收益: 329.10 平均盈利: 1.64 typeA: 0.81 胜率: 49.25%
趋势空且增强-R-2-3 总交易次数: 80 盈利: 710.9650930694128 亏损: -593.6395556982989 最大盈利: 100.33 最大亏损: -56.06 总收益: 117.33 平均盈利: 1.47 typeA: 0.68 胜率: 46.25%
趋势空且增强-R-3-1 总交易次数: 49 盈利: 613.7917097332653 亏损: -514.0947707039668 最大盈利: 359.44 最大亏损: -107.67 总收益: 99.70 平均盈利: 2.03 typeA: 0.62 胜率: 30.61%
趋势空且增强-R-3-2 总交易次数: 55 盈利: 368.6891984697081 亏损: -256.27487824792905 最大盈利: 178.00 最大亏损: -38.22 总收益: 112.41 平均盈利: 2.04 typeA: 0.56 胜率: 27.27%
趋势空且增强-R-2-2 总交易次数: 90 盈利: 726.0098177850731 亏损: -652.0893640502915 最大盈利: 98.43 最大亏损: -77.48 总收益: 73.92 平均盈利: 0.82 typeA: 0.41 胜率: 50.00%
趋势空且增强-R-3-5 总交易次数: 705 盈利: 2969.6718717954855 亏损: -2494.8924255616726 最大盈利: 218.05 最大亏损: -76.37 总收益: 474.78 平均盈利: 0.67 typeA: 0.22 胜率: 32.48%
趋势空且增强-R-3-3 总交易次数: 121 盈利: 669.1092924619473 亏损: -591.3422301581606 最大盈利: 123.26 最大亏损: -42.61 总收益: 77.77 平均盈利: 0.64 typeA: 0.20 胜率: 31.40%
趋势空且增强-R-1-4 总交易次数: 276 盈利: 2587.754116492523 亏损: -2635.263058684833 最大盈利: 150.20 最大亏损: -121.14 总收益: -47.51 平均盈利: -0.17 typeA: -0.08 胜率: 44.57%
趋势空且增强-R-1-2 总交易次数: 52 盈利: 533.0866893864344 亏损: -816.856435991346 最大盈利: 130.62 最大亏损: -96.26 总收益: -283.77 平均盈利: -5.46 typeA: -2.41 胜率: 44.23%

if (adx < 30) {
			if (emaFast < emaSlow) {
				// if (macd < lastMacd && lastMacd > lastLastMacd) {
				marketType = rsi < 45 && rsi > 35 ? '趋势多且增强-R-3-1' : '';
				// }
			}

			if (emaFast > emaSlow) {
				// if (macd > lastMacd && lastMacd < lastLastMacd) {
				marketType = rsi > 55 && rsi < 65 ? '趋势空且增强-L-3-1' : '';
				// }
			}
		} else if (adx > 30) {
			if (emaFast < emaSlow) {
				// if (macd < lastMacd && lastMacd > lastLastMacd) {
				marketType = rsi > 35 ? '趋势空且增强-L-2-1' : '趋势空';
				// }
			}

			if (emaFast > emaSlow) {
				// if (macd > lastMacd && lastMacd < lastLastMacd) {
				marketType = rsi < 65 ? '趋势多且增强-R-2-1' : '趋势多';
				// }
			}
		} else {
			marketType = '趋势多趋势空';
		}

		if (rsi > 70) {
			marketType = adx >= 30 ? '趋势多' : '趋势空';
		}

		if (rsi < 30) {
			marketType = adx >= 30 ? '趋势空' : '趋势多';
		}

      ========== 回测结果 ==========
          总交易次数:     9419
    盈利次数:       5405
    亏损次数:       4014
          胜率:          57.38%
          总收益:        1005.93 USDT
          盈亏比:        1.01
    rw:        0.0134
    rl:        0.0178
    carry:        0.43
          =============================

tradeNumTotal 9419
profitTotal -887.8735581261465
maxLossTotal -324.37
winRateTotal 3098.9800000000005
period month 54
avgRate 57.39
maxDrawdownTotal 98.6
趋势多且增强-R-2-1 总交易次数: 1650 盈利: 14524.907590778383 亏损: -10743.91678017367 最大盈利: 3113.05 最大亏损: -192.26 总收益: 3780.99 平均盈利: 2.29 typeA: 1.05 胜率: 45.70%
趋势多且增强-R-3-1 总交易次数: 3067 盈利: 25031.378609494026 亏损: -23243.19189677253 最大盈利: 298.09 最大亏损: -324.37 总收益: 1788.19 平均盈利: 0.58 typeA: 0.37 胜率: 62.93%
趋势空且增强-L-2-1 总交易次数: 1614 盈利: 9016.050336094828 亏损: -10633.270671503644 最大盈利: 236.36 最大亏损: -141.67 总收益: -1617.22 平均盈利: -1.00 typeA: -0.42 胜率: 42.19%
趋势空且增强-L-3-1 总交易次数: 3088 盈利: 23888.357547857828 亏损: -26834.388293901 最大盈利: 165.61 最大亏损: -311.18 总收益: -2946.03 平均盈利: -0.95 typeA: -0.63 胜率: 66.06%

     ========== 回测结果 ==========
          总交易次数:     6921
    盈利次数:       4486
    亏损次数:       2435
          胜率:          64.82%
          总收益:        358.70 USDT
          盈亏比:        1.01
    rw:        0.0124
    rl:        0.0226
    carry:        0.21
          =============================

tradeNumTotal 6921
profitTotal -1032.300299865317
maxLossTotal -324.37
winRateTotal 3488.2499999999995
period month 54
avgRate 64.60
maxDrawdownTotal 81.8
趋势多且增强-R-3-1 总交易次数: 3440 盈利: 28181.89186553288 亏损: -26512.378480590913 最大盈利: 298.09 最大亏损: -324.37 总收益: 1669.51 平均盈利: 0.49 typeA: 0.30 胜率: 62.67%
趋势空且增强-L-3-1 总交易次数: 3481 盈利: 27327.965614380486 亏损: -28638.77929918747 最大盈利: 165.61 最大亏损: -311.18 总收益: -1310.81 平均盈利: -0.38 typeA: -0.25 胜率: 66.93%


          ========== 回测结果 ==========
          总交易次数:     6426
    盈利次数:       4560
    亏损次数:       1866
          胜率:          70.96%
          总收益:        1727.27 USDT
          盈亏比:        1.03
    rw:        0.0120
    rl:        0.0283
    carry:        0.83
          =============================

tradeNumTotal 6426
profitTotal 432.67300012389467
maxLossTotal -635.58
winRateTotal 3819.5699999999993
period month 54
avgRate 70.73
maxDrawdownTotal 137.6
趋势多且增强-L-2-1 总交易次数: 195 盈利: 1389.1794797187265 亏损: -724.9575668473317 最大盈利: 77.27 最大亏损: -119.73 总收益: 664.22 平均盈利: 3.41 typeA: 2.69 胜率: 78.97%
趋势多且增强-R-3-1 总交易次数: 3061 盈利: 27312.239388548744 亏损: -23822.012938190688 最大盈利: 298.09 最大亏损: -296.60 总收益: 3490.23 平均盈利: 1.14 typeA: 0.80 胜率: 69.78%
趋势空且增强-L-3-1 总交易次数: 3041 盈利: 25305.180234349187 亏损: -27047.056951286908 最大盈利: 165.61 最大亏损: -635.58 总收益: -1741.88 平均盈利: -0.57 typeA: -0.41 胜率: 71.82%
趋势空且增强-R-2-1 总交易次数: 129 盈利: 668.2678830611507 亏损: -1353.5665292287374 最大盈利: 124.08 最大亏损: -328.85 总收益: -685.30 平均盈利: -5.31 typeA: -3.54 胜率: 66.67%

    ========== 回测结果 ==========
          总交易次数:     14581
    盈利次数:       9457
    亏损次数:       5124
          胜率:          64.86%
          总收益:        6393.67 USDT
          盈亏比:        1.10
    rw:        0.0076
    rl:        0.0128
    carry:        4.35
          =============================

tradeNumTotal 14581
profitTotal 3470.8703961945744
maxLossTotal -324.37
winRateTotal 3499.820000000001
period month 54
avgRate 64.81
maxDrawdownTotal 65.2
趋势多且增强-L-2-1 总交易次数: 510 盈利: 3547.3741780847054 亏损: -1723.2631838013442 最大盈利: 184.32 最大亏损: -119.73 总收益: 1824.11 平均盈利: 3.58 typeA: 2.68 胜率: 74.90%
趋势多且增强-R-2-1 总交易次数: 1370 盈利: 14846.703119544627 亏损: -10926.180843709424 最大盈利: 3780.87 最大亏损: -192.26 总收益: 3920.52 平均盈利: 2.86 typeA: 1.16 胜率: 40.58%
趋势多且增强-R-3-1 总交易次数: 3110 盈利: 25232.282501459653 亏损: -23342.777557829322 最大盈利: 298.09 最大亏损: -324.37 总收益: 1889.50 平均盈利: 0.61 typeA: 0.38 胜率: 62.70%
趋势空且增强-L-3-1 总交易次数: 9591 盈利: 28490.478819277527 亏损: -29730.94663683119 最大盈利: 126.47 最大亏损: -196.82 总收益: -1240.47 平均盈利: -0.13 typeA: -0.09 胜率: 68.49%


    ========== 回测结果 ==========
          总交易次数:     10831
    盈利次数:       6485
    亏损次数:       4346
          胜率:          59.87%
          总收益:        6652.03 USDT
          盈亏比:        1.12
    rw:        0.0098
    rl:        0.0132
    carry:        4.33
          =============================

tradeNumTotal 10831
profitTotal 4478.427975202387
maxLossTotal -336.14
winRateTotal 3228.44
period month 54
avgRate 59.79
maxDrawdownTotal 52.4
趋势多且增强-L-3-2 总交易次数: 505 盈利: 7351.384581903176 亏损: -2911.3873387633735 最大盈利: 4773.55 最大亏损: -231.92 总收益: 4440.00 平均盈利: 8.79 typeA: 3.81 胜率: 43.37%
趋势多且增强-R-2-1 总交易次数: 504 盈利: 3527.45693366952 亏损: -1710.2797882162997 最大盈利: 184.32 最大亏损: -119.73 总收益: 1817.18 平均盈利: 3.61 typeA: 2.71 胜率: 75.20%
趋势多且增强-L-3-1 总交易次数: 1858 盈利: 20608.345442224432 亏损: -18057.990599556215 最大盈利: 584.41 最大亏损: -336.14 总收益: 2550.35 平均盈利: 1.37 typeA: 0.78 胜率: 57.05%
趋势多且增强-L-3-3 总交易次数: 1275 盈利: 7513.467707253854 亏损: -7296.897351002388 最大盈利: 309.78 最大亏损: -217.90 总收益: 216.57 平均盈利: 0.17 typeA: 0.11 胜率: 64.24%
趋势空且增强-L-3-3 总交易次数: 4187 盈利: 10869.068924696192 亏损: -11896.376277338806 最大盈利: 60.61 最大亏损: -196.82 总收益: -1027.31 平均盈利: -0.25 typeA: -0.17 胜率: 67.59%
趋势空且增强-L-3-2 总交易次数: 1470 盈利: 4470.082709641884 亏损: -5098.861103824675 最大盈利: 51.35 最大亏损: -51.80 总收益: -628.78 平均盈利: -0.43 typeA: -0.21 胜率: 50.07%
趋势多且增强-R-2-2 总交易次数: 1032 盈利: 9244.49584361211 亏损: -9960.481709096633 最大盈利: 846.91 最大亏损: -173.21 总收益: -715.99 平均盈利: -0.69 typeA: -0.30 胜率: 42.83%



          ========== 回测结果 ==========
          总交易次数:     9263
    盈利次数:       5512
    亏损次数:       3751
          胜率:          59.51%
          总收益:        7654.51 USDT
          盈亏比:        1.14
    rw:        0.0109
    rl:        0.0142
    carry:        4.79
          =============================

tradeNumTotal 9263
profitTotal 5794.313986686451
maxLossTotal -336.14
winRateTotal 3205.770000000001
period month 54
avgRate 59.37
maxDrawdownTotal 60.5
趋势多且增强-L-3-2 总交易次数: 469 盈利: 7712.608218426514 亏损: -3014.892760300222 最大盈利: 4773.55 最大亏损: -231.92 总收益: 4697.72 平均盈利: 10.02 typeA: 4.66 胜率: 46.48%
趋势多且增强-R-2-1 总交易次数: 503 盈利: 3524.6774830346403 亏损: -1710.2797882162997 最大盈利: 184.32 最大亏损: -119.73 总收益: 1814.40 平均盈利: 3.61 typeA: 2.71 胜率: 75.15%
趋势多且增强-L-3-3-2 总交易次数: 667 盈利: 4608.946025725332 亏损: -3779.365444190421 最大盈利: 527.11 最大亏损: -130.21 总收益: 829.58 平均盈利: 1.24 typeA: 0.93 胜率: 75.11%
趋势多且增强-L-3-1 总交易次数: 1341 盈利: 15614.666769212696 亏损: -14016.632686283003 最大盈利: 364.11 最大亏损: -336.14 总收益: 1598.03 平均盈利: 1.19 typeA: 0.65 胜率: 54.66%
趋势多且增强-L-3-2-2 总交易次数: 46 盈利: 225.0411746753119 亏损: -189.55527007731766 最大盈利: 59.89 最大亏损: -51.36 总收益: 35.49 平均盈利: 0.77 typeA: 0.42 胜率: 54.35%
趋势多且增强-L-3-3 总交易次数: 1161 盈利: 7504.745919454682 亏损: -7175.973117340276 最大盈利: 394.13 最大亏损: -217.90 总收益: 328.77 平均盈利: 0.28 typeA: 0.18 胜率: 65.29%
趋势空且增强-L-3-2-1 总交易次数: 1640 盈利: 4923.3182224803295 亏损: -5284.789739376956 最大盈利: 51.35 最大亏损: -149.15 总收益: -361.47 平均盈利: -0.22 typeA: -0.12 胜率: 52.20%
趋势空且增强-L-3-3-1 总交易次数: 2526 盈利: 6654.913440073215 亏损: -7116.36685841063 最大盈利: 81.19 最大亏损: -125.24 总收益: -461.45 平均盈利: -0.18 typeA: -0.12 胜率: 64.57%
趋势多且增强-R-2-2 总交易次数: 910 盈利: 9731.159487024725 亏损: -10557.70708922554 最大盈利: 885.01 最大亏损: -173.21 总收益: -826.55 平均盈利: -0.91 typeA: -0.41 胜率: 45.27%


          ========== 回测结果 ==========
          总交易次数:     5239
    盈利次数:       2553
    亏损次数:       2686
          胜率:          48.73%
          总收益:        8235.40 USDT
          盈亏比:        1.21
    rw:        0.0183
    rl:        0.0148
    carry:        4.91
          =============================

tradeNumTotal 5239
profitTotal 7179.201264179132
maxLossTotal -419.73
winRateTotal 2631.790000000001
period month 54
avgRate 48.74
maxDrawdownTotal 51.7
趋势多且增强-L-3-1 总交易次数: 1004 盈利: 16800.86276872501 亏损: -10566.464449134046 最大盈利: 4974.48 最大亏损: -169.42 总收益: 6234.40 平均盈利: 6.21 typeA: 2.41 胜率: 38.84%
趋势多且增强-R-2-1 总交易次数: 651 盈利: 4208.2835759728805 亏损: -2146.763120484209 最大盈利: 184.32 最大亏损: -119.73 总收益: 2061.52 平均盈利: 3.17 typeA: 2.34 胜率: 74.04%
趋势多且增强-L-3-2-3 总交易次数: 246 盈利: 2668.004250568364 亏损: -1337.8300469588078 最大盈利: 1184.89 最大亏损: -63.12 总收益: 1330.17 平均盈利: 5.41 typeA: 1.56 胜率: 28.86%
趋势多且增强-R-2-2 总交易次数: 1064 盈利: 12668.066608780005 亏损: -11922.004925208661 最大盈利: 1328.61 最大亏损: -249.39 总收益: 746.06 平均盈利: 0.70 typeA: 0.31 胜率: 44.45%
趋势空且增强-L-3-2-2 总交易次数: 942 盈利: 2019.4975167719008 亏损: -2143.625325801489 最大盈利: 32.86 最大亏损: -29.88 总收益: -124.13 平均盈利: -0.13 typeA: -0.07 胜率: 53.08%
趋势多且增强-L-3-2-4 总交易次数: 281 盈利: 1645.4022823784599 亏损: -1713.817550506364 最大盈利: 187.75 最大亏损: -125.67 总收益: -68.42 平均盈利: -0.24 typeA: -0.11 胜率: 46.26%
趋势空且增强-L-3-2-1 总交易次数: 288 盈利: 600.5139979345815 亏损: -700.539112696076 最大盈利: 43.16 最大亏损: -49.80 总收益: -100.03 平均盈利: -0.35 typeA: -0.15 胜率: 42.71%
趋势多且增强-L-3-3 总交易次数: 149 盈利: 1239.1138912011165 亏损: -1596.738166256527 最大盈利: 162.98 最大亏损: -101.74 总收益: -357.62 平均盈利: -2.40 typeA: -1.10 胜率: 45.64%
趋势多且增强-L-3-4 总交易次数: 614 盈利: 5629.488546805948 亏损: -7116.049477912745 最大盈利: 405.50 最大亏损: -419.73 总收益: -1486.56 平均盈利: -2.42 typeA: -1.25 胜率: 51.47%



          ========== 回测结果 ==========
          总交易次数:     9594
    盈利次数:       5863
    亏损次数:       3731
          胜率:          61.11%
          总收益:        7975.62 USDT
          盈亏比:        1.15
    rw:        0.0104
    rl:        0.0143
    carry:        5.12
          =============================

tradeNumTotal 9594
profitTotal 6049.223823031671
maxLossTotal -272.06
winRateTotal 3296.8899999999994
period month 54
avgRate 61.05
maxDrawdownTotal 65.3
趋势多且增强-L-3-3 总交易次数: 476 盈利: 7830.3063178528455 亏损: -2708.3670438199106 最大盈利: 4773.55 最大亏损: -188.77 总收益: 5121.94 平均盈利: 10.76 typeA: 5.33 胜率: 49.58%
趋势多且增强-R-2-1 总交易次数: 378 盈利: 2481.99943835501 亏损: -1329.2272381174969 最大盈利: 77.27 最大亏损: -119.73 总收益: 1152.77 平均盈利: 3.05 typeA: 2.32 胜率: 76.19%
趋势多且增强-L-3-2-3 总交易次数: 91 盈利: 809.3115086745186 亏损: -491.8671773680275 最大盈利: 112.47 最大亏损: -57.69 总收益: 317.44 平均盈利: 3.49 typeA: 2.11 胜率: 60.44%
趋势多且增强-R-2-2 总交易次数: 579 盈利: 7833.364651960852 亏损: -6485.746855882368 最大盈利: 754.07 最大亏损: -212.19 总收益: 1347.62 平均盈利: 2.33 typeA: 1.17 胜率: 50.09%
趋势多且增强-L-3-2-4 总交易次数: 891 盈利: 6436.185965100439 亏损: -5636.526642869633 最大盈利: 527.11 最大亏损: -151.69 总收益: 799.66 平均盈利: 0.90 typeA: 0.66 胜率: 73.40%
趋势多且增强-L-3-4 总交易次数: 1106 盈利: 7298.838933903045 亏损: -6661.916931269951 最大盈利: 347.11 最大亏损: -246.89 总收益: 636.92 平均盈利: 0.58 typeA: 0.40 胜率: 68.63%
趋势多且增强-L-3-1 总交易次数: 1289 盈利: 14783.61552344741 亏损: -15077.63655991957 最大盈利: 308.85 最大亏损: -272.06 总收益: -294.02 平均盈利: -0.23 typeA: -0.13 胜率: 57.49%
趋势空且增强-L-3-2-1 总交易次数: 2064 盈利: 6284.625318093528 亏损: -6819.921867303532 最大盈利: 53.69 最大亏损: -149.15 总收益: -535.30 平均盈利: -0.26 typeA: -0.13 胜率: 51.84%
趋势空且增强-L-3-2-2 总交易次数: 2720 盈利: 7294.65897555039 亏损: -7866.07249335546 最大盈利: 81.19 最大亏损: -125.24 总收益: -571.41 平均盈利: -0.21 typeA: -0.14 胜率: 65.07%


   ========== 回测结果 ==========
          总交易次数:     1311
    盈利次数:       855
    亏损次数:       456
          胜率:          65.22%
          总收益:        2817.80 USDT
          盈亏比:        1.26
    rw:        0.0162
    rl:        0.0241
    carry:        5.54
          =============================

tradeNumTotal 1311
profitTotal 2552.995756902388
maxLossTotal -270.9
winRateTotal 3535.4399999999996
period month 54
avgRate 65.47
maxDrawdownTotal 49.5
趋势多且增强-R-1-1 总交易次数: 649 盈利: 7544.290093236033 亏损: -4816.767635858979 最大盈利: 141.74 最大亏损: -258.47 总收益: 2727.52 平均盈利: 4.20 typeA: 2.80 胜率: 66.56%
趋势空且增强-R-1-1 总交易次数: 662 盈利: 6306.031434596022 亏损: -6215.758135070614 最大盈利: 146.40 最大亏损: -270.90 总收益: 90.27 平均盈利: 0.14 typeA: 0.09 胜率: 63.90%



          ========== 回测结果 ==========
          总交易次数:     97
    盈利次数:       47
    亏损次数:       50
          胜率:          48.45%
          总收益:        394.94 USDT
          盈亏比:        3.09
    rw:        NaN
    rl:        NaN
    carry:        NaN
    最大连续盈利:  159.67092098641155
    最大连续亏损:  -23.58680892203435
    最大连盈次数:  7
    最大连亏次数:  6
          =============================

tradeNumTotal 97
profitTotal 375.5412340923091
maxLossTotal -19.43
winRateTotal 287.41
period month 7
avgRate 41.06
maxDrawdownTotal 2.6
undefined 总交易次数: 97 盈利: 584.0283864212474 亏损: -189.0871523289332 最大盈利: 159.67 最大亏损: -19.43 总收益: 394.94 平均盈利: 4.07 typeA: 1.97 胜率: 48.45%

   ========== 回测结果 ==========
          总交易次数:     113
    盈利次数:       63
    亏损次数:       50
          胜率:          55.75%
          总收益:        510.52 USDT
          盈亏比:        2.87
    rw:        NaN
    rl:        NaN
    carry:        NaN
    最大连续盈利:  163.37278537843952
    最大连续亏损:  -44.3875001056618
    最大连盈次数:  6
    最大连亏次数:  6
          =============================

tradeNumTotal 113
profitTotal 487.91523499562334
maxLossTotal -28.48
winRateTotal 331.17999999999995
period month 7
avgRate 47.31
maxDrawdownTotal 3.3
undefined 总交易次数: 113 盈利: 783.5286473125864 亏损: -273.0134123169571 最大盈利: 160.74 最大亏损: -28.48 总收益: 510.52 平均盈利: 4.52 typeA: 2.52 胜率: 55.75%


          ========== 回测结果 ==========
          总交易次数:     209
    盈利次数:       91
    亏损次数:       118
          胜率:          43.54%
          总收益:        610.52 USDT
          盈亏比:        1.92
    rw:        NaN
    rl:        NaN
    carry:        NaN
    最大连续盈利:  165.14089582284845
    最大连续亏损:  -87.24565954191276
    最大连盈次数:  6
    最大连亏次数:  10
          =============================

tradeNumTotal 209
profitTotal 568.5154775838917
maxLossTotal -35.45
winRateTotal 265.53999999999996
period month 7
avgRate 37.93
maxDrawdownTotal 7.8
undefined 总交易次数: 209 盈利: 1274.4992663457406 亏损: -663.9837887618369 最大盈利: 165.14 最大亏损: -35.45 总收益: 610.52 平均盈利: 2.92 typeA: 1.27 胜率: 43.54%


          ========== 回测结果 ==========
          总交易次数:     249
    盈利次数:       101
    亏损次数:       148
          胜率:          40.56%
          总收益:        682.50 USDT
          盈亏比:        1.87
    rw:        NaN
    rl:        NaN
    carry:        NaN
    最大连续盈利:  235.45815078515045
    最大连续亏损:  -87.24565954191276
    最大连盈次数:  6
    最大连亏次数:  10
          =============================

tradeNumTotal 249
profitTotal 632.4979747899176
maxLossTotal -35.45
winRateTotal 245.6
period month 7
avgRate 35.09
maxDrawdownTotal 8.3
undefined 总交易次数: 249 盈利: 1466.4931513564968 亏损: -783.9951765665655 最大盈利: 165.14 最大亏损: -35.45 总收益: 682.50 平均盈利: 2.74 typeA: 1.11 胜率: 40.56%



          ========== 回测结果 ==========
          总交易次数:     357
    盈利次数:       104
    亏损次数:       253
          胜率:          29.13%
          总收益:        2060.09 USDT
          盈亏比:        1.53
    rw:        NaN
    rl:        NaN
    carry:        NaN
    最大连续盈利:  984.4450474995062
    最大连续亏损:  -253.24505964322324
    最大连盈次数:  3
    最大连亏次数:  17
          =============================

tradeNumTotal 357
profitTotal 1986.8852193549944
maxLossTotal -127.75
winRateTotal 563.23
period month 18
avgRate 31.29
maxDrawdownTotal 25.7
趋势多且增强 总交易次数: 189 盈利: 3469.893662890208 亏损: -2259.868991417628 最大盈利: 822.20 最大亏损: -72.48 总收益: 1210.02 平均盈利: 6.40 typeA: 1.86 胜率: 29.10%
趋势空且增强 总交易次数: 168 盈利: 2508.718252537511 亏损: -1658.6577046550783 最大盈利: 244.49 最大亏损: -127.75 总收益: 850.06 平均盈利: 5.06 typeA: 1.48 胜率: 29.17%

tradeNumTotal 763
profitTotal 553.3277254992249
maxLossTotal -90.38
winRateTotal 270.95
period month 6
avgRate 45.16
maxDrawdownTotal 25.3
趋势空且增强 总交易次数: 341 盈利: 2353.1665398154187 亏损: -1934.9542736066594 最大盈利: 168.35 最大亏损: -90.38 总收益: 418.21 平均盈利: 1.23 typeA: 0.51 胜率: 41.94%
趋势多且增强 总交易次数: 422 盈利: 2082.8580749109074 亏损: -1794.7426156204065 最大盈利: 115.23 最大亏损: -55.76 总收益: 288.12 平均盈利: 0.68 typeA: 0.33 胜率: 47.87%


   ========== 回测结果 ==========
          总交易次数:     665
    盈利次数:       255
    亏损次数:       410
          胜率:          38.35%
          总收益:        1079.02 USDT
          盈亏比:        1.30
    rw:        NaN
    rl:        NaN
    carry:        NaN
    最大连续盈利:  291.71295818039476
    最大连续亏损:  -132.40550196133285
    最大连盈次数:  8
    最大连亏次数:  13
          =============================

tradeNumTotal 665
profitTotal 945.2219044558785
maxLossTotal -55.76
winRateTotal 230.91000000000003
period month 6
avgRate 38.49
maxDrawdownTotal 19.4
趋势空且增强 总交易次数: 349 盈利: 2351.798921626601 亏损: -1790.8336757788898 最大盈利: 168.35 最大亏损: -46.23 总收益: 560.97 平均盈利: 1.61 typeA: 0.66 胜率: 40.97%
趋势多且增强 总交易次数: 316 盈利: 2317.125117844382 亏损: -1799.0684592361852 最大盈利: 115.23 最大亏损: -55.76 总收益: 518.06 平均盈利: 1.64 typeA: 0.58 胜率: 35.44%

    ========== 回测结果 ==========
          总交易次数:     883
    盈利次数:       236
    亏损次数:       647
          胜率:          26.73%
          总收益:        1109.92 USDT
          盈亏比:        1.29
    rw:        NaN
    rl:        NaN
    carry:        NaN
    最大连续盈利:  271.6954723087765
    最大连续亏损:  -137.3146034107325
    最大连盈次数:  6
    最大连亏次数:  22
          =============================

tradeNumTotal 883
profitTotal 932.3200582964137
maxLossTotal -40.6
winRateTotal 160.38
period month 6
avgRate 26.73
maxDrawdownTotal 18.7
趋势空且增强 总交易次数: 302 盈利: 2125.037383235663 亏损: -1486.998992735378 最大盈利: 233.66 最大亏损: -26.61 总收益: 638.04 平均盈利: 2.11 typeA: 0.62 胜率: 29.14%
趋势多且增强 总交易次数: 581 盈利: 2813.702574678675 亏损: -2341.820906882507 最大盈利: 115.23 最大亏损: -40.60 总收益: 471.88 平均盈利: 0.81 typeA: 0.21 胜率: 25.47%



          ========== 回测结果 ==========
          总交易次数:     6692
    盈利次数:       4336
    亏损次数:       2356
          胜率:          64.79%
          总收益:        4601.93 USDT
          盈亏比:        1.14
    rw:        NaN
    rl:        NaN
    carry:        NaN
    最大连续盈利:  3427.593655777514
    最大连续亏损:  -467.1402813569344
    最大连盈次数:  18
    最大连亏次数:  11
          =============================

tradeNumTotal 6692
profitTotal 3259.5266582554495
maxLossTotal -356.36
winRateTotal 3497.89
period month 54
avgRate 64.78
maxDrawdownTotal 41.7
趋势多且增强 总交易次数: 3554 盈利: 22392.15442727156 亏损: -16990.79946836859 最大盈利: 3372.64 最大亏损: -356.36 总收益: 5401.35 平均盈利: 1.52 typeA: 1.00 胜率: 65.56%
趋势空且增强 总交易次数: 3138 盈利: 15405.038135180059 亏损: -16204.466435827298 最大盈利: 272.43 最大亏损: -346.22 总收益: -799.43 平均盈利: -0.25 typeA: -0.16 胜率: 63.93%


       ========== 回测结果 ==========
          总交易次数:     5308
    盈利次数:       3785
    亏损次数:       1523
          胜率:          71.31%
          总收益:        6641.19 USDT
          盈亏比:        1.23
    rw:        NaN
    rl:        NaN
    carry:        NaN
    最大连续盈利:  3427.1356761789616
    最大连续亏损:  -422.3662509913072
    最大连盈次数:  17
    最大连亏次数:  6
          =============================

tradeNumTotal 5308
profitTotal 5575.791937381166
maxLossTotal -356.36
winRateTotal 3837.640000000001
period month 54
avgRate 71.07
maxDrawdownTotal 37.9
趋势多且增强 总交易次数: 2752 盈利: 20987.683855379513 亏损: -14442.049725353034 最大盈利: 3372.64 最大亏损: -356.36 总收益: 6545.63 平均盈利: 2.38 typeA: 1.73 胜率: 72.78%
趋势空且增强 总交易次数: 2556 盈利: 14401.213808849021 亏损: -14305.656001494119 最大盈利: 272.43 最大亏损: -334.54 总收益: 95.56 平均盈利: 0.04 typeA: 0.03 胜率: 69.72%


       ========== 回测结果 ==========
          总交易次数:     5485
    盈利次数:       3837
    亏损次数:       1648
          胜率:          69.95%
          总收益:        6885.16 USDT
          盈亏比:        1.23
    rw:        NaN
    rl:        NaN
    carry:        NaN
    最大连续盈利:  3427.1356761789616
    最大连续亏损:  -422.3662509913072
    最大连盈次数:  17
    最大连亏次数:  6
          =============================

tradeNumTotal 5485
profitTotal 5784.156184712593
maxLossTotal -356.36
winRateTotal 3767.64
period month 54
avgRate 69.77
maxDrawdownTotal 37.9
趋势多且增强 总交易次数: 2870 盈利: 21839.046449068595 亏损: -14862.97863953244 最大盈利: 3372.64 最大亏损: -356.36 总收益: 6976.07 平均盈利: 2.43 typeA: 1.74 胜率: 71.39%
趋势空且增强 总交易次数: 2615 盈利: 14550.376872066121 亏损: -14641.28849688946 最大盈利: 272.43 最大亏损: -334.54 总收益: -90.91 平均盈利: -0.03 typeA: -0.02 胜率: 68.37%


   ========== 回测结果 ==========
          总交易次数:     5468
    盈利次数:       3825
    亏损次数:       1643
          胜率:          69.95%
          总收益:        6950.74 USDT
          盈亏比:        1.24
    rw:        NaN
    rl:        NaN
    carry:        NaN
    最大连续盈利:  3427.1356761789616
    最大连续亏损:  -422.3662509913072
    最大连盈次数:  17
    最大连亏次数:  6
          =============================

tradeNumTotal 5468
profitTotal 5853.144945800593
maxLossTotal -356.36
winRateTotal 3767.02
period month 54
avgRate 69.76
maxDrawdownTotal 37.9
趋势多且增强-L-1 总交易次数: 644 盈利: 8993.294876316459 亏损: -2869.703265200049 最大盈利: 3372.64 最大亏损: -164.85 总收益: 6123.59 平均盈利: 9.51 typeA: 6.64 胜率: 69.88%
趋势空且增强-R-1 总交易次数: 895 盈利: 6003.658680887045 亏损: -4277.501108857952 最大盈利: 272.43 最大亏损: -145.44 总收益: 1726.16 平均盈利: 1.93 typeA: 1.25 胜率: 64.69%
趋势多且增强-L-2 总交易次数: 283 盈利: 1782.8631977054072 亏损: -1243.5545364490924 最大盈利: 202.51 最大亏损: -88.80 总收益: 539.31 平均盈利: 1.91 typeA: 1.10 胜率: 57.95%
趋势空且增强-R-2 总交易次数: 170 盈利: 777.6329211453145 亏损: -668.8469959430256 最大盈利: 73.01 最大亏损: -55.75 总收益: 108.79 平均盈利: 0.64 typeA: 0.32 胜率: 49.41%
趋势多且增强-L-3 总交易次数: 1933 盈利: 11050.149904167887 亏损: -10677.301937759274 最大盈利: 110.84 最大亏损: -356.36 总收益: 372.85 平均盈利: 0.19 typeA: 0.14 胜率: 73.77%
趋势空且增强-R-3 总交易次数: 1543 盈利: 7775.928826467644 亏损: -9695.875616679537 最大盈利: 114.95 最大亏损: -334.54 总收益: -1919.95 平均盈利: -1.24 typeA: -0.90 胜率: 72.72%


          ========== 回测结果 ==========
          总交易次数:     4456
    盈利次数:       2866
    亏损次数:       1590
          胜率:          64.32%
          总收益:        9782.04 USDT
          盈亏比:        1.39
    rw:        NaN
    rl:        NaN
    carry:        NaN
    最大连续盈利:  3753.878777251355
    最大连续亏损:  -390.00099744283756
    最大连盈次数:  19
    最大连亏次数:  7
          =============================

tradeNumTotal 4456
profitTotal 8886.036355780137
maxLossTotal -293.95
winRateTotal 3463.0699999999997
period month 54
avgRate 64.13
maxDrawdownTotal 38.7
趋势多且增强-L-1 总交易次数: 688 盈利: 9449.750398540526 亏损: -3086.4345072722967 最大盈利: 3372.64 最大亏损: -164.85 总收益: 6363.32 平均盈利: 9.25 typeA: 6.52 胜率: 70.49%
趋势空且增强-R-1 总交易次数: 922 盈利: 6283.05688985513 亏损: -4257.065900888692 最大盈利: 272.43 最大亏损: -145.44 总收益: 2025.99 平均盈利: 2.20 typeA: 1.43 胜率: 64.97%
趋势多且增强-L-2 总交易次数: 285 盈利: 1781.5222642290123 亏损: -1254.0474904363205 最大盈利: 202.51 最大亏损: -88.80 总收益: 527.47 平均盈利: 1.85 typeA: 1.06 胜率: 57.54%
趋势多且增强-L-3 总交易次数: 1257 盈利: 9317.132929114026 亏损: -8116.997734730347 最大盈利: 381.24 最大亏损: -293.95 总收益: 1200.14 平均盈利: 0.95 typeA: 0.60 胜率: 62.61%
趋势空且增强-R-2 总交易次数: 171 盈利: 780.0051210064249 亏损: -618.9345052879343 最大盈利: 73.01 最大亏损: -55.75 总收益: 161.07 平均盈利: 0.94 typeA: 0.47 胜率: 49.71%
趋势空且增强-R-3 总交易次数: 1133 盈利: 7402.327955132848 亏损: -7898.279063482032 最大盈利: 199.97 最大亏损: -227.24 总收益: -495.95 平均盈利: -0.44 typeA: -0.29 胜率: 65.84%




          ========== 回测结果 ==========
          总交易次数:     4425
    盈利次数:       2620
    亏损次数:       1805
          胜率:          59.21%
          总收益:        11425.06 USDT
          盈亏比:        1.38
    rw:        NaN
    rl:        NaN
    carry:        NaN
    最大连续盈利:  6143.614917971328
    最大连续亏损:  -622.6317629703589
    最大连盈次数:  17
    最大连亏次数:  9
          =============================

tradeNumTotal 4425
profitTotal 10535.660995435168
maxLossTotal -328.68
winRateTotal 3198.1900000000005
period month 54
avgRate 59.23
maxDrawdownTotal 43.4
趋势多且增强-R-3 总交易次数: 1012 盈利: 17687.0951935084 亏损: -11682.506408611165 最大盈利: 5686.75 最大亏损: -328.68 总收益: 6004.59 平均盈利: 5.93 typeA: 3.55 胜率: 59.88%
趋势多且增强-L-1 总交易次数: 671 盈利: 6026.9708303590705 亏损: -3057.204086105102 最大盈利: 460.73 最大亏损: -164.85 总收益: 2969.77 平均盈利: 4.43 typeA: 3.13 胜率: 70.64%
趋势多且增强-L-2 总交易次数: 277 盈利: 1772.470223283004 亏损: -1249.0406640482327 最大盈利: 202.51 最大亏损: -88.80 总收益: 523.43 平均盈利: 1.89 typeA: 1.08 胜率: 57.40%
趋势空且增强-R-1 总交易次数: 1040 盈利: 5769.073345915071 亏损: -4565.0290239947935 最大盈利: 242.82 最大亏损: -104.37 总收益: 1204.04 平均盈利: 1.16 typeA: 0.60 胜率: 52.21%
趋势多且增强-L-3 总交易次数: 1251 盈利: 9958.109591979282 亏损: -9154.271500648292 最大盈利: 381.24 最大亏损: -293.95 总收益: 803.84 平均盈利: 0.64 typeA: 0.40 胜率: 61.71%
趋势空且增强-R-2 总交易次数: 174 盈利: 617.3146434712777 亏损: -697.9211496731444 最大盈利: 72.87 最大亏损: -44.72 总收益: -80.61 平均盈利: -0.46 typeA: -0.18 胜率: 37.93%


          ========== 回测结果 ==========
          总交易次数:     3962
    盈利次数:       2486
    亏损次数:       1476
          胜率:          62.75%
          总收益:        10363.02 USDT
          盈亏比:        1.47
    rw:        NaN
    rl:        NaN
    carry:        NaN
    最大连续盈利:  3753.878777251355
    最大连续亏损:  -390.00099744283756
    最大连盈次数:  18
    最大连亏次数:  6
          =============================

tradeNumTotal 3962
profitTotal 9565.815595306332
maxLossTotal -236.76
winRateTotal 3383.79
period month 54
avgRate 62.66
maxDrawdownTotal 25.3
趋势多且增强-L-1 总交易次数: 688 盈利: 9449.750398540526 亏损: -3086.4345072722967 最大盈利: 3372.64 最大亏损: -164.85 总收益: 6363.32 平均盈利: 9.25 typeA: 6.52 胜率: 70.49%
趋势空且增强-R-1 总交易次数: 922 盈利: 6283.05688985513 亏损: -4257.065900888692 最大盈利: 272.43 最大亏损: -145.44 总收益: 2025.99 平均盈利: 2.20 typeA: 1.43 胜率: 64.97%
趋势多且增强-L-2 总交易次数: 285 盈利: 1781.5222642290123 亏损: -1254.0474904363205 最大盈利: 202.51 最大亏损: -88.80 总收益: 527.47 平均盈利: 1.85 typeA: 1.06 胜率: 57.54%
趋势多且增强-L-3-1 总交易次数: 1000 盈利: 7744.059552831622 亏损: -6425.434275810868 最大盈利: 381.24 最大亏损: -236.76 总收益: 1318.63 平均盈利: 1.32 typeA: 0.78 胜率: 59.00%
趋势空且增强-R-2 总交易次数: 171 盈利: 780.0051210064249 亏损: -618.9345052879343 最大盈利: 73.01 最大亏损: -55.75 总收益: 161.07 平均盈利: 0.94 typeA: 0.47 胜率: 49.71%
趋势空且增强-R-3-1 总交易次数: 896 盈利: 6349.68817211976 亏损: -6383.150123579833 最大盈利: 199.97 最大亏损: -227.24 总收益: -33.46 平均盈利: -0.04 typeA: -0.02 胜率: 62.83%

 ========== 回测结果 ==========
          总交易次数:     3537
    盈利次数:       2303
    亏损次数:       1234
          胜率:          65.11%
          总收益:        10762.35 USDT
          盈亏比:        1.60
    rw:        NaN
    rl:        NaN
    carry:        NaN
    最大连续盈利:  4145.821212855519
    最大连续亏损:  -301.13742481053487
    最大连盈次数:  18
    最大连亏次数:  6
          =============================

tradeNumTotal 3537
profitTotal 10050.14900590555
maxLossTotal -205.81
winRateTotal 3511.8399999999992
period month 54
avgRate 65.03
maxDrawdownTotal 25.9
趋势多且增强-L-1 总交易次数: 749 盈利: 9688.90382848207 亏损: -3566.131000092942 最大盈利: 3372.64 最大亏损: -164.97 总收益: 6122.77 平均盈利: 8.17 typeA: 5.61 胜率: 68.62%
趋势空且增强-R-1 总交易次数: 960 盈利: 6568.602555570199 亏损: -4453.936806196764 最大盈利: 272.43 最大亏损: -145.44 总收益: 2114.67 平均盈利: 2.20 typeA: 1.43 胜率: 64.79%
趋势多且增强-L-2 总交易次数: 292 盈利: 1782.2849327297001 亏损: -1268.978137589278 最大盈利: 202.51 最大亏损: -88.80 总收益: 513.31 平均盈利: 1.76 typeA: 0.99 胜率: 56.51%
趋势多且增强-L-3-1 总交易次数: 700 盈利: 5273.528325608734 亏损: -4273.949939169411 最大盈利: 381.24 最大亏损: -205.40 总收益: 999.58 平均盈利: 1.43 typeA: 0.93 胜率: 64.86%
趋势空且增强-R-3-1 总交易次数: 663 盈利: 4497.699452449406 亏损: -3649.66068069338 最大盈利: 199.97 最大亏损: -205.81 总收益: 848.04 平均盈利: 1.28 typeA: 0.89 胜率: 69.68%
趋势空且增强-R-2 总交易次数: 173 盈利: 784.5356901377507 亏损: -620.549215330367 最大盈利: 73.01 最大亏损: -55.75 总收益: 163.99 平均盈利: 0.95 typeA: 0.47 胜率: 49.71%


       ========== 回测结果 ==========
          总交易次数:     3258
    盈利次数:       2135
    亏损次数:       1123
          胜率:          65.53%
          总收益:        11013.75 USDT
          盈亏比:        1.72
    rw:        NaN
    rl:        NaN
    carry:        NaN
    最大连续盈利:  4157.953166580367
    最大连续亏损:  -173.4794616436327
    最大连盈次数:  16
    最大连亏次数:  6
          =============================

tradeNumTotal 3258
profitTotal 10358.353822666944
maxLossTotal -164.97
winRateTotal 3538.39
period month 54
avgRate 65.53
maxDrawdownTotal 21.3
趋势多且增强-L-1 总交易次数: 753 盈利: 9716.20371004394 亏损: -3575.976815663954 最大盈利: 3372.64 最大亏损: -164.97 总收益: 6140.23 平均盈利: 8.15 typeA: 5.60 胜率: 68.66%
趋势多且增强-L-3-1 总交易次数: 554 盈利: 4151.732913218579 亏损: -2867.635946768723 最大盈利: 381.24 最大亏损: -120.25 总收益: 1284.10 平均盈利: 2.32 typeA: 1.56 胜率: 67.51%
趋势空且增强-R-1 总交易次数: 964 盈利: 6589.52571909258 亏损: -4464.7422721465855 最大盈利: 272.43 最大亏损: -145.44 总收益: 2124.78 平均盈利: 2.20 typeA: 1.43 胜率: 64.83%
趋势空且增强-R-3-1 总交易次数: 521 盈利: 3366.274273635708 亏损: -2579.291609374235 最大盈利: 199.97 最大亏损: -145.60 总收益: 786.98 平均盈利: 1.51 typeA: 1.06 胜率: 70.44%
趋势多且增强-L-2 总交易次数: 293 盈利: 1782.6555134116804 亏损: -1268.978137589278 最大盈利: 202.51 最大亏损: -88.80 总收益: 513.68 平均盈利: 1.75 typeA: 0.99 胜率: 56.66%
趋势空且增强-R-2 总交易次数: 173 盈利: 784.5356901377507 亏损: -620.549215330367 最大盈利: 73.01 最大亏损: -55.75 总收益: 163.99 平均盈利: 0.95 typeA: 0.47 胜率: 49.71%


          ========== 回测结果 ==========
          总交易次数:     3185
    盈利次数:       2088
    亏损次数:       1097
          胜率:          65.56%
          总收益:        10910.19 USDT
          盈亏比:        1.74
    rw:        NaN
    rl:        NaN
    carry:        NaN
    最大连续盈利:  4157.953166580367
    最大连续亏损:  -158.5109098058152
    最大连盈次数:  16
    最大连亏次数:  6
          =============================

tradeNumTotal 3185
profitTotal 10269.98857709892
maxLossTotal -145.6
winRateTotal 3539.9100000000008
period month 54
avgRate 65.55
maxDrawdownTotal 21.2
趋势多且增强-L-1 总交易次数: 696 盈利: 9134.82882729793 亏损: -3018.2219776474217 最大盈利: 3372.64 最大亏损: -78.44 总收益: 6116.61 平均盈利: 8.79 typeA: 6.12 胜率: 69.68%
趋势多且增强-L-3-1 总交易次数: 556 盈利: 4166.469110997533 亏损: -2874.5245042600122 最大盈利: 381.24 最大亏损: -120.25 总收益: 1291.94 平均盈利: 2.32 typeA: 1.57 胜率: 67.45%
趋势空且增强-R-1 总交易次数: 929 盈利: 6264.227197385971 亏损: -4240.563027545125 最大盈利: 272.43 最大亏损: -145.44 总收益: 2023.66 平均盈利: 2.18 typeA: 1.41 胜率: 64.69%
趋势空且增强-R-3-1 总交易次数: 523 盈利: 3405.524000923566 亏损: -2579.291609374235 最大盈利: 199.97 最大亏损: -145.60 总收益: 826.23 平均盈利: 1.58 typeA: 1.11 胜率: 70.55%
趋势多且增强-L-2 总交易次数: 302 盈利: 1848.0140164522827 亏损: -1294.7263639597634 最大盈利: 202.51 最大亏损: -88.80 总收益: 553.29 平均盈利: 1.83 typeA: 1.03 胜率: 55.96%
趋势空且增强-R-2 总交易次数: 179 盈利: 796.1644064968273 亏损: -697.7114996684966 最大盈利: 73.01 最大亏损: -55.75 总收益: 98.45 平均盈利: 0.55 typeA: 0.27 胜率: 49.72%

   ========== 回测结果 ==========
          总交易次数:     3186
    盈利次数:       2089
    亏损次数:       1097
          胜率:          65.57%
          总收益:        10943.27 USDT
          盈亏比:        1.74
    rw:        0.0123
    rl:        0.0134
    carry:        20.82
    最大连续盈利:  4157.953166580367
    最大连续亏损:  -158.5109098058152
    最大连盈次数:  16
    最大连亏次数:  6
          =============================

tradeNumTotal 3186
profitTotal 10302.871348174718
maxLossTotal -145.6
winRateTotal 3540.6500000000005
period month 54
avgRate 65.57
maxDrawdownTotal 21.2
趋势多且增强-L-2 总交易次数: 551 盈利: 6958.992019900589 亏损: -2273.982563189361 最大盈利: 3372.64 最大亏损: -88.80 总收益: 4685.01 平均盈利: 8.50 typeA: 5.39 胜率: 63.34%
趋势多且增强-L-1 总交易次数: 448 盈利: 4050.0953110925393 亏损: -2038.965778417827 最大盈利: 460.73 最大亏损: -78.44 总收益: 2011.13 平均盈利: 4.49 typeA: 3.07 胜率: 68.30%
趋势多且增强-L-3-1 总交易次数: 556 盈利: 4166.469110997533 亏损: -2874.5245042600122 最大盈利: 381.24 最大亏损: -120.25 总收益: 1291.94 平均盈利: 2.32 typeA: 1.57 胜率: 67.45%
趋势空且增强-R-1 总交易次数: 666 盈利: 4540.789753109658 亏损: -3221.675644389906 最大盈利: 160.75 最大亏损: -145.44 总收益: 1319.11 平均盈利: 1.98 typeA: 1.21 胜率: 61.11%
趋势空且增强-R-2 总交易次数: 442 盈利: 2526.6732596718903 亏损: -1716.8320078895774 最大盈利: 272.43 最大亏损: -96.70 总收益: 809.84 平均盈利: 1.83 typeA: 1.17 胜率: 64.03%
趋势空且增强-R-3-1 总交易次数: 523 盈利: 3405.524000923566 亏损: -2579.291609374235 最大盈利: 199.97 最大亏损: -145.60 总收益: 826.23 平均盈利: 1.58 typeA: 1.11 胜率: 70.55%


    ========== 回测结果 ==========
          总交易次数:     2964
    盈利次数:       2009
    亏损次数:       955
          胜率:          67.78%
          总收益:        10691.54 USDT
          盈亏比:        1.78
    rw:        0.0121
    rl:        0.0144
    carry:        20.53
    最大连续盈利:  4228.874506695498
    最大连续亏损:  -149.50236684231515
    最大连盈次数:  16
    最大连亏次数:  7
          =============================

tradeNumTotal 2964
profitTotal 10095.7403065802
maxLossTotal -145.6
winRateTotal 3655.4899999999984
period month 54
avgRate 67.69
maxDrawdownTotal 22.6
趋势多且增强-L-2 总交易次数: 317 盈利: 5528.279914541543 亏损: -1218.097123456436 最大盈利: 3372.64 最大亏损: -74.05 总收益: 4310.18 平均盈利: 13.60 typeA: 9.82 胜率: 72.24%
趋势多且增强-L-1 总交易次数: 529 盈利: 4505.488464651556 亏损: -2490.5875538076375 最大盈利: 460.73 最大亏损: -80.89 总收益: 2014.90 平均盈利: 3.81 typeA: 2.60 胜率: 68.24%
趋势空且增强-R-2 总交易次数: 321 盈利: 2046.287758340767 亏损: -1181.1340804502572 最大盈利: 272.43 最大亏损: -96.70 总收益: 865.15 平均盈利: 2.70 typeA: 1.96 胜率: 72.59%
趋势多且增强-L-3-1 总交易次数: 562 盈利: 4182.177067153049 亏损: -2965.701685080166 最大盈利: 381.24 最大亏损: -120.25 总收益: 1216.48 平均盈利: 2.16 typeA: 1.46 胜率: 67.26%
趋势空且增强-R-1 总交易次数: 702 盈利: 4725.804868567274 亏损: -3315.3182376117015 最大盈利: 160.75 最大亏损: -145.44 总收益: 1410.49 平均盈利: 2.01 typeA: 1.23 胜率: 61.40%
趋势空且增强-R-3-1 总交易次数: 533 盈利: 3464.8285053910877 亏损: -2590.4875916587434 最大盈利: 199.97 最大亏损: -145.60 总收益: 874.34 平均盈利: 1.64 typeA: 1.16 胜率: 70.73%


    ========== 回测结果 ==========
          总交易次数:     2712
    盈利次数:       1793
    亏损次数:       919
          胜率:          66.11%
          总收益:        10308.22 USDT
          盈亏比:        1.85
    rw:        0.0125
    rl:        0.0132
    carry:        23.09
    最大连续盈利:  3627.883081485003
    最大连续亏损:  -209.43581914104806
    最大连盈次数:  16
    最大连亏次数:  9
          =============================

tradeNumTotal 2712
profitTotal 9764.015653879856
maxLossTotal -145.44
winRateTotal 3621.9700000000003
period month 55
avgRate 65.85
maxDrawdownTotal 24.9
趋势多且增强-L-2 总交易次数: 353 盈利: 5600.853793890882 亏损: -1380.1732329550866 最大盈利: 3372.64 最大亏损: -74.05 总收益: 4220.68 平均盈利: 11.96 typeA: 8.57 胜率: 71.67%
趋势多且增强-L-1 总交易次数: 522 盈利: 4329.498620201644 亏损: -2175.1196075192715 最大盈利: 460.73 最大亏损: -80.89 总收益: 2154.38 平均盈利: 4.13 typeA: 2.85 胜率: 69.16%
趋势空且增强-R-2 总交易次数: 399 盈利: 2422.6410829333613 亏损: -1331.3685402022252 最大盈利: 272.43 最大亏损: -96.70 总收益: 1091.27 平均盈利: 2.74 typeA: 2.02 胜率: 73.68%
趋势空且增强-R-1 总交易次数: 667 盈利: 4756.6860711863565 亏损: -2817.170817760644 最大盈利: 160.75 最大亏损: -145.44 总收益: 1939.52 平均盈利: 2.91 typeA: 1.90 胜率: 65.22%
趋势多且增强-R-2 总交易次数: 416 盈利: 3062.0073121701066 亏损: -1997.7631559431602 最大盈利: 120.65 最大亏损: -76.46 总收益: 1064.24 平均盈利: 2.56 typeA: 1.61 胜率: 62.98%
趋势空且增强-L-1-1 总交易次数: 355 盈利: 2236.5105393580834 亏损: -2398.3864114800645 最大盈利: 78.49 最大亏损: -116.42 总收益: -161.88 平均盈利: -0.46 typeA: -0.24 胜率: 52.96%


      ========== 回测结果 ==========
          总交易次数:     3000
    盈利次数:       2032
    亏损次数:       968
          胜率:          67.73%
          总收益:        10778.09 USDT
          盈亏比:        1.78
    rw:        0.0121
    rl:        0.0143
    carry:        20.59
    最大连续盈利:  4228.874506695498
    最大连续亏损:  -149.50236684231515
    最大连盈次数:  16
    最大连亏次数:  7
          =============================

tradeNumTotal 3000
profitTotal 10174.886571167264
maxLossTotal -145.6
winRateTotal 3719.3799999999983
period month 55
avgRate 67.63
maxDrawdownTotal 22.6
趋势多且增强-L-2 总交易次数: 321 盈利: 5545.08103718973 亏损: -1231.9350168293815 最大盈利: 3372.64 最大亏损: -74.05 总收益: 4313.15 平均盈利: 13.44 typeA: 9.67 胜率: 71.96%
趋势多且增强-L-1 总交易次数: 535 盈利: 4520.3088986736175 亏损: -2496.272350045882 最大盈利: 460.73 最大亏损: -80.89 总收益: 2024.04 平均盈利: 3.78 typeA: 2.59 胜率: 68.41%
趋势空且增强-R-2 总交易次数: 324 盈利: 2063.507508599714 亏损: -1181.1340804502572 最大盈利: 272.43 最大亏损: -96.70 总收益: 882.37 平均盈利: 2.72 typeA: 1.98 胜率: 72.84%
趋势多且增强-L-3-1 总交易次数: 568 盈利: 4204.115561722348 亏损: -2982.376247387066 最大盈利: 381.24 最大亏损: -120.25 总收益: 1221.74 平均盈利: 2.15 typeA: 1.45 胜率: 67.43%
趋势空且增强-R-1 总交易次数: 713 盈利: 4865.928479088553 亏损: -3372.1538097182806 最大盈利: 160.75 最大亏损: -145.44 总收益: 1493.77 平均盈利: 2.10 typeA: 1.28 胜率: 61.29%
趋势空且增强-R-3-1 总交易次数: 539 盈利: 3471.657004060917 亏损: -2628.6404137366108 最大盈利: 199.97 最大亏损: -145.60 总收益: 843.02 平均盈利: 1.56 typeA: 1.10 胜率: 70.32%

     ========== 回测结果 ==========
          总交易次数:     2983
    盈利次数:       2046
    亏损次数:       937
          胜率:          68.59%
          总收益:        11087.90 USDT
          盈亏比:        1.82
    rw:        0.0120
    rl:        0.0144
    carry:        21.34
    最大连续盈利:  4225.824878665781
    最大连续亏损:  -149.50236684231515
    最大连盈次数:  17
    最大连亏次数:  9
          =============================

tradeNumTotal 2983
profitTotal 10488.500069533211
maxLossTotal -145.6
winRateTotal 3766.2299999999987
period month 55
avgRate 68.48
maxDrawdownTotal 22.4
趋势多且增强-L-2 总交易次数: 332 盈利: 5580.858168018405 亏损: -1321.261959581293 最大盈利: 3372.64 最大亏损: -74.05 总收益: 4259.60 平均盈利: 12.83 typeA: 9.16 胜率: 71.39%
趋势多且增强-L-1 总交易次数: 521 盈利: 4499.261816218135 亏损: -2383.7475436277928 最大盈利: 460.73 最大亏损: -80.89 总收益: 2115.51 平均盈利: 4.06 typeA: 2.77 胜率: 68.33%
趋势空且增强-R-2 总交易次数: 361 盈利: 2356.072070299653 亏损: -1285.204739230395 最大盈利: 272.43 最大亏损: -96.70 总收益: 1070.87 平均盈利: 2.97 typeA: 2.17 胜率: 73.13%
趋势空且增强-R-1 总交易次数: 658 盈利: 4480.917591803769 亏损: -2921.410505871991 最大盈利: 160.75 最大亏损: -145.44 总收益: 1559.51 平均盈利: 2.37 typeA: 1.53 胜率: 64.44%
趋势多且增强-L-3-1 总交易次数: 568 盈利: 4204.115561722348 亏损: -2982.376247387066 最大盈利: 381.24 最大亏损: -120.25 总收益: 1221.74 平均盈利: 2.15 typeA: 1.45 胜率: 67.43%
趋势空且增强-R-3-1 总交易次数: 543 盈利: 3501.434541934217 亏损: -2640.7586847646485 最大盈利: 199.97 最大亏损: -145.60 总收益: 860.68 平均盈利: 1.59 typeA: 1.12 胜率: 70.35%



          ========== 回测结果 ==========
          总交易次数:     4741
    盈利次数:       2154
    亏损次数:       2587
          胜率:          45.43%
          总收益:        6132.12 USDT
          盈亏比:        1.17
    rw:        0.0197
    rl:        0.0141
    carry:        4.55
    最大连续盈利:  2980.8055964401847
    最大连续亏损:  -775.1238914790672
    最大连盈次数:  12
    最大连亏次数:  15
          =============================

tradeNumTotal 4741
profitTotal 5175.3207637131945
maxLossTotal -377.04
winRateTotal 2504.139999999999
period month 55
avgRate 45.53
maxDrawdownTotal 60.5
趋势多且增强-L-3-1 总交易次数: 762 盈利: 12624.189084574298 亏损: -7097.717969928439 最大盈利: 2980.81 最大亏损: -78.79 总收益: 5526.47 平均盈利: 7.25 typeA: 2.15 胜率: 29.66%
趋势多且增强-L-1-1 总交易次数: 1138 盈利: 9474.8343207003 亏损: -8053.920956360557 最大盈利: 289.14 最大亏损: -216.36 总收益: 1420.91 平均盈利: 1.25 typeA: 0.63 胜率: 50.70%
趋势多且增强-R-3-1 总交易次数: 475 盈利: 2727.7497172412654 亏损: -2236.150913484256 最大盈利: 84.52 最大亏损: -67.89 总收益: 491.60 平均盈利: 1.03 typeA: 0.60 胜率: 57.68%
趋势空且增强-L-3-1 总交易次数: 407 盈利: 2229.152852371773 亏损: -1925.8518783229983 最大盈利: 47.70 最大亏损: -120.58 总收益: 303.30 平均盈利: 0.75 typeA: 0.43 胜率: 57.74%
趋势空且增强-R-1-1 总交易次数: 1094 盈利: 8945.311070461843 亏损: -8930.52569587614 最大盈利: 278.41 最大亏损: -377.04 总收益: 14.79 平均盈利: 0.01 typeA: 0.01 胜率: 53.02%
趋势空且增强-R-3-1 总交易次数: 865 盈利: 6652.566724089435 亏损: -8277.515591753147 最大盈利: 199.40 最大亏损: -164.35 总收益: -1624.95 平均盈利: -1.88 typeA: -0.57 胜率: 30.29%



   ========== 回测结果 ==========
          总交易次数:     491
    盈利次数:       249
    亏损次数:       242
          胜率:          50.71%
          总收益:        1425.87 USDT
          盈亏比:        1.42
    rw:        0.0192
    rl:        0.0139
    carry:        10.83
    最大连续盈利:  304.23094297016513
    最大连续亏损:  -110.87242018210144
    最大连盈次数:  8
    最大连亏次数:  9
          =============================

tradeNumTotal 491
profitTotal 1326.6736058673127
maxLossTotal -74.63
winRateTotal 368.29
period month 7
avgRate 52.61
maxDrawdownTotal 28.5
趋势多且增强-L-2-1 总交易次数: 138 盈利: 1422.9270795621997 亏损: -971.6602501479085 最大盈利: 119.35 最大亏损: -74.63 总收益: 451.27 平均盈利: 3.27 typeA: 2.20 胜率: 67.39%
趋势空且增强-R-3-2 总交易次数: 127 盈利: 1452.7608227972519 亏损: -771.4956968694066 最大盈利: 154.19 最大亏损: -28.36 总收益: 681.27 平均盈利: 5.36 typeA: 1.94 胜率: 36.22%
趋势空且增强-L-1-1 总交易次数: 107 盈利: 973.2750799688021 亏损: -721.7474052012868 最大盈利: 69.46 最大亏损: -59.61 总收益: 251.53 平均盈利: 2.35 typeA: 1.54 胜率: 65.42%
趋势多且增强-R-3-1 总交易次数: 119 盈利: 937.5429024202497 亏损: -895.7289266625652 最大盈利: 119.73 最大亏损: -57.65 总收益: 41.81 平均盈利: 0.35 typeA: 0.12 胜率: 33.61%


  ========== 回测结果 ==========
          总交易次数:     509
    盈利次数:       254
    亏损次数:       255
          胜率:          49.90%
          总收益:        1449.44 USDT
          盈亏比:        1.42
    rw:        0.0192
    rl:        0.0135
    carry:        10.97
    最大连续盈利:  262.57338886445376
    最大连续亏损:  -110.87242018210144
    最大连盈次数:  6
    最大连亏次数:  10
          =============================

tradeNumTotal 509
profitTotal 1346.6362152836516
maxLossTotal -74.63
winRateTotal 357.14
period month 7
avgRate 51.02
maxDrawdownTotal 28.4
趋势多且增强-L-2-1 总交易次数: 138 盈利: 1422.9270795621997 亏损: -971.6602501479085 最大盈利: 119.35 最大亏损: -74.63 总收益: 451.27 平均盈利: 3.27 typeA: 2.20 胜率: 67.39%
趋势空且增强-R-3-2 总交易次数: 143 盈利: 1547.7120585865725 亏损: -838.2764258163309 最大盈利: 182.90 最大亏损: -28.36 总收益: 709.44 平均盈利: 4.96 typeA: 1.73 胜率: 34.97%
趋势空且增强-L-1-1 总交易次数: 107 盈利: 973.2750799688021 亏损: -721.7474052012868 最大盈利: 69.46 最大亏损: -59.61 总收益: 251.53 平均盈利: 2.35 typeA: 1.54 胜率: 65.42%
趋势多且增强-R-3-1 总交易次数: 121 盈利: 938.4468932314896 亏损: -901.2408148998617 最大盈利: 119.73 最大亏损: -57.65 总收益: 37.21 平均盈利: 0.31 typeA: 0.10 胜率: 33.88%


      ========== 回测结果 ==========
          总交易次数:     424
    盈利次数:       204
    亏损次数:       220
          胜率:          48.11%
          总收益:        1277.76 USDT
          盈亏比:        1.49
    rw:        0.0191
    rl:        0.0119
    carry:        13.30
    最大连续盈利:  252.50022143494033
    最大连续亏损:  -109.54636572800443
    最大连盈次数:  9
    最大连亏次数:  11
          =============================

tradeNumTotal 424
profitTotal 1192.3556537566915
maxLossTotal -59.61
winRateTotal 348.12
period month 7
avgRate 49.73
maxDrawdownTotal 19.6
趋势多且增强-L-2-1 总交易次数: 83 盈利: 824.9876981958563 亏损: -461.2355367196614 最大盈利: 73.75 最大亏损: -59.57 总收益: 363.75 平均盈利: 4.38 typeA: 3.06 胜率: 69.88%
趋势空且增强-L-1-1 总交易次数: 77 盈利: 591.0469022645204 亏损: -390.22628378080475 最大盈利: 43.05 最大亏损: -59.61 总收益: 200.82 平均盈利: 2.61 typeA: 1.86 胜率: 71.43%
趋势空且增强-R-3-2 总交易次数: 143 盈利: 1537.1939817932655 亏损: -868.7142047027331 最大盈利: 182.90 最大亏损: -40.74 总收益: 668.48 平均盈利: 4.67 typeA: 1.63 胜率: 34.97%
趋势多且增强-R-3-1 总交易次数: 121 盈利: 941.0943209969757 亏损: -896.3912242907065 最大盈利: 119.73 最大亏损: -57.65 总收益: 44.70 平均盈利: 0.37 typeA: 0.13 胜率: 33.88%


    ========== 回测结果 ==========
          总交易次数:     505
    盈利次数:       252
    亏损次数:       253
          胜率:          49.90%
          总收益:        1478.16 USDT
          盈亏比:        1.44
    rw:        0.0192
    rl:        0.0133
    carry:        11.43
    最大连续盈利:  264.15941960938085
    最大连续亏损:  -110.87242018210144
    最大连盈次数:  8
    最大连亏次数:  10
          =============================

tradeNumTotal 505
profitTotal 1376.3637341548613
maxLossTotal -74.63
winRateTotal 359.66999999999996
period month 7
avgRate 51.38
maxDrawdownTotal 28
趋势多且增强-L-2-1 总交易次数: 135 盈利: 1416.2622584086912 亏损: -963.6017089291445 最大盈利: 119.35 最大亏损: -74.63 总收益: 452.66 平均盈利: 3.35 typeA: 2.29 胜率: 68.15%
趋势空且增强-R-3-2 总交易次数: 142 盈利: 1537.5139753042386 亏损: -835.9647034115513 最大盈利: 182.90 最大亏损: -44.28 总收益: 701.55 平均盈利: 4.94 typeA: 1.74 胜率: 35.21%
趋势空且增强-L-1-1 总交易次数: 106 盈利: 963.4615348299988 亏损: -712.4542296630848 最大盈利: 69.46 最大亏损: -59.61 总收益: 251.01 平均盈利: 2.37 typeA: 1.54 胜率: 65.09%
趋势多且增强-R-3-1 总交易次数: 122 盈利: 924.9469337398749 亏损: -852.0003261241376 最大盈利: 116.01 最大亏损: -44.80 总收益: 72.95 平均盈利: 0.60 typeA: 0.20 胜率: 33.61%


          ========== 回测结果 ==========
          总交易次数:     523
    盈利次数:       260
    亏损次数:       263
          胜率:          49.71%
          总收益:        1440.33 USDT
          盈亏比:        1.42
    rw:        0.0189
    rl:        0.0132
    carry:        11.04
    最大连续盈利:  264.15941960938085
    最大连续亏损:  -116.95578813251792
    最大连盈次数:  6
    最大连亏次数:  10
          =============================

tradeNumTotal 523
profitTotal 1334.928897644089
maxLossTotal -56.28
winRateTotal 360.94
period month 7
avgRate 51.56
maxDrawdownTotal 27.4
趋势多且增强-L-2-1 总交易次数: 146 盈利: 1465.673776139114 亏损: -1034.733835084448 最大盈利: 98.06 最大亏损: -56.28 总收益: 430.94 平均盈利: 2.95 typeA: 1.98 胜率: 67.12%
趋势空且增强-R-3-2 总交易次数: 142 盈利: 1537.5139753042386 亏损: -835.9647034115513 最大盈利: 182.90 最大亏损: -44.28 总收益: 701.55 平均盈利: 4.94 typeA: 1.74 胜率: 35.21%
趋势空且增强-L-1-1 总交易次数: 113 盈利: 977.5201884364808 亏损: -742.6271113554586 最大盈利: 51.26 最大亏损: -47.50 总收益: 234.89 平均盈利: 2.08 typeA: 1.31 胜率: 62.83%
趋势多且增强-R-3-1 总交易次数: 122 盈利: 924.9469337398749 亏损: -852.0003261241376 最大盈利: 116.01 最大亏损: -44.80 总收益: 72.95 平均盈利: 0.60 typeA: 0.20 胜率: 33.61%

  ========== 回测结果 ==========
          总交易次数:     571
    盈利次数:       278
    亏损次数:       293
          胜率:          48.69%
          总收益:        1429.02 USDT
          盈亏比:        1.38
    rw:        0.0188
    rl:        0.0130
    carry:        10.22
    最大连续盈利:  252.50022143494033
    最大连续亏损:  -111.61702285500984
    最大连盈次数:  6
    最大连亏次数:  10
          =============================

tradeNumTotal 571
profitTotal 1313.4192442764677
maxLossTotal -74.63
winRateTotal 346.95
period month 7
avgRate 49.56
maxDrawdownTotal 25.8
趋势多且增强-L-2-1 总交易次数: 135 盈利: 1422.1533407610848 亏损: -948.6575059907193 最大盈利: 119.35 最大亏损: -74.63 总收益: 473.50 平均盈利: 3.51 typeA: 2.42 胜率: 68.89%
趋势空且增强-R-3-2 总交易次数: 171 盈利: 1777.1298885200174 亏损: -971.9810088063274 最大盈利: 182.90 最大亏损: -34.06 总收益: 805.15 平均盈利: 4.71 typeA: 1.79 胜率: 38.01%
趋势空且增强-L-1-1 总交易次数: 106 盈利: 939.8805525884543 亏损: -717.7383464030471 最大盈利: 69.46 最大亏损: -59.61 总收益: 222.14 平均盈利: 2.10 typeA: 1.34 胜率: 64.15%
趋势多且增强-R-3-1 总交易次数: 159 盈利: 1091.4981398049945 亏损: -1163.2658161979646 最大盈利: 115.43 最大亏损: -59.33 总收益: -71.77 平均盈利: -0.45 typeA: -0.15 胜率: 32.70%

     ========== 回测结果 ==========
          总交易次数:     869
    盈利次数:       367
    亏损次数:       502
          胜率:          42.23%
          总收益:        1802.22 USDT
          盈亏比:        1.47
    rw:        0.0154
    rl:        0.0077
    carry:        17.56
    最大连续盈利:  269.8652352201879
    最大连续亏损:  -181.05647256772838
    最大连盈次数:  6
    最大连亏次数:  15
          =============================

tradeNumTotal 869
profitTotal 1627.2171681028592
maxLossTotal -64.19
winRateTotal 288.82
period month 7
avgRate 41.26
maxDrawdownTotal 28.5
趋势多且增强-R-3-1 总交易次数: 56 盈利: 647.8103694305668 亏损: -439.8863132491192 最大盈利: 117.90 最大亏损: -44.80 总收益: 207.92 平均盈利: 3.71 typeA: 1.72 胜率: 46.43%
趋势空且增强-R-3-2 总交易次数: 76 盈利: 692.8357493401724 亏损: -428.3647440193654 最大盈利: 155.77 最大亏损: -44.28 总收益: 264.47 平均盈利: 3.48 typeA: 1.28 胜率: 36.84%
趋势多且增强-L-2-1 总交易次数: 150 盈利: 1019.5046134729429 亏损: -608.1974235577569 最大盈利: 119.35 最大亏损: -36.58 总收益: 411.31 平均盈利: 2.74 typeA: 1.24 胜率: 45.33%
趋势空且增强-L-1-2 总交易次数: 204 盈利: 1315.9278768915963 亏损: -823.2067351948573 最大盈利: 197.70 最大亏损: -29.08 总收益: 492.72 平均盈利: 2.42 typeA: 0.94 胜率: 38.73%
趋势空且增强-L-1-1 总交易次数: 168 盈利: 879.7110899315493 亏损: -649.563358118408 最大盈利: 58.74 最大亏损: -59.61 总收益: 230.15 平均盈利: 1.37 typeA: 0.57 胜率: 41.67%
趋势多且增强-L-2-2 总交易次数: 215 盈利: 1096.0737476381491 亏损: -900.4277044625716 最大盈利: 105.85 最大亏损: -64.19 总收益: 195.65 平均盈利: 0.91 typeA: 0.41 胜率: 44.65%
^C


 ========== 回测结果 ==========
          总交易次数:     776
    盈利次数:       351
    亏损次数:       425
          胜率:          45.23%
          总收益:        1368.74 USDT
          盈亏比:        1.44
    rw:        0.0127
    rl:        0.0073
    carry:        19.14
    最大连续盈利:  269.8652352201879
    最大连续亏损:  -104.59744505725064
    最大连盈次数:  8
    最大连亏次数:  9
          =============================

tradeNumTotal 776
profitTotal 1212.7412549472533
maxLossTotal -44.8
winRateTotal 311.67
period month 7
avgRate 44.52
maxDrawdownTotal 25.1
趋势多且增强-R-3-1 总交易次数: 56 盈利: 647.8103694305668 亏损: -439.8863132491192 最大盈利: 117.90 最大亏损: -44.80 总收益: 207.92 平均盈利: 3.71 typeA: 1.72 胜率: 46.43%
趋势空且增强-L-1-1 总交易次数: 102 盈利: 434.48217479734535 亏损: -213.1078142933767 最大盈利: 38.87 最大亏损: -31.06 总收益: 221.37 平均盈利: 2.17 typeA: 1.34 胜率: 61.76%
趋势空且增强-R-3-2 总交易次数: 76 盈利: 692.8357493401724 亏损: -428.3647440193654 最大盈利: 155.77 最大亏损: -44.28 总收益: 264.47 平均盈利: 3.48 typeA: 1.28 胜率: 36.84%
趋势空且增强-L-1-2 总交易次数: 205 盈利: 1216.3765828446326 亏损: -833.1580760362783 最大盈利: 197.70 最大亏损: -29.08 总收益: 383.22 平均盈利: 1.87 typeA: 0.69 胜率: 37.07%
趋势多且增强-L-2-2 总交易次数: 216 盈利: 1015.4345959616763 亏损: -817.5230942723261 最大盈利: 105.85 最大亏损: -42.98 总收益: 197.91 平均盈利: 0.92 typeA: 0.41 胜率: 44.91%
趋势多且增强-L-2-1 总交易次数: 121 盈利: 448.3100793212952 亏损: -354.4682548779351 最大盈利: 119.35 最大亏损: -35.30 总收益: 93.84 平均盈利: 0.78 typeA: 0.39 胜率: 50.41%


    ========== 回测结果 ==========
          总交易次数:     729
    盈利次数:       331
    亏损次数:       398
          胜率:          45.40%
          总收益:        1419.89 USDT
          盈亏比:        1.52
    rw:        0.0126
    rl:        0.0069
    carry:        22.36
    最大连续盈利:  269.8652352201879
    最大连续亏损:  -87.15706240085467
    最大连盈次数:  11
    最大连亏次数:  9
          =============================

tradeNumTotal 729
profitTotal 1273.4880974040123
maxLossTotal -44.8
winRateTotal 311.99
period month 7
avgRate 44.57
maxDrawdownTotal 22.9
趋势多且增强-R-3-1 总交易次数: 56 盈利: 652.1135289727754 亏损: -439.8863132491192 最大盈利: 117.90 最大亏损: -44.80 总收益: 212.23 平均盈利: 3.79 typeA: 1.76 胜率: 46.43%
趋势空且增强-R-3-2 总交易次数: 76 盈利: 692.8357493401724 亏损: -428.3647440193654 最大盈利: 155.77 最大亏损: -44.28 总收益: 264.47 平均盈利: 3.48 typeA: 1.28 胜率: 36.84%
趋势空且增强-L-1-1 总交易次数: 69 盈利: 270.7139129806962 亏损: -134.64736867848057 最大盈利: 38.87 最大亏损: -18.18 总收益: 136.07 平均盈利: 1.97 typeA: 1.23 胜率: 62.32%
趋势多且增强-L-2-1 总交易次数: 92 盈利: 350.6292498234055 亏损: -187.8094938642952 最大盈利: 119.35 最大亏损: -18.64 总收益: 162.82 平均盈利: 1.77 typeA: 0.96 胜率: 54.35%
趋势空且增强-L-1-2 总交易次数: 211 盈利: 1278.8437021524164 亏损: -791.7368180195551 最大盈利: 197.70 最大亏损: -29.08 总收益: 487.11 平均盈利: 2.31 typeA: 0.93 胜率: 40.28%
趋势多且增强-L-2-2 总交易次数: 225 盈利: 927.3368043663511 亏损: -770.1401124009575 最大盈利: 105.85 最大亏损: -35.17 总收益: 157.20 平均盈利: 0.70 typeA: 0.31 胜率: 44.00%


        ========== 回测结果 ==========
          总交易次数:     756
    盈利次数:       340
    亏损次数:       416
          胜率:          44.97%
          总收益:        1657.73 USDT
          盈亏比:        1.60
    rw:        0.0130
    rl:        0.0066
    carry:        25.56
    最大连续盈利:  312.6924895781072
    最大连续亏损:  -87.15706240085467
    最大连盈次数:  10
    最大连亏次数:  10
          =============================

tradeNumTotal 756
profitTotal 1505.5268073588004
maxLossTotal -35.17
winRateTotal 311.32000000000005
period month 7
avgRate 44.47
maxDrawdownTotal 23.7
趋势空且增强-R-3-2 总交易次数: 78 盈利: 760.2164381797352 亏损: -373.01698008074453 最大盈利: 155.77 最大亏损: -21.68 总收益: 387.20 平均盈利: 4.96 typeA: 1.91 胜率: 38.46%
趋势多且增强-R-3-1 总交易次数: 76 盈利: 798.2211325047836 亏损: -444.4483446421354 最大盈利: 117.90 最大亏损: -29.31 总收益: 353.77 平均盈利: 4.65 typeA: 1.90 胜率: 40.79%
趋势多且增强-L-1-1 总交易次数: 92 盈利: 348.59386711777597 亏损: -187.6094938642952 最大盈利: 119.35 最大亏损: -18.64 总收益: 160.98 平均盈利: 1.75 typeA: 0.97 胜率: 55.43%
趋势空且增强-L-2-2 总交易次数: 214 盈利: 1299.5529032561144 亏损: -831.9710666499831 最大盈利: 197.70 最大亏损: -29.08 总收益: 467.58 平均盈利: 2.18 typeA: 0.87 胜率: 39.72%
趋势空且增强-L-2-1 总交易次数: 69 盈利: 232.42952243839778 亏损: -142.7074247691051 最大盈利: 38.87 最大亏损: -23.20 总收益: 89.72 平均盈利: 1.30 typeA: 0.79 胜率: 60.87%
趋势多且增强-L-1-2 总交易次数: 227 盈利: 970.7719086926171 亏损: -772.305654824327 最大盈利: 105.85 最大亏损: -35.17 总收益: 198.47 平均盈利: 0.87 typeA: 0.39 胜率: 44.49%


          ========== 回测结果 ==========
          总交易次数:     692
    盈利次数:       317
    亏损次数:       375
          胜率:          45.81%
          总收益:        1676.51 USDT
          盈亏比:        1.67
    rw:        0.0132
    rl:        0.0067
    carry:        27.56
    最大连续盈利:  291.39141814583
    最大连续亏损:  -72.2565431475086
    最大连盈次数:  10
    最大连亏次数:  8
          =============================

tradeNumTotal 692
profitTotal 1537.305252763243
maxLossTotal -29.68
winRateTotal 316.21000000000004
period month 7
avgRate 45.17
maxDrawdownTotal 20
趋势多且增强-R-3-1 总交易次数: 81 盈利: 845.1772170491912 亏损: -454.72306480361334 最大盈利: 117.90 最大亏损: -29.31 总收益: 390.45 平均盈利: 4.82 typeA: 2.02 胜率: 41.98%
趋势空且增强-R-3-2 总交易次数: 81 盈利: 784.4999219062365 亏损: -396.0604305775203 最大盈利: 155.77 最大亏损: -26.89 总收益: 388.44 平均盈利: 4.80 typeA: 1.95 胜率: 40.74%
趋势空且增强-L-2-2 总交易次数: 135 盈利: 1042.6409566616317 亏损: -583.4190461557014 最大盈利: 197.70 最大亏损: -29.08 总收益: 459.22 平均盈利: 3.40 typeA: 1.21 胜率: 35.56%
趋势多且增强-L-1-1 总交易次数: 150 盈利: 593.5424933657241 亏损: -289.1596042131815 最大盈利: 119.35 最大亏损: -18.64 总收益: 304.38 平均盈利: 2.03 typeA: 1.18 胜率: 58.00%
趋势空且增强-L-2-1 总交易次数: 116 盈利: 336.9325874405978 亏损: -259.78284385797616 最大盈利: 38.87 最大亏损: -23.03 总收益: 77.15 平均盈利: 0.67 typeA: 0.36 胜率: 54.31%
趋势多且增强-L-1-2 总交易次数: 129 盈利: 575.7639655994494 亏损: -518.9068996515634 最大盈利: 105.85 最大亏损: -29.68 总收益: 56.86 平均盈利: 0.44 typeA: 0.18 胜率: 40.31%

        ========== 回测结果 ==========
          总交易次数:     697
    盈利次数:       318
    亏损次数:       379
          胜率:          45.62%
          总收益:        1659.65 USDT
          盈亏比:        1.66
    rw:        0.0132
    rl:        0.0067
    carry:        27.20
    最大连续盈利:  291.39141814583
    最大连续亏损:  -72.2565431475086
    最大连盈次数:  10
    最大连亏次数:  8
          =============================

tradeNumTotal 697
profitTotal 1519.450050108129
maxLossTotal -29.68
winRateTotal 316.26000000000005
period month 7
avgRate 45.18
maxDrawdownTotal 20
趋势空且增强-R-3-2 总交易次数: 82 盈利: 784.4999219062365 亏损: -389.5706083961134 最大盈利: 155.77 最大亏损: -26.89 总收益: 394.93 平均盈利: 4.82 typeA: 1.94 胜率: 40.24%
趋势多且增强-R-3-1 总交易次数: 84 盈利: 845.1772170491912 亏损: -481.73125924378706 最大盈利: 117.90 最大亏损: -29.31 总收益: 363.45 平均盈利: 4.33 typeA: 1.75 胜率: 40.48%
趋势空且增强-L-2-2 总交易次数: 135 盈利: 1042.6409566616317 亏损: -583.4190461557014 最大盈利: 197.70 最大亏损: -29.08 总收益: 459.22 平均盈利: 3.40 typeA: 1.21 胜率: 35.56%
趋势多且增强-L-1-1 总交易次数: 150 盈利: 593.5424933657241 亏损: -289.1596042131815 最大盈利: 119.35 最大亏损: -18.64 总收益: 304.38 平均盈利: 2.03 typeA: 1.18 胜率: 58.00%
趋势空且增强-L-2-1 总交易次数: 116 盈利: 336.9325874405978 亏损: -259.78284385797616 最大盈利: 38.87 最大亏损: -23.03 总收益: 77.15 平均盈利: 0.67 typeA: 0.36 胜率: 54.31%
趋势多且增强-L-1-2 总交易次数: 130 盈利: 579.4271352031027 亏损: -518.9068996515634 最大盈利: 105.85 最大亏损: -29.68 总收益: 60.52 平均盈利: 0.47 typeA: 0.19 胜率: 40.77%

   ========== 回测结果 ==========
          总交易次数:     688
    盈利次数:       320
    亏损次数:       368
          胜率:          46.51%
          总收益:        1748.71 USDT
          盈亏比:        1.74
    rw:        0.0129
    rl:        0.0064
    carry:        30.68
    最大连续盈利:  291.39141814583
    最大连续亏损:  -65.13786986023754
    最大连盈次数:  7
    最大连亏次数:  8
          =============================

tradeNumTotal 688
profitTotal 1610.5097395966197
maxLossTotal -29.31
winRateTotal 325.52000000000004
period month 7
avgRate 46.50
maxDrawdownTotal 17.6
趋势空且增强-R-3-2 总交易次数: 107 盈利: 1074.796428365047 亏损: -553.7883084584216 最大盈利: 155.77 最大亏损: -26.89 总收益: 521.01 平均盈利: 4.87 typeA: 1.96 胜率: 40.19%
趋势空且增强-L-2-2 总交易次数: 100 盈利: 676.9861729067283 亏损: -311.90116208063193 最大盈利: 197.70 最大亏损: -17.92 总收益: 365.09 平均盈利: 3.65 typeA: 1.39 胜率: 38.00%
趋势多且增强-L-1-1 总交易次数: 150 盈利: 593.5424933657241 亏损: -287.3646311431637 最大盈利: 119.35 最大亏损: -18.64 总收益: 306.18 平均盈利: 2.04 typeA: 1.18 胜率: 58.00%
趋势多且增强-R-3-1 总交易次数: 104 盈利: 936.7976407714109 亏损: -632.507626576401 最大盈利: 117.90 最大亏损: -29.31 总收益: 304.29 平均盈利: 2.93 typeA: 1.13 胜率: 38.46%
趋势多且增强-L-1-2 总交易次数: 111 盈利: 497.95839798068977 亏损: -327.5092485664937 最大盈利: 111.47 最大亏损: -22.24 总收益: 170.45 平均盈利: 1.54 typeA: 0.68 胜率: 44.14%
趋势空且增强-L-2-1 总交易次数: 116 盈利: 336.9325874405978 亏损: -255.233004408435 最大盈利: 38.87 最大亏损: -18.48 总收益: 81.70 平均盈利: 0.70 typeA: 0.38 胜率: 54.31%


   ========== 回测结果 ==========
          总交易次数:     605
    盈利次数:       276
    亏损次数:       329
          胜率:          45.62%
          总收益:        1645.03 USDT
          盈亏比:        1.74
    rw:        0.0140
    rl:        0.0068
    carry:        28.61
    最大连续盈利:  291.39141814583
    最大连续亏损:  -70.59279545621057
    最大连盈次数:  7
    最大连亏次数:  8
          =============================

tradeNumTotal 605
profitTotal 1523.434019927286
maxLossTotal -29.31
winRateTotal 317.8
period month 7
avgRate 45.40
maxDrawdownTotal 13.7
趋势空且增强-R-3-2 总交易次数: 108 盈利: 1074.796428365047 亏损: -559.1416173661387 最大盈利: 155.77 最大亏损: -26.89 总收益: 515.65 平均盈利: 4.77 typeA: 1.90 胜率: 39.81%
趋势空且增强-L-2-2 总交易次数: 60 盈利: 538.8494075527367 亏损: -217.5550711470614 最大盈利: 197.70 最大亏损: -17.92 总收益: 321.29 平均盈利: 5.35 typeA: 1.78 胜率: 33.33%
趋势多且增强-L-1-1 总交易次数: 150 盈利: 593.5424933657241 亏损: -287.3646311431637 最大盈利: 119.35 最大亏损: -18.64 总收益: 306.18 平均盈利: 2.04 typeA: 1.18 胜率: 58.00%
趋势多且增强-R-3-1 总交易次数: 105 盈利: 936.7976407714109 亏损: -655.3151444970257 最大盈利: 117.90 最大亏损: -29.31 总收益: 281.48 平均盈利: 2.68 typeA: 1.02 胜率: 38.10%
趋势多且增强-L-1-2 总交易次数: 66 盈利: 390.9180664952874 亏损: -252.19313550166595 最大盈利: 111.47 最大亏损: -18.54 总收益: 138.72 平均盈利: 2.10 typeA: 0.73 胜率: 34.85%
趋势空且增强-L-2-1 总交易次数: 116 盈利: 336.9325874405978 亏损: -255.233004408435 最大盈利: 38.87 最大亏损: -18.48 总收益: 81.70 平均盈利: 0.70 typeA: 0.38 胜率: 54.31%



          ========== 回测结果 ==========
          总交易次数:     700
    盈利次数:       325
    亏损次数:       375
          胜率:          46.43%
          总收益:        1836.20 USDT
          盈亏比:        1.76
    rw:        0.0130
    rl:        0.0064
    carry:        31.40
    最大连续盈利:  291.39141814583
    最大连续亏损:  -65.13786986023754
    最大连盈次数:  7
    最大连亏次数:  8
          =============================

tradeNumTotal 700
profitTotal 1695.5960441100808
maxLossTotal -29.31
winRateTotal 324.15000000000003
period month 7
avgRate 46.31
maxDrawdownTotal 17.6
趋势空且增强-R-3-2 总交易次数: 108 盈利: 1074.796428365047 亏损: -556.3254617653402 最大盈利: 155.77 最大亏损: -26.89 总收益: 518.47 平均盈利: 4.80 typeA: 1.91 胜率: 39.81%
趋势多且增强-R-3-1 总交易次数: 108 盈利: 1041.8772443160199 亏损: -644.9735259645196 最大盈利: 117.90 最大亏损: -29.31 总收益: 396.90 平均盈利: 3.68 typeA: 1.43 胜率: 38.89%
趋势空且增强-L-2-2 总交易次数: 100 盈利: 676.9861729067283 亏损: -311.90116208063193 最大盈利: 197.70 最大亏损: -17.92 总收益: 365.09 平均盈利: 3.65 typeA: 1.39 胜率: 38.00%
趋势多且增强-L-1-1 总交易次数: 151 盈利: 596.2306243205185 亏损: -287.3646311431637 最大盈利: 119.35 最大亏损: -18.64 总收益: 308.87 平均盈利: 2.05 typeA: 1.19 胜率: 58.28%
趋势多且增强-L-1-2 总交易次数: 112 盈利: 497.95839798068977 亏损: -330.3019764411352 最大盈利: 111.47 最大亏损: -22.24 总收益: 167.66 平均盈利: 1.50 typeA: 0.65 胜率: 43.75%
趋势空且增强-L-2-1 总交易次数: 121 盈利: 349.44182935436953 亏损: -270.22789573847 最大盈利: 38.87 最大亏损: -18.48 总收益: 79.21 平均盈利: 0.65 typeA: 0.35 胜率: 53.72%


          ========== 回测结果 ==========
          总交易次数:     987
    盈利次数:       471
    亏损次数:       516
          胜率:          47.72%
          总收益:        1983.25 USDT
          盈亏比:        1.65
    rw:        0.0107
    rl:        0.0059
    carry:        31.60
    最大连续盈利:  297.3115061406079
    最大连续亏损:  -86.74681383709603
    最大连盈次数:  6
    最大连亏次数:  7
          =============================

tradeNumTotal 987
profitTotal 1785.254495099358
maxLossTotal -29.31
winRateTotal 336.53999999999996
period month 7
avgRate 48.08
maxDrawdownTotal 18
趋势空且增强-R-3-2 总交易次数: 124 盈利: 1151.9299504817607 亏损: -625.6978279189262 最大盈利: 154.19 最大亏损: -26.89 总收益: 526.23 平均盈利: 4.24 typeA: 1.61 胜率: 37.90%
趋势空且增强-L-2-2 总交易次数: 130 盈利: 712.5411758999836 亏损: -314.11103770777595 最大盈利: 197.70 最大亏损: -23.14 总收益: 398.43 平均盈利: 3.06 typeA: 1.32 胜率: 43.08%
趋势多且增强-L-1-1 总交易次数: 132 盈利: 553.8641717296389 亏损: -263.37519636227347 最大盈利: 119.35 最大亏损: -18.64 总收益: 290.49 平均盈利: 2.20 typeA: 1.27 胜率: 57.58%
趋势多且增强-L-1-2 总交易次数: 143 盈利: 536.2712995794512 亏损: -246.97608755741592 最大盈利: 88.34 最大亏损: -17.13 总收益: 289.30 平均盈利: 2.02 typeA: 1.08 胜率: 53.15%
趋势多且增强-R-3-1 总交易次数: 129 盈利: 1059.2677920932695 亏损: -732.5888043888589 最大盈利: 111.21 最大亏损: -29.31 总收益: 326.68 平均盈利: 2.53 typeA: 0.94 胜率: 37.21%
趋势空且增强-L-2-1 总交易次数: 103 盈利: 320.2935074509661 亏损: -224.63078223755977 最大盈利: 38.87 最大亏损: -15.96 总收益: 95.66 平均盈利: 0.93 typeA: 0.50 胜率: 54.37%
趋势空且增强-R-3-1 总交易次数: 118 盈利: 389.5264100893027 亏损: -326.3180005386844 最大盈利: 51.79 最大亏损: -26.98 总收益: 63.21 平均盈利: 0.54 typeA: 0.26 胜率: 49.15%
趋势多且增强-R-3-2 总交易次数: 108 盈利: 322.1734792780337 亏损: -328.9155547915096 最大盈利: 28.48 最大亏损: -27.21 总收益: -6.74 平均盈利: -0.06 typeA: -0.03 胜率: 50.00%


*/
