/*  #################################


if (emaFast > emaSlow) {
  if (close > emaFast) {
    if (adxPlusDI > adxMinusDI) {
      if (rsi > 70) {
        marketType = adx >= 30 ? '趋势多' : '趋势空';
      } else if (rsi > 75) {
        marketType = '趋势空';
        if (
          emaSlope > config.emaSlope.emaSlopeThreshold * 2 &&
          adx >= 30
        )
          marketType =
            adxMinusDI > 10 && rsi > 80
              ? '趋势空且增强-1'
              : adxMinusDI < 10
              ? '趋势多且增强-1'
              : '';
      } else if (
        rsi < 60 &&
        emaSlope > config.emaSlope.emaSlopeThreshold / 2
      ) {
        marketType = '趋势多且增强-2';
      }
    } else {
      if (adx < 20 && adx > 15) {
        if (
          rsi > 60 &&
          emaSlope > config.emaSlope.emaSlopeThreshold * 2
        )
          marketType = '趋势空且增强-2';
      }
    }
  } else if (close < emaSlow) {
    if (adxPlusDI < adxMinusDI) {
      if (rsi < 50) marketType = '趋势空且增强-3';
    }
    if (adxPlusDI > adxMinusDI) {
      if (rsi > 50) marketType = '趋势多且增强-3';
    }
    if (adx >= 25) {
      if (rsi > 40) {
        marketType = '趋势多且增强-4';
      }
    }
    if (adx < 25) {
    }
    if (adx < 20) {
      if (adxPlusDI < adxMinusDI) {
        marketType = '趋势空';
      }
      if (rsi > 55 && adxPlusDI > adxMinusDI)
        marketType = '趋势多且增强-5';
      if (rsi < 45 && adxPlusDI < adxMinusDI)
        marketType = '趋势空且增强-4';
    }
  } else {
    if (adx < 25 && adx > 20) {
      if (rsi > 50) marketType = '趋势多且增强-6';
      if (rsi < 50) marketType = '趋势多且增强-5';
    }
  }
}

if (emaFast < emaSlow) {
  if (close < emaFast) {
    if (adxPlusDI < adxMinusDI) {
      if (rsi < 30) {
        marketType = '趋势多';
        if (
          rsi < 25 &&
          emaSlope < -config.emaSlope.emaSlopeThreshold * 2
        )
          marketType =
            adxPlusDI > 10 ? '趋势多且增强-7' : '趋势多';
      } else if (
        rsi > 40 &&
        emaSlope < -config.emaSlope.emaSlopeThreshold / 2
      ) {
        marketType = '趋势空且增强-7';
      }
    } else {
      if (adx < 20 && adx > 15) {
        if (
          rsi < 45 &&
          emaSlope < -config.emaSlope.emaSlopeThreshold * 2
        )
          marketType = '趋势多且增强-8';
      }
    }
  } else if (close > emaSlow) {
    if (adxPlusDI < adxMinusDI) {
      if (rsi < 50) marketType = '趋势空且增强-8';
    }
    if (adxPlusDI > adxMinusDI) {
      if (rsi > 50) marketType = '趋势空';
    }

    if (adx >= 25) {
      if (rsi < 60) marketType = '趋势空';
    }
    if (adx < 25) {
      marketType = rsi > 60 ? '趋势多' : '趋势空';
    }
    if (adx < 20) {
      if (rsi > 55 && adxPlusDI > adxMinusDI)
        marketType = '趋势多且增强-10';
      if (rsi < 45 && adxPlusDI < adxMinusDI)
        marketType = '趋势空且增强-10';
    }
  } else {
  }
}

if (
  adx < 25 &&
  adxPlusDI > adxMinusDI &&
  emaFast < emaSlow &&
  close < emaFast
) {
  if (rsi < 30 && emaSlope < -config.emaSlope.emaSlopeThreshold)
    marketType = '趋势空且增强-11';
}
if (
  adx < 25 &&
  adxPlusDI < adxMinusDI &&
  emaFast > emaSlow &&
  close > emaFast
) {
  if (rsi > 70 && emaSlope > config.emaSlope.emaSlopeThreshold)
    marketType = '趋势多且增强-11';
}



######################################################################

if (emaSlope > config.emaSlope.emaSlopeThreshold)
							if (
								emaSlope >
								config.emaSlope.emaSlopeThreshold * 3
							) {
								marketType =
									adxMinusDI > 10
										? rsi > 75
											? '趋势空且增强-L0-1-1-1'
											: ''
										: adxMinusDI < 10
										? rsi > 80
											? '趋势空且增强-L0-1-2-1'
											: '趋势空且增强-L0-1-2-2'
										: '';
							} else if (
								emaSlope >
								config.emaSlope.emaSlopeThreshold * 2
							) {
								marketType =
									adxMinusDI > 10
										? rsi > 75
											? '趋势空且增强-L0-2-1-1'
											: ''
										: adxMinusDI < 10
										? rsi > 80
											? '趋势空且增强-L0-2-2-1'
											: '趋势空且增强-L0-2-2-2'
										: '';
							} else {
								marketType =
									adxMinusDI > 10
										? rsi > 75
											? ''
											: '趋势空且增强-L0-3-1-2'
										: adxMinusDI < 10
										? rsi > 80
											? '趋势空且增强-L0-3-2-1'
											: '趋势空且增强-L0-3-2-2'
										: '';
							}


#######################################################################



/*


// profitTotal 128229.40293307074
// maxLossTotal -8015.37
// winRateTotal 2363.840000000001
// period month 53
// avgRate 44.60
// maxDrawdownTotal 46.3
// 趋势空且增强-1 总交易次数: 252 盈利: 171 亏损: 81 最大盈利: 3060.96 最大亏损: -8015.37 胜率: 67.86% 总收益: 9677.65
// 趋势多且增强-7 总交易次数: 270 盈利: 181 亏损: 89 最大盈利: 1699.60 最大亏损: -1208.82 胜率: 67.04% 总收益: 15497.30
// 趋势空且增强-11 总交易次数: 146 盈利: 89 亏损: 57 最大盈利: 778.33 最大亏损: -813.44 胜率: 60.96% 总收益: 2766.38
// 趋势空且增强-2 总交易次数: 166 盈利: 98 亏损: 68 最大盈利: 1750.26 最大亏损: -1724.13 胜率: 59.04% 总收益: 1835.80
// 趋势多且增强-3 总交易次数: 12 盈利: 7 亏损: 5 最大盈利: 405.27 最大亏损: -92.76 胜率: 58.33% 总收益: 642.52
// 趋势多且增强-8 总交易次数: 275 盈利: 155 亏损: 120 最大盈利: 3060.40 最大亏损: -1479.45 胜率: 56.36% 总收益: 1439.47
// 趋势多且增强-4 总交易次数: 785 盈利: 437 亏损: 348 最大盈利: 3373.87 最大亏损: -1173.74 胜率: 55.67% 总收益: 21416.80
// 趋势多且增强-11 总交易次数: 182 盈利: 100 亏损: 82 最大盈利: 2658.47 最大亏损: -907.40 胜率: 54.95% 总收益: 3391.26
// 趋势多且增强-1 总交易次数: 102 盈利: 47 亏损: 55 最大盈利: 3283.19 最大亏损: -1889.43 胜率: 46.08% 总收益: 6530.29
// 趋势空且增强-4 总交易次数: 76 盈利: 35 亏损: 41 最大盈利: 910.73 最大亏损: -292.60 胜率: 46.05% 总收益: 1609.29
// 趋势空且增强-7 总交易次数: 1465 盈利: 643 亏损: 822 最大盈利: 2350.99 最大亏损: -3479.07 胜率: 43.89% 总收益: 23983.70
// 趋势多且增强-2 总交易次数: 1204 盈利: 471 亏损: 733 最大盈利: 3114.40 最大亏损: -1401.52 胜率: 39.12% 总收益: 40899.91
// 趋势多且增强-10 总交易次数: 54 盈利: 21 亏损: 33 最大盈利: 1251.76 最大亏损: -797.76 胜率: 38.89% 总收益: 1629.24
// 趋势空且增强-3 总交易次数: 380 盈利: 140 亏损: 240 最大盈利: 1717.05 最大亏损: -1220.59 胜率: 36.84% 总收益: 5954.93
// 趋势多且增强-6 总交易次数: 916 盈利: 312 亏损: 604 最大盈利: 2117.62 最大亏损: -1603.63 胜率: 34.06% 总收益: 3968.27
// 趋势多且增强-5 总交易次数: 38 盈利: 9 亏损: 29 最大盈利: 275.93 最大亏损: -185.04 胜率: 23.68% 总收益: -305.40

/*
###################################################

趋势多且增强-1 总交易次数: 102 盈利: 15543.836700226399 亏损: -9013.549142325903 最大盈利: 3283.19 最大亏损: -1889.43 胜率: 46.08% 总收益: 6530.29 平均盈利: 64.02
趋势多且增强-7 总交易次数: 270 盈利: 39401.278935118884 亏损: -23903.97890286401 最大盈利: 1699.60 最大亏损: -1208.82 胜率: 67.04% 总收益: 15497.30 平均盈利: 57.40
趋势多且增强-3 总交易次数: 12 盈利: 802.7784718940346 亏损: -160.25659676774796 最大盈利: 405.27 最大亏损: -92.76 胜率: 58.33% 总收益: 642.52 平均盈利: 53.54
趋势空且增强-1 总交易次数: 252 盈利: 45986.12098660062 亏损: -36308.473752504535 最大盈利: 3060.96 最大亏损: -8015.37 胜率: 67.86% 总收益: 9677.65 平均盈利: 38.40
趋势多且增强-2 总交易次数: 1204 盈利: 136196.84061735877 亏损: -95296.93241461799 最大盈利: 3114.40 最大亏损: -1401.52 胜率: 39.12% 总收益: 40899.91 平均盈利: 33.97
趋势多且增强-10 总交易次数: 54 盈利: 4197.441592576286 亏损: -2568.205216179146 最大盈利: 1251.76 最大亏损: -797.76 胜率: 38.89% 总收益: 1629.24 平均盈利: 30.17
趋势多且增强-4 总交易次数: 785 盈利: 59600.76945481538 亏损: -38183.965008360436 最大盈利: 3373.87 最大亏损: -1173.74 胜率: 55.67% 总收益: 21416.80 平均盈利: 27.28
趋势空且增强-4 总交易次数: 76 盈利: 5795.6569336612 亏损: -4186.367615539448 最大盈利: 910.73 最大亏损: -292.60 胜率: 46.05% 总收益: 1609.29 平均盈利: 21.17
趋势空且增强-11 总交易次数: 146 盈利: 14149.47938334938 亏损: -11383.10405512391 最大盈利: 778.33 最大亏损: -813.44 胜率: 60.96% 总收益: 2766.38 平均盈利: 18.95
趋势多且增强-11 总交易次数: 182 盈利: 20517.223144383825 亏损: -17125.96673588096 最大盈利: 2658.47 最大亏损: -907.40 胜率: 54.95% 总收益: 3391.26 平均盈利: 18.63
趋势空且增强-7 总交易次数: 1465 盈利: 165861.3375531459 亏损: -141877.6423715744 最大盈利: 2350.99 最大亏损: -3479.07 胜率: 43.89% 总收益: 23983.70 平均盈利: 16.37
趋势空且增强-3 总交易次数: 380 盈利: 30163.064226270282 亏损: -24208.1294140455 最大盈利: 1717.05 最大亏损: -1220.59 胜率: 36.84% 总收益: 5954.93 平均盈利: 15.67
趋势空且增强-2 总交易次数: 166 盈利: 13108.576725370716 亏损: -11272.772603321857 最大盈利: 1750.26 最大亏损: -1724.13 胜率: 59.04% 总收益: 1835.80 平均盈利: 11.06
趋势多且增强-8 总交易次数: 275 盈利: 18957.67933200975 亏损: -17518.207981196203 最大盈利: 3060.40 最大亏损: -1479.45 胜率: 56.36% 总收益: 1439.47 平均盈利: 5.23
趋势多且增强-6 总交易次数: 916 盈利: 51025.907279950356 亏损: -47057.63398281573 最大盈利: 2117.62 最大亏损: -1603.63 胜率: 34.06% 总收益: 3968.27 平均盈利: 4.33
趋势多且增强-5 总交易次数: 38 盈利: 822.6398399342359 亏损: -1128.0424504778116 最大盈利: 275.93 最大亏损: -185.04 胜率: 23.68% 总收益: -305.40 平均盈利: -8.04

###############################################################################

趋势多且增强-7 总交易次数: 270 盈利: 39401.278935118884 亏损: -23903.97890286401 最大盈利: 1699.60 最大亏损: -1208.82 胜率: 67.04% 总收益: 15497.30 平均盈利: 57.40 typeA: 38.48
趋势多且增强-3 总交易次数: 12 盈利: 802.7784718940346 亏损: -160.25659676774796 最大盈利: 405.27 最大亏损: -92.76 胜率: 58.33% 总收益: 642.52 平均盈利: 53.54 typeA: 31.23
趋势多且增强-1 总交易次数: 102 盈利: 15543.836700226399 亏损: -9013.549142325903 最大盈利: 3283.19 最大亏损: -1889.43 胜率: 46.08% 总收益: 6530.29 平均盈利: 64.02 typeA: 29.50
趋势空且增强-1 总交易次数: 252 盈利: 45986.12098660062 亏损: -36308.473752504535 最大盈利: 3060.96 最大亏损: -8015.37 胜率: 67.86% 总收益: 9677.65 平均盈利: 38.40 typeA: 26.06
趋势多且增强-4 总交易次数: 785 盈利: 59600.76945481538 亏损: -38183.965008360436 最大盈利: 3373.87 最大亏损: -1173.74 胜率: 55.67% 总收益: 21416.80 平均盈利: 27.28 typeA: 15.19
趋势多且增强-2 总交易次数: 1204 盈利: 136196.84061735877 亏损: -95296.93241461799 最大盈利: 3114.40 最大亏损: -1401.52 胜率: 39.12% 总收益: 40899.91 平均盈利: 33.97 typeA: 13.29
趋势多且增强-10 总交易次数: 54 盈利: 4197.441592576286 亏损: -2568.205216179146 最大盈利: 1251.76 最大亏损: -797.76 胜率: 38.89% 总收益: 1629.24 平均盈利: 30.17 typeA: 11.73
趋势空且增强-11 总交易次数: 146 盈利: 14149.47938334938 亏损: -11383.10405512391 最大盈利: 778.33 最大亏损: -813.44 胜率: 60.96% 总收益: 2766.38 平均盈利: 18.95 typeA: 11.55
趋势多且增强-11 总交易次数: 182 盈利: 20517.223144383825 亏损: -17125.96673588096 最大盈利: 2658.47 最大亏损: -907.40 胜率: 54.95% 总收益: 3391.26 平均盈利: 18.63 typeA: 10.24
趋势空且增强-4 总交易次数: 76 盈利: 5795.6569336612 亏损: -4186.367615539448 最大盈利: 910.73 最大亏损: -292.60 胜率: 46.05% 总收益: 1609.29 平均盈利: 21.17 typeA: 9.75
趋势空且增强-7 总交易次数: 1465 盈利: 165861.3375531459 亏损: -141877.6423715744 最大盈利: 2350.99 最大亏损: -3479.07 胜率: 43.89% 总收益: 23983.70 平均盈利: 16.37 typeA: 7.19
趋势空且增强-2 总交易次数: 166 盈利: 13108.576725370716 亏损: -11272.772603321857 最大盈利: 1750.26 最大亏损: -1724.13 胜率: 59.04% 总收益: 1835.80 平均盈利: 11.06 typeA: 6.53
趋势空且增强-3 总交易次数: 380 盈利: 30163.064226270282 亏损: -24208.1294140455 最大盈利: 1717.05 最大亏损: -1220.59 胜率: 36.84% 总收益: 5954.93 平均盈利: 15.67 typeA: 5.77
趋势多且增强-8 总交易次数: 275 盈利: 18957.67933200975 亏损: -17518.207981196203 最大盈利: 3060.40 最大亏损: -1479.45 胜率: 56.36% 总收益: 1439.47 平均盈利: 5.23 typeA: 2.95
趋势多且增强-6 总交易次数: 916 盈利: 51025.907279950356 亏损: -47057.63398281573 最大盈利: 2117.62 最大亏损: -1603.63 胜率: 34.06% 总收益: 3968.27 平均盈利: 4.33 typeA: 1.48
趋势多且增强-5 总交易次数: 38 盈利: 822.6398399342359 亏损: -1128.0424504778116 最大盈利: 275.93 最大亏损: -185.04 胜率: 23.68% 总收益: -305.40 平均盈利: -8.04 typeA: -1.90


##################################################

profitTotal 128229.40293307074
maxLossTotal -8015.37
winRateTotal 2363.840000000001
period month 53
avgRate 44.60
maxDrawdownTotal 46.3
趋势多且增强-7 总交易次数: 270 盈利: 39401.278935118884 亏损: -23903.97890286401 最大盈利: 1699.60 最大亏损: -1208.82 胜率: 67.04% 总收益: 15497.30 平均盈利: 57.40 typeA: 38.48
趋势多且增强-3 总交易次数: 12 盈利: 802.7784718940346 亏损: -160.25659676774796 最大盈利: 405.27 最大亏损: -92.76 胜率: 58.33% 总收益: 642.52 平均盈利: 53.54 typeA: 31.23
趋势多且增强-1 总交易次数: 102 盈利: 15543.836700226399 亏损: -9013.549142325903 最大盈利: 3283.19 最大亏损: -1889.43 胜率: 46.08% 总收益: 6530.29 平均盈利: 64.02 typeA: 29.50
趋势空且增强-1 总交易次数: 252 盈利: 45986.12098660062 亏损: -36308.473752504535 最大盈利: 3060.96 最大亏损: -8015.37 胜率: 67.86% 总收益: 9677.65 平均盈利: 38.40 typeA: 26.06
趋势多且增强-4 总交易次数: 785 盈利: 59600.76945481538 亏损: -38183.965008360436 最大盈利: 3373.87 最大亏损: -1173.74 胜率: 55.67% 总收益: 21416.80 平均盈利: 27.28 typeA: 15.19
趋势多且增强-2 总交易次数: 1204 盈利: 136196.84061735877 亏损: -95296.93241461799 最大盈利: 3114.40 最大亏损: -1401.52 胜率: 39.12% 总收益: 40899.91 平均盈利: 33.97 typeA: 13.29
趋势多且增强-10 总交易次数: 54 盈利: 4197.441592576286 亏损: -2568.205216179146 最大盈利: 1251.76 最大亏损: -797.76 胜率: 38.89% 总收益: 1629.24 平均盈利: 30.17 typeA: 11.73
趋势空且增强-11 总交易次数: 146 盈利: 14149.47938334938 亏损: -11383.10405512391 最大盈利: 778.33 最大亏损: -813.44 胜率: 60.96% 总收益: 2766.38 平均盈利: 18.95 typeA: 11.55
趋势多且增强-11 总交易次数: 182 盈利: 20517.223144383825 亏损: -17125.96673588096 最大盈利: 2658.47 最大亏损: -907.40 胜率: 54.95% 总收益: 3391.26 平均盈利: 18.63 typeA: 10.24
趋势空且增强-4 总交易次数: 76 盈利: 5795.6569336612 亏损: -4186.367615539448 最大盈利: 910.73 最大亏损: -292.60 胜率: 46.05% 总收益: 1609.29 平均盈利: 21.17 typeA: 9.75
趋势空且增强-7 总交易次数: 1465 盈利: 165861.3375531459 亏损: -141877.6423715744 最大盈利: 2350.99 最大亏损: -3479.07 胜率: 43.89% 总收益: 23983.70 平均盈利: 16.37 typeA: 7.19
趋势空且增强-2 总交易次数: 166 盈利: 13108.576725370716 亏损: -11272.772603321857 最大盈利: 1750.26 最大亏损: -1724.13 胜率: 59.04% 总收益: 1835.80 平均盈利: 11.06 typeA: 6.53
趋势空且增强-3 总交易次数: 380 盈利: 30163.064226270282 亏损: -24208.1294140455 最大盈利: 1717.05 最大亏损: -1220.59 胜率: 36.84% 总收益: 5954.93 平均盈利: 15.67 typeA: 5.77
趋势多且增强-8 总交易次数: 275 盈利: 18957.67933200975 亏损: -17518.207981196203 最大盈利: 3060.40 最大亏损: -1479.45 胜率: 56.36% 总收益: 1439.47 平均盈利: 5.23 typeA: 2.95
趋势多且增强-6 总交易次数: 916 盈利: 51025.907279950356 亏损: -47057.63398281573 最大盈利: 2117.62 最大亏损: -1603.63 胜率: 34.06% 总收益: 3968.27 平均盈利: 4.33 typeA: 1.48
趋势多且增强-5 总交易次数: 38 盈利: 822.6398399342359 亏损: -1128.0424504778116 最大盈利: 275.93 最大亏损: -185.04 胜率: 23.68% 总收益: -305.40 平均盈利: -8.04 typeA: -1.90


###################################################

profitTotal 144034.70494669524
maxLossTotal -5425.95
winRateTotal 2260.7100000000005
period month 53
avgRate 42.65
maxDrawdownTotal 41.9
趋势多且增强-1 总交易次数: 58 盈利: 17878.374725835467 亏损: -9735.804410992057 最大盈利: 6150.71 最大亏损: -1889.43 胜率: 56.90% 总收益: 8142.57 平均盈利: 140.39 typeA: 79.88
趋势空且增强-1 总交易次数: 120 盈利: 31111.87932022779 亏损: -19991.228125900136 最大盈利: 3191.96 最大亏损: -5425.95 胜率: 62.50% 总收益: 11120.65 平均盈利: 92.67 typeA: 57.92
趋势多且增强-7 总交易次数: 270 盈利: 39487.316299317084 亏损: -23903.97890286401 最大盈利: 1699.60 最大亏损: -1208.82 胜率: 67.04% 总收益: 15583.34 平均盈利: 57.72 typeA: 38.69
趋势多且增强-4 总交易次数: 607 盈利: 60051.90442671677 亏损: -30139.898157963285 最大盈利: 9227.82 最大亏损: -1173.74 胜率: 52.88% 总收益: 29912.01 平均盈利: 49.28 typeA: 26.06
趋势多且增强-2 总交易次数: 1039 盈利: 129016.28703655387 亏损: -83039.08150993954 最大盈利: 9874.53 最大亏损: -1401.52 胜率: 36.48% 总收益: 45977.21 平均盈利: 44.25 typeA: 16.14
趋势多且增强-10 总交易次数: 54 盈利: 5032.707097453098 亏损: -2838.8038257945077 最大盈利: 2723.88 最大亏损: -797.76 胜率: 35.19% 总收益: 2193.90 平均盈利: 40.63 typeA: 14.30
趋势空且增强-11 总交易次数: 146 盈利: 14149.47938334938 亏损: -11383.10405512391 最大盈利: 778.33 最大亏损: -813.44 胜率: 60.96% 总收益: 2766.38 平均盈利: 18.95 typeA: 11.55
趋势空且增强-4 总交易次数: 76 盈利: 5795.6569336612 亏损: -4186.367615539448 最大盈利: 910.73 最大亏损: -292.60 胜率: 46.05% 总收益: 1609.29 平均盈利: 21.17 typeA: 9.75
趋势空且增强-7 总交易次数: 1465 盈利: 165861.3375531459 亏损: -141877.6423715744 最大盈利: 2350.99 最大亏损: -3479.07 胜率: 43.89% 总收益: 23983.70 平均盈利: 16.37 typeA: 7.19
趋势空且增强-2 总交易次数: 166 盈利: 13108.576725370716 亏损: -11272.772603321857 最大盈利: 1750.26 最大亏损: -1724.13 胜率: 59.04% 总收益: 1835.80 平均盈利: 11.06 typeA: 6.53
趋势多且增强-8 总交易次数: 275 盈利: 20514.748514673814 亏损: -17518.207981196203 最大盈利: 4561.65 最大亏损: -1479.45 胜率: 56.36% 总收益: 2996.54 平均盈利: 10.90 typeA: 6.14
趋势空且增强-3 总交易次数: 380 盈利: 30163.064226270282 亏损: -24208.1294140455 最大盈利: 1717.05 最大亏损: -1220.59 胜率: 36.84% 总收益: 5954.93 平均盈利: 15.67 typeA: 5.77
趋势多且增强-3 总交易次数: 12 盈利: 397.5066159653215 亏损: -286.16007499605973 最大盈利: 151.39 最大亏损: -125.90 胜率: 50.00% 总收益: 111.35 平均盈利: 9.28 typeA: 4.64
趋势多且增强-11 总交易次数: 172 盈利: 22745.325256324766 亏损: -21301.815662002093 最大盈利: 2331.42 最大亏损: -907.40 胜率: 43.02% 总收益: 1443.51 平均盈利: 8.39 typeA: 3.61
趋势多且增强-6 总交易次数: 881 盈利: 49755.747215755924 亏损: -47619.03342110404 最大盈利: 2117.62 最大亏损: -1603.63 胜率: 31.56% 总收益: 2136.71 平均盈利: 2.43 typeA: 0.77
趋势多且增强-5 总交易次数: 38 盈利: 982.8641989085944 亏损: -1128.0424504778116 最大盈利: 275.93 最大亏损: -185.04 胜率: 23.68% 总收益: -145.18 平均盈利: -3.82 typeA: -0.90

###########################################################################

profitTotal 148380.2293375683
maxLossTotal -3479.07
winRateTotal 2273.48
period month 53
avgRate 42.90
maxDrawdownTotal 44.3
趋势多且增强-7 总交易次数: 270 盈利: 39487.316299317084 亏损: -23903.97890286401 最大盈利: 1699.60 最大亏损: -1208.82 胜率: 67.04% 总收益: 15583.34 平均盈利: 57.72 typeA: 38.69
趋势多且增强-3 总交易次数: 12 盈利: 802.7784718940346 亏损: -160.25659676774796 最大盈利: 405.27 最大亏损: -92.76 胜率: 58.33% 总收益: 642.52 平均盈利: 53.54 typeA: 31.23
趋势多且增强-2 总交易次数: 1103 盈利: 173577.2724759525 亏损: -88391.39003756334 最大盈利: 41166.13 最大亏损: -1401.52 胜率: 37.90% 总收益: 85185.88 平均盈利: 77.23 typeA: 29.27
趋势多且增强-11 总交易次数: 181 盈利: 23175.845051034776 亏损: -18551.016628453748 最大盈利: 2331.42 最大亏损: -907.40 胜率: 49.72% 总收益: 4624.83 平均盈利: 25.55 typeA: 12.70
趋势空且增强-11 总交易次数: 146 盈利: 14149.47938334938 亏损: -11647.058051779211 最大盈利: 778.33 最大亏损: -897.70 胜率: 60.96% 总收益: 2502.42 平均盈利: 17.14 typeA: 10.45
趋势空且增强-4 总交易次数: 76 盈利: 5795.6569336612 亏损: -4186.367615539448 最大盈利: 910.73 最大亏损: -292.60 胜率: 46.05% 总收益: 1609.29 平均盈利: 21.17 typeA: 9.75
趋势空且增强-2 总交易次数: 166 盈利: 13108.576725370716 亏损: -11078.50583539961 最大盈利: 1750.26 最大亏损: -818.35 胜率: 59.04% 总收益: 2030.07 平均盈利: 12.23 typeA: 7.22
趋势多且增强-10 总交易次数: 54 盈利: 3731.834920204533 亏损: -2755.579305853593 最大盈利: 1251.76 最大亏损: -797.76 胜率: 37.04% 总收益: 976.26 平均盈利: 18.08 typeA: 6.70
趋势空且增强-7 总交易次数: 1467 盈利: 165861.3375531459 亏损: -144142.32283461362 最大盈利: 2350.99 最大亏损: -3479.07 胜率: 43.83% 总收益: 21719.01 平均盈利: 14.81 typeA: 6.49
趋势多且增强-8 总交易次数: 275 盈利: 20677.634858869253 亏损: -17518.207981196203 最大盈利: 4780.36 最大亏损: -1479.45 胜率: 56.36% 总收益: 3159.43 平均盈利: 11.49 typeA: 6.48
趋势多且增强-4 总交易次数: 657 盈利: 41378.95987003667 亏损: -34007.904189795496 最大盈利: 1855.48 最大亏损: -1173.74 胜率: 52.82% 总收益: 7371.06 平均盈利: 11.22 typeA: 5.93
趋势空且增强-3 总交易次数: 380 盈利: 30133.564474902803 亏损: -24262.45297253222 最大盈利: 1717.05 最大亏损: -1220.59 胜率: 36.58% 总收益: 5871.11 平均盈利: 15.45 typeA: 5.65
趋势多且增强-6 总交易次数: 914 盈利: 55993.55515001397 亏损: -47043.13926728289 最大盈利: 5340.69 最大亏损: -1603.63 胜率: 33.92% 总收益: 8950.42 平均盈利: 9.79 typeA: 3.32
趋势多且增强-5 总交易次数: 38 盈利: 822.6398399342359 亏损: -1128.0424504778116 最大盈利: 275.93 最大亏损: -185.04 胜率: 23.68% 总收益: -305.40 平均盈利: -8.04 typeA: -1.90

==================================================================




profitTotal 152640.6598333721
maxLossTotal -3479.07
winRateTotal 2306.8199999999997
period month 53
avgRate 43.52
maxDrawdownTotal 44.1
趋势多且增强-7 总交易次数: 270 盈利: 39487.316299317084 亏损: -23903.97890286401 最大盈利: 1699.60 最大亏损: -1208.82 胜率: 67.04% 总收益: 15583.34 平均盈利: 57.72 typeA: 38.69
趋势多且增强-2 总交易次数: 1095 盈利: 173476.31324507284 亏损: -87438.38568864955 最大盈利: 41166.13 最大亏损: -1401.52 胜率: 37.99% 总收益: 86037.93 平均盈利: 78.57 typeA: 29.85
趋势空且增强-4 总交易次数: 74 盈利: 6269.825815341308 亏损: -4300.131770564811 最大盈利: 910.73 最大亏损: -292.60 胜率: 50.00% 总收益: 1969.69 平均盈利: 26.62 typeA: 13.31
趋势多且增强-11 总交易次数: 181 盈利: 23175.845051034776 亏损: -18817.02540823572 最大盈利: 2331.42 最大亏损: -907.40 胜率: 49.72% 总收益: 4358.82 平均盈利: 24.08 typeA: 11.97
趋势多且增强-3 总交易次数: 68 盈利: 3860.982337820494 亏损: -2529.091636680612 最大盈利: 1049.40 最大亏损: -291.68 胜率: 44.12% 总收益: 1331.89 平均盈利: 19.59 typeA: 8.64
趋势空且增强-7 总交易次数: 1419 盈利: 169488.9051112377 亏损: -144593.44696635279 最大盈利: 2350.99 最大亏损: -3479.07 胜率: 45.53% 总收益: 24895.46 平均盈利: 17.54 typeA: 7.99
趋势空且增强-2 总交易次数: 161 盈利: 13255.933252049594 亏损: -11041.000895638583 最大盈利: 1750.26 最大亏损: -818.35 胜率: 57.76% 总收益: 2214.93 平均盈利: 13.76 typeA: 7.95
趋势空且增强-11 总交易次数: 141 盈利: 13615.384312665894 亏损: -12006.550750914672 最大盈利: 778.33 最大亏损: -897.70 胜率: 59.57% 总收益: 1608.83 平均盈利: 11.41 typeA: 6.80
趋势多且增强-10 总交易次数: 54 盈利: 3731.834920204533 亏损: -2755.579305853593 最大盈利: 1251.76 最大亏损: -797.76 胜率: 37.04% 总收益: 976.26 平均盈利: 18.08 typeA: 6.70
趋势多且增强-8 总交易次数: 273 盈利: 20671.546734610813 亏损: -17434.133911763944 最大盈利: 4780.36 最大亏损: -1479.45 胜率: 56.41% 总收益: 3237.41 平均盈利: 11.86 typeA: 6.69
趋势空且增强-3 总交易次数: 379 盈利: 33983.677524984254 亏损: -27889.90621432036 最大盈利: 1717.05 最大亏损: -1220.59 胜率: 37.47% 总收益: 6093.77 平均盈利: 16.08 typeA: 6.02
趋势多且增强-4 总交易次数: 658 盈利: 41384.59678919644 亏损: -34007.904189795496 最大盈利: 1855.48 最大亏损: -1173.74 胜率: 52.89% 总收益: 7376.69 平均盈利: 11.21 typeA: 5.93
趋势多且增强-6 总交易次数: 918 盈利: 55869.099142616215 亏损: -47469.465061145966 最大盈利: 5340.69 最大亏损: -1603.63 胜率: 33.77% 总收益: 8399.63 平均盈利: 9.15 typeA: 3.09


##################################################################

profitTotal 143653.08109252137
maxLossTotal -3479.07
winRateTotal 2308.840000000001
period month 53
avgRate 43.56
maxDrawdownTotal 41.4
趋势空且增强-1 总交易次数: 129 盈利: 25065.03397388836 亏损: -12138.772122165288 最大盈利: 3191.96 最大亏损: -1549.16 胜率: 66.67% 总收益: 12926.26 平均盈利: 100.20 typeA: 66.81
趋势多且增强-1 总交易次数: 61 盈利: 17296.407604573993 亏损: -11024.284352343619 最大盈利: 6150.71 最大亏损: -1889.43 胜率: 54.10% 总收益: 6272.12 平均盈利: 102.82 typeA: 55.63
趋势多且增强-4 总交易次数: 677 盈利: 60799.263356889176 亏损: -31407.4755182825 最大盈利: 9227.82 最大亏损: -923.52 胜率: 53.47% 总收益: 29391.79 平均盈利: 43.41 typeA: 23.21
趋势多且增强-7 总交易次数: 394 盈利: 34629.001903660406 亏损: -20858.86901926128 最大盈利: 1699.60 最大亏损: -1439.52 胜率: 59.90% 总收益: 13770.13 平均盈利: 34.95 typeA: 20.93
趋势多且增强-2 总交易次数: 1101 盈利: 134654.53460328118 亏损: -89942.89773736836 最大盈利: 9874.53 最大亏损: -1361.53 胜率: 37.69% 总收益: 44711.64 平均盈利: 40.61 typeA: 15.31
趋势多且增强-11 总交易次数: 181 盈利: 23903.226692041186 亏损: -19027.415892475776 最大盈利: 2331.42 最大亏损: -907.40 胜率: 50.28% 总收益: 4875.81 平均盈利: 26.94 typeA: 13.54
趋势空且增强-4 总交易次数: 74 盈利: 5860.906357711153 亏损: -4300.131770564811 最大盈利: 910.73 最大亏损: -292.60 胜率: 50.00% 总收益: 1560.77 平均盈利: 21.09 typeA: 10.55
趋势空且增强-2 总交易次数: 161 盈利: 13517.416236992509 亏损: -10868.272859624105 最大盈利: 1750.26 最大亏损: -726.46 胜率: 57.76% 总收益: 2649.14 平均盈利: 16.45 typeA: 9.50
趋势多且增强-3 总交易次数: 68 盈利: 3860.982337820494 亏损: -2529.091636680612 最大盈利: 1049.40 最大亏损: -291.68 胜率: 44.12% 总收益: 1331.89 平均盈利: 19.59 typeA: 8.64
趋势空且增强-11 总交易次数: 141 盈利: 14646.604414224088 亏损: -12618.447768094416 最大盈利: 778.33 最大亏损: -910.68 胜率: 55.32% 总收益: 2028.16 平均盈利: 14.38 typeA: 7.96
趋势空且增强-7 总交易次数: 1343 盈利: 164109.97955247574 亏损: -140110.4955749115 最大盈利: 2544.83 最大亏损: -3479.07 胜率: 43.78% 总收益: 23999.48 平均盈利: 17.87 typeA: 7.82
趋势多且增强-10 总交易次数: 54 盈利: 3731.834920204533 亏损: -2880.019601458416 最大盈利: 1251.76 最大亏损: -797.76 胜率: 37.04% 总收益: 851.82 平均盈利: 15.77 typeA: 5.84
趋势空且增强-3 总交易次数: 371 盈利: 32708.734204891476 亏损: -27240.79363795605 最大盈利: 2357.13 最大亏损: -1220.59 胜率: 37.20% 总收益: 5467.94 平均盈利: 14.74 typeA: 5.48
趋势多且增强-8 总交易次数: 273 盈利: 20436.229936523952 亏损: -19210.195059546815 最大盈利: 4561.65 最大亏损: -1479.45 胜率: 56.04% 总收益: 1226.03 平均盈利: 4.49 typeA: 2.52
趋势多且增强-6 总交易次数: 918 盈利: 52078.97503545774 亏损: -47540.887487381064 最大盈利: 2117.62 最大亏损: -1286.08 胜率: 33.77% 总收益: 4538.09 平均盈利: 4.94 typeA: 1.67

################################################################



profitTotal 147985.34578208814
maxLossTotal -3479.07
winRateTotal 2327.5000000000005
period month 53
avgRate 43.92
maxDrawdownTotal 42.7
趋势空且增强-1 总交易次数: 129 盈利: 25065.03397388836 亏损: -12138.772122165288 最大盈利: 3191.96 最大亏损: -1549.16 胜率: 66.67% 总收益: 12926.26 平均盈利: 100.20 typeA: 66.81
趋势多且增强-1 总交易次数: 61 盈利: 17296.407604573993 亏损: -11024.284352343619 最大盈利: 6150.71 最大亏损: -1889.43 胜率: 54.10% 总收益: 6272.12 平均盈利: 102.82 typeA: 55.63
趋势多且增强-7test2 总交易次数: 107 盈利: 12089.63784874288 亏损: -5979.998584044565 最大盈利: 1427.22 最大亏损: -1764.99 胜率: 69.16% 总收益: 6109.64 平均盈利: 57.10 typeA: 39.49
趋势多且增强-4 总交易次数: 678 盈利: 60939.73934432185 亏损: -31391.39323585886 最大盈利: 9227.82 最大亏损: -923.52 胜率: 53.54% 总收益: 29548.35 平均盈利: 43.58 typeA: 23.33
趋势多且增强-7test1 总交易次数: 327 盈利: 26386.87950334655 亏损: -15144.332728692547 最大盈利: 1699.60 最大亏损: -984.85 胜率: 61.47% 总收益: 11242.55 平均盈利: 34.38 typeA: 21.13
趋势多且增强-2 总交易次数: 1102 盈利: 134992.85933942435 亏损: -89942.89773736836 最大盈利: 9874.53 最大亏损: -1361.53 胜率: 37.75% 总收益: 45049.96 平均盈利: 40.88 typeA: 15.43
趋势多且增强-11 总交易次数: 181 盈利: 23903.226692041186 亏损: -19027.415892475776 最大盈利: 2331.42 最大亏损: -907.40 胜率: 50.28% 总收益: 4875.81 平均盈利: 26.94 typeA: 13.54
趋势空且增强-2 总交易次数: 161 盈利: 13517.416236992509 亏损: -10868.272859624105 最大盈利: 1750.26 最大亏损: -726.46 胜率: 57.76% 总收益: 2649.14 平均盈利: 16.45 typeA: 9.50
趋势空且增强-11 总交易次数: 141 盈利: 14811.612471406766 亏损: -12615.260446157094 最大盈利: 778.33 最大亏损: -910.68 胜率: 56.03% 总收益: 2196.35 平均盈利: 15.58 typeA: 8.73
趋势空且增强-4 总交易次数: 74 盈利: 5581.547946345316 亏损: -4300.131770564811 最大盈利: 910.73 最大亏损: -292.60 胜率: 50.00% 总收益: 1281.42 平均盈利: 17.32 typeA: 8.66
趋势多且增强-3 总交易次数: 68 盈利: 3860.982337820494 亏损: -2529.091636680612 最大盈利: 1049.40 最大亏损: -291.68 胜率: 44.12% 总收益: 1331.89 平均盈利: 19.59 typeA: 8.64
趋势空且增强-7 总交易次数: 1350 盈利: 164217.93487141497 亏损: -140540.29814902393 最大盈利: 2544.83 最大亏损: -3479.07 胜率: 43.70% 总收益: 23677.64 平均盈利: 17.54 typeA: 7.66
趋势空且增强-3 总交易次数: 372 盈利: 33532.57665524387 亏损: -27296.572146903964 最大盈利: 2357.13 最大亏损: -1220.59 胜率: 37.10% 总收益: 6236.00 平均盈利: 16.76 typeA: 6.22
趋势多且增强-10 总交易次数: 54 盈利: 3731.834920204533 亏损: -2880.019601458416 最大盈利: 1251.76 最大亏损: -797.76 胜率: 37.04% 总收益: 851.82 平均盈利: 15.77 typeA: 5.84
趋势多且增强-8 总交易次数: 274 盈利: 20436.229936523952 亏损: -19217.267611550873 最大盈利: 4561.65 最大亏损: -1479.45 胜率: 55.84% 总收益: 1218.96 平均盈利: 4.45 typeA: 2.48
趋势多且增强-6 总交易次数: 918 盈利: 52078.97503545774 亏损: -47509.54006074834 最大盈利: 2117.62 最大亏损: -1286.08 胜率: 33.77% 总收益: 4569.43 平均盈利: 4.98 typeA: 1.68

#############################################################


profitTotal 129728.46919851024
maxLossTotal -1889.43
winRateTotal 2606.68
period month 53
avgRate 49.18
maxDrawdownTotal 36.9
趋势空且增强-1 总交易次数: 131 盈利: 25069.644521439583 亏损: -12138.772122165288 最大盈利: 3191.96 最大亏损: -1549.16 胜率: 67.18% 总收益: 12930.87 平均盈利: 98.71 typeA: 66.31
趋势多且增强-1 总交易次数: 61 盈利: 17296.407604573993 亏损: -11024.284352343619 最大盈利: 6150.71 最大亏损: -1889.43 胜率: 54.10% 总收益: 6272.12 平均盈利: 102.82 typeA: 55.63
趋势多且增强-7test2 总交易次数: 108 盈利: 12096.200922277689 亏损: -5979.998584044565 最大盈利: 1427.22 最大亏损: -1764.99 胜率: 69.44% 总收益: 6116.20 平均盈利: 56.63 typeA: 39.32
趋势空且增强-2 总交易次数: 257 盈利: 27823.532690092812 亏损: -16246.026129281627 最大盈利: 3207.12 最大亏损: -726.46 胜率: 59.53% 总收益: 11577.51 平均盈利: 45.05 typeA: 26.82
趋势多且增强-4 总交易次数: 732 盈利: 65832.23969324383 亏损: -33041.186041826266 最大盈利: 9227.82 最大亏损: -923.52 胜率: 54.51% 总收益: 32791.05 平均盈利: 44.80 typeA: 24.42
趋势多且增强-7test1 总交易次数: 330 盈利: 26825.67298336487 亏损: -15144.332728692547 最大盈利: 1699.60 最大亏损: -984.85 胜率: 61.82% 总收益: 11681.34 平均盈利: 35.40 typeA: 21.88
趋势多且增强-2 总交易次数: 1355 盈利: 155491.96815233625 亏损: -110356.70829683944 最大盈利: 9874.53 最大亏损: -1361.53 胜率: 37.34% 总收益: 45135.26 平均盈利: 33.31 typeA: 12.44
趋势多且增强-11 总交易次数: 192 盈利: 24250.397951602452 亏损: -19823.260197738728 最大盈利: 2331.42 最大亏损: -907.40 胜率: 50.00% 总收益: 4427.14 平均盈利: 23.06 typeA: 11.53
趋势空且增强-4 总交易次数: 106 盈利: 8668.79092844931 亏损: -6807.499636916097 最大盈利: 910.73 最大亏损: -383.83 胜率: 49.06% 总收益: 1861.29 平均盈利: 17.56 typeA: 8.61
趋势空且增强-11 总交易次数: 187 盈利: 18140.163847941418 亏损: -15608.760783055459 最大盈利: 778.33 最大亏损: -910.68 胜率: 56.15% 总收益: 2531.40 平均盈利: 13.54 typeA: 7.60
趋势多且增强-8 总交易次数: 286 盈利: 21460.53825422555 亏损: -19528.25947813389 最大盈利: 4561.65 最大亏损: -1479.45 胜率: 56.99% 总收益: 1932.28 平均盈利: 6.76 typeA: 3.85


##################################################################



tradeNumTotal 3432
profitTotal 132016.74421826098
maxLossTotal -2110.94
winRateTotal 2630.6000000000004
period month 53
avgRate 49.63
maxDrawdownTotal 29.6
趋势空且增强-1 总交易次数: 131 盈利: 25069.644521439583 亏损: -12138.772122165288 最大盈利: 3191.96 最大亏损: -1549.16 胜率: 67.18% 总收益: 12930.87 平均盈利: 98.71 typeA: 66.31
趋势多且增强-1 总交易次数: 61 盈利: 17377.836074828952 亏损: -10363.964846442652 最大盈利: 6150.71 最大亏损: -1694.02 胜率: 54.10% 总收益: 7013.87 平均盈利: 114.98 typeA: 62.20
趋势空且增强-2 总交易次数: 253 盈利: 33096.78302448325 亏损: -16494.7582515435 最大盈利: 4403.10 最大亏损: -726.46 胜率: 58.50% 总收益: 16602.02 平均盈利: 65.62 typeA: 38.39
趋势多且增强-7test2 总交易次数: 107 盈利: 11805.060151029167 亏损: -6426.581956572068 最大盈利: 1427.22 最大亏损: -2088.31 胜率: 69.16% 总收益: 5378.48 平均盈利: 50.27 typeA: 34.76
趋势多且增强-4 总交易次数: 728 盈利: 68458.37403898448 亏损: -36129.53255468728 最大盈利: 9227.82 最大亏损: -1830.26 胜率: 58.65% 总收益: 32328.84 平均盈利: 44.41 typeA: 26.05
趋势多且增强-7test1 总交易次数: 325 盈利: 27370.293834378674 亏损: -16032.988709013554 最大盈利: 1699.60 最大亏损: -1818.29 胜率: 60.92% 总收益: 11337.31 平均盈利: 34.88 typeA: 21.25
趋势空且增强-11 总交易次数: 176 盈利: 20245.533582436612 亏损: -16118.435555699794 最大盈利: 778.33 最大亏损: -939.00 胜率: 60.23% 总收益: 4127.10 平均盈利: 23.45 typeA: 14.12
趋势多且增强-11 总交易次数: 191 盈利: 24318.588558067302 亏损: -19530.517990241584 最大盈利: 2331.42 最大亏损: -969.84 胜率: 50.79% 总收益: 4788.07 平均盈利: 25.07 typeA: 12.73
趋势多且增强-2 总交易次数: 1355 盈利: 157108.32198608658 亏损: -113107.7970063924 最大盈利: 9874.53 最大亏损: -2110.94 胜率: 37.93% 总收益: 44000.52 平均盈利: 32.47 typeA: 12.32
趋势空且增强-4 总交易次数: 105 盈利: 7857.864090514264 亏损: -7448.2066512298 最大盈利: 910.73 最大亏损: -383.83 胜率: 40.95% 总收益: 409.66 平均盈利: 3.90 typeA: 1.60

########################################################################


tradeNumTotal 3228
profitTotal 132766.42916718993
maxLossTotal -2110.94
winRateTotal 2593.26
period month 53
avgRate 48.93
maxDrawdownTotal 29
趋势空且增强-2 总交易次数: 253 盈利: 33096.78302448325 亏损: -17541.498080282247 最大盈利: 4403.10 最大亏损: -1403.32 胜率: 58.50% 总收益: 15555.28 平均盈利: 61.48 typeA: 35.97
趋势多且增强-7test2 总交易次数: 107 盈利: 11805.060151029167 亏损: -6426.581956572068 最大盈利: 1427.22 最大亏损: -2088.31 胜率: 69.16% 总收益: 5378.48 平均盈利: 50.27 typeA: 34.76
趋势多且增强-2 总交易次数: 1351 盈利: 195608.65999329046 亏损: -112082.08100695984 最大盈利: 41166.13 最大亏损: -2110.94 胜率: 38.12% 总收益: 83526.58 平均盈利: 61.83 typeA: 23.57
趋势多且增强-7test1 总交易次数: 325 盈利: 27370.293834378674 亏损: -16032.988709013554 最大盈利: 1699.60 最大亏损: -1818.29 胜率: 60.92% 总收益: 11337.31 平均盈利: 34.88 typeA: 21.25
趋势空且增强-11 总交易次数: 176 盈利: 20245.533582436612 亏损: -16529.16258259777 最大盈利: 778.33 最大亏损: -939.00 胜率: 60.23% 总收益: 3716.37 平均盈利: 21.12 typeA: 12.72
趋势多且增强-4 总交易次数: 720 盈利: 52450.368773133996 亏损: -37159.307707007894 最大盈利: 2081.23 最大亏损: -1830.26 胜率: 58.06% 总收益: 15291.06 平均盈利: 21.24 typeA: 12.33
趋势多且增强-11 总交易次数: 191 盈利: 23616.852678251096 亏损: -19573.16026666435 最大盈利: 2331.42 最大亏损: -969.84 胜率: 50.26% 总收益: 4043.69 平均盈利: 21.17 typeA: 10.64
趋势空且增强-4 总交易次数: 105 盈利: 7857.864090514264 亏损: -7448.2066512298 最大盈利: 910.73 最大亏损: -383.83 胜率: 40.95% 总收益: 409.66 平均盈利: 3.90 typeA: 1.60


###########################################################################


tradeNumTotal 3228
profitTotal 132766.42916718993
maxLossTotal -2110.94
winRateTotal 2593.26
period month 53
avgRate 48.93
maxDrawdownTotal 29
趋势多且增强-2testtest 总交易次数: 49 盈利: 49672.23323235777 亏损: -3942.0728500518744 最大盈利: 41166.13 最大亏损: -642.41 胜率: 42.86% 总收益: 45730.16 平均盈利: 933.27 typeA: 400.00
趋势空且增强-2 总交易次数: 253 盈利: 33096.78302448325 亏损: -17541.498080282247 最大盈利: 4403.10 最大亏损: -1403.32 胜率: 58.50% 总收益: 15555.28 平均盈利: 61.48 typeA: 35.97
趋势多且增强-7test2 总交易次数: 107 盈利: 11805.060151029167 亏损: -6426.581956572068 最大盈利: 1427.22 最大亏损: -2088.31 胜率: 69.16% 总收益: 5378.48 平均盈利: 50.27 typeA: 34.76
趋势多且增强-6test 总交易次数: 287 盈利: 45312.210772788916 亏损: -21788.355077462318 最大盈利: 16227.05 最大亏损: -1991.57 胜率: 37.63% 总收益: 23523.86 平均盈利: 81.96 typeA: 30.84
趋势多且增强-2 总交易次数: 36 盈利: 6726.833198832167 亏损: -4094.6226096474743 最大盈利: 3125.26 最大亏损: -2110.94 胜率: 36.11% 总收益: 2632.21 平均盈利: 73.12 typeA: 26.40
趋势多且增强-7test1 总交易次数: 325 盈利: 27370.293834378674 亏损: -16032.988709013554 最大盈利: 1699.60 最大亏损: -1818.29 胜率: 60.92% 总收益: 11337.31 平均盈利: 34.88 typeA: 21.25
趋势空且增强-11 总交易次数: 176 盈利: 20245.533582436612 亏损: -16529.16258259777 最大盈利: 778.33 最大亏损: -939.00 胜率: 60.23% 总收益: 3716.37 平均盈利: 21.12 typeA: 12.72
趋势多且增强-4 总交易次数: 720 盈利: 52450.368773133996 亏损: -37159.307707007894 最大盈利: 2081.23 最大亏损: -1830.26 胜率: 58.06% 总收益: 15291.06 平均盈利: 21.24 typeA: 12.33
趋势多且增强-11 总交易次数: 191 盈利: 23616.852678251096 亏损: -19573.16026666435 最大盈利: 2331.42 最大亏损: -969.84 胜率: 50.26% 总收益: 4043.69 平均盈利: 21.17 typeA: 10.64
趋势多且增强-4test 总交易次数: 268 盈利: 30313.472221118696 亏损: -23990.618786201678 最大盈利: 7630.31 最大亏损: -1322.90 胜率: 32.46% 总收益: 6322.85 平均盈利: 23.59 typeA: 7.66
趋势多且增强-2test 总交易次数: 91 盈利: 10834.56217779673 亏损: -9081.513102235545 最大盈利: 1856.25 最大亏损: -952.52 胜率: 39.56% 总收益: 1753.05 平均盈利: 19.26 typeA: 7.62
趋势多且增强-7test 总交易次数: 30 盈利: 2728.3485544577943 亏损: -2367.858819054945 最大盈利: 578.50 最大亏损: -447.75 胜率: 46.67% 总收益: 360.49 平均盈利: 12.02 typeA: 5.61
趋势多且增强-5test 总交易次数: 436 盈利: 35140.75989769567 亏损: -31298.326796084166 最大盈利: 1367.76 最大亏损: -1995.64 胜率: 40.14% 总收益: 3842.43 平均盈利: 8.81 typeA: 3.54
趋势空且增强-4 总交易次数: 105 盈利: 7857.864090514264 亏损: -7448.2066512298 最大盈利: 910.73 最大亏损: -383.83 胜率: 40.95% 总收益: 409.66 平均盈利: 3.90 typeA: 1.60
趋势多且增强-3test 总交易次数: 154 盈利: 14880.239938242872 亏损: -15518.712966221967 最大盈利: 1890.24 最大亏损: -1361.53 胜率: 39.61% 总收益: -638.47 平均盈利: -4.15 typeA: -1.64


#####################################################################

tradeNumTotal 3246
profitTotal 134241.8770664378
maxLossTotal -2110.94
winRateTotal 2591.3199999999997
period month 53
avgRate 48.89
maxDrawdownTotal 29
趋势多且增强-1-1 总交易次数: 49 盈利: 49672.23323235777 亏损: -4053.6170212722764 最大盈利: 41166.13 最大亏损: -642.41 胜率: 42.86% 总收益: 45618.62 平均盈利: 930.99 typeA: 399.02
趋势空且增强-2 总交易次数: 253 盈利: 33096.78302448325 亏损: -16680.410005015863 最大盈利: 4403.10 最大亏损: -818.35 胜率: 58.50% 总收益: 16416.37 平均盈利: 64.89 typeA: 37.96
趋势多且增强-7test2 总交易次数: 107 盈利: 11805.060151029167 亏损: -6426.581956572068 最大盈利: 1427.22 最大亏损: -2088.31 胜率: 69.16% 总收益: 5378.48 平均盈利: 50.27 typeA: 34.76
趋势多且增强-1-7 总交易次数: 287 盈利: 45312.210772788916 亏损: -21788.355077462318 最大盈利: 16227.05 最大亏损: -1991.57 胜率: 37.63% 总收益: 23523.86 平均盈利: 81.96 typeA: 30.84
趋势多且增强-1-2 总交易次数: 36 盈利: 6726.833198832167 亏损: -4107.430351225565 最大盈利: 3125.26 最大亏损: -2110.94 胜率: 36.11% 总收益: 2619.40 平均盈利: 72.76 typeA: 26.27
趋势多且增强-7test1 总交易次数: 325 盈利: 27370.293834378674 亏损: -16032.988709013554 最大盈利: 1699.60 最大亏损: -1818.29 胜率: 60.92% 总收益: 11337.31 平均盈利: 34.88 typeA: 21.25
趋势空且增强-11 总交易次数: 175 盈利: 20245.533582436612 亏损: -15715.718197125032 最大盈利: 778.33 最大亏损: -939.00 胜率: 60.57% 总收益: 4529.82 平均盈利: 25.88 typeA: 15.68
趋势多且增强-4 总交易次数: 720 盈利: 52371.54794407842 亏损: -37207.02676929187 最大盈利: 2081.23 最大亏损: -1830.26 胜率: 57.78% 总收益: 15164.52 平均盈利: 21.06 typeA: 12.17
趋势多且增强-11 总交易次数: 191 盈利: 23552.336645291703 亏损: -19155.5096038594 最大盈利: 2331.42 最大亏损: -907.40 胜率: 50.26% 总收益: 4396.83 平均盈利: 23.02 typeA: 11.57
趋势多且增强-1-3 总交易次数: 91 盈利: 10781.593703998973 亏损: -8791.8296269185 最大盈利: 1856.25 最大亏损: -952.52 胜率: 38.46% 总收益: 1989.76 平均盈利: 21.87 typeA: 8.41
趋势多且增强-1-5 总交易次数: 268 盈利: 30313.472221118696 亏损: -23861.152939649393 最大盈利: 7630.31 最大亏损: -1322.90 胜率: 32.46% 总收益: 6452.32 平均盈利: 24.08 typeA: 7.82
趋势多且增强-1-8 总交易次数: 30 盈利: 2728.3485544577943 亏损: -2367.858819054945 最大盈利: 578.50 最大亏损: -447.75 胜率: 46.67% 总收益: 360.49 平均盈利: 12.02 typeA: 5.61
趋势多且增强-1-6 总交易次数: 436 盈利: 35140.75989769567 亏损: -31298.326796084166 最大盈利: 1367.76 最大亏损: -1995.64 胜率: 40.14% 总收益: 3842.43 平均盈利: 8.81 typeA: 3.54
趋势空且增强-4 总交易次数: 102 盈利: 7517.814950465125 亏损: -7367.932747346985 最大盈利: 910.73 最大亏损: -383.83 胜率: 40.20% 总收益: 149.88 平均盈利: 1.47 typeA: 0.59
趋势多且增强-1-4 总交易次数: 154 盈利: 14880.239938242872 亏损: -15741.785862273235 最大盈利: 1890.24 最大亏损: -1361.53 胜率: 39.61% 总收益: -861.55 平均盈利: -5.59 typeA: -2.22
趋势空且增强-4test 总交易次数: 22 盈利: 2203.3162806176583 亏损: -2351.9763836703737 最大盈利: 523.86 最大亏损: -459.50 胜率: 54.55% 总收益: -148.66 平均盈利: -6.76 typeA: -3.69



###########################################################################


tradeNumTotal 3368
profitTotal 136044.26012056693
maxLossTotal -2110.94
winRateTotal 2536.7999999999993
period month 53
avgRate 47.86
maxDrawdownTotal 29
趋势多且增强-1-1 总交易次数: 49 盈利: 49672.23323235777 亏损: -3768.643567221994 最大盈利: 41166.13 最大亏损: -642.41 胜率: 42.86% 总收益: 45903.59 平均盈利: 936.81 typeA: 401.52
趋势多且增强-7test2 总交易次数: 107 盈利: 11805.060151029167 亏损: -6426.581956572068 最大盈利: 1427.22 最大亏损: -2088.31 胜率: 69.16% 总收益: 5378.48 平均盈利: 50.27 typeA: 34.76
趋势空且增强-2 总交易次数: 245 盈利: 29860.05268900044 亏损: -16118.376326280297 最大盈利: 4403.10 最大亏损: -818.35 胜率: 58.78% 总收益: 13741.68 平均盈利: 56.09 typeA: 32.97
趋势多且增强-4-3 总交易次数: 91 盈利: 8616.951875776456 亏损: -3711.9031643218045 最大盈利: 1285.64 最大亏损: -501.31 胜率: 53.85% 总收益: 4905.05 平均盈利: 53.90 typeA: 29.03
趋势多且增强-1-7 总交易次数: 287 盈利: 42079.4257587886 亏损: -21788.355077462318 最大盈利: 12994.26 最大亏损: -1991.57 胜率: 37.63% 总收益: 20291.07 平均盈利: 70.70 typeA: 26.60
趋势多且增强-1-2 总交易次数: 36 盈利: 6726.833198832167 亏损: -4175.562747859988 最大盈利: 3125.26 最大亏损: -2110.94 胜率: 36.11% 总收益: 2551.27 平均盈利: 70.87 typeA: 25.59
趋势多且增强-7test1 总交易次数: 328 盈利: 28027.162166437723 亏损: -16085.339556755705 最大盈利: 1699.60 最大亏损: -1818.29 胜率: 60.98% 总收益: 11941.82 平均盈利: 36.41 typeA: 22.20
趋势空且增强-4-5 总交易次数: 145 盈利: 18386.48759499155 亏损: -12313.170006209533 最大盈利: 2533.05 最大亏损: -727.25 胜率: 36.55% 总收益: 6073.32 平均盈利: 41.88 typeA: 15.31
趋势空且增强-11 总交易次数: 173 盈利: 19954.86121998568 亏损: -15715.718197125032 最大盈利: 778.33 最大亏损: -939.00 胜率: 60.12% 总收益: 4239.14 平均盈利: 24.50 typeA: 14.73
趋势多且增强-4-4 总交易次数: 614 盈利: 41549.03351082521 亏损: -29299.980041707073 最大盈利: 2081.23 最大亏损: -1830.26 胜率: 56.35% 总收益: 12249.05 平均盈利: 19.95 typeA: 11.24
趋势多且增强-1-5 总交易次数: 270 盈利: 30745.093138284767 亏损: -23311.1473278013 最大盈利: 7630.31 最大亏损: -1322.90 胜率: 32.96% 总收益: 7433.95 平均盈利: 27.53 typeA: 9.07
趋势多且增强-11 总交易次数: 192 盈利: 22395.958172817736 亏损: -19063.38053831145 最大盈利: 2061.31 最大亏损: -907.40 胜率: 49.48% 总收益: 3332.58 平均盈利: 17.36 typeA: 8.59
趋势多且增强-1-3 总交易次数: 91 盈利: 10045.08367598242 亏损: -8512.254343792036 最大盈利: 1856.25 最大亏损: -588.80 胜率: 36.26% 总收益: 1532.83 平均盈利: 16.84 typeA: 6.11
趋势多且增强-1-8 总交易次数: 30 盈利: 2728.3485544577943 亏损: -2367.858819054945 最大盈利: 578.50 最大亏损: -447.75 胜率: 46.67% 总收益: 360.49 平均盈利: 12.02 typeA: 5.61
趋势多且增强-1-6 总交易次数: 436 盈利: 34033.81730147873 亏损: -31363.820340921167 最大盈利: 1367.76 最大亏损: -1995.64 胜率: 39.68% 总收益: 2670.00 平均盈利: 6.12 typeA: 2.43
趋势空且增强-4 总交易次数: 99 盈利: 7639.9280357927455 亏损: -7273.25945608876 最大盈利: 910.73 最大亏损: -383.83 胜率: 39.39% 总收益: 366.67 平均盈利: 3.70 typeA: 1.46
趋势多且增强-1-4 总交易次数: 154 盈利: 14133.693400184304 亏损: -14241.150646372433 最大盈利: 1890.24 最大亏损: -943.77 胜率: 38.96% 总收益: -107.46 平均盈利: -0.70 typeA: -0.27
趋势空且增强-4test 总交易次数: 21 盈利: 2203.3162806176583 亏损: -2246.5777232160945 最大盈利: 523.86 最大亏损: -459.50 胜率: 57.14% 总收益: -43.26 平均盈利: -2.06 typeA: -1.18


#############################################################################



tradeNumTotal 3368
profitTotal 136044.26012056693
maxLossTotal -2110.94
winRateTotal 2536.7999999999993
period month 53
avgRate 47.86
maxDrawdownTotal 29
趋势多且增强-1-1 总交易次数: 49 盈利: 49672.23323235777 亏损: -3768.643567221994 最大盈利: 41166.13 最大亏损: -642.41 胜率: 42.86% 总收益: 45903.59 平均盈利: 936.81 typeA: 401.52
趋势多且增强-7test2 总交易次数: 107 盈利: 11805.060151029167 亏损: -6426.581956572068 最大盈利: 1427.22 最大亏损: -2088.31 胜率: 69.16% 总收益: 5378.48 平均盈利: 50.27 typeA: 34.76
趋势空且增强-2 总交易次数: 245 盈利: 29860.05268900044 亏损: -16118.376326280297 最大盈利: 4403.10 最大亏损: -818.35 胜率: 58.78% 总收益: 13741.68 平均盈利: 56.09 typeA: 32.97
趋势多且增强-4-3 总交易次数: 91 盈利: 8616.951875776456 亏损: -3711.9031643218045 最大盈利: 1285.64 最大亏损: -501.31 胜率: 53.85% 总收益: 4905.05 平均盈利: 53.90 typeA: 29.03
趋势多且增强-1-8 总交易次数: 287 盈利: 42079.4257587886 亏损: -21788.355077462318 最大盈利: 12994.26 最大亏损: -1991.57 胜率: 37.63% 总收益: 20291.07 平均盈利: 70.70 typeA: 26.60
趋势多且增强-1-2 总交易次数: 36 盈利: 6726.833198832167 亏损: -4175.562747859988 最大盈利: 3125.26 最大亏损: -2110.94 胜率: 36.11% 总收益: 2551.27 平均盈利: 70.87 typeA: 25.59
趋势多且增强-7test1 总交易次数: 328 盈利: 28027.162166437723 亏损: -16085.339556755705 最大盈利: 1699.60 最大亏损: -1818.29 胜率: 60.98% 总收益: 11941.82 平均盈利: 36.41 typeA: 22.20
趋势空且增强-4-6 总交易次数: 145 盈利: 18386.48759499155 亏损: -12313.170006209533 最大盈利: 2533.05 最大亏损: -727.25 胜率: 36.55% 总收益: 6073.32 平均盈利: 41.88 typeA: 15.31
趋势空且增强-11 总交易次数: 173 盈利: 19954.86121998568 亏损: -15715.718197125032 最大盈利: 778.33 最大亏损: -939.00 胜率: 60.12% 总收益: 4239.14 平均盈利: 24.50 typeA: 14.73
趋势多且增强-4-4 总交易次数: 465 盈利: 32874.174002960564 亏损: -23091.778131233437 最大盈利: 2081.23 最大亏损: -1830.26 胜率: 54.62% 总收益: 9782.40 平均盈利: 21.04 typeA: 11.49
趋势多且增强-4-5 总交易次数: 149 盈利: 8674.859507864634 亏损: -6208.201910473636 最大盈利: 1373.52 最大亏损: -390.73 胜率: 61.74% 总收益: 2466.66 平均盈利: 16.55 typeA: 10.22
趋势多且增强-1-5 总交易次数: 270 盈利: 30745.093138284767 亏损: -23311.1473278013 最大盈利: 7630.31 最大亏损: -1322.90 胜率: 32.96% 总收益: 7433.95 平均盈利: 27.53 typeA: 9.07
趋势多且增强-11 总交易次数: 192 盈利: 22395.958172817736 亏损: -19063.38053831145 最大盈利: 2061.31 最大亏损: -907.40 胜率: 49.48% 总收益: 3332.58 平均盈利: 17.36 typeA: 8.59
趋势多且增强-1-6 总交易次数: 220 盈利: 19866.417784875863 亏损: -16135.115693058819 最大盈利: 963.19 最大亏损: -879.16 胜率: 40.00% 总收益: 3731.30 平均盈利: 16.96 typeA: 6.78
趋势多且增强-1-3 总交易次数: 91 盈利: 10045.08367598242 亏损: -8512.254343792036 最大盈利: 1856.25 最大亏损: -588.80 胜率: 36.26% 总收益: 1532.83 平均盈利: 16.84 typeA: 6.11
趋势多且增强-1-9 总交易次数: 30 盈利: 2728.3485544577943 亏损: -2367.858819054945 最大盈利: 578.50 最大亏损: -447.75 胜率: 46.67% 总收益: 360.49 平均盈利: 12.02 typeA: 5.61
趋势空且增强-4 总交易次数: 99 盈利: 7639.9280357927455 亏损: -7273.25945608876 最大盈利: 910.73 最大亏损: -383.83 胜率: 39.39% 总收益: 366.67 平均盈利: 3.70 typeA: 1.46
趋势多且增强-1-4 总交易次数: 154 盈利: 14133.693400184304 亏损: -14241.150646372433 最大盈利: 1890.24 最大亏损: -943.77 胜率: 38.96% 总收益: -107.46 平均盈利: -0.70 typeA: -0.27
趋势空且增强-4test 总交易次数: 21 盈利: 2203.3162806176583 亏损: -2246.5777232160945 最大盈利: 523.86 最大亏损: -459.50 胜率: 57.14% 总收益: -43.26 平均盈利: -2.06 typeA: -1.18
趋势多且增强-1-7 总交易次数: 216 盈利: 14167.399516602884 亏损: -15228.704647862336 最大盈利: 1367.76 最大亏损: -1995.64 胜率: 39.35% 总收益: -1061.31 平均盈利: -4.91 typeA: -1.93


###################################################################



tradeNumTotal 4310
profitTotal 147083.94340294364
maxLossTotal -2197.24
winRateTotal 2634.3800000000006
period month 53
avgRate 49.71
maxDrawdownTotal 33.4
趋势多且增强-1-1-1 总交易次数: 41 盈利: 46630.546831319785 亏损: -2369.5280411846697 最大盈利: 41166.13 最大亏损: -455.43 胜率: 39.02% 总收益: 44261.02 平均盈利: 1079.54 typeA: 421.24
趋势多且增强-1-2 总交易次数: 19 盈利: 10776.172725511178 亏损: -3636.738244649015 最大盈利: 7049.81 最大亏损: -2197.24 胜率: 47.37% 总收益: 7139.43 平均盈利: 375.76 typeA: 178.00
趋势多且增强-1-8 总交易次数: 39 盈利: 8485.029709919974 亏损: -2552.6035297766375 最大盈利: 1199.40 最大亏损: -491.89 胜率: 56.41% 总收益: 5932.43 平均盈利: 152.11 typeA: 85.81
趋势多且增强-1-3 总交易次数: 53 盈利: 11529.231353435618 亏损: -4827.006901580487 最大盈利: 1856.25 最大亏损: -588.80 胜率: 50.94% 总收益: 6702.22 平均盈利: 126.46 typeA: 64.42
趋势多且增强-7test2 总交易次数: 107 盈利: 11894.336398796815 亏损: -6426.581956572068 最大盈利: 1427.22 最大亏损: -2088.31 胜率: 69.16% 总收益: 5467.75 平均盈利: 51.10 typeA: 35.34
趋势空且增强-2 总交易次数: 238 盈利: 28151.35749762982 亏损: -16118.376326280297 最大盈利: 4403.10 最大亏损: -818.35 胜率: 57.56% 总收益: 12032.98 平均盈利: 50.56 typeA: 29.10
趋势多且增强-1-1 总交易次数: 26 盈利: 4759.472699987232 亏损: -2891.8151384321427 最大盈利: 1348.53 最大亏损: -642.41 胜率: 38.46% 总收益: 1867.66 平均盈利: 71.83 typeA: 27.63
趋势多且增强-1-1-2 总交易次数: 31 盈利: 3516.0301591153875 亏损: -1386.9125301580052 最大盈利: 880.28 最大亏损: -296.01 胜率: 35.48% 总收益: 2129.12 平均盈利: 68.68 typeA: 24.37
趋势多且增强-7test1 总交易次数: 328 盈利: 28344.89060664494 亏损: -16085.339556755705 最大盈利: 1699.60 最大亏损: -1818.29 胜率: 60.98% 总收益: 12259.55 平均盈利: 37.38 typeA: 22.79
趋势多且增强-4-5 总交易次数: 168 盈利: 11829.468784381257 亏损: -7079.910629343406 最大盈利: 1655.83 最大亏损: -390.73 胜率: 64.29% 总收益: 4749.56 平均盈利: 28.27 typeA: 18.18
趋势多且增强-1-1-8 总交易次数: 247 盈利: 32044.332758094475 亏损: -19300.11432213677 最大盈利: 12994.26 最大亏损: -1991.57 胜率: 34.01% 总收益: 12744.22 平均盈利: 51.60 typeA: 17.55
趋势空且增强-11 总交易次数: 172 盈利: 19954.86121998568 亏损: -15424.95697344605 最大盈利: 778.33 最大亏损: -939.00 胜率: 60.47% 总收益: 4529.90 平均盈利: 26.34 typeA: 15.93
趋势多且增强-1-1-9 总交易次数: 28 盈利: 2868.8703863506585 亏损: -1920.1100002249473 最大盈利: 578.50 最大亏损: -426.30 胜率: 46.43% 总收益: 948.76 平均盈利: 33.88 typeA: 15.73
趋势多且增强-4-3 总交易次数: 105 盈利: 7957.953309388296 亏损: -5126.406126562657 最大盈利: 1601.48 最大亏损: -501.31 胜率: 53.33% 总收益: 2831.55 平均盈利: 26.97 typeA: 14.38
趋势多且增强-4-4 总交易次数: 502 盈利: 37424.73397184442 亏损: -24518.920717121186 最大盈利: 2081.23 最大亏损: -1830.26 胜率: 55.78% 总收益: 12905.81 平均盈利: 25.71 typeA: 14.34
趋势多且增强-1-6 总交易次数: 55 盈利: 6761.919854959909 亏损: -4849.473226437179 最大盈利: 963.19 最大亏损: -637.32 胜率: 38.18% 总收益: 1912.45 平均盈利: 34.77 typeA: 13.28
趋势空且增强-2-1 总交易次数: 781 盈利: 64309.00869370471 亏损: -51419.69531568101 最大盈利: 1969.37 最大亏损: -984.91 胜率: 57.36% 总收益: 12889.31 平均盈利: 16.50 typeA: 9.47
趋势多且增强-1-1-4 总交易次数: 128 盈利: 10518.74962531337 亏损: -7901.641098637103 最大盈利: 1890.24 最大亏损: -610.81 胜率: 41.41% 总收益: 2617.11 平均盈利: 20.45 typeA: 8.47
趋势多且增强-1-5 总交易次数: 80 盈利: 8242.913228276158 亏损: -6657.708240283488 最大盈利: 1183.30 最大亏损: -625.61 胜率: 37.50% 总收益: 1585.20 平均盈利: 19.82 typeA: 7.43
趋势空且增强-4-6 总交易次数: 131 盈利: 13516.426145239335 亏损: -11003.82436128702 最大盈利: 2533.05 最大亏损: -727.25 胜率: 35.11% 总收益: 2512.60 平均盈利: 19.18 typeA: 6.73
趋势多且增强-1-1-3 总交易次数: 68 盈利: 5959.35658420948 亏损: -4978.125289039102 最大盈利: 1586.90 最大亏损: -585.54 胜率: 38.24% 总收益: 981.23 平均盈利: 14.43 typeA: 5.52
趋势多且增强-1-1-6 总交易次数: 165 盈利: 13142.402337145506 亏损: -11039.204878014987 最大盈利: 880.39 最大亏损: -879.16 胜率: 42.42% 总收益: 2103.20 平均盈利: 12.75 typeA: 5.41
趋势多且增强-11 总交易次数: 194 盈利: 13731.285721314369 亏损: -12104.437717771236 最大盈利: 2143.30 最大亏损: -907.40 胜率: 52.06% 总收益: 1626.85 平均盈利: 8.39 typeA: 4.37
趋势空且增强-4 总交易次数: 97 盈利: 7639.9280357927455 亏损: -6836.992317326915 最大盈利: 910.73 最大亏损: -383.83 胜率: 40.21% 总收益: 802.94 平均盈利: 8.28 typeA: 3.33
趋势多且增强-1-1-7 总交易次数: 171 盈利: 9067.15334383683 亏损: -9062.514366483583 最大盈利: 725.34 最大亏损: -487.08 胜率: 41.52% 总收益: 4.64 平均盈利: 0.03 typeA: 0.01
趋势多且增强-1-1-5 总交易次数: 200 盈利: 15618.976923791302 亏损: -16169.999080369438 最大盈利: 1247.87 最大亏损: -1322.90 胜率: 35.00% 总收益: -551.02 平均盈利: -2.76 typeA: -0.96
趋势空且增强-4test 总交易次数: 17 盈利: 1613.9356930489962 亏损: -1917.195446525875 最大盈利: 523.86 最大亏损: -459.50 胜率: 58.82% 总收益: -303.26 平均盈利: -17.84 typeA: -10.49
趋势多且增强-1-4 总交易次数: 71 盈利: 5651.641657647966 亏损: -9473.62307368921 最大盈利: 502.50 最大亏损: -966.78 胜率: 39.44% 总收益: -3821.98 平均盈利: -53.83 typeA: -21.23
趋势多且增强-1-7 总交易次数: 46 盈利: 3058.5944795490223 亏损: -5784.696729323098 最大盈利: 506.34 最大亏损: -1995.64 胜率: 36.96% 总收益: -2726.10 平均盈利: -59.26 typeA: -21.90
趋势多且增强-1-9 总交易次数: 2 盈利: 64.56362063163954 亏损: -447.7488188299975 最大盈利: 64.56 最大亏损: -447.75 胜率: 50.00% 总收益: -383.19 平均盈利: -191.59 typeA: -95.80


#########################################################################


tradeNumTotal 3901
profitTotal 148002.35987915887
maxLossTotal -2197.24
winRateTotal 2714.1
period month 53
avgRate 51.21
maxDrawdownTotal 32.8
趋势多且增强-1-1-1 总交易次数: 42 盈利: 46630.546831319785 亏损: -2379.484367054646 最大盈利: 41166.13 最大亏损: -455.43 胜率: 38.10% 总收益: 44251.06 平均盈利: 1053.60 typeA: 401.42
趋势多且增强-1-2 总交易次数: 19 盈利: 10776.172725511178 亏损: -3636.738244649015 最大盈利: 7049.81 最大亏损: -2197.24 胜率: 47.37% 总收益: 7139.43 平均盈利: 375.76 typeA: 178.00
趋势多且增强-1-3 总交易次数: 54 盈利: 11206.428012732946 亏损: -5099.609154113886 最大盈利: 1856.25 最大亏损: -588.80 胜率: 48.15% 总收益: 6106.82 平均盈利: 113.09 typeA: 54.45
趋势空且增强-2 总交易次数: 231 盈利: 30723.043543508975 亏损: -16084.261751656948 最大盈利: 4403.10 最大亏损: -818.35 胜率: 56.71% 总收益: 14638.78 平均盈利: 63.37 typeA: 35.94
趋势多且增强-7test2 总交易次数: 107 盈利: 11894.336398796815 亏损: -6426.581956572068 最大盈利: 1427.22 最大亏损: -2088.31 胜率: 69.16% 总收益: 5467.75 平均盈利: 51.10 typeA: 35.34
趋势多且增强-1-1 总交易次数: 25 盈利: 4759.472699987232 亏损: -2616.4374256536835 最大盈利: 1348.53 最大亏损: -642.41 胜率: 40.00% 总收益: 2143.04 平均盈利: 85.72 typeA: 34.29
趋势多且增强-7test1 总交易次数: 332 盈利: 30052.831125459663 亏损: -16345.39616319728 最大盈利: 1699.60 最大亏损: -1818.29 胜率: 60.84% 总收益: 13707.43 平均盈利: 41.29 typeA: 25.12
趋势多且增强-1-1-2 总交易次数: 31 盈利: 3516.0301591153875 亏损: -1386.9125301580052 最大盈利: 880.28 最大亏损: -296.01 胜率: 35.48% 总收益: 2129.12 平均盈利: 68.68 typeA: 24.37
趋势空且增强-2-3 总交易次数: 147 盈利: 12012.74233719917 亏损: -7316.898342587241 最大盈利: 1221.70 最大亏损: -706.58 胜率: 63.95% 总收益: 4695.84 平均盈利: 31.94 typeA: 20.43
趋势空且增强-2-4 总交易次数: 74 盈利: 6876.402431489951 亏损: -4682.493392103459 最大盈利: 781.91 最大亏损: -922.87 胜率: 60.81% 总收益: 2193.91 平均盈利: 29.65 typeA: 18.03
趋势空且增强-11 总交易次数: 169 盈利: 19570.051674370952 亏损: -14893.978101430237 最大盈利: 750.81 最大亏损: -939.00 胜率: 62.13% 总收益: 4676.07 平均盈利: 27.67 typeA: 17.19
趋势多且增强-1-1-8 总交易次数: 279 盈利: 34748.83782334795 亏损: -20909.001659114456 最大盈利: 12994.26 最大亏损: -1991.57 胜率: 34.05% 总收益: 13839.84 平均盈利: 49.61 typeA: 16.89
趋势空且增强-2-1 总交易次数: 402 盈利: 37692.743706649046 亏损: -27022.23085550433 最大盈利: 1969.37 最大亏损: -835.02 胜率: 54.73% 总收益: 10670.51 平均盈利: 26.54 typeA: 14.53
趋势多且增强-4-4 总交易次数: 516 盈利: 36667.09275097297 亏损: -24604.176504891468 最大盈利: 2081.23 最大亏损: -1830.26 胜率: 56.59% 总收益: 12062.92 平均盈利: 23.38 typeA: 13.23
趋势多且增强-4-5 总交易次数: 173 盈利: 10688.486976643278 亏损: -7224.428363963552 最大盈利: 866.15 最大亏损: -390.73 胜率: 64.16% 总收益: 3464.06 平均盈利: 20.02 typeA: 12.85
趋势多且增强-1-1-9 总交易次数: 30 盈利: 2868.8703863506585 亏损: -2013.6396368250055 最大盈利: 578.50 最大亏损: -426.30 胜率: 43.33% 总收益: 855.23 平均盈利: 28.51 typeA: 12.35
趋势多且增强-4-3 总交易次数: 112 盈利: 7993.743656821589 亏损: -5537.801294080691 最大盈利: 1601.48 最大亏损: -501.31 胜率: 51.79% 总收益: 2455.94 平均盈利: 21.93 typeA: 11.36
趋势多且增强-1-6 总交易次数: 86 盈利: 9905.344001811847 亏损: -7867.296875541218 最大盈利: 963.19 最大亏损: -1091.73 胜率: 40.70% 总收益: 2038.05 平均盈利: 23.70 typeA: 9.65
趋势多且增强-1-5 总交易次数: 124 盈利: 12957.513363879754 亏损: -10568.179044949991 最大盈利: 1183.30 最大亏损: -1308.10 胜率: 39.52% 总收益: 2389.33 平均盈利: 19.27 typeA: 7.62
趋势多且增强-1-1-4 总交易次数: 159 盈利: 12199.194351004668 亏损: -10199.353643224453 最大盈利: 1890.24 最大亏损: -610.81 胜率: 40.25% 总收益: 1999.84 平均盈利: 12.58 typeA: 5.06
趋势空且增强-4-6 总交易次数: 131 盈利: 13466.683029417383 亏损: -11747.449611454816 最大盈利: 2533.05 最大亏损: -727.25 胜率: 35.88% 总收益: 1719.23 平均盈利: 13.12 typeA: 4.71
趋势空且增强-4 总交易次数: 90 盈利: 7370.714797442532 亏损: -6410.8326913159935 最大盈利: 910.73 最大亏损: -383.83 胜率: 41.11% 总收益: 959.88 平均盈利: 10.67 typeA: 4.38
趋势多且增强-11 总交易次数: 203 盈利: 13931.01832761969 亏损: -12641.25124749825 最大盈利: 2143.30 最大亏损: -907.40 胜率: 51.72% 总收益: 1289.77 平均盈利: 6.35 typeA: 3.29
趋势多且增强-1-1-3 总交易次数: 73 盈利: 6193.340551516161 亏损: -5579.8282801915875 最大盈利: 1586.90 最大亏损: -585.54 胜率: 38.36% 总收益: 613.51 平均盈利: 8.40 typeA: 3.22
趋势空且增强-2-5 总交易次数: 1 盈利: 0 亏损: -212.41591943716355 最大盈利: -212.42 最大亏损: -212.42 胜率: 0.00% 总收益: -212.42 平均盈利: -212.42 typeA: 0.00
趋势空且增强-2-2 总交易次数: 198 盈利: 12552.430995356002 亏损: -15302.186107221314 最大盈利: 654.93 最大亏损: -984.91 胜率: 59.09% 总收益: -2749.76 平均盈利: -13.89 typeA: -8.21
趋势空且增强-4test 总交易次数: 17 盈利: 1613.9356930489962 亏损: -1880.15617877853 最大盈利: 523.86 最大亏损: -459.50 胜率: 58.82% 总收益: -266.22 平均盈利: -15.66 typeA: -9.21
趋势多且增强-1-4 总交易次数: 76 盈利: 7108.609239840191 亏损: -9539.23836888652 最大盈利: 535.92 最大亏损: -966.78 胜率: 42.11% 总收益: -2430.63 平均盈利: -31.98 typeA: -13.47


################################################################


######################################################################

tradeNumTotal 4015
profitTotal 169622.8773785019
maxLossTotal -2088.31
winRateTotal 2873.480000000001
period month 53
avgRate 54.22
maxDrawdownTotal 36.1
趋势多且增强-L-3-1 总交易次数: 39 盈利: 46734.311752840695 亏损: -1853.9459182721039 最大盈利: 41166.13 最大亏损: -281.54 胜率: 41.03% 总收益: 44880.37 平均盈利: 1150.78 typeA: 472.16
趋势多且增强-L-2-2 总交易次数: 11 盈利: 10463.568812160125 亏损: -731.8088541712134 最大盈利: 7106.66 最大亏损: -315.45 胜率: 45.45% 总收益: 9731.76 平均盈利: 884.71 typeA: 402.10
趋势多且增强-R-1-2-1 总交易次数: 8 盈利: 2079.6347737771307 亏损: -14.567478002513882 最大盈利: 903.48 最大亏损: -14.57 胜率: 87.50% 总收益: 2065.07 平均盈利: 258.13 typeA: 225.87
趋势多且增强-L-2-1 总交易次数: 7 盈利: 1859.604771694 亏损: -350.4566031446385 最大盈利: 766.72 最大亏损: -165.71 胜率: 57.14% 总收益: 1509.15 平均盈利: 215.59 typeA: 123.19
趋势空且增强-1-3 总交易次数: 71 盈利: 8766.093316892162 亏损: -1924.064828385387 最大盈利: 1220.97 最大亏损: -673.69 胜率: 76.06% 总收益: 6842.03 平均盈利: 96.37 typeA: 73.30
趋势空且增强-L-1-2 总交易次数: 39 盈利: 7032.488841019735 亏损: -3768.569829967331 最大盈利: 2068.45 最大亏损: -808.06 胜率: 66.67% 总收益: 3263.92 平均盈利: 83.69 typeA: 55.80
趋势多且增强-R-1-1-1 总交易次数: 39 盈利: 5290.831108692588 亏损: -2642.3740117617376 最大盈利: 1148.20 最大亏损: -711.96 胜率: 69.23% 总收益: 2648.46 平均盈利: 67.91 typeA: 47.01
趋势多且增强-R-2-2 总交易次数: 26 盈利: 2141.404376679049 亏损: -522.2550632676632 最大盈利: 369.72 最大亏损: -162.39 胜率: 73.08% 总收益: 1619.15 平均盈利: 62.27 typeA: 45.51
趋势多且增强-L-1-6 总交易次数: 60 盈利: 10355.19037605873 亏损: -5086.558935081293 最大盈利: 963.19 最大亏损: -381.66 胜率: 46.67% 总收益: 5268.63 平均盈利: 87.81 typeA: 40.98
趋势空且增强-2 总交易次数: 228 盈利: 31688.312188265423 亏损: -15979.400162124695 最大盈利: 4403.10 最大亏损: -818.35 胜率: 57.89% 总收益: 15708.91 平均盈利: 68.90 typeA: 39.89
趋势多且增强-L-3-2 总交易次数: 32 盈利: 3590.794533718919 亏损: -1313.820727792057 最大盈利: 880.28 最大亏损: -296.01 胜率: 40.63% 总收益: 2276.97 平均盈利: 71.16 typeA: 28.91
趋势空且增强-2-3 总交易次数: 43 盈利: 3432.4195698885806 亏损: -1771.629959201227 最大盈利: 1142.40 最大亏损: -375.86 胜率: 67.44% 总收益: 1660.79 平均盈利: 38.62 typeA: 26.05
趋势多且增强-4-3 总交易次数: 136 盈利: 12924.668582098015 亏损: -6063.2427148998795 最大盈利: 2591.16 最大亏损: -501.31 胜率: 50.74% 总收益: 6861.43 平均盈利: 50.45 typeA: 25.60
趋势多且增强-R-1-1-2 总交易次数: 236 盈利: 24192.82042325656 亏损: -14244.554445946786 最大盈利: 1933.32 最大亏损: -1818.29 胜率: 58.90% 总收益: 9948.27 平均盈利: 42.15 typeA: 24.83
趋势多且增强-R-3-2 总交易次数: 17 盈利: 1085.8038354650619 亏损: -442.66717463488214 最大盈利: 266.93 最大亏损: -157.60 胜率: 58.82% 总收益: 643.14 平均盈利: 37.83 typeA: 22.25
趋势多且增强-R-2-1 总交易次数: 73 盈利: 5934.387902969092 亏损: -3571.243485923923 最大盈利: 1699.60 最大亏损: -444.10 胜率: 58.90% 总收益: 2363.14 平均盈利: 32.37 typeA: 19.07
趋势空且增强-4-6 总交易次数: 130 盈利: 16426.430056135432 亏损: -10594.4777100857 最大盈利: 2533.05 最大亏损: -727.25 胜率: 38.46% 总收益: 5831.95 平均盈利: 44.86 typeA: 17.25
趋势多且增强-4-5 总交易次数: 206 盈利: 12314.41979231835 亏损: -7174.357046610934 最大盈利: 1373.52 最大亏损: -395.22 胜率: 66.99% 总收益: 5140.06 平均盈利: 24.95 typeA: 16.72
趋势多且增强-R-1-2-2 总交易次数: 65 盈利: 7194.893169650456 亏损: -5590.453759250537 最大盈利: 1427.22 最大亏损: -2088.31 胜率: 67.69% 总收益: 1604.44 平均盈利: 24.68 typeA: 16.71
趋势多且增强-L-3-8 总交易次数: 281 盈利: 32795.856947935084 亏损: -21008.78507513147 最大盈利: 9134.79 最大亏损: -1991.57 胜率: 34.16% 总收益: 11787.07 平均盈利: 41.95 typeA: 14.33
趋势空且增强-11 总交易次数: 173 盈利: 19653.87932790941 亏损: -16240.530635701953 最大盈利: 750.81 最大亏损: -939.00 胜率: 61.27% 总收益: 3413.35 平均盈利: 19.73 typeA: 12.09
趋势多且增强-11 总交易次数: 206 盈利: 24395.071443983372 亏损: -19282.029632499187 最大盈利: 2423.17 最大亏损: -907.40 胜率: 48.54% 总收益: 5113.04 平均盈利: 24.82 typeA: 12.05
趋势空且增强-3-4 总交易次数: 536 盈利: 31976.636892046754 亏损: -21306.564476398795 最大盈利: 2433.03 最大亏损: -647.04 胜率: 57.09% 总收益: 10670.07 平均盈利: 19.91 typeA: 11.36
趋势多且增强-4-4 总交易次数: 576 盈利: 38309.46322249057 亏损: -28500.74819852229 最大盈利: 2081.23 最大亏损: -1830.26 胜率: 61.11% 总收益: 9808.72 平均盈利: 17.03 typeA: 10.41
趋势多且增强-L-3-9 总交易次数: 30 盈利: 2663.784933826155 亏损: -2013.6396368250055 最大盈利: 578.50 最大亏损: -426.30 胜率: 43.33% 总收益: 650.15 平均盈利: 21.67 typeA: 9.39
趋势多且增强-R-3-1 总交易次数: 108 盈利: 6938.221229166604 亏损: -5288.091654207932 最大盈利: 1447.78 最大亏损: -837.68 胜率: 58.33% 总收益: 1650.13 平均盈利: 15.28 typeA: 8.91
趋势多且增强-L-2-5 总交易次数: 79 盈利: 7275.9985942132025 亏损: -5582.0390802460915 最大盈利: 1183.30 最大亏损: -341.13 胜率: 35.44% 总收益: 1693.96 平均盈利: 21.44 typeA: 7.60
趋势空且增强-3-3 总交易次数: 378 盈利: 19137.474925678493 亏损: -17176.329166611442 最大盈利: 836.27 最大亏损: -774.78 胜率: 59.26% 总收益: 1961.15 平均盈利: 5.19 typeA: 3.07
趋势多且增强-L-3-4 总交易次数: 182 盈利: 12678.248822054817 亏损: -11596.630879713899 最大盈利: 905.14 最大亏损: -610.81 胜率: 39.56% 总收益: 1081.62 平均盈利: 5.94 typeA: 2.35


###############################################################################


tradeNumTotal 3660
profitTotal 162929.5514844662
maxLossTotal -2061.77
winRateTotal 2985.4099999999994
period month 53
avgRate 56.33
maxDrawdownTotal 32.8
趋势多且增强-L1-3-1 总交易次数: 40 盈利: 46734.311752840695 亏损: -1859.18421181273 最大盈利: 41166.13 最大亏损: -281.54 胜率: 40.00% 总收益: 44875.13 平均盈利: 1121.88 typeA: 448.75
趋势多且增强-L1-2-2 总交易次数: 11 盈利: 10463.568812160125 亏损: -731.8088541712134 最大盈利: 7106.66 最大亏损: -315.45 胜率: 45.45% 总收益: 9731.76 平均盈利: 884.71 typeA: 402.10
趋势多且增强-L1-2-1 总交易次数: 7 盈利: 1859.604771694 亏损: -350.4566031446385 最大盈利: 766.72 最大亏损: -165.71 胜率: 57.14% 总收益: 1509.15 平均盈利: 215.59 typeA: 123.19
趋势多且增强-L1-1-6 总交易次数: 56 盈利: 17036.94718852432 亏损: -4842.990263642759 最大盈利: 8558.15 最大亏损: -381.66 胜率: 46.43% 总收益: 12193.96 平均盈利: 217.75 typeA: 101.10
趋势空且增强-L2-1-3 总交易次数: 68 盈利: 8718.160334688237 亏损: -1529.8398031870045 最大盈利: 1220.97 最大亏损: -673.69 胜率: 77.94% 总收益: 7188.32 平均盈利: 105.71 typeA: 82.39
趋势多且增强-R-2-2 总交易次数: 26 盈利: 2141.404376679049 亏损: -522.2550632676632 最大盈利: 369.72 最大亏损: -162.39 胜率: 73.08% 总收益: 1619.15 平均盈利: 62.27 typeA: 45.51
趋势多且增强-R-1-1-1 总交易次数: 37 盈利: 4842.114794767353 亏损: -2563.0091203399047 最大盈利: 1148.20 最大亏损: -711.96 胜率: 70.27% 总收益: 2279.11 平均盈利: 61.60 typeA: 43.28
趋势空且增强-L1-1-2 总交易次数: 37 盈利: 6171.886933348584 亏损: -3768.569829967331 最大盈利: 2068.45 最大亏损: -808.06 胜率: 64.86% 总收益: 2403.32 平均盈利: 64.95 typeA: 42.13
趋势空且增强-2 总交易次数: 204 盈利: 30474.691664170303 亏损: -16339.645202314798 最大盈利: 4403.10 最大亏损: -818.35 胜率: 53.92% 总收益: 14135.05 平均盈利: 69.29 typeA: 37.36
趋势空且增强-L2-2-3 总交易次数: 42 盈利: 3969.3079347707303 亏损: -1717.2953279040744 最大盈利: 1142.40 最大亏损: -375.86 胜率: 69.05% 总收益: 2252.01 平均盈利: 53.62 typeA: 37.02
趋势多且增强-L1-3-9 总交易次数: 34 盈利: 4504.662928826276 亏损: -2376.1925635612447 最大盈利: 1115.35 最大亏损: -426.30 胜率: 47.06% 总收益: 2128.47 平均盈利: 62.60 typeA: 29.46
趋势多且增强-L1-3-2 总交易次数: 32 盈利: 3590.794533718919 亏损: -1313.820727792057 最大盈利: 880.28 最大亏损: -296.01 胜率: 40.63% 总收益: 2276.97 平均盈利: 71.16 typeA: 28.91
趋势多且增强-L3-1-3 总交易次数: 133 盈利: 12748.244735457449 亏损: -6379.577262327933 最大盈利: 2591.16 最大亏损: -695.46 胜率: 50.38% 总收益: 6368.67 平均盈利: 47.88 typeA: 24.12
趋势多且增强-L3-1-4-1 总交易次数: 198 盈利: 21122.163376752545 亏损: -14013.64490372997 最大盈利: 1855.48 最大亏损: -1830.26 胜率: 63.13% 总收益: 7108.52 平均盈利: 35.90 typeA: 22.66
趋势多且增强-R-3-2 总交易次数: 17 盈利: 1085.8038354650619 亏损: -442.66717463488214 最大盈利: 266.93 最大亏损: -157.60 胜率: 58.82% 总收益: 643.14 平均盈利: 37.83 typeA: 22.25
趋势空且增强-11 总交易次数: 164 盈利: 19259.91998717781 亏损: -13767.80045244885 最大盈利: 750.81 最大亏损: -897.70 胜率: 62.80% 总收益: 5492.12 平均盈利: 33.49 typeA: 21.03
趋势多且增强-R-2-1 总交易次数: 73 盈利: 5934.387902969092 亏损: -3571.243485923923 最大盈利: 1699.60 最大亏损: -444.10 胜率: 58.90% 总收益: 2363.14 平均盈利: 32.37 typeA: 19.07
趋势多且增强-11 总交易次数: 211 盈利: 26668.566299347636 亏损: -18759.202629305317 最大盈利: 2423.17 最大亏损: -907.40 胜率: 50.71% 总收益: 7909.36 平均盈利: 37.49 typeA: 19.01
趋势多且增强-L3-1-5 总交易次数: 203 盈利: 12219.253871431454 亏损: -7100.633028324683 最大盈利: 1373.52 最大亏损: -395.22 胜率: 67.00% 总收益: 5118.62 平均盈利: 25.21 typeA: 16.89
趋势空且增强-L3-1-6 总交易次数: 127 盈利: 16133.641899806447 亏损: -10681.185829152897 最大盈利: 2533.05 最大亏损: -727.25 胜率: 37.80% 总收益: 5452.46 平均盈利: 42.93 typeA: 16.23
趋势多且增强-R-1-2-2 总交易次数: 59 盈利: 4850.272918087848 亏损: -3496.552045928097 最大盈利: 1403.49 最大亏损: -879.35 胜率: 67.80% 总收益: 1353.72 平均盈利: 22.94 typeA: 15.56
趋势多且增强-R-1-1-2 总交易次数: 235 盈利: 23246.9654464987 亏损: -16834.305407373617 最大盈利: 1933.32 最大亏损: -2061.77 胜率: 56.60% 总收益: 6412.66 平均盈利: 27.29 typeA: 15.44
趋势空且增强-L2-3-4 总交易次数: 529 盈利: 31972.380351989614 亏损: -22072.74528942542 最大盈利: 2433.03 最大亏损: -647.04 胜率: 57.28% 总收益: 9899.64 平均盈利: 18.71 typeA: 10.72
趋势多且增强-R-3-1 总交易次数: 108 盈利: 6938.221229166604 亏损: -5288.091654207932 最大盈利: 1447.78 最大亏损: -837.68 胜率: 58.33% 总收益: 1650.13 平均盈利: 15.28 typeA: 8.91
趋势多且增强-L1-2-5 总交易次数: 80 盈利: 7473.877834924026 亏损: -5742.841312810793 最大盈利: 1183.30 最大亏损: -341.13 胜率: 36.25% 总收益: 1731.04 平均盈利: 21.64 typeA: 7.84
趋势多且增强-L3-1-4-3 总交易次数: 372 盈利: 16756.409808171757 亏损: -13474.74257122807 最大盈利: 2081.23 最大亏损: -521.42 胜率: 60.48% 总收益: 3281.67 平均盈利: 8.82 typeA: 5.34
趋势空且增强-L2-3-3 总交易次数: 373 盈利: 19199.188290987404 亏损: -17322.235068714126 最大盈利: 836.27 最大亏损: -774.78 胜率: 59.25% 总收益: 1876.95 平均盈利: 5.03 typeA: 2.98
趋势多且增强-L1-3-4 总交易次数: 184 盈利: 12959.77251926955 亏损: -11922.439162583438 最大盈利: 905.14 最大亏损: -610.81 胜率: 39.67% 总收益: 1037.33 平均盈利: 5.64 typeA: 2.24

#############################################################################

tradeNumTotal 3660
profitTotal 162929.5514844662
maxLossTotal -2061.77
winRateTotal 2985.4099999999994
period month 53
avgRate 56.33
maxDrawdownTotal 32.8
趋势空且增强-L2-1-3 总交易次数: 68 盈利: 8718.160334688237 亏损: -1529.8398031870045 最大盈利: 1220.97 最大亏损: -673.69 胜率: 77.94% 总收益: 7188.32 平均盈利: 105.71 typeA: 82.39
趋势多且增强-R-2-2 总交易次数: 26 盈利: 2141.404376679049 亏损: -522.2550632676632 最大盈利: 369.72 最大亏损: -162.39 胜率: 73.08% 总收益: 1619.15 平均盈利: 62.27 typeA: 45.51
趋势多且增强-R-1-1-1 总交易次数: 37 盈利: 4842.114794767353 亏损: -2563.0091203399047 最大盈利: 1148.20 最大亏损: -711.96 胜率: 70.27% 总收益: 2279.11 平均盈利: 61.60 typeA: 43.28
趋势空且增强-L2-2-3 总交易次数: 42 盈利: 3969.3079347707303 亏损: -1717.2953279040744 最大盈利: 1142.40 最大亏损: -375.86 胜率: 69.05% 总收益: 2252.01 平均盈利: 53.62 typeA: 37.02
趋势多且增强-R-1-2-2 总交易次数: 59 盈利: 4850.272918087848 亏损: -3496.552045928097 最大盈利: 1403.49 最大亏损: -879.35 胜率: 67.80% 总收益: 1353.72 平均盈利: 22.94 typeA: 15.56
趋势多且增强-L3-1-5 总交易次数: 203 盈利: 12219.253871431454 亏损: -7100.633028324683 最大盈利: 1373.52 最大亏损: -395.22 胜率: 67.00% 总收益: 5118.62 平均盈利: 25.21 typeA: 16.89
趋势空且增强-L1-1-2 总交易次数: 37 盈利: 6171.886933348584 亏损: -3768.569829967331 最大盈利: 2068.45 最大亏损: -808.06 胜率: 64.86% 总收益: 2403.32 平均盈利: 64.95 typeA: 42.13
趋势多且增强-L3-1-4-1 总交易次数: 198 盈利: 21122.163376752545 亏损: -14013.64490372997 最大盈利: 1855.48 最大亏损: -1830.26 胜率: 63.13% 总收益: 7108.52 平均盈利: 35.90 typeA: 22.66
趋势空且增强-11 总交易次数: 164 盈利: 19259.91998717781 亏损: -13767.80045244885 最大盈利: 750.81 最大亏损: -897.70 胜率: 62.80% 总收益: 5492.12 平均盈利: 33.49 typeA: 21.03
趋势多且增强-L3-1-4-3 总交易次数: 372 盈利: 16756.409808171757 亏损: -13474.74257122807 最大盈利: 2081.23 最大亏损: -521.42 胜率: 60.48% 总收益: 3281.67 平均盈利: 8.82 typeA: 5.34
趋势空且增强-L2-3-3 总交易次数: 373 盈利: 19199.188290987404 亏损: -17322.235068714126 最大盈利: 836.27 最大亏损: -774.78 胜率: 59.25% 总收益: 1876.95 平均盈利: 5.03 typeA: 2.98
趋势多且增强-R-2-1 总交易次数: 73 盈利: 5934.387902969092 亏损: -3571.243485923923 最大盈利: 1699.60 最大亏损: -444.10 胜率: 58.90% 总收益: 2363.14 平均盈利: 32.37 typeA: 19.07
趋势多且增强-R-3-2 总交易次数: 17 盈利: 1085.8038354650619 亏损: -442.66717463488214 最大盈利: 266.93 最大亏损: -157.60 胜率: 58.82% 总收益: 643.14 平均盈利: 37.83 typeA: 22.25
趋势多且增强-R-3-1 总交易次数: 108 盈利: 6938.221229166604 亏损: -5288.091654207932 最大盈利: 1447.78 最大亏损: -837.68 胜率: 58.33% 总收益: 1650.13 平均盈利: 15.28 typeA: 8.91
趋势空且增强-L2-3-4 总交易次数: 333 盈利: 18160.345671961277 亏损: -14508.467355075654 最大盈利: 1020.85 最大亏损: -647.04 胜率: 57.66% 总收益: 3651.88 平均盈利: 10.97 typeA: 6.32
趋势多且增强-L1-2-1 总交易次数: 7 盈利: 1859.604771694 亏损: -350.4566031446385 最大盈利: 766.72 最大亏损: -165.71 胜率: 57.14% 总收益: 1509.15 平均盈利: 215.59 typeA: 123.19
趋势空且增强-L2-3-5 总交易次数: 196 盈利: 13812.034680028319 亏损: -7564.277934349762 最大盈利: 2433.03 最大亏损: -633.58 胜率: 56.63% 总收益: 6247.76 平均盈利: 31.88 typeA: 18.05
趋势多且增强-R-1-1-2 总交易次数: 235 盈利: 23246.9654464987 亏损: -16834.305407373617 最大盈利: 1933.32 最大亏损: -2061.77 胜率: 56.60% 总收益: 6412.66 平均盈利: 27.29 typeA: 15.44
趋势空且增强-2 总交易次数: 204 盈利: 30474.691664170303 亏损: -16339.645202314798 最大盈利: 4403.10 最大亏损: -818.35 胜率: 53.92% 总收益: 14135.05 平均盈利: 69.29 typeA: 37.36
趋势多且增强-11 总交易次数: 211 盈利: 26668.566299347636 亏损: -18759.202629305317 最大盈利: 2423.17 最大亏损: -907.40 胜率: 50.71% 总收益: 7909.36 平均盈利: 37.49 typeA: 19.01
趋势多且增强-L3-1-3 总交易次数: 133 盈利: 12748.244735457449 亏损: -6379.577262327933 最大盈利: 2591.16 最大亏损: -695.46 胜率: 50.38% 总收益: 6368.67 平均盈利: 47.88 typeA: 24.12
趋势多且增强-L1-3-9 总交易次数: 34 盈利: 4504.662928826276 亏损: -2376.1925635612447 最大盈利: 1115.35 最大亏损: -426.30 胜率: 47.06% 总收益: 2128.47 平均盈利: 62.60 typeA: 29.46
趋势多且增强-L1-1-6 总交易次数: 56 盈利: 17036.94718852432 亏损: -4842.990263642759 最大盈利: 8558.15 最大亏损: -381.66 胜率: 46.43% 总收益: 12193.96 平均盈利: 217.75 typeA: 101.10
趋势多且增强-L1-2-2 总交易次数: 11 盈利: 10463.568812160125 亏损: -731.8088541712134 最大盈利: 7106.66 最大亏损: -315.45 胜率: 45.45% 总收益: 9731.76 平均盈利: 884.71 typeA: 402.10
趋势多且增强-L1-3-2 总交易次数: 32 盈利: 3590.794533718919 亏损: -1313.820727792057 最大盈利: 880.28 最大亏损: -296.01 胜率: 40.63% 总收益: 2276.97 平均盈利: 71.16 typeA: 28.91
趋势多且增强-L1-3-1 总交易次数: 40 盈利: 46734.311752840695 亏损: -1859.18421181273 最大盈利: 41166.13 最大亏损: -281.54 胜率: 40.00% 总收益: 44875.13 平均盈利: 1121.88 typeA: 448.75
趋势多且增强-L1-3-4 总交易次数: 184 盈利: 12959.77251926955 亏损: -11922.439162583438 最大盈利: 905.14 最大亏损: -610.81 胜率: 39.67% 总收益: 1037.33 平均盈利: 5.64 typeA: 2.24
趋势空且增强-L3-1-6 总交易次数: 127 盈利: 16133.641899806447 亏损: -10681.185829152897 最大盈利: 2533.05 最大亏损: -727.25 胜率: 37.80% 总收益: 5452.46 平均盈利: 42.93 typeA: 16.23
趋势多且增强-L1-2-5 总交易次数: 80 盈利: 7473.877834924026 亏损: -5742.841312810793 最大盈利: 1183.30 最大亏损: -341.13 胜率: 36.25% 总收益: 1731.04 平均盈利: 21.64 typeA: 7.84





*/
