/*  #################################



if (emaFast > emaSlow) {
  if (close > emaFast) {
    if (adxPlusDI > adxMinusDI) {
      if (rsi > 70) {
        marketType = adx >= 30 ? '趋势多' : '趋势空';
      } else if (rsi > 75) {
        marketType = '趋势空';
        if (
          emaSlope > config.emaSlope.emaSlopeThreshold * 2 &&
          adx >= 30
        )
          marketType =
            adxMinusDI > 10 && rsi > 80
              ? '趋势空且增强-1'
              : adxMinusDI < 10
              ? '趋势多且增强-1'
              : '';
      } else if (
        rsi < 60 &&
        emaSlope > config.emaSlope.emaSlopeThreshold / 2
      ) {
        marketType = '趋势多且增强-2';
      }
    } else {
      if (adx < 20 && adx > 15) {
        if (
          rsi > 60 &&
          emaSlope > config.emaSlope.emaSlopeThreshold * 2
        )
          marketType = '趋势空且增强-2';
      }
    }
  } else if (close < emaSlow) {
    if (adxPlusDI < adxMinusDI) {
      if (rsi < 50) marketType = '趋势空且增强-3';
    }
    if (adxPlusDI > adxMinusDI) {
      if (rsi > 50) marketType = '趋势多且增强-3';
    }
    if (adx >= 25) {
      if (rsi > 40) {
        marketType = '趋势多且增强-4';
      }
    }
    if (adx < 25) {
    }
    if (adx < 20) {
      if (adxPlusDI < adxMinusDI) {
        marketType = '趋势空';
      }
      if (rsi > 55 && adxPlusDI > adxMinusDI)
        marketType = '趋势多且增强-5';
      if (rsi < 45 && adxPlusDI < adxMinusDI)
        marketType = '趋势空且增强-4';
    }
  } else {
    if (adx < 25 && adx > 20) {
      if (rsi > 50) marketType = '趋势多且增强-6';
      if (rsi < 50) marketType = '趋势多且增强-5';
    }
  }
}

if (emaFast < emaSlow) {
  if (close < emaFast) {
    if (adxPlusDI < adxMinusDI) {
      if (rsi < 30) {
        marketType = '趋势多';
        if (
          rsi < 25 &&
          emaSlope < -config.emaSlope.emaSlopeThreshold * 2
        )
          marketType =
            adxPlusDI > 10 ? '趋势多且增强-7' : '趋势多';
      } else if (
        rsi > 40 &&
        emaSlope < -config.emaSlope.emaSlopeThreshold / 2
      ) {
        marketType = '趋势空且增强-7';
      }
    } else {
      if (adx < 20 && adx > 15) {
        if (
          rsi < 45 &&
          emaSlope < -config.emaSlope.emaSlopeThreshold * 2
        )
          marketType = '趋势多且增强-8';
      }
    }
  } else if (close > emaSlow) {
    if (adxPlusDI < adxMinusDI) {
      if (rsi < 50) marketType = '趋势空且增强-8';
    }
    if (adxPlusDI > adxMinusDI) {
      if (rsi > 50) marketType = '趋势空';
    }

    if (adx >= 25) {
      if (rsi < 60) marketType = '趋势空';
    }
    if (adx < 25) {
      marketType = rsi > 60 ? '趋势多' : '趋势空';
    }
    if (adx < 20) {
      if (rsi > 55 && adxPlusDI > adxMinusDI)
        marketType = '趋势多且增强-10';
      if (rsi < 45 && adxPlusDI < adxMinusDI)
        marketType = '趋势空且增强-10';
    }
  } else {
  }
}

if (
  adx < 25 &&
  adxPlusDI > adxMinusDI &&
  emaFast < emaSlow &&
  close < emaFast
) {
  if (rsi < 30 && emaSlope < -config.emaSlope.emaSlopeThreshold)
    marketType = '趋势空且增强-11';
}
if (
  adx < 25 &&
  adxPlusDI < adxMinusDI &&
  emaFast > emaSlow &&
  close > emaFast
) {
  if (rsi > 70 && emaSlope > config.emaSlope.emaSlopeThreshold)
    marketType = '趋势多且增强-11';
}


/*


// profitTotal 128229.40293307074
// maxLossTotal -8015.37
// winRateTotal 2363.840000000001
// period month 53
// avgRate 44.60
// maxDrawdownTotal 46.3
// 趋势空且增强-1 总交易次数: 252 盈利: 171 亏损: 81 最大盈利: 3060.96 最大亏损: -8015.37 胜率: 67.86% 总收益: 9677.65
// 趋势多且增强-7 总交易次数: 270 盈利: 181 亏损: 89 最大盈利: 1699.60 最大亏损: -1208.82 胜率: 67.04% 总收益: 15497.30
// 趋势空且增强-11 总交易次数: 146 盈利: 89 亏损: 57 最大盈利: 778.33 最大亏损: -813.44 胜率: 60.96% 总收益: 2766.38
// 趋势空且增强-2 总交易次数: 166 盈利: 98 亏损: 68 最大盈利: 1750.26 最大亏损: -1724.13 胜率: 59.04% 总收益: 1835.80
// 趋势多且增强-3 总交易次数: 12 盈利: 7 亏损: 5 最大盈利: 405.27 最大亏损: -92.76 胜率: 58.33% 总收益: 642.52
// 趋势多且增强-8 总交易次数: 275 盈利: 155 亏损: 120 最大盈利: 3060.40 最大亏损: -1479.45 胜率: 56.36% 总收益: 1439.47
// 趋势多且增强-4 总交易次数: 785 盈利: 437 亏损: 348 最大盈利: 3373.87 最大亏损: -1173.74 胜率: 55.67% 总收益: 21416.80
// 趋势多且增强-11 总交易次数: 182 盈利: 100 亏损: 82 最大盈利: 2658.47 最大亏损: -907.40 胜率: 54.95% 总收益: 3391.26
// 趋势多且增强-1 总交易次数: 102 盈利: 47 亏损: 55 最大盈利: 3283.19 最大亏损: -1889.43 胜率: 46.08% 总收益: 6530.29
// 趋势空且增强-4 总交易次数: 76 盈利: 35 亏损: 41 最大盈利: 910.73 最大亏损: -292.60 胜率: 46.05% 总收益: 1609.29
// 趋势空且增强-7 总交易次数: 1465 盈利: 643 亏损: 822 最大盈利: 2350.99 最大亏损: -3479.07 胜率: 43.89% 总收益: 23983.70
// 趋势多且增强-2 总交易次数: 1204 盈利: 471 亏损: 733 最大盈利: 3114.40 最大亏损: -1401.52 胜率: 39.12% 总收益: 40899.91
// 趋势多且增强-10 总交易次数: 54 盈利: 21 亏损: 33 最大盈利: 1251.76 最大亏损: -797.76 胜率: 38.89% 总收益: 1629.24
// 趋势空且增强-3 总交易次数: 380 盈利: 140 亏损: 240 最大盈利: 1717.05 最大亏损: -1220.59 胜率: 36.84% 总收益: 5954.93
// 趋势多且增强-6 总交易次数: 916 盈利: 312 亏损: 604 最大盈利: 2117.62 最大亏损: -1603.63 胜率: 34.06% 总收益: 3968.27
// 趋势多且增强-5 总交易次数: 38 盈利: 9 亏损: 29 最大盈利: 275.93 最大亏损: -185.04 胜率: 23.68% 总收益: -305.40

/*
###################################################

趋势多且增强-1 总交易次数: 102 盈利: 15543.836700226399 亏损: -9013.549142325903 最大盈利: 3283.19 最大亏损: -1889.43 胜率: 46.08% 总收益: 6530.29 平均盈利: 64.02
趋势多且增强-7 总交易次数: 270 盈利: 39401.278935118884 亏损: -23903.97890286401 最大盈利: 1699.60 最大亏损: -1208.82 胜率: 67.04% 总收益: 15497.30 平均盈利: 57.40
趋势多且增强-3 总交易次数: 12 盈利: 802.7784718940346 亏损: -160.25659676774796 最大盈利: 405.27 最大亏损: -92.76 胜率: 58.33% 总收益: 642.52 平均盈利: 53.54
趋势空且增强-1 总交易次数: 252 盈利: 45986.12098660062 亏损: -36308.473752504535 最大盈利: 3060.96 最大亏损: -8015.37 胜率: 67.86% 总收益: 9677.65 平均盈利: 38.40
趋势多且增强-2 总交易次数: 1204 盈利: 136196.84061735877 亏损: -95296.93241461799 最大盈利: 3114.40 最大亏损: -1401.52 胜率: 39.12% 总收益: 40899.91 平均盈利: 33.97
趋势多且增强-10 总交易次数: 54 盈利: 4197.441592576286 亏损: -2568.205216179146 最大盈利: 1251.76 最大亏损: -797.76 胜率: 38.89% 总收益: 1629.24 平均盈利: 30.17
趋势多且增强-4 总交易次数: 785 盈利: 59600.76945481538 亏损: -38183.965008360436 最大盈利: 3373.87 最大亏损: -1173.74 胜率: 55.67% 总收益: 21416.80 平均盈利: 27.28
趋势空且增强-4 总交易次数: 76 盈利: 5795.6569336612 亏损: -4186.367615539448 最大盈利: 910.73 最大亏损: -292.60 胜率: 46.05% 总收益: 1609.29 平均盈利: 21.17
趋势空且增强-11 总交易次数: 146 盈利: 14149.47938334938 亏损: -11383.10405512391 最大盈利: 778.33 最大亏损: -813.44 胜率: 60.96% 总收益: 2766.38 平均盈利: 18.95
趋势多且增强-11 总交易次数: 182 盈利: 20517.223144383825 亏损: -17125.96673588096 最大盈利: 2658.47 最大亏损: -907.40 胜率: 54.95% 总收益: 3391.26 平均盈利: 18.63
趋势空且增强-7 总交易次数: 1465 盈利: 165861.3375531459 亏损: -141877.6423715744 最大盈利: 2350.99 最大亏损: -3479.07 胜率: 43.89% 总收益: 23983.70 平均盈利: 16.37
趋势空且增强-3 总交易次数: 380 盈利: 30163.064226270282 亏损: -24208.1294140455 最大盈利: 1717.05 最大亏损: -1220.59 胜率: 36.84% 总收益: 5954.93 平均盈利: 15.67
趋势空且增强-2 总交易次数: 166 盈利: 13108.576725370716 亏损: -11272.772603321857 最大盈利: 1750.26 最大亏损: -1724.13 胜率: 59.04% 总收益: 1835.80 平均盈利: 11.06
趋势多且增强-8 总交易次数: 275 盈利: 18957.67933200975 亏损: -17518.207981196203 最大盈利: 3060.40 最大亏损: -1479.45 胜率: 56.36% 总收益: 1439.47 平均盈利: 5.23
趋势多且增强-6 总交易次数: 916 盈利: 51025.907279950356 亏损: -47057.63398281573 最大盈利: 2117.62 最大亏损: -1603.63 胜率: 34.06% 总收益: 3968.27 平均盈利: 4.33
趋势多且增强-5 总交易次数: 38 盈利: 822.6398399342359 亏损: -1128.0424504778116 最大盈利: 275.93 最大亏损: -185.04 胜率: 23.68% 总收益: -305.40 平均盈利: -8.04

###############################################################################

趋势多且增强-7 总交易次数: 270 盈利: 39401.278935118884 亏损: -23903.97890286401 最大盈利: 1699.60 最大亏损: -1208.82 胜率: 67.04% 总收益: 15497.30 平均盈利: 57.40 typeA: 38.48
趋势多且增强-3 总交易次数: 12 盈利: 802.7784718940346 亏损: -160.25659676774796 最大盈利: 405.27 最大亏损: -92.76 胜率: 58.33% 总收益: 642.52 平均盈利: 53.54 typeA: 31.23
趋势多且增强-1 总交易次数: 102 盈利: 15543.836700226399 亏损: -9013.549142325903 最大盈利: 3283.19 最大亏损: -1889.43 胜率: 46.08% 总收益: 6530.29 平均盈利: 64.02 typeA: 29.50
趋势空且增强-1 总交易次数: 252 盈利: 45986.12098660062 亏损: -36308.473752504535 最大盈利: 3060.96 最大亏损: -8015.37 胜率: 67.86% 总收益: 9677.65 平均盈利: 38.40 typeA: 26.06
趋势多且增强-4 总交易次数: 785 盈利: 59600.76945481538 亏损: -38183.965008360436 最大盈利: 3373.87 最大亏损: -1173.74 胜率: 55.67% 总收益: 21416.80 平均盈利: 27.28 typeA: 15.19
趋势多且增强-2 总交易次数: 1204 盈利: 136196.84061735877 亏损: -95296.93241461799 最大盈利: 3114.40 最大亏损: -1401.52 胜率: 39.12% 总收益: 40899.91 平均盈利: 33.97 typeA: 13.29
趋势多且增强-10 总交易次数: 54 盈利: 4197.441592576286 亏损: -2568.205216179146 最大盈利: 1251.76 最大亏损: -797.76 胜率: 38.89% 总收益: 1629.24 平均盈利: 30.17 typeA: 11.73
趋势空且增强-11 总交易次数: 146 盈利: 14149.47938334938 亏损: -11383.10405512391 最大盈利: 778.33 最大亏损: -813.44 胜率: 60.96% 总收益: 2766.38 平均盈利: 18.95 typeA: 11.55
趋势多且增强-11 总交易次数: 182 盈利: 20517.223144383825 亏损: -17125.96673588096 最大盈利: 2658.47 最大亏损: -907.40 胜率: 54.95% 总收益: 3391.26 平均盈利: 18.63 typeA: 10.24
趋势空且增强-4 总交易次数: 76 盈利: 5795.6569336612 亏损: -4186.367615539448 最大盈利: 910.73 最大亏损: -292.60 胜率: 46.05% 总收益: 1609.29 平均盈利: 21.17 typeA: 9.75
趋势空且增强-7 总交易次数: 1465 盈利: 165861.3375531459 亏损: -141877.6423715744 最大盈利: 2350.99 最大亏损: -3479.07 胜率: 43.89% 总收益: 23983.70 平均盈利: 16.37 typeA: 7.19
趋势空且增强-2 总交易次数: 166 盈利: 13108.576725370716 亏损: -11272.772603321857 最大盈利: 1750.26 最大亏损: -1724.13 胜率: 59.04% 总收益: 1835.80 平均盈利: 11.06 typeA: 6.53
趋势空且增强-3 总交易次数: 380 盈利: 30163.064226270282 亏损: -24208.1294140455 最大盈利: 1717.05 最大亏损: -1220.59 胜率: 36.84% 总收益: 5954.93 平均盈利: 15.67 typeA: 5.77
趋势多且增强-8 总交易次数: 275 盈利: 18957.67933200975 亏损: -17518.207981196203 最大盈利: 3060.40 最大亏损: -1479.45 胜率: 56.36% 总收益: 1439.47 平均盈利: 5.23 typeA: 2.95
趋势多且增强-6 总交易次数: 916 盈利: 51025.907279950356 亏损: -47057.63398281573 最大盈利: 2117.62 最大亏损: -1603.63 胜率: 34.06% 总收益: 3968.27 平均盈利: 4.33 typeA: 1.48
趋势多且增强-5 总交易次数: 38 盈利: 822.6398399342359 亏损: -1128.0424504778116 最大盈利: 275.93 最大亏损: -185.04 胜率: 23.68% 总收益: -305.40 平均盈利: -8.04 typeA: -1.90


##################################################

profitTotal 128229.40293307074
maxLossTotal -8015.37
winRateTotal 2363.840000000001
period month 53
avgRate 44.60
maxDrawdownTotal 46.3
趋势多且增强-7 总交易次数: 270 盈利: 39401.278935118884 亏损: -23903.97890286401 最大盈利: 1699.60 最大亏损: -1208.82 胜率: 67.04% 总收益: 15497.30 平均盈利: 57.40 typeA: 38.48
趋势多且增强-3 总交易次数: 12 盈利: 802.7784718940346 亏损: -160.25659676774796 最大盈利: 405.27 最大亏损: -92.76 胜率: 58.33% 总收益: 642.52 平均盈利: 53.54 typeA: 31.23
趋势多且增强-1 总交易次数: 102 盈利: 15543.836700226399 亏损: -9013.549142325903 最大盈利: 3283.19 最大亏损: -1889.43 胜率: 46.08% 总收益: 6530.29 平均盈利: 64.02 typeA: 29.50
趋势空且增强-1 总交易次数: 252 盈利: 45986.12098660062 亏损: -36308.473752504535 最大盈利: 3060.96 最大亏损: -8015.37 胜率: 67.86% 总收益: 9677.65 平均盈利: 38.40 typeA: 26.06
趋势多且增强-4 总交易次数: 785 盈利: 59600.76945481538 亏损: -38183.965008360436 最大盈利: 3373.87 最大亏损: -1173.74 胜率: 55.67% 总收益: 21416.80 平均盈利: 27.28 typeA: 15.19
趋势多且增强-2 总交易次数: 1204 盈利: 136196.84061735877 亏损: -95296.93241461799 最大盈利: 3114.40 最大亏损: -1401.52 胜率: 39.12% 总收益: 40899.91 平均盈利: 33.97 typeA: 13.29
趋势多且增强-10 总交易次数: 54 盈利: 4197.441592576286 亏损: -2568.205216179146 最大盈利: 1251.76 最大亏损: -797.76 胜率: 38.89% 总收益: 1629.24 平均盈利: 30.17 typeA: 11.73
趋势空且增强-11 总交易次数: 146 盈利: 14149.47938334938 亏损: -11383.10405512391 最大盈利: 778.33 最大亏损: -813.44 胜率: 60.96% 总收益: 2766.38 平均盈利: 18.95 typeA: 11.55
趋势多且增强-11 总交易次数: 182 盈利: 20517.223144383825 亏损: -17125.96673588096 最大盈利: 2658.47 最大亏损: -907.40 胜率: 54.95% 总收益: 3391.26 平均盈利: 18.63 typeA: 10.24
趋势空且增强-4 总交易次数: 76 盈利: 5795.6569336612 亏损: -4186.367615539448 最大盈利: 910.73 最大亏损: -292.60 胜率: 46.05% 总收益: 1609.29 平均盈利: 21.17 typeA: 9.75
趋势空且增强-7 总交易次数: 1465 盈利: 165861.3375531459 亏损: -141877.6423715744 最大盈利: 2350.99 最大亏损: -3479.07 胜率: 43.89% 总收益: 23983.70 平均盈利: 16.37 typeA: 7.19
趋势空且增强-2 总交易次数: 166 盈利: 13108.576725370716 亏损: -11272.772603321857 最大盈利: 1750.26 最大亏损: -1724.13 胜率: 59.04% 总收益: 1835.80 平均盈利: 11.06 typeA: 6.53
趋势空且增强-3 总交易次数: 380 盈利: 30163.064226270282 亏损: -24208.1294140455 最大盈利: 1717.05 最大亏损: -1220.59 胜率: 36.84% 总收益: 5954.93 平均盈利: 15.67 typeA: 5.77
趋势多且增强-8 总交易次数: 275 盈利: 18957.67933200975 亏损: -17518.207981196203 最大盈利: 3060.40 最大亏损: -1479.45 胜率: 56.36% 总收益: 1439.47 平均盈利: 5.23 typeA: 2.95
趋势多且增强-6 总交易次数: 916 盈利: 51025.907279950356 亏损: -47057.63398281573 最大盈利: 2117.62 最大亏损: -1603.63 胜率: 34.06% 总收益: 3968.27 平均盈利: 4.33 typeA: 1.48
趋势多且增强-5 总交易次数: 38 盈利: 822.6398399342359 亏损: -1128.0424504778116 最大盈利: 275.93 最大亏损: -185.04 胜率: 23.68% 总收益: -305.40 平均盈利: -8.04 typeA: -1.90


###################################################

profitTotal 144034.70494669524
maxLossTotal -5425.95
winRateTotal 2260.7100000000005
period month 53
avgRate 42.65
maxDrawdownTotal 41.9
趋势多且增强-1 总交易次数: 58 盈利: 17878.374725835467 亏损: -9735.804410992057 最大盈利: 6150.71 最大亏损: -1889.43 胜率: 56.90% 总收益: 8142.57 平均盈利: 140.39 typeA: 79.88
趋势空且增强-1 总交易次数: 120 盈利: 31111.87932022779 亏损: -19991.228125900136 最大盈利: 3191.96 最大亏损: -5425.95 胜率: 62.50% 总收益: 11120.65 平均盈利: 92.67 typeA: 57.92
趋势多且增强-7 总交易次数: 270 盈利: 39487.316299317084 亏损: -23903.97890286401 最大盈利: 1699.60 最大亏损: -1208.82 胜率: 67.04% 总收益: 15583.34 平均盈利: 57.72 typeA: 38.69
趋势多且增强-4 总交易次数: 607 盈利: 60051.90442671677 亏损: -30139.898157963285 最大盈利: 9227.82 最大亏损: -1173.74 胜率: 52.88% 总收益: 29912.01 平均盈利: 49.28 typeA: 26.06
趋势多且增强-2 总交易次数: 1039 盈利: 129016.28703655387 亏损: -83039.08150993954 最大盈利: 9874.53 最大亏损: -1401.52 胜率: 36.48% 总收益: 45977.21 平均盈利: 44.25 typeA: 16.14
趋势多且增强-10 总交易次数: 54 盈利: 5032.707097453098 亏损: -2838.8038257945077 最大盈利: 2723.88 最大亏损: -797.76 胜率: 35.19% 总收益: 2193.90 平均盈利: 40.63 typeA: 14.30
趋势空且增强-11 总交易次数: 146 盈利: 14149.47938334938 亏损: -11383.10405512391 最大盈利: 778.33 最大亏损: -813.44 胜率: 60.96% 总收益: 2766.38 平均盈利: 18.95 typeA: 11.55
趋势空且增强-4 总交易次数: 76 盈利: 5795.6569336612 亏损: -4186.367615539448 最大盈利: 910.73 最大亏损: -292.60 胜率: 46.05% 总收益: 1609.29 平均盈利: 21.17 typeA: 9.75
趋势空且增强-7 总交易次数: 1465 盈利: 165861.3375531459 亏损: -141877.6423715744 最大盈利: 2350.99 最大亏损: -3479.07 胜率: 43.89% 总收益: 23983.70 平均盈利: 16.37 typeA: 7.19
趋势空且增强-2 总交易次数: 166 盈利: 13108.576725370716 亏损: -11272.772603321857 最大盈利: 1750.26 最大亏损: -1724.13 胜率: 59.04% 总收益: 1835.80 平均盈利: 11.06 typeA: 6.53
趋势多且增强-8 总交易次数: 275 盈利: 20514.748514673814 亏损: -17518.207981196203 最大盈利: 4561.65 最大亏损: -1479.45 胜率: 56.36% 总收益: 2996.54 平均盈利: 10.90 typeA: 6.14
趋势空且增强-3 总交易次数: 380 盈利: 30163.064226270282 亏损: -24208.1294140455 最大盈利: 1717.05 最大亏损: -1220.59 胜率: 36.84% 总收益: 5954.93 平均盈利: 15.67 typeA: 5.77
趋势多且增强-3 总交易次数: 12 盈利: 397.5066159653215 亏损: -286.16007499605973 最大盈利: 151.39 最大亏损: -125.90 胜率: 50.00% 总收益: 111.35 平均盈利: 9.28 typeA: 4.64
趋势多且增强-11 总交易次数: 172 盈利: 22745.325256324766 亏损: -21301.815662002093 最大盈利: 2331.42 最大亏损: -907.40 胜率: 43.02% 总收益: 1443.51 平均盈利: 8.39 typeA: 3.61
趋势多且增强-6 总交易次数: 881 盈利: 49755.747215755924 亏损: -47619.03342110404 最大盈利: 2117.62 最大亏损: -1603.63 胜率: 31.56% 总收益: 2136.71 平均盈利: 2.43 typeA: 0.77
趋势多且增强-5 总交易次数: 38 盈利: 982.8641989085944 亏损: -1128.0424504778116 最大盈利: 275.93 最大亏损: -185.04 胜率: 23.68% 总收益: -145.18 平均盈利: -3.82 typeA: -0.90

###########################################################################

profitTotal 148380.2293375683
maxLossTotal -3479.07
winRateTotal 2273.48
period month 53
avgRate 42.90
maxDrawdownTotal 44.3
趋势多且增强-7 总交易次数: 270 盈利: 39487.316299317084 亏损: -23903.97890286401 最大盈利: 1699.60 最大亏损: -1208.82 胜率: 67.04% 总收益: 15583.34 平均盈利: 57.72 typeA: 38.69
趋势多且增强-3 总交易次数: 12 盈利: 802.7784718940346 亏损: -160.25659676774796 最大盈利: 405.27 最大亏损: -92.76 胜率: 58.33% 总收益: 642.52 平均盈利: 53.54 typeA: 31.23
趋势多且增强-2 总交易次数: 1103 盈利: 173577.2724759525 亏损: -88391.39003756334 最大盈利: 41166.13 最大亏损: -1401.52 胜率: 37.90% 总收益: 85185.88 平均盈利: 77.23 typeA: 29.27
趋势多且增强-11 总交易次数: 181 盈利: 23175.845051034776 亏损: -18551.016628453748 最大盈利: 2331.42 最大亏损: -907.40 胜率: 49.72% 总收益: 4624.83 平均盈利: 25.55 typeA: 12.70
趋势空且增强-11 总交易次数: 146 盈利: 14149.47938334938 亏损: -11647.058051779211 最大盈利: 778.33 最大亏损: -897.70 胜率: 60.96% 总收益: 2502.42 平均盈利: 17.14 typeA: 10.45
趋势空且增强-4 总交易次数: 76 盈利: 5795.6569336612 亏损: -4186.367615539448 最大盈利: 910.73 最大亏损: -292.60 胜率: 46.05% 总收益: 1609.29 平均盈利: 21.17 typeA: 9.75
趋势空且增强-2 总交易次数: 166 盈利: 13108.576725370716 亏损: -11078.50583539961 最大盈利: 1750.26 最大亏损: -818.35 胜率: 59.04% 总收益: 2030.07 平均盈利: 12.23 typeA: 7.22
趋势多且增强-10 总交易次数: 54 盈利: 3731.834920204533 亏损: -2755.579305853593 最大盈利: 1251.76 最大亏损: -797.76 胜率: 37.04% 总收益: 976.26 平均盈利: 18.08 typeA: 6.70
趋势空且增强-7 总交易次数: 1467 盈利: 165861.3375531459 亏损: -144142.32283461362 最大盈利: 2350.99 最大亏损: -3479.07 胜率: 43.83% 总收益: 21719.01 平均盈利: 14.81 typeA: 6.49
趋势多且增强-8 总交易次数: 275 盈利: 20677.634858869253 亏损: -17518.207981196203 最大盈利: 4780.36 最大亏损: -1479.45 胜率: 56.36% 总收益: 3159.43 平均盈利: 11.49 typeA: 6.48
趋势多且增强-4 总交易次数: 657 盈利: 41378.95987003667 亏损: -34007.904189795496 最大盈利: 1855.48 最大亏损: -1173.74 胜率: 52.82% 总收益: 7371.06 平均盈利: 11.22 typeA: 5.93
趋势空且增强-3 总交易次数: 380 盈利: 30133.564474902803 亏损: -24262.45297253222 最大盈利: 1717.05 最大亏损: -1220.59 胜率: 36.58% 总收益: 5871.11 平均盈利: 15.45 typeA: 5.65
趋势多且增强-6 总交易次数: 914 盈利: 55993.55515001397 亏损: -47043.13926728289 最大盈利: 5340.69 最大亏损: -1603.63 胜率: 33.92% 总收益: 8950.42 平均盈利: 9.79 typeA: 3.32
趋势多且增强-5 总交易次数: 38 盈利: 822.6398399342359 亏损: -1128.0424504778116 最大盈利: 275.93 最大亏损: -185.04 胜率: 23.68% 总收益: -305.40 平均盈利: -8.04 typeA: -1.90

==================================================================




profitTotal 152640.6598333721
maxLossTotal -3479.07
winRateTotal 2306.8199999999997
period month 53
avgRate 43.52
maxDrawdownTotal 44.1
趋势多且增强-7 总交易次数: 270 盈利: 39487.316299317084 亏损: -23903.97890286401 最大盈利: 1699.60 最大亏损: -1208.82 胜率: 67.04% 总收益: 15583.34 平均盈利: 57.72 typeA: 38.69
趋势多且增强-2 总交易次数: 1095 盈利: 173476.31324507284 亏损: -87438.38568864955 最大盈利: 41166.13 最大亏损: -1401.52 胜率: 37.99% 总收益: 86037.93 平均盈利: 78.57 typeA: 29.85
趋势空且增强-4 总交易次数: 74 盈利: 6269.825815341308 亏损: -4300.131770564811 最大盈利: 910.73 最大亏损: -292.60 胜率: 50.00% 总收益: 1969.69 平均盈利: 26.62 typeA: 13.31
趋势多且增强-11 总交易次数: 181 盈利: 23175.845051034776 亏损: -18817.02540823572 最大盈利: 2331.42 最大亏损: -907.40 胜率: 49.72% 总收益: 4358.82 平均盈利: 24.08 typeA: 11.97
趋势多且增强-3 总交易次数: 68 盈利: 3860.982337820494 亏损: -2529.091636680612 最大盈利: 1049.40 最大亏损: -291.68 胜率: 44.12% 总收益: 1331.89 平均盈利: 19.59 typeA: 8.64
趋势空且增强-7 总交易次数: 1419 盈利: 169488.9051112377 亏损: -144593.44696635279 最大盈利: 2350.99 最大亏损: -3479.07 胜率: 45.53% 总收益: 24895.46 平均盈利: 17.54 typeA: 7.99
趋势空且增强-2 总交易次数: 161 盈利: 13255.933252049594 亏损: -11041.000895638583 最大盈利: 1750.26 最大亏损: -818.35 胜率: 57.76% 总收益: 2214.93 平均盈利: 13.76 typeA: 7.95
趋势空且增强-11 总交易次数: 141 盈利: 13615.384312665894 亏损: -12006.550750914672 最大盈利: 778.33 最大亏损: -897.70 胜率: 59.57% 总收益: 1608.83 平均盈利: 11.41 typeA: 6.80
趋势多且增强-10 总交易次数: 54 盈利: 3731.834920204533 亏损: -2755.579305853593 最大盈利: 1251.76 最大亏损: -797.76 胜率: 37.04% 总收益: 976.26 平均盈利: 18.08 typeA: 6.70
趋势多且增强-8 总交易次数: 273 盈利: 20671.546734610813 亏损: -17434.133911763944 最大盈利: 4780.36 最大亏损: -1479.45 胜率: 56.41% 总收益: 3237.41 平均盈利: 11.86 typeA: 6.69
趋势空且增强-3 总交易次数: 379 盈利: 33983.677524984254 亏损: -27889.90621432036 最大盈利: 1717.05 最大亏损: -1220.59 胜率: 37.47% 总收益: 6093.77 平均盈利: 16.08 typeA: 6.02
趋势多且增强-4 总交易次数: 658 盈利: 41384.59678919644 亏损: -34007.904189795496 最大盈利: 1855.48 最大亏损: -1173.74 胜率: 52.89% 总收益: 7376.69 平均盈利: 11.21 typeA: 5.93
趋势多且增强-6 总交易次数: 918 盈利: 55869.099142616215 亏损: -47469.465061145966 最大盈利: 5340.69 最大亏损: -1603.63 胜率: 33.77% 总收益: 8399.63 平均盈利: 9.15 typeA: 3.09


##################################################################

profitTotal 143653.08109252137
maxLossTotal -3479.07
winRateTotal 2308.840000000001
period month 53
avgRate 43.56
maxDrawdownTotal 41.4
趋势空且增强-1 总交易次数: 129 盈利: 25065.03397388836 亏损: -12138.772122165288 最大盈利: 3191.96 最大亏损: -1549.16 胜率: 66.67% 总收益: 12926.26 平均盈利: 100.20 typeA: 66.81
趋势多且增强-1 总交易次数: 61 盈利: 17296.407604573993 亏损: -11024.284352343619 最大盈利: 6150.71 最大亏损: -1889.43 胜率: 54.10% 总收益: 6272.12 平均盈利: 102.82 typeA: 55.63
趋势多且增强-4 总交易次数: 677 盈利: 60799.263356889176 亏损: -31407.4755182825 最大盈利: 9227.82 最大亏损: -923.52 胜率: 53.47% 总收益: 29391.79 平均盈利: 43.41 typeA: 23.21
趋势多且增强-7 总交易次数: 394 盈利: 34629.001903660406 亏损: -20858.86901926128 最大盈利: 1699.60 最大亏损: -1439.52 胜率: 59.90% 总收益: 13770.13 平均盈利: 34.95 typeA: 20.93
趋势多且增强-2 总交易次数: 1101 盈利: 134654.53460328118 亏损: -89942.89773736836 最大盈利: 9874.53 最大亏损: -1361.53 胜率: 37.69% 总收益: 44711.64 平均盈利: 40.61 typeA: 15.31
趋势多且增强-11 总交易次数: 181 盈利: 23903.226692041186 亏损: -19027.415892475776 最大盈利: 2331.42 最大亏损: -907.40 胜率: 50.28% 总收益: 4875.81 平均盈利: 26.94 typeA: 13.54
趋势空且增强-4 总交易次数: 74 盈利: 5860.906357711153 亏损: -4300.131770564811 最大盈利: 910.73 最大亏损: -292.60 胜率: 50.00% 总收益: 1560.77 平均盈利: 21.09 typeA: 10.55
趋势空且增强-2 总交易次数: 161 盈利: 13517.416236992509 亏损: -10868.272859624105 最大盈利: 1750.26 最大亏损: -726.46 胜率: 57.76% 总收益: 2649.14 平均盈利: 16.45 typeA: 9.50
趋势多且增强-3 总交易次数: 68 盈利: 3860.982337820494 亏损: -2529.091636680612 最大盈利: 1049.40 最大亏损: -291.68 胜率: 44.12% 总收益: 1331.89 平均盈利: 19.59 typeA: 8.64
趋势空且增强-11 总交易次数: 141 盈利: 14646.604414224088 亏损: -12618.447768094416 最大盈利: 778.33 最大亏损: -910.68 胜率: 55.32% 总收益: 2028.16 平均盈利: 14.38 typeA: 7.96
趋势空且增强-7 总交易次数: 1343 盈利: 164109.97955247574 亏损: -140110.4955749115 最大盈利: 2544.83 最大亏损: -3479.07 胜率: 43.78% 总收益: 23999.48 平均盈利: 17.87 typeA: 7.82
趋势多且增强-10 总交易次数: 54 盈利: 3731.834920204533 亏损: -2880.019601458416 最大盈利: 1251.76 最大亏损: -797.76 胜率: 37.04% 总收益: 851.82 平均盈利: 15.77 typeA: 5.84
趋势空且增强-3 总交易次数: 371 盈利: 32708.734204891476 亏损: -27240.79363795605 最大盈利: 2357.13 最大亏损: -1220.59 胜率: 37.20% 总收益: 5467.94 平均盈利: 14.74 typeA: 5.48
趋势多且增强-8 总交易次数: 273 盈利: 20436.229936523952 亏损: -19210.195059546815 最大盈利: 4561.65 最大亏损: -1479.45 胜率: 56.04% 总收益: 1226.03 平均盈利: 4.49 typeA: 2.52
趋势多且增强-6 总交易次数: 918 盈利: 52078.97503545774 亏损: -47540.887487381064 最大盈利: 2117.62 最大亏损: -1286.08 胜率: 33.77% 总收益: 4538.09 平均盈利: 4.94 typeA: 1.67

################################################################



profitTotal 147985.34578208814
maxLossTotal -3479.07
winRateTotal 2327.5000000000005
period month 53
avgRate 43.92
maxDrawdownTotal 42.7
趋势空且增强-1 总交易次数: 129 盈利: 25065.03397388836 亏损: -12138.772122165288 最大盈利: 3191.96 最大亏损: -1549.16 胜率: 66.67% 总收益: 12926.26 平均盈利: 100.20 typeA: 66.81
趋势多且增强-1 总交易次数: 61 盈利: 17296.407604573993 亏损: -11024.284352343619 最大盈利: 6150.71 最大亏损: -1889.43 胜率: 54.10% 总收益: 6272.12 平均盈利: 102.82 typeA: 55.63
趋势多且增强-7test2 总交易次数: 107 盈利: 12089.63784874288 亏损: -5979.998584044565 最大盈利: 1427.22 最大亏损: -1764.99 胜率: 69.16% 总收益: 6109.64 平均盈利: 57.10 typeA: 39.49
趋势多且增强-4 总交易次数: 678 盈利: 60939.73934432185 亏损: -31391.39323585886 最大盈利: 9227.82 最大亏损: -923.52 胜率: 53.54% 总收益: 29548.35 平均盈利: 43.58 typeA: 23.33
趋势多且增强-7test1 总交易次数: 327 盈利: 26386.87950334655 亏损: -15144.332728692547 最大盈利: 1699.60 最大亏损: -984.85 胜率: 61.47% 总收益: 11242.55 平均盈利: 34.38 typeA: 21.13
趋势多且增强-2 总交易次数: 1102 盈利: 134992.85933942435 亏损: -89942.89773736836 最大盈利: 9874.53 最大亏损: -1361.53 胜率: 37.75% 总收益: 45049.96 平均盈利: 40.88 typeA: 15.43
趋势多且增强-11 总交易次数: 181 盈利: 23903.226692041186 亏损: -19027.415892475776 最大盈利: 2331.42 最大亏损: -907.40 胜率: 50.28% 总收益: 4875.81 平均盈利: 26.94 typeA: 13.54
趋势空且增强-2 总交易次数: 161 盈利: 13517.416236992509 亏损: -10868.272859624105 最大盈利: 1750.26 最大亏损: -726.46 胜率: 57.76% 总收益: 2649.14 平均盈利: 16.45 typeA: 9.50
趋势空且增强-11 总交易次数: 141 盈利: 14811.612471406766 亏损: -12615.260446157094 最大盈利: 778.33 最大亏损: -910.68 胜率: 56.03% 总收益: 2196.35 平均盈利: 15.58 typeA: 8.73
趋势空且增强-4 总交易次数: 74 盈利: 5581.547946345316 亏损: -4300.131770564811 最大盈利: 910.73 最大亏损: -292.60 胜率: 50.00% 总收益: 1281.42 平均盈利: 17.32 typeA: 8.66
趋势多且增强-3 总交易次数: 68 盈利: 3860.982337820494 亏损: -2529.091636680612 最大盈利: 1049.40 最大亏损: -291.68 胜率: 44.12% 总收益: 1331.89 平均盈利: 19.59 typeA: 8.64
趋势空且增强-7 总交易次数: 1350 盈利: 164217.93487141497 亏损: -140540.29814902393 最大盈利: 2544.83 最大亏损: -3479.07 胜率: 43.70% 总收益: 23677.64 平均盈利: 17.54 typeA: 7.66
趋势空且增强-3 总交易次数: 372 盈利: 33532.57665524387 亏损: -27296.572146903964 最大盈利: 2357.13 最大亏损: -1220.59 胜率: 37.10% 总收益: 6236.00 平均盈利: 16.76 typeA: 6.22
趋势多且增强-10 总交易次数: 54 盈利: 3731.834920204533 亏损: -2880.019601458416 最大盈利: 1251.76 最大亏损: -797.76 胜率: 37.04% 总收益: 851.82 平均盈利: 15.77 typeA: 5.84
趋势多且增强-8 总交易次数: 274 盈利: 20436.229936523952 亏损: -19217.267611550873 最大盈利: 4561.65 最大亏损: -1479.45 胜率: 55.84% 总收益: 1218.96 平均盈利: 4.45 typeA: 2.48
趋势多且增强-6 总交易次数: 918 盈利: 52078.97503545774 亏损: -47509.54006074834 最大盈利: 2117.62 最大亏损: -1286.08 胜率: 33.77% 总收益: 4569.43 平均盈利: 4.98 typeA: 1.68

#############################################################


profitTotal 129728.46919851024
maxLossTotal -1889.43
winRateTotal 2606.68
period month 53
avgRate 49.18
maxDrawdownTotal 36.9
趋势空且增强-1 总交易次数: 131 盈利: 25069.644521439583 亏损: -12138.772122165288 最大盈利: 3191.96 最大亏损: -1549.16 胜率: 67.18% 总收益: 12930.87 平均盈利: 98.71 typeA: 66.31
趋势多且增强-1 总交易次数: 61 盈利: 17296.407604573993 亏损: -11024.284352343619 最大盈利: 6150.71 最大亏损: -1889.43 胜率: 54.10% 总收益: 6272.12 平均盈利: 102.82 typeA: 55.63
趋势多且增强-7test2 总交易次数: 108 盈利: 12096.200922277689 亏损: -5979.998584044565 最大盈利: 1427.22 最大亏损: -1764.99 胜率: 69.44% 总收益: 6116.20 平均盈利: 56.63 typeA: 39.32
趋势空且增强-2 总交易次数: 257 盈利: 27823.532690092812 亏损: -16246.026129281627 最大盈利: 3207.12 最大亏损: -726.46 胜率: 59.53% 总收益: 11577.51 平均盈利: 45.05 typeA: 26.82
趋势多且增强-4 总交易次数: 732 盈利: 65832.23969324383 亏损: -33041.186041826266 最大盈利: 9227.82 最大亏损: -923.52 胜率: 54.51% 总收益: 32791.05 平均盈利: 44.80 typeA: 24.42
趋势多且增强-7test1 总交易次数: 330 盈利: 26825.67298336487 亏损: -15144.332728692547 最大盈利: 1699.60 最大亏损: -984.85 胜率: 61.82% 总收益: 11681.34 平均盈利: 35.40 typeA: 21.88
趋势多且增强-2 总交易次数: 1355 盈利: 155491.96815233625 亏损: -110356.70829683944 最大盈利: 9874.53 最大亏损: -1361.53 胜率: 37.34% 总收益: 45135.26 平均盈利: 33.31 typeA: 12.44
趋势多且增强-11 总交易次数: 192 盈利: 24250.397951602452 亏损: -19823.260197738728 最大盈利: 2331.42 最大亏损: -907.40 胜率: 50.00% 总收益: 4427.14 平均盈利: 23.06 typeA: 11.53
趋势空且增强-4 总交易次数: 106 盈利: 8668.79092844931 亏损: -6807.499636916097 最大盈利: 910.73 最大亏损: -383.83 胜率: 49.06% 总收益: 1861.29 平均盈利: 17.56 typeA: 8.61
趋势空且增强-11 总交易次数: 187 盈利: 18140.163847941418 亏损: -15608.760783055459 最大盈利: 778.33 最大亏损: -910.68 胜率: 56.15% 总收益: 2531.40 平均盈利: 13.54 typeA: 7.60
趋势多且增强-8 总交易次数: 286 盈利: 21460.53825422555 亏损: -19528.25947813389 最大盈利: 4561.65 最大亏损: -1479.45 胜率: 56.99% 总收益: 1932.28 平均盈利: 6.76 typeA: 3.85


##################################################################



tradeNumTotal 3432
profitTotal 132016.74421826098
maxLossTotal -2110.94
winRateTotal 2630.6000000000004
period month 53
avgRate 49.63
maxDrawdownTotal 29.6
趋势空且增强-1 总交易次数: 131 盈利: 25069.644521439583 亏损: -12138.772122165288 最大盈利: 3191.96 最大亏损: -1549.16 胜率: 67.18% 总收益: 12930.87 平均盈利: 98.71 typeA: 66.31
趋势多且增强-1 总交易次数: 61 盈利: 17377.836074828952 亏损: -10363.964846442652 最大盈利: 6150.71 最大亏损: -1694.02 胜率: 54.10% 总收益: 7013.87 平均盈利: 114.98 typeA: 62.20
趋势空且增强-2 总交易次数: 253 盈利: 33096.78302448325 亏损: -16494.7582515435 最大盈利: 4403.10 最大亏损: -726.46 胜率: 58.50% 总收益: 16602.02 平均盈利: 65.62 typeA: 38.39
趋势多且增强-7test2 总交易次数: 107 盈利: 11805.060151029167 亏损: -6426.581956572068 最大盈利: 1427.22 最大亏损: -2088.31 胜率: 69.16% 总收益: 5378.48 平均盈利: 50.27 typeA: 34.76
趋势多且增强-4 总交易次数: 728 盈利: 68458.37403898448 亏损: -36129.53255468728 最大盈利: 9227.82 最大亏损: -1830.26 胜率: 58.65% 总收益: 32328.84 平均盈利: 44.41 typeA: 26.05
趋势多且增强-7test1 总交易次数: 325 盈利: 27370.293834378674 亏损: -16032.988709013554 最大盈利: 1699.60 最大亏损: -1818.29 胜率: 60.92% 总收益: 11337.31 平均盈利: 34.88 typeA: 21.25
趋势空且增强-11 总交易次数: 176 盈利: 20245.533582436612 亏损: -16118.435555699794 最大盈利: 778.33 最大亏损: -939.00 胜率: 60.23% 总收益: 4127.10 平均盈利: 23.45 typeA: 14.12
趋势多且增强-11 总交易次数: 191 盈利: 24318.588558067302 亏损: -19530.517990241584 最大盈利: 2331.42 最大亏损: -969.84 胜率: 50.79% 总收益: 4788.07 平均盈利: 25.07 typeA: 12.73
趋势多且增强-2 总交易次数: 1355 盈利: 157108.32198608658 亏损: -113107.7970063924 最大盈利: 9874.53 最大亏损: -2110.94 胜率: 37.93% 总收益: 44000.52 平均盈利: 32.47 typeA: 12.32
趋势空且增强-4 总交易次数: 105 盈利: 7857.864090514264 亏损: -7448.2066512298 最大盈利: 910.73 最大亏损: -383.83 胜率: 40.95% 总收益: 409.66 平均盈利: 3.90 typeA: 1.60

########################################################################


tradeNumTotal 3228
profitTotal 132766.42916718993
maxLossTotal -2110.94
winRateTotal 2593.26
period month 53
avgRate 48.93
maxDrawdownTotal 29
趋势空且增强-2 总交易次数: 253 盈利: 33096.78302448325 亏损: -17541.498080282247 最大盈利: 4403.10 最大亏损: -1403.32 胜率: 58.50% 总收益: 15555.28 平均盈利: 61.48 typeA: 35.97
趋势多且增强-7test2 总交易次数: 107 盈利: 11805.060151029167 亏损: -6426.581956572068 最大盈利: 1427.22 最大亏损: -2088.31 胜率: 69.16% 总收益: 5378.48 平均盈利: 50.27 typeA: 34.76
趋势多且增强-2 总交易次数: 1351 盈利: 195608.65999329046 亏损: -112082.08100695984 最大盈利: 41166.13 最大亏损: -2110.94 胜率: 38.12% 总收益: 83526.58 平均盈利: 61.83 typeA: 23.57
趋势多且增强-7test1 总交易次数: 325 盈利: 27370.293834378674 亏损: -16032.988709013554 最大盈利: 1699.60 最大亏损: -1818.29 胜率: 60.92% 总收益: 11337.31 平均盈利: 34.88 typeA: 21.25
趋势空且增强-11 总交易次数: 176 盈利: 20245.533582436612 亏损: -16529.16258259777 最大盈利: 778.33 最大亏损: -939.00 胜率: 60.23% 总收益: 3716.37 平均盈利: 21.12 typeA: 12.72
趋势多且增强-4 总交易次数: 720 盈利: 52450.368773133996 亏损: -37159.307707007894 最大盈利: 2081.23 最大亏损: -1830.26 胜率: 58.06% 总收益: 15291.06 平均盈利: 21.24 typeA: 12.33
趋势多且增强-11 总交易次数: 191 盈利: 23616.852678251096 亏损: -19573.16026666435 最大盈利: 2331.42 最大亏损: -969.84 胜率: 50.26% 总收益: 4043.69 平均盈利: 21.17 typeA: 10.64
趋势空且增强-4 总交易次数: 105 盈利: 7857.864090514264 亏损: -7448.2066512298 最大盈利: 910.73 最大亏损: -383.83 胜率: 40.95% 总收益: 409.66 平均盈利: 3.90 typeA: 1.60


###########################################################################


tradeNumTotal 3228
profitTotal 132766.42916718993
maxLossTotal -2110.94
winRateTotal 2593.26
period month 53
avgRate 48.93
maxDrawdownTotal 29
趋势多且增强-2testtest 总交易次数: 49 盈利: 49672.23323235777 亏损: -3942.0728500518744 最大盈利: 41166.13 最大亏损: -642.41 胜率: 42.86% 总收益: 45730.16 平均盈利: 933.27 typeA: 400.00
趋势空且增强-2 总交易次数: 253 盈利: 33096.78302448325 亏损: -17541.498080282247 最大盈利: 4403.10 最大亏损: -1403.32 胜率: 58.50% 总收益: 15555.28 平均盈利: 61.48 typeA: 35.97
趋势多且增强-7test2 总交易次数: 107 盈利: 11805.060151029167 亏损: -6426.581956572068 最大盈利: 1427.22 最大亏损: -2088.31 胜率: 69.16% 总收益: 5378.48 平均盈利: 50.27 typeA: 34.76
趋势多且增强-6test 总交易次数: 287 盈利: 45312.210772788916 亏损: -21788.355077462318 最大盈利: 16227.05 最大亏损: -1991.57 胜率: 37.63% 总收益: 23523.86 平均盈利: 81.96 typeA: 30.84
趋势多且增强-2 总交易次数: 36 盈利: 6726.833198832167 亏损: -4094.6226096474743 最大盈利: 3125.26 最大亏损: -2110.94 胜率: 36.11% 总收益: 2632.21 平均盈利: 73.12 typeA: 26.40
趋势多且增强-7test1 总交易次数: 325 盈利: 27370.293834378674 亏损: -16032.988709013554 最大盈利: 1699.60 最大亏损: -1818.29 胜率: 60.92% 总收益: 11337.31 平均盈利: 34.88 typeA: 21.25
趋势空且增强-11 总交易次数: 176 盈利: 20245.533582436612 亏损: -16529.16258259777 最大盈利: 778.33 最大亏损: -939.00 胜率: 60.23% 总收益: 3716.37 平均盈利: 21.12 typeA: 12.72
趋势多且增强-4 总交易次数: 720 盈利: 52450.368773133996 亏损: -37159.307707007894 最大盈利: 2081.23 最大亏损: -1830.26 胜率: 58.06% 总收益: 15291.06 平均盈利: 21.24 typeA: 12.33
趋势多且增强-11 总交易次数: 191 盈利: 23616.852678251096 亏损: -19573.16026666435 最大盈利: 2331.42 最大亏损: -969.84 胜率: 50.26% 总收益: 4043.69 平均盈利: 21.17 typeA: 10.64
趋势多且增强-4test 总交易次数: 268 盈利: 30313.472221118696 亏损: -23990.618786201678 最大盈利: 7630.31 最大亏损: -1322.90 胜率: 32.46% 总收益: 6322.85 平均盈利: 23.59 typeA: 7.66
趋势多且增强-2test 总交易次数: 91 盈利: 10834.56217779673 亏损: -9081.513102235545 最大盈利: 1856.25 最大亏损: -952.52 胜率: 39.56% 总收益: 1753.05 平均盈利: 19.26 typeA: 7.62
趋势多且增强-7test 总交易次数: 30 盈利: 2728.3485544577943 亏损: -2367.858819054945 最大盈利: 578.50 最大亏损: -447.75 胜率: 46.67% 总收益: 360.49 平均盈利: 12.02 typeA: 5.61
趋势多且增强-5test 总交易次数: 436 盈利: 35140.75989769567 亏损: -31298.326796084166 最大盈利: 1367.76 最大亏损: -1995.64 胜率: 40.14% 总收益: 3842.43 平均盈利: 8.81 typeA: 3.54
趋势空且增强-4 总交易次数: 105 盈利: 7857.864090514264 亏损: -7448.2066512298 最大盈利: 910.73 最大亏损: -383.83 胜率: 40.95% 总收益: 409.66 平均盈利: 3.90 typeA: 1.60
趋势多且增强-3test 总交易次数: 154 盈利: 14880.239938242872 亏损: -15518.712966221967 最大盈利: 1890.24 最大亏损: -1361.53 胜率: 39.61% 总收益: -638.47 平均盈利: -4.15 typeA: -1.64


#####################################################################

tradeNumTotal 3246
profitTotal 134241.8770664378
maxLossTotal -2110.94
winRateTotal 2591.3199999999997
period month 53
avgRate 48.89
maxDrawdownTotal 29
趋势多且增强-1-1 总交易次数: 49 盈利: 49672.23323235777 亏损: -4053.6170212722764 最大盈利: 41166.13 最大亏损: -642.41 胜率: 42.86% 总收益: 45618.62 平均盈利: 930.99 typeA: 399.02
趋势空且增强-2 总交易次数: 253 盈利: 33096.78302448325 亏损: -16680.410005015863 最大盈利: 4403.10 最大亏损: -818.35 胜率: 58.50% 总收益: 16416.37 平均盈利: 64.89 typeA: 37.96
趋势多且增强-7test2 总交易次数: 107 盈利: 11805.060151029167 亏损: -6426.581956572068 最大盈利: 1427.22 最大亏损: -2088.31 胜率: 69.16% 总收益: 5378.48 平均盈利: 50.27 typeA: 34.76
趋势多且增强-1-7 总交易次数: 287 盈利: 45312.210772788916 亏损: -21788.355077462318 最大盈利: 16227.05 最大亏损: -1991.57 胜率: 37.63% 总收益: 23523.86 平均盈利: 81.96 typeA: 30.84
趋势多且增强-1-2 总交易次数: 36 盈利: 6726.833198832167 亏损: -4107.430351225565 最大盈利: 3125.26 最大亏损: -2110.94 胜率: 36.11% 总收益: 2619.40 平均盈利: 72.76 typeA: 26.27
趋势多且增强-7test1 总交易次数: 325 盈利: 27370.293834378674 亏损: -16032.988709013554 最大盈利: 1699.60 最大亏损: -1818.29 胜率: 60.92% 总收益: 11337.31 平均盈利: 34.88 typeA: 21.25
趋势空且增强-11 总交易次数: 175 盈利: 20245.533582436612 亏损: -15715.718197125032 最大盈利: 778.33 最大亏损: -939.00 胜率: 60.57% 总收益: 4529.82 平均盈利: 25.88 typeA: 15.68
趋势多且增强-4 总交易次数: 720 盈利: 52371.54794407842 亏损: -37207.02676929187 最大盈利: 2081.23 最大亏损: -1830.26 胜率: 57.78% 总收益: 15164.52 平均盈利: 21.06 typeA: 12.17
趋势多且增强-11 总交易次数: 191 盈利: 23552.336645291703 亏损: -19155.5096038594 最大盈利: 2331.42 最大亏损: -907.40 胜率: 50.26% 总收益: 4396.83 平均盈利: 23.02 typeA: 11.57
趋势多且增强-1-3 总交易次数: 91 盈利: 10781.593703998973 亏损: -8791.8296269185 最大盈利: 1856.25 最大亏损: -952.52 胜率: 38.46% 总收益: 1989.76 平均盈利: 21.87 typeA: 8.41
趋势多且增强-1-5 总交易次数: 268 盈利: 30313.472221118696 亏损: -23861.152939649393 最大盈利: 7630.31 最大亏损: -1322.90 胜率: 32.46% 总收益: 6452.32 平均盈利: 24.08 typeA: 7.82
趋势多且增强-1-8 总交易次数: 30 盈利: 2728.3485544577943 亏损: -2367.858819054945 最大盈利: 578.50 最大亏损: -447.75 胜率: 46.67% 总收益: 360.49 平均盈利: 12.02 typeA: 5.61
趋势多且增强-1-6 总交易次数: 436 盈利: 35140.75989769567 亏损: -31298.326796084166 最大盈利: 1367.76 最大亏损: -1995.64 胜率: 40.14% 总收益: 3842.43 平均盈利: 8.81 typeA: 3.54
趋势空且增强-4 总交易次数: 102 盈利: 7517.814950465125 亏损: -7367.932747346985 最大盈利: 910.73 最大亏损: -383.83 胜率: 40.20% 总收益: 149.88 平均盈利: 1.47 typeA: 0.59
趋势多且增强-1-4 总交易次数: 154 盈利: 14880.239938242872 亏损: -15741.785862273235 最大盈利: 1890.24 最大亏损: -1361.53 胜率: 39.61% 总收益: -861.55 平均盈利: -5.59 typeA: -2.22
趋势空且增强-4test 总交易次数: 22 盈利: 2203.3162806176583 亏损: -2351.9763836703737 最大盈利: 523.86 最大亏损: -459.50 胜率: 54.55% 总收益: -148.66 平均盈利: -6.76 typeA: -3.69



###########################################################################


tradeNumTotal 3368
profitTotal 136044.26012056693
maxLossTotal -2110.94
winRateTotal 2536.7999999999993
period month 53
avgRate 47.86
maxDrawdownTotal 29
趋势多且增强-1-1 总交易次数: 49 盈利: 49672.23323235777 亏损: -3768.643567221994 最大盈利: 41166.13 最大亏损: -642.41 胜率: 42.86% 总收益: 45903.59 平均盈利: 936.81 typeA: 401.52
趋势多且增强-7test2 总交易次数: 107 盈利: 11805.060151029167 亏损: -6426.581956572068 最大盈利: 1427.22 最大亏损: -2088.31 胜率: 69.16% 总收益: 5378.48 平均盈利: 50.27 typeA: 34.76
趋势空且增强-2 总交易次数: 245 盈利: 29860.05268900044 亏损: -16118.376326280297 最大盈利: 4403.10 最大亏损: -818.35 胜率: 58.78% 总收益: 13741.68 平均盈利: 56.09 typeA: 32.97
趋势多且增强-4-3 总交易次数: 91 盈利: 8616.951875776456 亏损: -3711.9031643218045 最大盈利: 1285.64 最大亏损: -501.31 胜率: 53.85% 总收益: 4905.05 平均盈利: 53.90 typeA: 29.03
趋势多且增强-1-7 总交易次数: 287 盈利: 42079.4257587886 亏损: -21788.355077462318 最大盈利: 12994.26 最大亏损: -1991.57 胜率: 37.63% 总收益: 20291.07 平均盈利: 70.70 typeA: 26.60
趋势多且增强-1-2 总交易次数: 36 盈利: 6726.833198832167 亏损: -4175.562747859988 最大盈利: 3125.26 最大亏损: -2110.94 胜率: 36.11% 总收益: 2551.27 平均盈利: 70.87 typeA: 25.59
趋势多且增强-7test1 总交易次数: 328 盈利: 28027.162166437723 亏损: -16085.339556755705 最大盈利: 1699.60 最大亏损: -1818.29 胜率: 60.98% 总收益: 11941.82 平均盈利: 36.41 typeA: 22.20
趋势空且增强-4-5 总交易次数: 145 盈利: 18386.48759499155 亏损: -12313.170006209533 最大盈利: 2533.05 最大亏损: -727.25 胜率: 36.55% 总收益: 6073.32 平均盈利: 41.88 typeA: 15.31
趋势空且增强-11 总交易次数: 173 盈利: 19954.86121998568 亏损: -15715.718197125032 最大盈利: 778.33 最大亏损: -939.00 胜率: 60.12% 总收益: 4239.14 平均盈利: 24.50 typeA: 14.73
趋势多且增强-4-4 总交易次数: 614 盈利: 41549.03351082521 亏损: -29299.980041707073 最大盈利: 2081.23 最大亏损: -1830.26 胜率: 56.35% 总收益: 12249.05 平均盈利: 19.95 typeA: 11.24
趋势多且增强-1-5 总交易次数: 270 盈利: 30745.093138284767 亏损: -23311.1473278013 最大盈利: 7630.31 最大亏损: -1322.90 胜率: 32.96% 总收益: 7433.95 平均盈利: 27.53 typeA: 9.07
趋势多且增强-11 总交易次数: 192 盈利: 22395.958172817736 亏损: -19063.38053831145 最大盈利: 2061.31 最大亏损: -907.40 胜率: 49.48% 总收益: 3332.58 平均盈利: 17.36 typeA: 8.59
趋势多且增强-1-3 总交易次数: 91 盈利: 10045.08367598242 亏损: -8512.254343792036 最大盈利: 1856.25 最大亏损: -588.80 胜率: 36.26% 总收益: 1532.83 平均盈利: 16.84 typeA: 6.11
趋势多且增强-1-8 总交易次数: 30 盈利: 2728.3485544577943 亏损: -2367.858819054945 最大盈利: 578.50 最大亏损: -447.75 胜率: 46.67% 总收益: 360.49 平均盈利: 12.02 typeA: 5.61
趋势多且增强-1-6 总交易次数: 436 盈利: 34033.81730147873 亏损: -31363.820340921167 最大盈利: 1367.76 最大亏损: -1995.64 胜率: 39.68% 总收益: 2670.00 平均盈利: 6.12 typeA: 2.43
趋势空且增强-4 总交易次数: 99 盈利: 7639.9280357927455 亏损: -7273.25945608876 最大盈利: 910.73 最大亏损: -383.83 胜率: 39.39% 总收益: 366.67 平均盈利: 3.70 typeA: 1.46
趋势多且增强-1-4 总交易次数: 154 盈利: 14133.693400184304 亏损: -14241.150646372433 最大盈利: 1890.24 最大亏损: -943.77 胜率: 38.96% 总收益: -107.46 平均盈利: -0.70 typeA: -0.27
趋势空且增强-4test 总交易次数: 21 盈利: 2203.3162806176583 亏损: -2246.5777232160945 最大盈利: 523.86 最大亏损: -459.50 胜率: 57.14% 总收益: -43.26 平均盈利: -2.06 typeA: -1.18


#############################################################################



tradeNumTotal 3368
profitTotal 136044.26012056693
maxLossTotal -2110.94
winRateTotal 2536.7999999999993
period month 53
avgRate 47.86
maxDrawdownTotal 29
趋势多且增强-1-1 总交易次数: 49 盈利: 49672.23323235777 亏损: -3768.643567221994 最大盈利: 41166.13 最大亏损: -642.41 胜率: 42.86% 总收益: 45903.59 平均盈利: 936.81 typeA: 401.52
趋势多且增强-7test2 总交易次数: 107 盈利: 11805.060151029167 亏损: -6426.581956572068 最大盈利: 1427.22 最大亏损: -2088.31 胜率: 69.16% 总收益: 5378.48 平均盈利: 50.27 typeA: 34.76
趋势空且增强-2 总交易次数: 245 盈利: 29860.05268900044 亏损: -16118.376326280297 最大盈利: 4403.10 最大亏损: -818.35 胜率: 58.78% 总收益: 13741.68 平均盈利: 56.09 typeA: 32.97
趋势多且增强-4-3 总交易次数: 91 盈利: 8616.951875776456 亏损: -3711.9031643218045 最大盈利: 1285.64 最大亏损: -501.31 胜率: 53.85% 总收益: 4905.05 平均盈利: 53.90 typeA: 29.03
趋势多且增强-1-8 总交易次数: 287 盈利: 42079.4257587886 亏损: -21788.355077462318 最大盈利: 12994.26 最大亏损: -1991.57 胜率: 37.63% 总收益: 20291.07 平均盈利: 70.70 typeA: 26.60
趋势多且增强-1-2 总交易次数: 36 盈利: 6726.833198832167 亏损: -4175.562747859988 最大盈利: 3125.26 最大亏损: -2110.94 胜率: 36.11% 总收益: 2551.27 平均盈利: 70.87 typeA: 25.59
趋势多且增强-7test1 总交易次数: 328 盈利: 28027.162166437723 亏损: -16085.339556755705 最大盈利: 1699.60 最大亏损: -1818.29 胜率: 60.98% 总收益: 11941.82 平均盈利: 36.41 typeA: 22.20
趋势空且增强-4-6 总交易次数: 145 盈利: 18386.48759499155 亏损: -12313.170006209533 最大盈利: 2533.05 最大亏损: -727.25 胜率: 36.55% 总收益: 6073.32 平均盈利: 41.88 typeA: 15.31
趋势空且增强-11 总交易次数: 173 盈利: 19954.86121998568 亏损: -15715.718197125032 最大盈利: 778.33 最大亏损: -939.00 胜率: 60.12% 总收益: 4239.14 平均盈利: 24.50 typeA: 14.73
趋势多且增强-4-4 总交易次数: 465 盈利: 32874.174002960564 亏损: -23091.778131233437 最大盈利: 2081.23 最大亏损: -1830.26 胜率: 54.62% 总收益: 9782.40 平均盈利: 21.04 typeA: 11.49
趋势多且增强-4-5 总交易次数: 149 盈利: 8674.859507864634 亏损: -6208.201910473636 最大盈利: 1373.52 最大亏损: -390.73 胜率: 61.74% 总收益: 2466.66 平均盈利: 16.55 typeA: 10.22
趋势多且增强-1-5 总交易次数: 270 盈利: 30745.093138284767 亏损: -23311.1473278013 最大盈利: 7630.31 最大亏损: -1322.90 胜率: 32.96% 总收益: 7433.95 平均盈利: 27.53 typeA: 9.07
趋势多且增强-11 总交易次数: 192 盈利: 22395.958172817736 亏损: -19063.38053831145 最大盈利: 2061.31 最大亏损: -907.40 胜率: 49.48% 总收益: 3332.58 平均盈利: 17.36 typeA: 8.59
趋势多且增强-1-6 总交易次数: 220 盈利: 19866.417784875863 亏损: -16135.115693058819 最大盈利: 963.19 最大亏损: -879.16 胜率: 40.00% 总收益: 3731.30 平均盈利: 16.96 typeA: 6.78
趋势多且增强-1-3 总交易次数: 91 盈利: 10045.08367598242 亏损: -8512.254343792036 最大盈利: 1856.25 最大亏损: -588.80 胜率: 36.26% 总收益: 1532.83 平均盈利: 16.84 typeA: 6.11
趋势多且增强-1-9 总交易次数: 30 盈利: 2728.3485544577943 亏损: -2367.858819054945 最大盈利: 578.50 最大亏损: -447.75 胜率: 46.67% 总收益: 360.49 平均盈利: 12.02 typeA: 5.61
趋势空且增强-4 总交易次数: 99 盈利: 7639.9280357927455 亏损: -7273.25945608876 最大盈利: 910.73 最大亏损: -383.83 胜率: 39.39% 总收益: 366.67 平均盈利: 3.70 typeA: 1.46
趋势多且增强-1-4 总交易次数: 154 盈利: 14133.693400184304 亏损: -14241.150646372433 最大盈利: 1890.24 最大亏损: -943.77 胜率: 38.96% 总收益: -107.46 平均盈利: -0.70 typeA: -0.27
趋势空且增强-4test 总交易次数: 21 盈利: 2203.3162806176583 亏损: -2246.5777232160945 最大盈利: 523.86 最大亏损: -459.50 胜率: 57.14% 总收益: -43.26 平均盈利: -2.06 typeA: -1.18
趋势多且增强-1-7 总交易次数: 216 盈利: 14167.399516602884 亏损: -15228.704647862336 最大盈利: 1367.76 最大亏损: -1995.64 胜率: 39.35% 总收益: -1061.31 平均盈利: -4.91 typeA: -1.93


###################################################################



tradeNumTotal 4310
profitTotal 147083.94340294364
maxLossTotal -2197.24
winRateTotal 2634.3800000000006
period month 53
avgRate 49.71
maxDrawdownTotal 33.4
趋势多且增强-1-1-1 总交易次数: 41 盈利: 46630.546831319785 亏损: -2369.5280411846697 最大盈利: 41166.13 最大亏损: -455.43 胜率: 39.02% 总收益: 44261.02 平均盈利: 1079.54 typeA: 421.24
趋势多且增强-1-2 总交易次数: 19 盈利: 10776.172725511178 亏损: -3636.738244649015 最大盈利: 7049.81 最大亏损: -2197.24 胜率: 47.37% 总收益: 7139.43 平均盈利: 375.76 typeA: 178.00
趋势多且增强-1-8 总交易次数: 39 盈利: 8485.029709919974 亏损: -2552.6035297766375 最大盈利: 1199.40 最大亏损: -491.89 胜率: 56.41% 总收益: 5932.43 平均盈利: 152.11 typeA: 85.81
趋势多且增强-1-3 总交易次数: 53 盈利: 11529.231353435618 亏损: -4827.006901580487 最大盈利: 1856.25 最大亏损: -588.80 胜率: 50.94% 总收益: 6702.22 平均盈利: 126.46 typeA: 64.42
趋势多且增强-7test2 总交易次数: 107 盈利: 11894.336398796815 亏损: -6426.581956572068 最大盈利: 1427.22 最大亏损: -2088.31 胜率: 69.16% 总收益: 5467.75 平均盈利: 51.10 typeA: 35.34
趋势空且增强-2 总交易次数: 238 盈利: 28151.35749762982 亏损: -16118.376326280297 最大盈利: 4403.10 最大亏损: -818.35 胜率: 57.56% 总收益: 12032.98 平均盈利: 50.56 typeA: 29.10
趋势多且增强-1-1 总交易次数: 26 盈利: 4759.472699987232 亏损: -2891.8151384321427 最大盈利: 1348.53 最大亏损: -642.41 胜率: 38.46% 总收益: 1867.66 平均盈利: 71.83 typeA: 27.63
趋势多且增强-1-1-2 总交易次数: 31 盈利: 3516.0301591153875 亏损: -1386.9125301580052 最大盈利: 880.28 最大亏损: -296.01 胜率: 35.48% 总收益: 2129.12 平均盈利: 68.68 typeA: 24.37
趋势多且增强-7test1 总交易次数: 328 盈利: 28344.89060664494 亏损: -16085.339556755705 最大盈利: 1699.60 最大亏损: -1818.29 胜率: 60.98% 总收益: 12259.55 平均盈利: 37.38 typeA: 22.79
趋势多且增强-4-5 总交易次数: 168 盈利: 11829.468784381257 亏损: -7079.910629343406 最大盈利: 1655.83 最大亏损: -390.73 胜率: 64.29% 总收益: 4749.56 平均盈利: 28.27 typeA: 18.18
趋势多且增强-1-1-8 总交易次数: 247 盈利: 32044.332758094475 亏损: -19300.11432213677 最大盈利: 12994.26 最大亏损: -1991.57 胜率: 34.01% 总收益: 12744.22 平均盈利: 51.60 typeA: 17.55
趋势空且增强-11 总交易次数: 172 盈利: 19954.86121998568 亏损: -15424.95697344605 最大盈利: 778.33 最大亏损: -939.00 胜率: 60.47% 总收益: 4529.90 平均盈利: 26.34 typeA: 15.93
趋势多且增强-1-1-9 总交易次数: 28 盈利: 2868.8703863506585 亏损: -1920.1100002249473 最大盈利: 578.50 最大亏损: -426.30 胜率: 46.43% 总收益: 948.76 平均盈利: 33.88 typeA: 15.73
趋势多且增强-4-3 总交易次数: 105 盈利: 7957.953309388296 亏损: -5126.406126562657 最大盈利: 1601.48 最大亏损: -501.31 胜率: 53.33% 总收益: 2831.55 平均盈利: 26.97 typeA: 14.38
趋势多且增强-4-4 总交易次数: 502 盈利: 37424.73397184442 亏损: -24518.920717121186 最大盈利: 2081.23 最大亏损: -1830.26 胜率: 55.78% 总收益: 12905.81 平均盈利: 25.71 typeA: 14.34
趋势多且增强-1-6 总交易次数: 55 盈利: 6761.919854959909 亏损: -4849.473226437179 最大盈利: 963.19 最大亏损: -637.32 胜率: 38.18% 总收益: 1912.45 平均盈利: 34.77 typeA: 13.28
趋势空且增强-2-1 总交易次数: 781 盈利: 64309.00869370471 亏损: -51419.69531568101 最大盈利: 1969.37 最大亏损: -984.91 胜率: 57.36% 总收益: 12889.31 平均盈利: 16.50 typeA: 9.47
趋势多且增强-1-1-4 总交易次数: 128 盈利: 10518.74962531337 亏损: -7901.641098637103 最大盈利: 1890.24 最大亏损: -610.81 胜率: 41.41% 总收益: 2617.11 平均盈利: 20.45 typeA: 8.47
趋势多且增强-1-5 总交易次数: 80 盈利: 8242.913228276158 亏损: -6657.708240283488 最大盈利: 1183.30 最大亏损: -625.61 胜率: 37.50% 总收益: 1585.20 平均盈利: 19.82 typeA: 7.43
趋势空且增强-4-6 总交易次数: 131 盈利: 13516.426145239335 亏损: -11003.82436128702 最大盈利: 2533.05 最大亏损: -727.25 胜率: 35.11% 总收益: 2512.60 平均盈利: 19.18 typeA: 6.73
趋势多且增强-1-1-3 总交易次数: 68 盈利: 5959.35658420948 亏损: -4978.125289039102 最大盈利: 1586.90 最大亏损: -585.54 胜率: 38.24% 总收益: 981.23 平均盈利: 14.43 typeA: 5.52
趋势多且增强-1-1-6 总交易次数: 165 盈利: 13142.402337145506 亏损: -11039.204878014987 最大盈利: 880.39 最大亏损: -879.16 胜率: 42.42% 总收益: 2103.20 平均盈利: 12.75 typeA: 5.41
趋势多且增强-11 总交易次数: 194 盈利: 13731.285721314369 亏损: -12104.437717771236 最大盈利: 2143.30 最大亏损: -907.40 胜率: 52.06% 总收益: 1626.85 平均盈利: 8.39 typeA: 4.37
趋势空且增强-4 总交易次数: 97 盈利: 7639.9280357927455 亏损: -6836.992317326915 最大盈利: 910.73 最大亏损: -383.83 胜率: 40.21% 总收益: 802.94 平均盈利: 8.28 typeA: 3.33
趋势多且增强-1-1-7 总交易次数: 171 盈利: 9067.15334383683 亏损: -9062.514366483583 最大盈利: 725.34 最大亏损: -487.08 胜率: 41.52% 总收益: 4.64 平均盈利: 0.03 typeA: 0.01
趋势多且增强-1-1-5 总交易次数: 200 盈利: 15618.976923791302 亏损: -16169.999080369438 最大盈利: 1247.87 最大亏损: -1322.90 胜率: 35.00% 总收益: -551.02 平均盈利: -2.76 typeA: -0.96
趋势空且增强-4test 总交易次数: 17 盈利: 1613.9356930489962 亏损: -1917.195446525875 最大盈利: 523.86 最大亏损: -459.50 胜率: 58.82% 总收益: -303.26 平均盈利: -17.84 typeA: -10.49
趋势多且增强-1-4 总交易次数: 71 盈利: 5651.641657647966 亏损: -9473.62307368921 最大盈利: 502.50 最大亏损: -966.78 胜率: 39.44% 总收益: -3821.98 平均盈利: -53.83 typeA: -21.23
趋势多且增强-1-7 总交易次数: 46 盈利: 3058.5944795490223 亏损: -5784.696729323098 最大盈利: 506.34 最大亏损: -1995.64 胜率: 36.96% 总收益: -2726.10 平均盈利: -59.26 typeA: -21.90
趋势多且增强-1-9 总交易次数: 2 盈利: 64.56362063163954 亏损: -447.7488188299975 最大盈利: 64.56 最大亏损: -447.75 胜率: 50.00% 总收益: -383.19 平均盈利: -191.59 typeA: -95.80




#############################################################################


*/
