/*




  ========== 回测结果 ==========
      总交易次数:     52
      胜率:          76.92%
      总收益:        5649.97 USDT
      期末余额:      6639.37 USDT
      盈亏比:        20.54
      最大单笔盈利:  4116.61
      最大单笔亏损:  -62.43
      手续费:       21.7243208968457
      =============================
    
profit: 5639.373812579404
maxDrawdown 3.1%
startTime: 2021-01-01 00:00:00
趋势空且增强-L1-3-4-2 总交易次数: 1 盈利: 35.36389195148848 亏损: 0 最大盈利: 35.36 最大亏损: 35.36 总收益: 35.36 平均盈利: 35.36 typeA: 35.36 胜率: 100.00%
趋势空且增强-L-4-2-3 总交易次数: 2 盈利: 30.49712088724591 亏损: 0 最大盈利: 15.36 最大亏损: 15.14 总收益: 30.50 平均盈利: 15.25 typeA: 15.25 胜率: 100.00%
趋势多且增强-R-3-1 总交易次数: 2 盈利: 133.9199095041599 亏损: 0 最大盈利: 125.40 最大亏损: 8.52 总收益: 133.92 平均盈利: 66.96 typeA: 66.96 胜率: 100.00%
趋势多且增强-R-2-1 总交易次数: 1 盈利: 169.9598529970851 亏损: 0 最大盈利: 169.96 最大亏损: 169.96 总收益: 169.96 平均盈利: 169.96 typeA: 169.96 胜率: 100.00%
趋势多且增强-L3-1-3 总交易次数: 1 盈利: 2.6279552150854113 亏损: 0 最大盈利: 2.63 最大亏损: 2.63 总收益: 2.63 平均盈利: 2.63 typeA: 2.63 胜率: 100.00%
趋势多且增强-L1-3-1 总交易次数: 1 盈利: 4116.613172492735 亏损: 0 最大盈利: 4116.61 最大亏损: 4116.61 总收益: 4116.61 平均盈利: 4116.61 typeA: 4116.61 胜率: 100.00%
趋势空且增强-L2-1-3 总交易次数: 1 盈利: 85.99070408163257 亏损: 0 最大盈利: 85.99 最大亏损: 85.99 总收益: 85.99 平均盈利: 85.99 typeA: 85.99 胜率: 100.00%
趋势空且增强-2 总交易次数: 1 盈利: 388.9487793458633 亏损: 0 最大盈利: 388.95 最大亏损: 388.95 总收益: 388.95 平均盈利: 388.95 typeA: 388.95 胜率: 100.00%
趋势空且增强-11 总交易次数: 1 盈利: 61.03596563936395 亏损: 0 最大盈利: 61.04 最大亏损: 61.04 总收益: 61.04 平均盈利: 61.04 typeA: 61.04 胜率: 100.00%
趋势空且增强-L2-3-3 总交易次数: 14 盈利: 352.74409262760446 亏损: -51.540759968864755 最大盈利: 186.25 最大亏损: -38.54 总收益: 301.20 平均盈利: 21.51 typeA: 18.44 胜率: 85.71%
趋势多且增强-L3-1-4-4 总交易次数: 10 盈利: 273.9468255935737 亏损: -24.774920553249636 最大盈利: 117.31 最大亏损: -21.21 总收益: 249.17 平均盈利: 24.92 typeA: 19.93 胜率: 80.00%
趋势空且增强-L2-3-4 总交易次数: 6 盈利: 74.47335646832168 亏损: -60.14613034593363 最大盈利: 27.75 最大亏损: -57.95 总收益: 14.33 平均盈利: 2.39 typeA: 1.59 胜率: 66.67%
趋势多且增强-L3-1-5 总交易次数: 5 盈利: 76.16665706684765 亏损: -36.77120754032773 最大盈利: 60.38 最大亏损: -34.66 总收益: 39.40 平均盈利: 7.88 typeA: 4.73 胜率: 60.00%
趋势空且增强-L2-3-5 总交易次数: 4 盈利: 136.79408716382773 亏损: -40.210333861790346 最大盈利: 129.83 最大亏损: -30.71 总收益: 96.58 平均盈利: 24.15 typeA: 12.07 胜率: 50.00%
趋势多且增强-R-1-1-2 总交易次数: 1 盈利: 0 亏损: -62.42744269830421 最大盈利: -62.43 最大亏损: -62.43 总收益: -62.43 平均盈利: -62.43 typeA: 0.00 胜率: 0.00%
趋势多且增强-L3-1-4-1 总交易次数: 1 盈利: 0 亏损: -13.237763486959654 最大盈利: -13.24 最大亏损: -13.24 总收益: -13.24 平均盈利: -13.24 typeA: 0.00 胜率: 0.00%
Loaded 3000 15m candles

      ========== 回测结果 ==========
      总交易次数:     70
      胜率:          67.14%
      总收益:        884.64 USDT
      期末余额:      1870.44 USDT
      盈亏比:        2.33
      最大单笔盈利:  312.53
      最大单笔亏损:  -183.03
      手续费:       28.264447092449643
      =============================
    
profit: 870.4384787565871
maxDrawdown 15.8%
startTime: 2021-01-31 00:00:00
趋势多且增强-L3-1-4-1 总交易次数: 4 盈利: 107.59239065788675 亏损: 0 最大盈利: 36.83 最大亏损: 18.79 总收益: 107.59 平均盈利: 26.90 typeA: 26.90 胜率: 100.00%
趋势多且增强-L1-2-2 总交易次数: 1 盈利: 312.52588546929184 亏损: 0 最大盈利: 312.53 最大亏损: 312.53 总收益: 312.53 平均盈利: 312.53 typeA: 312.53 胜率: 100.00%
趋势空且增强-L2-2-3 总交易次数: 2 盈利: 27.128078363157215 亏损: 0 最大盈利: 17.66 最大亏损: 9.47 总收益: 27.13 平均盈利: 13.56 typeA: 13.56 胜率: 100.00%
趋势多且增强-L3-1-4-3 总交易次数: 4 盈利: 111.31356114438094 亏损: 0 最大盈利: 89.90 最大亏损: 4.59 总收益: 111.31 平均盈利: 27.83 typeA: 27.83 胜率: 100.00%
趋势多且增强-L1-3-9 总交易次数: 2 盈利: 162.09630214404206 亏损: 0 最大盈利: 111.54 最大亏损: 50.56 总收益: 162.10 平均盈利: 81.05 typeA: 81.05 胜率: 100.00%
趋势空且增强-L2-1-3 总交易次数: 4 盈利: 60.01670919628897 亏损: 0 最大盈利: 21.74 最大亏损: 4.99 总收益: 60.02 平均盈利: 15.00 typeA: 15.00 胜率: 100.00%
趋势多且增强-R-1-2-2 总交易次数: 1 盈利: 18.7527452822133 亏损: 0 最大盈利: 18.75 最大亏损: 18.75 总收益: 18.75 平均盈利: 18.75 typeA: 18.75 胜率: 100.00%
趋势空且增强-L1-3-4-2 总交易次数: 5 盈利: 50.819977771470235 亏损: -1.6804070305273027 最大盈利: 21.33 最大亏损: -1.68 总收益: 49.14 平均盈利: 9.83 typeA: 7.86 胜率: 80.00%
趋势空且增强-11 总交易次数: 5 盈利: 81.82246115824377 亏损: -13.978780152251703 最大盈利: 28.40 最大亏损: -13.98 总收益: 67.84 平均盈利: 13.57 typeA: 10.85 胜率: 80.00%
趋势空且增强-L2-3-5 总交易次数: 4 盈利: 71.34414655902629 亏损: -51.11868325800009 最大盈利: 37.19 最大亏损: -51.12 总收益: 20.23 平均盈利: 5.06 typeA: 3.79 胜率: 75.00%
趋势多且增强-L3-1-3 总交易次数: 3 盈利: 42.21555796740505 亏损: -0.5738168999038598 最大盈利: 31.46 最大亏损: -0.57 总收益: 41.64 平均盈利: 13.88 typeA: 9.25 胜率: 66.67%
趋势空且增强-L2-3-4 总交易次数: 8 盈利: 114.1687074204419 亏损: -81.56076844269512 最大盈利: 68.81 最大亏损: -64.70 总收益: 32.61 平均盈利: 4.08 typeA: 2.55 胜率: 62.50%
趋势多且增强-L3-1-4-2 总交易次数: 2 盈利: 39.17673846153841 亏损: -183.02636752207823 最大盈利: 39.18 最大亏损: -183.03 总收益: -143.85 平均盈利: -71.92 typeA: -35.96 胜率: 50.00%
趋势空且增强-2 总交易次数: 6 盈利: 231.77291914528908 亏损: -97.55920109116897 最大盈利: 175.03 最大亏损: -72.06 总收益: 134.21 平均盈利: 22.37 typeA: 11.18 胜率: 50.00%
趋势多且增强-R-2-1 总交易次数: 4 盈利: 32.5031645752954 亏损: -21.45555724380079 最大盈利: 17.52 最大亏损: -17.20 总收益: 11.05 平均盈利: 2.76 typeA: 1.38 胜率: 50.00%
趋势多且增强-L1-3-1 总交易次数: 2 盈利: 42.99940810890792 亏损: -7.940413449360571 最大盈利: 43.00 最大亏损: -7.94 总收益: 35.06 平均盈利: 17.53 typeA: 8.76 胜率: 50.00%
趋势多且增强-L1-3-2 总交易次数: 2 盈利: 11.059676367731631 亏损: -8.992035733514067 最大盈利: 11.06 最大亏损: -8.99 总收益: 2.07 平均盈利: 1.03 typeA: 0.52 胜率: 50.00%
趋势多且增强-R-1-1-2 总交易次数: 3 盈利: 21.199362530511923 亏损: -56.845891810072956 最大盈利: 21.20 最大亏损: -31.71 总收益: -35.65 平均盈利: -11.88 typeA: -3.96 胜率: 33.33%
趋势多且增强-L3-1-4-4 总交易次数: 3 盈利: 8.618634359000383 亏损: -15.012956450379942 最大盈利: 8.62 最大亏损: -14.18 总收益: -6.39 平均盈利: -2.13 typeA: -0.71 胜率: 33.33%
趋势多且增强-L3-1-5 总交易次数: 3 盈利: 1.6347789132072144 亏损: -14.294066662382264 最大盈利: 1.63 最大亏损: -14.02 总收益: -12.66 平均盈利: -4.22 typeA: -1.41 胜率: 33.33%
趋势空且增强-L1-1-2 总交易次数: 1 盈利: 0 亏损: -80.80563264081609 最大盈利: -80.81 最大亏损: -80.81 总收益: -80.81 平均盈利: -80.81 typeA: 0.00 胜率: 0.00%
趋势空且增强-L2-3-3 总交易次数: 1 盈利: 0 亏损: -29.278148451787754 最大盈利: -29.28 最大亏损: -29.28 总收益: -29.28 平均盈利: -29.28 typeA: 0.00 胜率: 0.00%
Loaded 3000 15m candles

      ========== 回测结果 ==========
      总交易次数:     56
      胜率:          73.21%
      总收益:        340.16 USDT
      期末余额:      1328.96 USDT
      盈亏比:        2.97
      最大单笔盈利:  127.27
      最大单笔亏损:  -34.31
      手续费:       22.422909685939377
      =============================
    
profit: 328.96099865891824
maxDrawdown 2.9%
startTime: 2021-03-02 00:00:00
趋势多且增强-L3-1-4-2 总交易次数: 2 盈利: 31.94632160244803 亏损: 0 最大盈利: 29.33 最大亏损: 2.62 总收益: 31.95 平均盈利: 15.97 typeA: 15.97 胜率: 100.00%
趋势空且增强-L2-3-3 总交易次数: 5 盈利: 68.60954377479345 亏损: 0 最大盈利: 50.96 最大亏损: 3.21 总收益: 68.61 平均盈利: 13.72 typeA: 13.72 胜率: 100.00%
趋势空且增强-L-4-2-3 总交易次数: 5 盈利: 33.52014377338139 亏损: 0 最大盈利: 10.67 最大亏损: 1.76 总收益: 33.52 平均盈利: 6.70 typeA: 6.70 胜率: 100.00%
趋势多且增强-L1-3-2 总交易次数: 1 盈利: 63.331277839643576 亏损: 0 最大盈利: 63.33 最大亏损: 63.33 总收益: 63.33 平均盈利: 63.33 typeA: 63.33 胜率: 100.00%
趋势多且增强-R-3-2 总交易次数: 1 盈利: 6.755568474701048 亏损: 0 最大盈利: 6.76 最大亏损: 6.76 总收益: 6.76 平均盈利: 6.76 typeA: 6.76 胜率: 100.00%
趋势多且增强-L3-1-4-4 总交易次数: 11 盈利: 37.13257135172135 亏损: -27.36807621161669 最大盈利: 19.19 最大亏损: -27.37 总收益: 9.76 平均盈利: 0.89 typeA: 0.81 胜率: 90.91%
趋势空且增强-L2-3-5 总交易次数: 6 盈利: 11.575483441196221 亏损: -6.328332162921385 最大盈利: 5.10 最大亏损: -6.33 总收益: 5.25 平均盈利: 0.87 typeA: 0.73 胜率: 83.33%
趋势多且增强-R-3-1 总交易次数: 7 盈利: 61.50797013838932 亏损: -26.522874700724152 最大盈利: 32.59 最大亏损: -24.26 总收益: 34.99 平均盈利: 5.00 typeA: 3.57 胜率: 71.43%
趋势空且增强-L2-3-4 总交易次数: 5 盈利: 37.569762578017034 亏损: -15.27152897133914 最大盈利: 22.27 最大亏损: -10.73 总收益: 22.30 平均盈利: 4.46 typeA: 2.68 胜率: 60.00%
趋势空且增强-11 总交易次数: 2 盈利: 11.969335068879488 亏损: -22.095708492221934 最大盈利: 11.97 最大亏损: -22.10 总收益: -10.13 平均盈利: -5.06 typeA: -2.53 胜率: 50.00%
趋势空且增强-L1-3-4-2 总交易次数: 2 盈利: 0.7910414104140282 亏损: -6.89831754838072 最大盈利: 0.79 最大亏损: -6.90 总收益: -6.11 平均盈利: -3.05 typeA: -1.53 胜率: 50.00%
趋势多且增强-L3-1-5 总交易次数: 3 盈利: 20.975110500937504 亏损: -2.501012280540394 最大盈利: 20.98 最大亏损: -1.46 总收益: 18.47 平均盈利: 6.16 typeA: 2.05 胜率: 33.33%
趋势多且增强-L3-1-3 总交易次数: 5 盈利: 127.26830143983416 亏损: -44.75315511944884 最大盈利: 127.27 最大亏损: -34.31 总收益: 82.52 平均盈利: 16.50 typeA: 3.30 胜率: 20.00%
趋势多且增强-L1-3-1 总交易次数: 1 盈利: 0 亏损: -21.052427248242793 最大盈利: -21.05 最大亏损: -21.05 总收益: -21.05 平均盈利: -21.05 typeA: 0.00 胜率: 0.00%
Loaded 3000 15m candles

      ========== 回测结果 ==========
      总交易次数:     76
      胜率:          56.58%
      总收益:        3786.56 USDT
      期末余额:      4771.36 USDT
      盈亏比:        7.88
      最大单笔盈利:  855.81
      最大单笔亏损:  -69.04
      手续费:       30.82670641198886
      =============================
    
profit: 3771.36456697217
maxDrawdown 14.7%
startTime: 2021-04-01 00:00:00
趋势多且增强-L3-1-4-4 总交易次数: 1 盈利: 127.26830143983416 亏损: 0 最大盈利: 127.27 最大亏损: 127.27 总收益: 127.27 平均盈利: 127.27 typeA: 127.27 胜率: 100.00%
趋势多且增强-L3-1-5 总交易次数: 3 盈利: 112.58628478839609 亏损: 0 最大盈利: 86.61 最大亏损: 5.00 总收益: 112.59 平均盈利: 37.53 typeA: 37.53 胜率: 100.00%
趋势空且增强-11 总交易次数: 1 盈利: 31.196256209150395 亏损: 0 最大盈利: 31.20 最大亏损: 31.20 总收益: 31.20 平均盈利: 31.20 typeA: 31.20 胜率: 100.00%
趋势多且增强-L3-1-4-2 总交易次数: 3 盈利: 61.58036244645486 亏损: 0 最大盈利: 33.78 最大亏损: 5.27 总收益: 61.58 平均盈利: 20.53 typeA: 20.53 胜率: 100.00%
趋势多且增强-L1-2-2 总交易次数: 1 盈利: 710.6664378327267 亏损: 0 最大盈利: 710.67 最大亏损: 710.67 总收益: 710.67 平均盈利: 710.67 typeA: 710.67 胜率: 100.00%
趋势空且增强-L1-1-2 总交易次数: 3 盈利: 252.9655163571467 亏损: 0 最大盈利: 206.84 最大亏损: 0.52 总收益: 252.97 平均盈利: 84.32 typeA: 84.32 胜率: 100.00%
趋势多且增强-L3-1-4-1 总交易次数: 7 盈利: 116.46938845700603 亏损: -0.05262382075477409 最大盈利: 63.26 最大亏损: -0.05 总收益: 116.42 平均盈利: 16.63 typeA: 14.25 胜率: 85.71%
趋势空且增强-2 总交易次数: 13 盈利: 865.6503321260067 亏损: -98.71691016263507 最大盈利: 276.38 最大亏损: -69.04 总收益: 766.93 平均盈利: 58.99 typeA: 45.38 胜率: 76.92%
趋势多且增强-R-1-1-2 总交易次数: 7 盈利: 689.6849709008833 亏损: -27.56047071660821 最大盈利: 235.85 最大亏损: -18.80 总收益: 662.12 平均盈利: 94.59 typeA: 67.57 胜率: 71.43%
趋势空且增强-L2-3-3 总交易次数: 4 盈利: 29.651651424301207 亏损: -37.33318078546156 最大盈利: 23.20 最大亏损: -34.26 总收益: -7.68 平均盈利: -1.92 typeA: -0.96 胜率: 50.00%
趋势多且增强-L3-1-4-3 总交易次数: 2 盈利: 22.877313617170458 亏损: -1.9239509262365813 最大盈利: 22.88 最大亏损: -1.92 总收益: 20.95 平均盈利: 10.48 typeA: 5.24 胜率: 50.00%
趋势多且增强-L3-1-3 总交易次数: 2 盈利: 259.1160619748811 亏损: -2.805539393939477 最大盈利: 259.12 最大亏损: -2.81 总收益: 256.31 平均盈利: 128.16 typeA: 64.08 胜率: 50.00%
趋势多且增强-L1-1-6 总交易次数: 9 盈利: 1012.0126178091934 亏损: -120.63900284334149 最大盈利: 855.81 最大亏损: -29.60 总收益: 891.37 平均盈利: 99.04 typeA: 44.01 胜率: 44.44%
趋势多且增强-L1-3-9 总交易次数: 3 盈利: 42.94036499333896 亏损: -6.293526665172281 最大盈利: 42.94 最大亏损: -4.83 总收益: 36.65 平均盈利: 12.22 typeA: 4.07 胜率: 33.33%
趋势空且增强-L1-3-4-2 总交易次数: 7 盈利: 1.9651547437849335 亏损: -107.65797569191264 最大盈利: 1.97 最大亏损: -51.69 总收益: -105.69 平均盈利: -15.10 typeA: -2.16 胜率: 14.29%
趋势多且增强-R-3-2 总交易次数: 1 盈利: 0 亏损: -5.381243027314871 最大盈利: -5.38 最大亏损: -5.38 总收益: -5.38 平均盈利: -5.38 typeA: 0.00 胜率: 0.00%
趋势空且增强-L2-3-4 总交易次数: 1 盈利: 0 亏损: -4.722765901293222 最大盈利: -4.72 最大亏损: -4.72 总收益: -4.72 平均盈利: -4.72 typeA: 0.00 胜率: 0.00%
趋势多且增强-L1-3-2 总交易次数: 2 盈利: 0 亏损: -23.271219641385258 最大盈利: -4.02 最大亏损: -19.25 总收益: -23.27 平均盈利: -11.64 typeA: 0.00 胜率: 0.00%
趋势空且增强-L-4-2-3 总交易次数: 1 盈利: 0 亏损: -58.65366180981609 最大盈利: -58.65 最大亏损: -58.65 总收益: -58.65 平均盈利: -58.65 typeA: 0.00 胜率: 0.00%
趋势空且增强-L2-3-5 总交易次数: 1 盈利: 0 亏损: -17.278728800915154 最大盈利: -17.28 最大亏损: -17.28 总收益: -17.28 平均盈利: -17.28 typeA: 0.00 胜率: 0.00%
趋势空且增强-L2-2-3 总交易次数: 1 盈利: 0 亏损: -10.583588853533906 最大盈利: -10.58 最大亏损: -10.58 总收益: -10.58 平均盈利: -10.58 typeA: 0.00 胜率: 0.00%
趋势多且增强-L1-3-1 总交易次数: 2 盈利: 0 亏损: -8.606432894145087 最大盈利: -1.00 最大亏损: -7.61 总收益: -8.61 平均盈利: -4.30 typeA: 0.00 胜率: 0.00%
趋势空且增强-L2-1-3 总交易次数: 1 盈利: 0 亏损: -18.58562621364377 最大盈利: -18.59 最大亏损: -18.59 总收益: -18.59 平均盈利: -18.59 typeA: 0.00 胜率: 0.00%
Loaded 3000 15m candles

      ========== 回测结果 ==========
      总交易次数:     84
      胜率:          66.67%
      总收益:        1411.53 USDT
      期末余额:      2394.73 USDT
      盈亏比:        3.03
      最大单笔盈利:  140.35
      最大单笔亏损:  -90.48
      手续费:       33.699333440068024
      =============================
    
profit: 1394.7330993939017
maxDrawdown 5.6%
startTime: 2021-05-01 00:00:00
趋势空且增强-11 总交易次数: 4 盈利: 174.35642475087758 亏损: 0 最大盈利: 77.83 最大亏损: 19.40 总收益: 174.36 平均盈利: 43.59 typeA: 43.59 胜率: 100.00%
趋势多且增强-R-1-1-1 总交易次数: 3 盈利: 93.92222688678572 亏损: 0 最大盈利: 56.38 最大亏损: 17.13 总收益: 93.92 平均盈利: 31.31 typeA: 31.31 胜率: 100.00%
趋势空且增强-L2-1-3 总交易次数: 4 盈利: 95.90699653134436 亏损: 0 最大盈利: 43.70 最大亏损: 8.27 总收益: 95.91 平均盈利: 23.98 typeA: 23.98 胜率: 100.00%
趋势空且增强-L2-2-3 总交易次数: 1 盈利: 0.17971556230476002 亏损: 0 最大盈利: 0.18 最大亏损: 0.18 总收益: 0.18 平均盈利: 0.18 typeA: 0.18 胜率: 100.00%
趋势多且增强-L3-1-4-3 总交易次数: 1 盈利: 0.38424179463025665 亏损: 0 最大盈利: 0.38 最大亏损: 0.38 总收益: 0.38 平均盈利: 0.38 typeA: 0.38 胜率: 100.00%
趋势空且增强-2 总交易次数: 14 盈利: 234.46902703472958 亏损: -129.22834636364814 最大盈利: 72.52 最大亏损: -65.93 总收益: 105.24 平均盈利: 7.52 typeA: 5.91 胜率: 78.57%
趋势多且增强-L3-1-5 总交易次数: 4 盈利: 162.26102224141013 亏损: -11.601091770922453 最大盈利: 137.35 最大亏损: -11.60 总收益: 150.66 平均盈利: 37.66 typeA: 28.25 胜率: 75.00%
趋势空且增强-L2-3-3 总交易次数: 6 盈利: 82.51547824527 亏损: -35.34299756822458 最大盈利: 46.22 最大亏损: -21.92 总收益: 47.17 平均盈利: 7.86 typeA: 5.24 胜率: 66.67%
趋势多且增强-R-1-2-2 总交易次数: 3 盈利: 254.4275181268003 亏损: -5.463356315593015 最大盈利: 140.35 最大亏损: -5.46 总收益: 248.96 平均盈利: 82.99 typeA: 55.33 胜率: 66.67%
趋势多且增强-R-1-1-2 总交易次数: 8 盈利: 192.98322988224484 亏损: -100.73432748798326 最大盈利: 100.70 最大亏损: -60.26 总收益: 92.25 平均盈利: 11.53 typeA: 7.21 胜率: 62.50%
趋势多且增强-L3-1-4-1 总交易次数: 12 盈利: 297.7948491672016 亏损: -172.49451025274254 最大盈利: 97.53 最大亏损: -90.48 总收益: 125.30 平均盈利: 10.44 typeA: 6.09 胜率: 58.33%
趋势多且增强-L1-1-6 总交易次数: 13 盈利: 405.54763671401963 亏损: -138.49473112249078 最大盈利: 105.79 最大亏损: -63.73 总收益: 267.05 平均盈利: 20.54 typeA: 11.06 胜率: 53.85%
趋势空且增强-L2-3-4 总交易次数: 4 盈利: 70.60097978253962 亏损: -36.01520194298752 最大盈利: 54.48 最大亏损: -19.41 总收益: 34.59 平均盈利: 8.65 typeA: 4.32 胜率: 50.00%
趋势多且增强-L3-1-3 总交易次数: 2 盈利: 26.670411462871535 亏损: -7.169467625326253 最大盈利: 26.67 最大亏损: -7.17 总收益: 19.50 平均盈利: 9.75 typeA: 4.88 胜率: 50.00%
趋势空且增强-L1-1-2 总交易次数: 2 盈利: 16.566500103708922 亏损: -3.9039208480564747 最大盈利: 16.57 最大亏损: -3.90 总收益: 12.66 平均盈利: 6.33 typeA: 3.17 胜率: 50.00%
趋势多且增强-L3-1-4-2 总交易次数: 1 盈利: 0 亏损: -2.646843357667718 最大盈利: -2.65 最大亏损: -2.65 总收益: -2.65 平均盈利: -2.65 typeA: 0.00 胜率: 0.00%
趋势空且增强-L2-3-5 总交易次数: 1 盈利: 0 亏损: -11.328862517727522 最大盈利: -11.33 最大亏损: -11.33 总收益: -11.33 平均盈利: -11.33 typeA: 0.00 胜率: 0.00%
趋势多且增强-L1-3-9 总交易次数: 1 盈利: 0 亏损: -42.629501719470184 最大盈利: -42.63 最大亏损: -42.63 总收益: -42.63 平均盈利: -42.63 typeA: 0.00 胜率: 0.00%
Loaded 3000 15m candles

      ========== 回测结果 ==========
      总交易次数:     84
      胜率:          54.76%
      总收益:        45.65 USDT
      期末余额:      1028.85 USDT
      盈亏比:        1.07
      最大单笔盈利:  74.72
      最大单笔亏损:  -81.83
      手续费:       33.54333801134269
      =============================
    
profit: 28.848204193539686
maxDrawdown 26.4%
startTime: 2021-05-31 00:00:00
趋势多且增强-L3-1-4-3 总交易次数: 1 盈利: 0.38424179463025665 亏损: 0 最大盈利: 0.38 最大亏损: 0.38 总收益: 0.38 平均盈利: 0.38 typeA: 0.38 胜率: 100.00%
趋势空且增强-L1-1-2 总交易次数: 3 盈利: 45.963467477370315 亏损: 0 最大盈利: 17.97 最大亏损: 10.86 总收益: 45.96 平均盈利: 15.32 typeA: 15.32 胜率: 100.00%
趋势多且增强-R-1-2-2 总交易次数: 2 盈利: 26.25951226750388 亏损: 0 最大盈利: 21.69 最大亏损: 4.57 总收益: 26.26 平均盈利: 13.13 typeA: 13.13 胜率: 100.00%
趋势空且增强-L2-1-3 总交易次数: 3 盈利: 30.955899079739538 亏损: 0 最大盈利: 16.21 最大亏损: 1.10 总收益: 30.96 平均盈利: 10.32 typeA: 10.32 胜率: 100.00%
趋势多且增强-L3-1-5 总交易次数: 2 盈利: 19.311713412931166 亏损: 0 最大盈利: 12.59 最大亏损: 6.72 总收益: 19.31 平均盈利: 9.66 typeA: 9.66 胜率: 100.00%
趋势空且增强-L2-3-4 总交易次数: 3 盈利: 62.54418587944053 亏损: 0 最大盈利: 56.31 最大亏损: 1.10 总收益: 62.54 平均盈利: 20.85 typeA: 20.85 胜率: 100.00%
趋势多且增强-L3-1-4-2 总交易次数: 2 盈利: 2.152116265031717 亏损: 0 最大盈利: 1.58 最大亏损: 0.57 总收益: 2.15 平均盈利: 1.08 typeA: 1.08 胜率: 100.00%
趋势空且增强-L2-2-3 总交易次数: 1 盈利: 0.4381879087574844 亏损: 0 最大盈利: 0.44 最大亏损: 0.44 总收益: 0.44 平均盈利: 0.44 typeA: 0.44 胜率: 100.00%
趋势多且增强-L3-1-3 总交易次数: 3 盈利: 32.1346207070452 亏损: -11.359075205952728 最大盈利: 28.05 最大亏损: -11.36 总收益: 20.78 平均盈利: 6.93 typeA: 4.62 胜率: 66.67%
趋势空且增强-11 总交易次数: 6 盈利: 12.797841420120385 亏损: -112.1167285591799 最大盈利: 7.07 最大亏损: -63.36 总收益: -99.32 平均盈利: -16.55 typeA: -11.04 胜率: 66.67%
趋势空且增强-L2-3-3 总交易次数: 5 盈利: 87.96865310311239 亏损: -58.02471102524244 最大盈利: 55.30 最大亏损: -51.30 总收益: 29.94 平均盈利: 5.99 typeA: 3.59 胜率: 60.00%
趋势空且增强-2 总交易次数: 17 盈利: 237.5335772613995 亏损: -142.74480648295417 最大盈利: 74.72 最大亏损: -81.83 总收益: 94.79 平均盈利: 5.58 typeA: 3.28 胜率: 58.82%
趋势多且增强-L1-3-9 总交易次数: 4 盈利: 54.00976045349489 亏损: -16.393388491024638 最大盈利: 35.24 最大亏损: -9.93 总收益: 37.62 平均盈利: 9.40 typeA: 4.70 胜率: 50.00%
趋势多且增强-R-1-1-2 总交易次数: 12 盈利: 42.975817275270465 亏损: -109.73352011235644 最大盈利: 32.88 最大亏损: -63.20 总收益: -66.76 平均盈利: -5.56 typeA: -2.32 胜率: 41.67%
趋势多且增强-L3-1-4-1 总交易次数: 9 盈利: 39.18384963968092 亏损: -101.54253065342671 最大盈利: 33.46 最大亏损: -63.51 总收益: -62.36 平均盈利: -6.93 typeA: -1.54 胜率: 22.22%
趋势多且增强-L1-1-6 总交易次数: 6 盈利: 0.9385322648671128 亏损: -69.16951368303873 最大盈利: 0.94 最大亏损: -32.42 总收益: -68.23 平均盈利: -11.37 typeA: -1.90 胜率: 16.67%
趋势空且增强-L1-3-4-2 总交易次数: 1 盈利: 0 亏损: -0.23025316838574153 最大盈利: -0.23 最大亏损: -0.23 总收益: -0.23 平均盈利: -0.23 typeA: 0.00 胜率: 0.00%
趋势多且增强-R-1-1-1 总交易次数: 2 盈利: 0 亏损: -21.24386136587416 最大盈利: -0.42 最大亏损: -20.82 总收益: -21.24 平均盈利: -10.62 typeA: 0.00 胜率: 0.00%
趋势多且增强-L1-2-1 总交易次数: 1 盈利: 0 亏损: -1.3761260564034037 最大盈利: -1.38 最大亏损: -1.38 总收益: -1.38 平均盈利: -1.38 typeA: 0.00 胜率: 0.00%
趋势多且增强-L1-2-2 总交易次数: 1 盈利: 0 亏损: -5.969257213014098 最大盈利: -5.97 最大亏损: -5.97 总收益: -5.97 平均盈利: -5.97 typeA: 0.00 胜率: 0.00%
Loaded 3000 15m candles

      ========== 回测结果 ==========
      总交易次数:     88
      胜率:          62.50%
      总收益:        232.99 USDT
      期末余额:      1215.39 USDT
      盈亏比:        1.44
      最大单笔盈利:  67.15
      最大单笔亏损:  -140.33
      手续费:       35.166143563265344
      =============================
    
profit: 215.38885085654465
maxDrawdown 12.2%
startTime: 2021-06-30 00:00:00
趋势空且增强-L-4-2-3 总交易次数: 2 盈利: 3.6150117026329927 亏损: 0 最大盈利: 1.93 最大亏损: 1.68 总收益: 3.62 平均盈利: 1.81 typeA: 1.81 胜率: 100.00%
趋势空且增强-L2-3-5 总交易次数: 2 盈利: 38.75577672792218 亏损: 0 最大盈利: 38.61 最大亏损: 0.14 总收益: 38.76 平均盈利: 19.38 typeA: 19.38 胜率: 100.00%
趋势空且增强-L2-2-3 总交易次数: 1 盈利: 1.1673858247532232 亏损: 0 最大盈利: 1.17 最大亏损: 1.17 总收益: 1.17 平均盈利: 1.17 typeA: 1.17 胜率: 100.00%
趋势空且增强-L2-3-4 总交易次数: 7 盈利: 111.03525781666205 亏损: -29.817830940988937 最大盈利: 45.14 最大亏损: -29.82 总收益: 81.22 平均盈利: 11.60 typeA: 9.94 胜率: 85.71%
趋势空且增强-11 总交易次数: 6 盈利: 97.88533036307302 亏损: -29.33681320932521 最大盈利: 35.33 最大亏损: -29.34 总收益: 68.55 平均盈利: 11.42 typeA: 9.52 胜率: 83.33%
趋势多且增强-L3-1-4-2 总交易次数: 9 盈利: 45.387420544359756 亏损: -17.271573415903973 最大盈利: 23.48 最大亏损: -10.44 总收益: 28.12 平均盈利: 3.12 typeA: 2.43 胜率: 77.78%
趋势多且增强-R-1-1-2 总交易次数: 15 盈利: 94.90378173665282 亏损: -52.96051908261332 最大盈利: 32.88 最大亏损: -24.93 总收益: 41.94 平均盈利: 2.80 typeA: 1.86 胜率: 66.67%
趋势空且增强-L2-1-3 总交易次数: 6 盈利: 53.10685314693053 亏损: -1.141115984915417 最大盈利: 29.02 最大亏损: -0.86 总收益: 51.97 平均盈利: 8.66 typeA: 5.77 胜率: 66.67%
趋势多且增强-R-1-1-1 总交易次数: 3 盈利: 17.104478408019236 亏损: -20.927999640223074 最大盈利: 12.38 最大亏损: -20.93 总收益: -3.82 平均盈利: -1.27 typeA: -0.85 胜率: 66.67%
趋势多且增强-L3-1-3 总交易次数: 3 盈利: 81.5642843132606 亏损: -3.33431167651066 最大盈利: 65.49 最大亏损: -3.33 总收益: 78.23 平均盈利: 26.08 typeA: 17.39 胜率: 66.67%
趋势空且增强-L1-3-4-2 总交易次数: 5 盈利: 30.33207353133389 亏损: -4.301737135286591 最大盈利: 16.45 最大亏损: -2.37 总收益: 26.03 平均盈利: 5.21 typeA: 3.12 胜率: 60.00%
趋势空且增强-L2-3-3 总交易次数: 4 盈利: 48.905215468500046 亏损: -23.92726862175346 最大盈利: 39.06 最大亏损: -17.21 总收益: 24.98 平均盈利: 6.24 typeA: 3.12 胜率: 50.00%
趋势多且增强-L3-1-5 总交易次数: 6 盈利: 58.32947065750285 亏损: -70.31984788388249 最大盈利: 41.92 最大亏损: -33.37 总收益: -11.99 平均盈利: -2.00 typeA: -1.00 胜率: 50.00%
趋势空且增强-2 总交易次数: 6 盈利: 69.87665803442555 亏损: -163.99422395962432 最大盈利: 67.15 最大亏损: -140.33 总收益: -94.12 平均盈利: -15.69 typeA: -7.84 胜率: 50.00%
趋势多且增强-L3-1-4-3 总交易次数: 2 盈利: 0.9930787589498913 亏损: -2.503497078910577 最大盈利: 0.99 最大亏损: -2.50 总收益: -1.51 平均盈利: -0.76 typeA: -0.38 胜率: 50.00%
趋势多且增强-L3-1-4-1 总交易次数: 5 盈利: 8.12529405564067 亏损: -20.652813812234122 最大盈利: 5.85 最大亏损: -7.80 总收益: -12.53 平均盈利: -2.51 typeA: -1.00 胜率: 40.00%
趋势多且增强-L1-1-6 总交易次数: 2 盈利: 0 亏损: -38.047369798537176 最大盈利: -15.40 最大亏损: -22.65 总收益: -38.05 平均盈利: -19.02 typeA: 0.00 胜率: 0.00%
趋势多且增强-R-2-2 总交易次数: 1 盈利: 0 亏损: -10.689059221513213 最大盈利: -10.69 最大亏损: -10.69 总收益: -10.69 平均盈利: -10.69 typeA: 0.00 胜率: 0.00%
趋势多且增强-L1-3-9 总交易次数: 1 盈利: 0 亏损: -20.48766392122577 最大盈利: -20.49 最大亏损: -20.49 总收益: -20.49 平均盈利: -20.49 typeA: 0.00 胜率: 0.00%
趋势多且增强-L1-3-1 总交易次数: 1 盈利: 0 亏损: -0.5238293540626249 最大盈利: -0.52 最大亏损: -0.52 总收益: -0.52 平均盈利: -0.52 typeA: 0.00 胜率: 0.00%
趋势多且增强-R-2-1 总交易次数: 1 盈利: 0 亏损: -17.86104549655951 最大盈利: -17.86 最大亏损: -17.86 总收益: -17.86 平均盈利: -17.86 typeA: 0.00 胜率: 0.00%
Loaded 3000 15m candles

      ========== 回测结果 ==========
      总交易次数:     71
      胜率:          59.15%
      总收益:        446.77 USDT
      期末余额:      1432.57 USDT
      盈亏比:        1.83
      最大单笔盈利:  185.55
      最大单笔亏损:  -81.34
      手续费:       28.4798789817593
      =============================
    
profit: 432.56961661018977
maxDrawdown 11.0%
startTime: 2021-07-30 00:00:00
趋势多且增强-R-1-1-1 总交易次数: 1 盈利: 12.380264900662251 亏损: 0 最大盈利: 12.38 最大亏损: 12.38 总收益: 12.38 平均盈利: 12.38 typeA: 12.38 胜率: 100.00%
趋势多且增强-L3-1-4-2 总交易次数: 2 盈利: 5.344036810281361 亏损: 0 最大盈利: 4.73 最大亏损: 0.62 总收益: 5.34 平均盈利: 2.67 typeA: 2.67 胜率: 100.00%
趋势空且增强-L2-3-4 总交易次数: 2 盈利: 4.56034245078283 亏损: 0 最大盈利: 3.17 最大亏损: 1.39 总收益: 4.56 平均盈利: 2.28 typeA: 2.28 胜率: 100.00%
趋势空且增强-L-4-2-3 总交易次数: 1 盈利: 1.8221379833207556 亏损: 0 最大盈利: 1.82 最大亏损: 1.82 总收益: 1.82 平均盈利: 1.82 typeA: 1.82 胜率: 100.00%
趋势空且增强-L1-1-2 总交易次数: 2 盈利: 27.616565446952954 亏损: 0 最大盈利: 21.83 最大亏损: 5.79 总收益: 27.62 平均盈利: 13.81 typeA: 13.81 胜率: 100.00%
趋势多且增强-R-1-2-2 总交易次数: 1 盈利: 62.82127705011391 亏损: 0 最大盈利: 62.82 最大亏损: 62.82 总收益: 62.82 平均盈利: 62.82 typeA: 62.82 胜率: 100.00%
趋势多且增强-L3-1-4-1 总交易次数: 6 盈利: 224.60920562697206 亏损: -17.45147899399829 最大盈利: 185.55 最大亏损: -17.45 总收益: 207.16 平均盈利: 34.53 typeA: 28.77 胜率: 83.33%
趋势多且增强-L3-1-3 总交易次数: 7 盈利: 127.27513888857612 亏损: -24.775949960893534 最大盈利: 51.36 最大亏损: -14.89 总收益: 102.50 平均盈利: 14.64 typeA: 10.46 胜率: 71.43%
趋势多且增强-L1-1-6 总交易次数: 3 盈利: 30.847638655407067 亏损: -21.45510581067508 最大盈利: 15.88 最大亏损: -21.46 总收益: 9.39 平均盈利: 3.13 typeA: 2.09 胜率: 66.67%
趋势多且增强-L3-1-5 总交易次数: 5 盈利: 47.78019860879128 亏损: -32.15428686508322 最大盈利: 35.02 最大亏损: -29.03 总收益: 15.63 平均盈利: 3.13 typeA: 1.88 胜率: 60.00%
趋势空且增强-L2-3-5 总交易次数: 5 盈利: 84.69099924877447 亏损: -8.657850138728541 最大盈利: 49.60 最大亏损: -5.80 总收益: 76.03 平均盈利: 15.21 typeA: 9.12 胜率: 60.00%
趋势空且增强-11 总交易次数: 6 盈利: 56.16623154242289 亏损: -120.7850426880151 最大盈利: 27.89 最大亏损: -81.34 总收益: -64.62 平均盈利: -10.77 typeA: -5.38 胜率: 50.00%
趋势多且增强-R-1-1-2 总交易次数: 6 盈利: 46.64503614868576 亏损: -19.603357398218535 最大盈利: 40.88 最大亏损: -14.98 总收益: 27.04 平均盈利: 4.51 typeA: 2.25 胜率: 50.00%
趋势空且增强-L1-3-4-2 总交易次数: 2 盈利: 3.2967661380945015 亏损: -4.363212047516612 最大盈利: 3.30 最大亏损: -4.36 总收益: -1.07 平均盈利: -0.53 typeA: -0.27 胜率: 50.00%
趋势多且增强-L1-3-9 总交易次数: 2 盈利: 19.45047309392486 亏损: -31.155357906962614 最大盈利: 19.45 最大亏损: -31.16 总收益: -11.70 平均盈利: -5.85 typeA: -2.93 胜率: 50.00%
趋势空且增强-L2-3-3 总交易次数: 7 盈利: 17.375391858661132 亏损: -70.10393431118467 最大盈利: 10.43 最大亏损: -23.04 总收益: -52.73 平均盈利: -7.53 typeA: -3.23 胜率: 42.86%
趋势空且增强-2 总交易次数: 10 盈利: 214.16400974917815 亏损: -162.6758598844184 最大盈利: 165.43 最大亏损: -67.52 总收益: 51.49 平均盈利: 5.15 typeA: 2.06 胜率: 40.00%
趋势空且增强-L2-1-3 总交易次数: 1 盈利: 0 亏损: -19.47308649202391 最大盈利: -19.47 最大亏损: -19.47 总收益: -19.47 平均盈利: -19.47 typeA: 0.00 胜率: 0.00%
趋势多且增强-L3-1-4-4 总交易次数: 2 盈利: 0 亏损: -7.421575093690846 最大盈利: -0.05 最大亏损: -7.37 总收益: -7.42 平均盈利: -3.71 typeA: 0.00 胜率: 0.00%
Loaded 3000 15m candles

      ========== 回测结果 ==========
      总交易次数:     73
      胜率:          65.75%
      总收益:        217.87 USDT
      期末余额:      1203.27 USDT
      盈亏比:        2.07
      最大单笔盈利:  56.30
      最大单笔亏损:  -29.31
      手续费:       29.201607185366917
      =============================
    
profit: 203.2681431603653
maxDrawdown 4.5%
startTime: 2021-08-29 00:00:00
趋势空且增强-L2-1-3 总交易次数: 2 盈利: 20.35468009870604 亏损: 0 最大盈利: 13.34 最大亏损: 7.01 总收益: 20.35 平均盈利: 10.18 typeA: 10.18 胜率: 100.00%
趋势多且增强-L1-3-9 总交易次数: 1 盈利: 11.216086766142357 亏损: 0 最大盈利: 11.22 最大亏损: 11.22 总收益: 11.22 平均盈利: 11.22 typeA: 11.22 胜率: 100.00%
趋势多且增强-R-1-2-2 总交易次数: 3 盈利: 9.791875318233188 亏损: 0 最大盈利: 6.49 最大亏损: 1.48 总收益: 9.79 平均盈利: 3.26 typeA: 3.26 胜率: 100.00%
趋势空且增强-L-4-2-3 总交易次数: 2 盈利: 1.4107713841656189 亏损: 0 最大盈利: 0.82 最大亏损: 0.59 总收益: 1.41 平均盈利: 0.71 typeA: 0.71 胜率: 100.00%
趋势多且增强-L3-1-4-2 总交易次数: 4 盈利: 6.875183890153506 亏损: 0 最大盈利: 2.88 最大亏损: 0.41 总收益: 6.88 平均盈利: 1.72 typeA: 1.72 胜率: 100.00%
趋势多且增强-L3-1-4-4 总交易次数: 1 盈利: 1.4872227579555894 亏损: 0 最大盈利: 1.49 最大亏损: 1.49 总收益: 1.49 平均盈利: 1.49 typeA: 1.49 胜率: 100.00%
趋势多且增强-L3-1-4-3 总交易次数: 1 盈利: 1.542402091300766 亏损: 0 最大盈利: 1.54 最大亏损: 1.54 总收益: 1.54 平均盈利: 1.54 typeA: 1.54 胜率: 100.00%
趋势多且增强-L3-1-4-1 总交易次数: 5 盈利: 40.27650399609392 亏损: -13.873239615800427 最大盈利: 30.36 最大亏损: -13.87 总收益: 26.40 平均盈利: 5.28 typeA: 4.22 胜率: 80.00%
趋势多且增强-L3-1-5 总交易次数: 5 盈利: 19.313154195973325 亏损: -22.331510687695058 最大盈利: 10.19 最大亏损: -22.33 总收益: -3.02 平均盈利: -0.60 typeA: -0.48 胜率: 80.00%
趋势空且增强-11 总交易次数: 4 盈利: 52.62205030193523 亏损: -22.122381248703437 最大盈利: 27.92 最大亏损: -22.12 总收益: 30.50 平均盈利: 7.62 typeA: 5.72 胜率: 75.00%
趋势多且增强-R-1-1-2 总交易次数: 12 盈利: 137.7463632528845 亏损: -32.65198076256471 最大盈利: 45.74 最大亏损: -29.31 总收益: 105.09 平均盈利: 8.76 typeA: 6.57 胜率: 75.00%
趋势空且增强-2 总交易次数: 6 盈利: 21.14043372843821 亏损: -12.192203852145617 最大盈利: 9.41 最大亏损: -11.79 总收益: 8.95 平均盈利: 1.49 typeA: 0.99 胜率: 66.67%
趋势空且增强-L2-3-5 总交易次数: 5 盈利: 58.497582771436726 亏损: -17.627820804791057 最大盈利: 56.30 最大亏损: -11.83 总收益: 40.87 平均盈利: 8.17 typeA: 4.90 胜率: 60.00%
趋势空且增强-L2-3-4 总交易次数: 4 盈利: 9.50971226054429 亏损: -6.040811283015816 最大盈利: 6.13 最大亏损: -4.54 总收益: 3.47 平均盈利: 0.87 typeA: 0.43 胜率: 50.00%
趋势多且增强-L3-1-3 总交易次数: 2 盈利: 0.5495689116581843 亏损: -0.1282731903292202 最大盈利: 0.55 最大亏损: -0.13 总收益: 0.42 平均盈利: 0.21 typeA: 0.11 胜率: 50.00%
趋势多且增强-R-1-1-1 总交易次数: 2 盈利: 4.994223572403532 亏损: -1.8861810899124432 最大盈利: 4.99 最大亏损: -1.89 总收益: 3.11 平均盈利: 1.55 typeA: 0.78 胜率: 50.00%
趋势多且增强-L1-1-6 总交易次数: 3 盈利: 10.56236723758493 亏损: -30.19963011751316 最大盈利: 10.56 最大亏损: -22.38 总收益: -19.64 平均盈利: -6.55 typeA: -2.18 胜率: 33.33%
趋势空且增强-L2-3-3 总交易次数: 3 盈利: 8.976146788990771 亏损: -9.921068472672506 最大盈利: 8.98 最大亏损: -7.26 总收益: -0.94 平均盈利: -0.31 typeA: -0.10 胜率: 33.33%
趋势空且增强-L1-3-4-2 总交易次数: 4 盈利: 4.18684210526313 亏损: -2.554578640280694 最大盈利: 4.19 最大亏损: -1.94 总收益: 1.63 平均盈利: 0.41 typeA: 0.10 胜率: 25.00%
趋势多且增强-L1-2-1 总交易次数: 1 盈利: 0 亏损: -4.293720355130381 最大盈利: -4.29 最大亏损: -4.29 总收益: -4.29 平均盈利: -4.29 typeA: 0.00 胜率: 0.00%
趋势多且增强-L1-3-2 总交易次数: 1 盈利: 0 亏损: -14.840994805088558 最大盈利: -14.84 最大亏损: -14.84 总收益: -14.84 平均盈利: -14.84 typeA: 0.00 胜率: 0.00%
趋势多且增强-R-2-1 总交易次数: 1 盈利: 0 亏损: -2.5204194782309064 最大盈利: -2.52 最大亏损: -2.52 总收益: -2.52 平均盈利: -2.52 typeA: 0.00 胜率: 0.00%
趋势多且增强-L1-2-2 总交易次数: 1 盈利: 0 亏损: -10.000213865621134 最大盈利: -10.00 最大亏损: -10.00 总收益: -10.00 平均盈利: -10.00 typeA: 0.00 胜率: 0.00%
Loaded 3000 15m candles

      ========== 回测结果 ==========
      总交易次数:     81
      胜率:          54.32%
      总收益:        170.86 USDT
      期末余额:      1154.66 USDT
      盈亏比:        1.39
      最大单笔盈利:  122.10
      最大单笔亏损:  -73.11
      手续费:       32.43988886979425
      =============================
    
profit: 154.66248168294283
maxDrawdown 9.7%
startTime: 2021-09-28 00:00:00
趋势空且增强-L1-3-4-2 总交易次数: 5 盈利: 15.441786114906831 亏损: 0 最大盈利: 5.87 最大亏损: 1.09 总收益: 15.44 平均盈利: 3.09 typeA: 3.09 胜率: 100.00%
趋势多且增强-L3-1-4-3 总交易次数: 1 盈利: 0.7563720161746074 亏损: 0 最大盈利: 0.76 最大亏损: 0.76 总收益: 0.76 平均盈利: 0.76 typeA: 0.76 胜率: 100.00%
趋势多且增强-L3-1-3 总交易次数: 2 盈利: 11.692616362698447 亏损: 0 最大盈利: 10.36 最大亏损: 1.33 总收益: 11.69 平均盈利: 5.85 typeA: 5.85 胜率: 100.00%
趋势空且增强-L2-1-3 总交易次数: 7 盈利: 201.0552421234292 亏损: -5.375624737063562 最大盈利: 122.10 最大亏损: -5.38 总收益: 195.68 平均盈利: 27.95 typeA: 23.96 胜率: 85.71%
趋势多且增强-L3-1-4-2 总交易次数: 4 盈利: 10.410884020126597 亏损: -26.67321232671791 最大盈利: 7.84 最大亏损: -26.67 总收益: -16.26 平均盈利: -4.07 typeA: -3.05 胜率: 75.00%
趋势多且增强-L3-1-4-1 总交易次数: 12 盈利: 162.4077184690967 亏损: -23.621013597417885 最大盈利: 81.91 最大亏损: -7.82 总收益: 138.79 平均盈利: 11.57 typeA: 7.71 胜率: 66.67%
趋势空且增强-L-4-2-3 总交易次数: 3 盈利: 6.364400020301472 亏损: -0.03679530064459294 最大盈利: 3.38 最大亏损: -0.04 总收益: 6.33 平均盈利: 2.11 typeA: 1.41 胜率: 66.67%
趋势多且增强-L3-1-5 总交易次数: 3 盈利: 21.810451165051493 亏损: -3.919494047619051 最大盈利: 15.13 最大亏损: -3.92 总收益: 17.89 平均盈利: 5.96 typeA: 3.98 胜率: 66.67%
趋势空且增强-L2-3-3 总交易次数: 5 盈利: 16.627719184932577 亏损: -39.449243898401285 最大盈利: 7.17 最大亏损: -21.91 总收益: -22.82 平均盈利: -4.56 typeA: -2.74 胜率: 60.00%
趋势空且增强-L2-3-5 总交易次数: 4 盈利: 18.973376776228093 亏损: -10.192404142263694 最大盈利: 16.61 最大亏损: -5.52 总收益: 8.78 平均盈利: 2.20 typeA: 1.10 胜率: 50.00%
趋势多且增强-L1-1-6 总交易次数: 2 盈利: 41.731773774996185 亏损: -2.6482526770149395 最大盈利: 41.73 最大亏损: -2.65 总收益: 39.08 平均盈利: 19.54 typeA: 9.77 胜率: 50.00%
趋势多且增强-R-1-1-2 总交易次数: 7 盈利: 39.086603827049245 亏损: -21.226963545691383 最大盈利: 22.37 最大亏损: -7.41 总收益: 17.86 平均盈利: 2.55 typeA: 1.09 胜率: 42.86%
趋势空且增强-L2-3-4 总交易次数: 3 盈利: 1.4844222101143159 亏损: -7.210950162298001 最大盈利: 1.48 最大亏损: -3.77 总收益: -5.73 平均盈利: -1.91 typeA: -0.64 胜率: 33.33%
趋势空且增强-L1-1-2 总交易次数: 6 盈利: 20.55610514452708 亏损: -108.78180463188235 最大盈利: 15.33 最大亏损: -73.11 总收益: -88.23 平均盈利: -14.70 typeA: -4.90 胜率: 33.33%
趋势空且增强-2 总交易次数: 11 盈利: 43.41870450726055 亏损: -137.42944209657747 最大盈利: 36.26 最大亏损: -53.81 总收益: -94.01 平均盈利: -8.55 typeA: -2.33 胜率: 27.27%
趋势空且增强-11 总交易次数: 1 盈利: 0 亏损: -30.617714519762444 最大盈利: -30.62 最大亏损: -30.62 总收益: -30.62 平均盈利: -30.62 typeA: 0.00 胜率: 0.00%
趋势多且增强-L1-2-2 总交易次数: 3 盈利: 0 亏损: -19.262227411289764 最大盈利: -2.55 最大亏损: -12.44 总收益: -19.26 平均盈利: -6.42 typeA: 0.00 胜率: 0.00%
趋势多且增强-L3-1-4-4 总交易次数: 1 盈利: 0 亏损: -4.478874521944984 最大盈利: -4.48 最大亏损: -4.48 总收益: -4.48 平均盈利: -4.48 typeA: 0.00 胜率: 0.00%
趋势多且增强-L1-3-9 总交易次数: 1 盈利: 0 亏损: -0.031676417357581366 最大盈利: -0.03 最大亏损: -0.03 总收益: -0.03 平均盈利: -0.03 typeA: 0.00 胜率: 0.00%
Loaded 3000 15m candles

      ========== 回测结果 ==========
      总交易次数:     80
      胜率:          60.00%
      总收益:        -56.41 USDT
      期末余额:      927.59 USDT
      盈亏比:        0.86
      最大单笔盈利:  37.61
      最大单笔亏损:  -73.11
      手续费:       31.996821126288502
      =============================
    
profit: -72.4125622517272
maxDrawdown 15.3%
startTime: 2021-10-28 00:00:00
趋势多且增强-L3-1-5 总交易次数: 4 盈利: 38.69135838845367 亏损: 0 最大盈利: 17.95 最大亏损: 3.41 总收益: 38.69 平均盈利: 9.67 typeA: 9.67 胜率: 100.00%
趋势多且增强-L1-3-9 总交易次数: 1 盈利: 16.123265306122473 亏损: 0 最大盈利: 16.12 最大亏损: 16.12 总收益: 16.12 平均盈利: 16.12 typeA: 16.12 胜率: 100.00%
趋势多且增强-L3-1-4-3 总交易次数: 3 盈利: 3.8326699755760405 亏损: 0 最大盈利: 2.63 最大亏损: 0.56 总收益: 3.83 平均盈利: 1.28 typeA: 1.28 胜率: 100.00%
趋势多且增强-L1-2-1 总交易次数: 1 盈利: 26.7068507194902 亏损: 0 最大盈利: 26.71 最大亏损: 26.71 总收益: 26.71 平均盈利: 26.71 typeA: 26.71 胜率: 100.00%
趋势多且增强-L3-1-4-1 总交易次数: 6 盈利: 34.944171859217924 亏损: -18.015847302436992 最大盈利: 16.81 最大亏损: -18.02 总收益: 16.93 平均盈利: 2.82 typeA: 2.35 胜率: 83.33%
趋势空且增强-L2-3-3 总交易次数: 5 盈利: 23.367625698130713 亏损: -17.510488058151626 最大盈利: 10.78 最大亏损: -17.51 总收益: 5.86 平均盈利: 1.17 typeA: 0.94 胜率: 80.00%
趋势多且增强-R-1-1-2 总交易次数: 8 盈利: 18.76448177602148 亏损: -20.421916038997917 最大盈利: 7.52 最大亏损: -16.32 总收益: -1.66 平均盈利: -0.21 typeA: -0.16 胜率: 75.00%
趋势空且增强-L2-1-3 总交易次数: 4 盈利: 24.944640097952277 亏损: -0.5802318950769396 最大盈利: 10.45 最大亏损: -0.58 总收益: 24.36 平均盈利: 6.09 typeA: 4.57 胜率: 75.00%
趋势空且增强-11 总交易次数: 4 盈利: 23.97938648777979 亏损: -4.00677234560161 最大盈利: 14.57 最大亏损: -4.01 总收益: 19.97 平均盈利: 4.99 typeA: 3.74 胜率: 75.00%
趋势空且增强-L2-3-5 总交易次数: 6 盈利: 52.97399419130181 亏损: -41.655135618777976 最大盈利: 37.61 最大亏损: -24.18 总收益: 11.32 平均盈利: 1.89 typeA: 1.26 胜率: 66.67%
趋势空且增强-2 总交易次数: 10 盈利: 28.672831624779135 亏损: -45.53172641424906 最大盈利: 11.26 最大亏损: -30.46 总收益: -16.86 平均盈利: -1.69 typeA: -0.84 胜率: 50.00%
趋势空且增强-L1-1-2 总交易次数: 2 盈利: 11.137111614881968 亏损: -73.10591322155372 最大盈利: 11.14 最大亏损: -73.11 总收益: -61.97 平均盈利: -30.98 typeA: -15.49 胜率: 50.00%
趋势多且增强-L3-1-4-2 总交易次数: 4 盈利: 3.8737785002371847 亏损: -25.740509008391218 最大盈利: 2.01 最大亏损: -21.18 总收益: -21.87 平均盈利: -5.47 typeA: -2.73 胜率: 50.00%
趋势空且增强-L1-3-4-2 总交易次数: 2 盈利: 9.943023617844611 亏损: -11.022860626380984 最大盈利: 9.94 最大亏损: -11.02 总收益: -1.08 平均盈利: -0.54 typeA: -0.27 胜率: 50.00%
趋势多且增强-R-2-1 总交易次数: 2 盈利: 1.3803991306066448 亏损: -3.6805245039258754 最大盈利: 1.38 最大亏损: -3.68 总收益: -2.30 平均盈利: -1.15 typeA: -0.58 胜率: 50.00%
趋势空且增强-L2-3-4 总交易次数: 7 盈利: 13.035975134022774 亏损: -14.673418770647732 最大盈利: 7.27 最大亏损: -8.99 总收益: -1.64 平均盈利: -0.23 typeA: -0.10 胜率: 42.86%
趋势多且增强-R-1-2-2 总交易次数: 3 盈利: 2.555926427103668 亏损: -42.024999577224136 最大盈利: 2.56 最大亏损: -32.33 总收益: -39.47 平均盈利: -13.16 typeA: -4.39 胜率: 33.33%
趋势多且增强-L3-1-3 总交易次数: 2 盈利: 0 亏损: -16.402823228477228 最大盈利: -1.98 最大亏损: -14.42 总收益: -16.40 平均盈利: -8.20 typeA: 0.00 胜率: 0.00%
趋势多且增强-L1-2-2 总交易次数: 1 盈利: 0 亏损: -1.1798266113832736 最大盈利: -1.18 最大亏损: -1.18 总收益: -1.18 平均盈利: -1.18 typeA: 0.00 胜率: 0.00%
趋势多且增强-L1-1-6 总交易次数: 2 盈利: 0 亏损: -44.46188464813259 最大盈利: -6.30 最大亏损: -38.17 总收益: -44.46 平均盈利: -22.23 typeA: 0.00 胜率: 0.00%
趋势空且增强-L-4-2-3 总交易次数: 1 盈利: 0 亏损: -0.4311799375939154 最大盈利: -0.43 最大亏损: -0.43 总收益: -0.43 平均盈利: -0.43 typeA: 0.00 胜率: 0.00%
趋势多且增强-L3-1-4-4 总交易次数: 1 盈利: 0 亏损: -6.931168888692003 最大盈利: -6.93 最大亏损: -6.93 总收益: -6.93 平均盈利: -6.93 typeA: 0.00 胜率: 0.00%
趋势多且增强-L1-3-2 总交易次数: 1 盈利: 0 亏损: -3.9628261055512444 最大盈利: -3.96 最大亏损: -3.96 总收益: -3.96 平均盈利: -3.96 typeA: 0.00 胜率: 0.00%
Loaded 3000 15m candles

      ========== 回测结果 ==========
      总交易次数:     78
      胜率:          58.97%
      总收益:        -98.50 USDT
      期末余额:      885.90 USDT
      盈亏比:        0.79
      最大单笔盈利:  41.24
      最大单笔亏损:  -119.73
      手续费:       31.19498903473811
      =============================
    
profit: -114.09961504868124
maxDrawdown 26.0%
startTime: 2021-11-27 00:00:00
趋势多且增强-R-1-2-2 总交易次数: 1 盈利: 2.3833263024677835 亏损: 0 最大盈利: 2.38 最大亏损: 2.38 总收益: 2.38 平均盈利: 2.38 typeA: 2.38 胜率: 100.00%
趋势空且增强-2 总交易次数: 4 盈利: 3.6656110268382993 亏损: 0 最大盈利: 1.37 最大亏损: 0.47 总收益: 3.67 平均盈利: 0.92 typeA: 0.92 胜率: 100.00%
趋势多且增强-R-1-1-1 总交易次数: 2 盈利: 21.553449581876954 亏损: 0 最大盈利: 10.98 最大亏损: 10.57 总收益: 21.55 平均盈利: 10.78 typeA: 10.78 胜率: 100.00%
趋势空且增强-11 总交易次数: 5 盈利: 82.33440295718943 亏损: -22.21969659595455 最大盈利: 40.25 最大亏损: -22.22 总收益: 60.11 平均盈利: 12.02 typeA: 9.62 胜率: 80.00%
趋势多且增强-L3-1-5 总交易次数: 4 盈利: 19.754146615392084 亏损: -12.873002682375194 最大盈利: 12.96 最大亏损: -12.87 总收益: 6.88 平均盈利: 1.72 typeA: 1.29 胜率: 75.00%
趋势多且增强-L3-1-3 总交易次数: 4 盈利: 8.654614240516974 亏损: -4.6003772506430005 最大盈利: 5.92 最大亏损: -4.60 总收益: 4.05 平均盈利: 1.01 typeA: 0.76 胜率: 75.00%
趋势空且增强-L2-1-3 总交易次数: 4 盈利: 59.34529922747512 亏损: -1.3320882852292346 最大盈利: 41.24 最大亏损: -1.33 总收益: 58.01 平均盈利: 14.50 typeA: 10.88 胜率: 75.00%
趋势空且增强-L2-3-3 总交易次数: 3 盈利: 15.21577801716515 亏损: -76.9004461895414 最大盈利: 10.70 最大亏损: -76.90 总收益: -61.68 平均盈利: -20.56 typeA: -13.71 胜率: 66.67%
趋势多且增强-R-1-1-2 总交易次数: 14 盈利: 70.91478507936642 亏损: -134.75322870640923 最大盈利: 32.16 最大亏损: -119.73 总收益: -63.84 平均盈利: -4.56 typeA: -2.93 胜率: 64.29%
趋势多且增强-L3-1-4-2 总交易次数: 5 盈利: 22.90964671204068 亏损: -11.138392659626575 最大盈利: 8.50 最大亏损: -6.22 总收益: 11.77 平均盈利: 2.35 typeA: 1.41 胜率: 60.00%
趋势空且增强-L2-3-4 总交易次数: 7 盈利: 22.213641343340022 亏损: -89.6986450910156 最大盈利: 12.89 最大亏损: -47.00 总收益: -67.49 平均盈利: -9.64 typeA: -5.51 胜率: 57.14%
趋势多且增强-L1-3-1 总交易次数: 2 盈利: 6.411915036708999 亏损: -8.923552525135698 最大盈利: 6.41 最大亏损: -8.92 总收益: -2.51 平均盈利: -1.26 typeA: -0.63 胜率: 50.00%
趋势空且增强-L2-3-5 总交易次数: 2 盈利: 1.5753979054493505 亏损: -11.903845540130737 最大盈利: 1.58 最大亏损: -11.90 总收益: -10.33 平均盈利: -5.16 typeA: -2.58 胜率: 50.00%
趋势多且增强-L3-1-4-4 总交易次数: 2 盈利: 19.693167625811036 亏损: -5.652053820164805 最大盈利: 19.69 最大亏损: -5.65 总收益: 14.04 平均盈利: 7.02 typeA: 3.51 胜率: 50.00%
趋势空且增强-L-4-2-3 总交易次数: 4 盈利: 3.1224249399005286 亏损: -10.086923462572754 最大盈利: 2.09 最大亏损: -7.14 总收益: -6.96 平均盈利: -1.74 typeA: -0.87 胜率: 50.00%
趋势空且增强-L1-3-4-2 总交易次数: 8 盈利: 8.618010005608323 亏损: -14.867570386094414 最大盈利: 4.77 最大亏损: -5.34 总收益: -6.25 平均盈利: -0.78 typeA: -0.29 胜率: 37.50%
趋势多且增强-L1-1-6 总交易次数: 1 盈利: 0 亏损: -6.295751475854113 最大盈利: -6.30 最大亏损: -6.30 总收益: -6.30 平均盈利: -6.30 typeA: 0.00 胜率: 0.00%
趋势空且增强-L1-1-2 总交易次数: 1 盈利: 0 亏损: -5.612034704730022 最大盈利: -5.61 最大亏损: -5.61 总收益: -5.61 平均盈利: -5.61 typeA: 0.00 胜率: 0.00%
趋势多且增强-L3-1-4-1 总交易次数: 2 盈利: 0 亏损: -22.521851488205698 最大盈利: -8.19 最大亏损: -14.33 总收益: -22.52 平均盈利: -11.26 typeA: 0.00 胜率: 0.00%
趋势多且增强-L3-1-4-3 总交易次数: 1 盈利: 0 亏损: -13.729325111339405 最大盈利: -13.73 最大亏损: -13.73 总收益: -13.73 平均盈利: -13.73 typeA: 0.00 胜率: 0.00%
趋势多且增强-L1-3-2 总交易次数: 1 盈利: 0 亏损: -5.177625490540559 最大盈利: -5.18 最大亏损: -5.18 总收益: -5.18 平均盈利: -5.18 typeA: 0.00 胜率: 0.00%
趋势多且增强-L1-2-2 总交易次数: 1 盈利: 0 亏损: -8.578820200261285 最大盈利: -8.58 最大亏损: -8.58 总收益: -8.58 平均盈利: -8.58 typeA: 0.00 胜率: 0.00%
Loaded 3000 15m candles

      ========== 回测结果 ==========
      总交易次数:     94
      胜率:          61.70%
      总收益:        199.26 USDT
      期末余额:      1180.46 USDT
      盈亏比:        1.48
      最大单笔盈利:  134.38
      最大单笔亏损:  -53.85
      手续费:       37.594970055931114
      =============================
    
profit: 180.4583306185716
maxDrawdown 14.7%
startTime: 2021-12-27 00:00:00
趋势多且增强-R-1-1-1 总交易次数: 2 盈利: 27.20645014362815 亏损: 0 最大盈利: 23.96 最大亏损: 3.24 总收益: 27.21 平均盈利: 13.60 typeA: 13.60 胜率: 100.00%
趋势多且增强-L3-1-4-2 总交易次数: 4 盈利: 11.945857096577832 亏损: 0 最大盈利: 6.26 最大亏损: 1.14 总收益: 11.95 平均盈利: 2.99 typeA: 2.99 胜率: 100.00%
趋势空且增强-L2-3-3 总交易次数: 6 盈利: 50.00454122411068 亏损: 0 最大盈利: 27.52 最大亏损: 0.31 总收益: 50.00 平均盈利: 8.33 typeA: 8.33 胜率: 100.00%
趋势多且增强-L1-2-1 总交易次数: 2 盈利: 27.559714668650354 亏损: 0 最大盈利: 17.56 最大亏损: 10.00 总收益: 27.56 平均盈利: 13.78 typeA: 13.78 胜率: 100.00%
趋势空且增强-L2-2-3 总交易次数: 1 盈利: 21.5369151826139 亏损: 0 最大盈利: 21.54 最大亏损: 21.54 总收益: 21.54 平均盈利: 21.54 typeA: 21.54 胜率: 100.00%
趋势多且增强-L3-1-4-4 总交易次数: 4 盈利: 14.988058779653773 亏损: -18.88785046728967 最大盈利: 7.92 最大亏损: -18.89 总收益: -3.90 平均盈利: -0.97 typeA: -0.73 胜率: 75.00%
趋势空且增强-L-4-2-3 总交易次数: 7 盈利: 27.85088053228589 亏损: -6.103239811196891 最大盈利: 19.82 最大亏损: -4.97 总收益: 21.75 平均盈利: 3.11 typeA: 2.22 胜率: 71.43%
趋势空且增强-L2-3-4 总交易次数: 10 盈利: 29.28592592061385 亏损: -14.169608663844377 最大盈利: 7.83 最大亏损: -11.07 总收益: 15.12 平均盈利: 1.51 typeA: 1.06 胜率: 70.00%
趋势多且增强-R-1-1-2 总交易次数: 12 盈利: 43.34622262922343 亏损: -63.19936023617578 最大盈利: 19.24 最大亏损: -20.77 总收益: -19.85 平均盈利: -1.65 typeA: -1.10 胜率: 66.67%
趋势多且增强-L3-1-4-3 总交易次数: 3 盈利: 2.9802071165772133 亏损: -53.85451588691522 最大盈利: 2.86 最大亏损: -53.85 总收益: -50.87 平均盈利: -16.96 typeA: -11.31 胜率: 66.67%
趋势多且增强-L3-1-5 总交易次数: 5 盈利: 88.99071606156296 亏损: -27.387063394791255 最大盈利: 71.45 最大亏损: -22.08 总收益: 61.60 平均盈利: 12.32 typeA: 7.39 胜率: 60.00%
趋势空且增强-2 总交易次数: 5 盈利: 26.563122567555055 亏损: -24.886625028795 最大盈利: 16.89 最大亏损: -17.70 总收益: 1.68 平均盈利: 0.34 typeA: 0.20 胜率: 60.00%
趋势空且增强-11 总交易次数: 5 盈利: 75.62634112038081 亏损: -27.16544319253837 最大盈利: 45.99 最大亏损: -18.19 总收益: 48.46 平均盈利: 9.69 typeA: 5.82 胜率: 60.00%
趋势多且增强-R-2-1 总交易次数: 4 盈利: 3.9886885837467614 亏损: -44.836875115294475 最大盈利: 2.22 最大亏损: -39.86 总收益: -40.85 平均盈利: -10.21 typeA: -5.11 胜率: 50.00%
趋势空且增强-L1-3-4-2 总交易次数: 6 盈利: 20.115116996101406 亏损: -49.072046454925854 最大盈利: 14.46 最大亏损: -37.18 总收益: -28.96 平均盈利: -4.83 typeA: -2.41 胜率: 50.00%
趋势多且增强-L3-1-4-1 总交易次数: 6 盈利: 135.31149156635746 亏损: -23.640598682491117 最大盈利: 134.38 最大亏损: -10.76 总收益: 111.67 平均盈利: 18.61 typeA: 6.20 胜率: 33.33%
趋势多且增强-R-1-2-2 总交易次数: 4 盈利: 8.045351690294552 亏损: -22.078749334165366 最大盈利: 8.05 最大亏损: -12.89 总收益: -14.03 平均盈利: -3.51 typeA: -0.88 胜率: 25.00%
趋势空且增强-L2-3-5 总交易次数: 5 盈利: 2.727725103404492 亏损: -19.173608568308886 最大盈利: 2.73 最大亏损: -6.95 总收益: -16.45 平均盈利: -3.29 typeA: -0.66 胜率: 20.00%
趋势多且增强-L1-3-9 总交易次数: 2 盈利: 0 亏损: -23.645245412145833 最大盈利: -2.96 最大亏损: -20.68 总收益: -23.65 平均盈利: -11.82 typeA: 0.00 胜率: 0.00%
趋势空且增强-L2-1-3 总交易次数: 1 盈利: 0 亏损: -0.7141661158844586 最大盈利: -0.71 最大亏损: -0.71 总收益: -0.71 平均盈利: -0.71 typeA: 0.00 胜率: 0.00%
Loaded 3000 15m candles

      ========== 回测结果 ==========
      总交易次数:     74
      胜率:          55.41%
      总收益:        -62.60 USDT
      期末余额:      922.60 USDT
      盈亏比:        0.84
      最大单笔盈利:  23.47
      最大单笔亏损:  -83.03
      手续费:       29.61652004658754
      =============================
    
profit: -77.40478905929444
maxDrawdown 18.5%
startTime: 2022-01-26 00:00:00
趋势空且增强-L2-1-3 总交易次数: 1 盈利: 12.558911833110002 亏损: 0 最大盈利: 12.56 最大亏损: 12.56 总收益: 12.56 平均盈利: 12.56 typeA: 12.56 胜率: 100.00%
趋势多且增强-L3-1-4-2 总交易次数: 2 盈利: 8.272367294569646 亏损: 0 最大盈利: 6.49 最大亏损: 1.78 总收益: 8.27 平均盈利: 4.14 typeA: 4.14 胜率: 100.00%
趋势多且增强-L1-3-9 总交易次数: 1 盈利: 17.884402267371385 亏损: 0 最大盈利: 17.88 最大亏损: 17.88 总收益: 17.88 平均盈利: 17.88 typeA: 17.88 胜率: 100.00%
趋势多且增强-L3-1-4-1 总交易次数: 1 盈利: 5.710924259344309 亏损: 0 最大盈利: 5.71 最大亏损: 5.71 总收益: 5.71 平均盈利: 5.71 typeA: 5.71 胜率: 100.00%
趋势多且增强-L3-1-3 总交易次数: 5 盈利: 47.95689019754944 亏损: -2.2088824222269277 最大盈利: 21.00 最大亏损: -2.21 总收益: 45.75 平均盈利: 9.15 typeA: 7.32 胜率: 80.00%
趋势多且增强-R-1-2-2 总交易次数: 5 盈利: 61.57477481901139 亏损: -83.03333605686736 最大盈利: 23.47 最大亏损: -83.03 总收益: -21.46 平均盈利: -4.29 typeA: -3.43 胜率: 80.00%
趋势多且增强-L3-1-4-3 总交易次数: 4 盈利: 16.69061216966933 亏损: -30.45135154513516 最大盈利: 9.19 最大亏损: -30.45 总收益: -13.76 平均盈利: -3.44 typeA: -2.58 胜率: 75.00%
趋势多且增强-R-1-1-2 总交易次数: 3 盈利: 25.34428066902301 亏损: -9.845129411764775 最大盈利: 22.06 最大亏损: -9.85 总收益: 15.50 平均盈利: 5.17 typeA: 3.44 胜率: 66.67%
趋势多且增强-L3-1-4-4 总交易次数: 3 盈利: 1.5439706592666564 亏损: -5.103614619725937 最大盈利: 0.94 最大亏损: -5.10 总收益: -3.56 平均盈利: -1.19 typeA: -0.79 胜率: 66.67%
趋势多且增强-R-2-1 总交易次数: 3 盈利: 12.933470548080368 亏损: -13.762584304108074 最大盈利: 10.07 最大亏损: -13.76 总收益: -0.83 平均盈利: -0.28 typeA: -0.18 胜率: 66.67%
趋势多且增强-L3-1-5 总交易次数: 8 盈利: 12.42173817414377 亏损: -46.716848128060114 最大盈利: 3.18 最大亏损: -42.51 总收益: -34.30 平均盈利: -4.29 typeA: -2.68 胜率: 62.50%
趋势空且增强-L1-3-4-2 总交易次数: 5 盈利: 12.129661012251113 亏损: -3.207714524904549 最大盈利: 7.79 最大亏损: -2.40 总收益: 8.92 平均盈利: 1.78 typeA: 1.07 胜率: 60.00%
趋势空且增强-L-4-2-3 总交易次数: 4 盈利: 5.187544943229095 亏损: -1.626558404569416 最大盈利: 2.88 最大亏损: -1.12 总收益: 3.56 平均盈利: 0.89 typeA: 0.45 胜率: 50.00%
趋势多且增强-R-3-1 总交易次数: 2 盈利: 14.18823873182847 亏损: -21.226500033595336 最大盈利: 14.19 最大亏损: -21.23 总收益: -7.04 平均盈利: -3.52 typeA: -1.76 胜率: 50.00%
趋势多且增强-R-2-2 总交易次数: 2 盈利: 2.3752870179569414 亏损: -3.880679646017648 最大盈利: 2.38 最大亏损: -3.88 总收益: -1.51 平均盈利: -0.75 typeA: -0.38 胜率: 50.00%
趋势空且增强-2 总交易次数: 5 盈利: 21.53558029100726 亏损: -17.15209128316247 最大盈利: 11.52 最大亏损: -7.19 总收益: 4.38 平均盈利: 0.88 typeA: 0.35 胜率: 40.00%
趋势空且增强-L2-3-4 总交易次数: 5 盈利: 25.604572856611846 亏损: -48.01786731412243 最大盈利: 23.04 最大亏损: -38.89 总收益: -22.41 平均盈利: -4.48 typeA: -1.79 胜率: 40.00%
趋势空且增强-L2-3-3 总交易次数: 6 盈利: 8.546302098832518 亏损: -43.59091233088566 最大盈利: 6.27 最大亏损: -17.89 总收益: -35.04 平均盈利: -5.84 typeA: -1.95 胜率: 33.33%
趋势空且增强-11 总交易次数: 4 盈利: 20.488357738525274 亏损: -45.13291488698373 最大盈利: 20.49 最大亏损: -38.32 总收益: -24.64 平均盈利: -6.16 typeA: -1.54 胜率: 25.00%
趋势空且增强-L1-1-2 总交易次数: 1 盈利: 0 亏损: -0.9326496637144502 最大盈利: -0.93 最大亏损: -0.93 总收益: -0.93 平均盈利: -0.93 typeA: 0.00 胜率: 0.00%
趋势空且增强-L2-3-5 总交易次数: 3 盈利: 0 亏损: -18.39751219071956 最大盈利: -0.71 最大亏损: -15.45 总收益: -18.40 平均盈利: -6.13 typeA: 0.00 胜率: 0.00%
趋势多且增强-L1-3-2 总交易次数: 1 盈利: 0 亏损: -1.2655298741092469 最大盈利: -1.27 最大亏损: -1.27 总收益: -1.27 平均盈利: -1.27 typeA: 0.00 胜率: 0.00%
Loaded 3000 15m candles

      ========== 回测结果 ==========
      总交易次数:     74
      胜率:          60.81%
      总收益:        128.11 USDT
      期末余额:      1113.31 USDT
      盈亏比:        1.50
      最大单笔盈利:  64.59
      最大单笔亏损:  -38.71
      手续费:       29.599538352684718
      =============================
    
profit: 113.30875932826325
maxDrawdown 9.8%
startTime: 2022-02-25 00:00:00
趋势多且增强-L3-1-4-2 总交易次数: 1 盈利: 6.493829152214224 亏损: 0 最大盈利: 6.49 最大亏损: 6.49 总收益: 6.49 平均盈利: 6.49 typeA: 6.49 胜率: 100.00%
趋势多且增强-R-3-1 总交易次数: 3 盈利: 11.524102984967676 亏损: 0 最大盈利: 5.86 最大亏损: 0.45 总收益: 11.52 平均盈利: 3.84 typeA: 3.84 胜率: 100.00%
趋势多且增强-L1-3-2 总交易次数: 1 盈利: 23.396749693752582 亏损: 0 最大盈利: 23.40 最大亏损: 23.40 总收益: 23.40 平均盈利: 23.40 typeA: 23.40 胜率: 100.00%
趋势多且增强-L1-2-1 总交易次数: 1 盈利: 64.59316760475289 亏损: 0 最大盈利: 64.59 最大亏损: 64.59 总收益: 64.59 平均盈利: 64.59 typeA: 64.59 胜率: 100.00%
趋势多且增强-R-1-1-2 总交易次数: 1 盈利: 2.736724124603783 亏损: 0 最大盈利: 2.74 最大亏损: 2.74 总收益: 2.74 平均盈利: 2.74 typeA: 2.74 胜率: 100.00%
趋势空且增强-L2-1-3 总交易次数: 1 盈利: 4.476480589402054 亏损: 0 最大盈利: 4.48 最大亏损: 4.48 总收益: 4.48 平均盈利: 4.48 typeA: 4.48 胜率: 100.00%
趋势多且增强-R-2-1 总交易次数: 4 盈利: 36.404841125120036 亏损: -9.848765906567648 最大盈利: 19.70 最大亏损: -9.85 总收益: 26.56 平均盈利: 6.64 typeA: 4.98 胜率: 75.00%
趋势空且增强-L2-3-4 总交易次数: 6 盈利: 55.486928781845144 亏损: -21.759947350405934 最大盈利: 31.27 最大亏损: -20.80 总收益: 33.73 平均盈利: 5.62 typeA: 3.75 胜率: 66.67%
趋势多且增强-L3-1-5 总交易次数: 3 盈利: 3.1632064852493125 亏损: -23.76117829457376 最大盈利: 1.73 最大亏损: -23.76 总收益: -20.60 平均盈利: -6.87 typeA: -4.58 胜率: 66.67%
趋势空且增强-L2-3-3 总交易次数: 12 盈利: 55.503421849903226 亏损: -27.176274727897624 最大盈利: 27.65 最大亏损: -13.71 总收益: 28.33 平均盈利: 2.36 typeA: 1.57 胜率: 66.67%
趋势多且增强-L3-1-3 总交易次数: 3 盈利: 24.94520787537254 亏损: -0.20000000000000004 最大盈利: 20.43 最大亏损: -0.20 总收益: 24.75 平均盈利: 8.25 typeA: 5.50 胜率: 66.67%
趋势空且增强-L-4-2-3 总交易次数: 5 盈利: 32.70659167456296 亏损: -2.3804442148186427 最大盈利: 30.76 最大亏损: -1.65 总收益: 30.33 平均盈利: 6.07 typeA: 3.64 胜率: 60.00%
趋势多且增强-L3-1-4-4 总交易次数: 5 盈利: 2.464912733088368 亏损: -24.371607341452886 最大盈利: 1.69 最大亏损: -19.41 总收益: -21.91 平均盈利: -4.38 typeA: -2.63 胜率: 60.00%
趋势多且增强-L3-1-4-3 总交易次数: 7 盈利: 6.95231355494717 亏损: -41.32851233775366 最大盈利: 2.38 最大亏损: -38.71 总收益: -34.38 平均盈利: -4.91 typeA: -2.81 胜率: 57.14%
趋势空且增强-2 总交易次数: 4 盈利: 11.750696017846352 亏损: -23.608720033712803 最大盈利: 11.52 最大亏损: -15.62 总收益: -11.86 平均盈利: -2.96 typeA: -1.48 胜率: 50.00%
趋势空且增强-L2-2-3 总交易次数: 2 盈利: 2.096245278826962 亏损: -0.6378775939059145 最大盈利: 2.10 最大亏损: -0.64 总收益: 1.46 平均盈利: 0.73 typeA: 0.36 胜率: 50.00%
趋势空且增强-11 总交易次数: 2 盈利: 21.9510657596371 亏损: -6.976074093130941 最大盈利: 21.95 最大亏损: -6.98 总收益: 14.97 平均盈利: 7.49 typeA: 3.74 胜率: 50.00%
趋势空且增强-L2-3-5 总交易次数: 5 盈利: 2.9180084496489913 亏损: -18.009235993460315 最大盈利: 1.55 最大亏损: -16.83 总收益: -15.09 平均盈利: -3.02 typeA: -1.21 胜率: 40.00%
趋势空且增强-L1-3-4-2 总交易次数: 3 盈利: 1.3797382671479241 亏损: -23.097813879490136 最大盈利: 1.38 最大亏损: -23.06 总收益: -21.72 平均盈利: -7.24 typeA: -2.41 胜率: 33.33%
趋势多且增强-L1-3-1 总交易次数: 4 盈利: 12.96866540532678 亏损: -29.865234841269285 最大盈利: 12.97 最大亏损: -24.35 总收益: -16.90 平均盈利: -4.22 typeA: -1.06 胜率: 25.00%
趋势多且增强-L1-3-9 总交易次数: 1 盈利: 0 亏损: -2.7824514715092725 最大盈利: -2.78 最大亏损: -2.78 总收益: -2.78 平均盈利: -2.78 typeA: 0.00 胜率: 0.00%
Loaded 3000 15m candles

      ========== 回测结果 ==========
      总交易次数:     88
      胜率:          70.45%
      总收益:        240.27 USDT
      期末余额:      1222.67 USDT
      盈亏比:        1.75
      最大单笔盈利:  114.24
      最大单笔亏损:  -57.31
      手续费:       35.15196977592929
      =============================
    
profit: 222.66847130341148
maxDrawdown 9.6%
startTime: 2022-03-27 00:00:00
趋势多且增强-L1-3-1 总交易次数: 1 盈利: 12.96866540532678 亏损: 0 最大盈利: 12.97 最大亏损: 12.97 总收益: 12.97 平均盈利: 12.97 typeA: 12.97 胜率: 100.00%
趋势空且增强-L2-1-3 总交易次数: 2 盈利: 19.629705439523924 亏损: 0 最大盈利: 15.15 最大亏损: 4.48 总收益: 19.63 平均盈利: 9.81 typeA: 9.81 胜率: 100.00%
趋势多且增强-L1-3-2 总交易次数: 1 盈利: 4.023657211828549 亏损: 0 最大盈利: 4.02 最大亏损: 4.02 总收益: 4.02 平均盈利: 4.02 typeA: 4.02 胜率: 100.00%
趋势多且增强-L3-1-5 总交易次数: 6 盈利: 18.249282380862482 亏损: 0 最大盈利: 5.82 最大亏损: 1.05 总收益: 18.25 平均盈利: 3.04 typeA: 3.04 胜率: 100.00%
趋势空且增强-L2-3-4 总交易次数: 4 盈利: 8.122068438748503 亏损: 0 最大盈利: 3.02 最大亏损: 0.31 总收益: 8.12 平均盈利: 2.03 typeA: 2.03 胜率: 100.00%
趋势多且增强-R-1-2-2 总交易次数: 5 盈利: 19.222525979557496 亏损: 0 最大盈利: 7.78 最大亏损: 0.79 总收益: 19.22 平均盈利: 3.84 typeA: 3.84 胜率: 100.00%
趋势空且增强-2 总交易次数: 5 盈利: 50.743907391565756 亏损: 0 最大盈利: 26.71 最大亏损: 1.40 总收益: 50.74 平均盈利: 10.15 typeA: 10.15 胜率: 100.00%
趋势空且增强-L2-2-3 总交易次数: 1 盈利: 114.24047127414063 亏损: 0 最大盈利: 114.24 最大亏损: 114.24 总收益: 114.24 平均盈利: 114.24 typeA: 114.24 胜率: 100.00%
趋势多且增强-L3-1-4-2 总交易次数: 1 盈利: 1.7623824027073605 亏损: 0 最大盈利: 1.76 最大亏损: 1.76 总收益: 1.76 平均盈利: 1.76 typeA: 1.76 胜率: 100.00%
趋势多且增强-L1-3-9 总交易次数: 1 盈利: 21.99149735597013 亏损: 0 最大盈利: 21.99 最大亏损: 21.99 总收益: 21.99 平均盈利: 21.99 typeA: 21.99 胜率: 100.00%
趋势多且增强-R-3-2 总交易次数: 1 盈利: 0.6439504783341392 亏损: 0 最大盈利: 0.64 最大亏损: 0.64 总收益: 0.64 平均盈利: 0.64 typeA: 0.64 胜率: 100.00%
趋势多且增强-R-2-1 总交易次数: 2 盈利: 6.157550025367837 亏损: 0 最大盈利: 5.47 最大亏损: 0.69 总收益: 6.16 平均盈利: 3.08 typeA: 3.08 胜率: 100.00%
趋势多且增强-R-2-2 总交易次数: 1 盈利: 4.041619328395823 亏损: 0 最大盈利: 4.04 最大亏损: 4.04 总收益: 4.04 平均盈利: 4.04 typeA: 4.04 胜率: 100.00%
趋势多且增强-R-3-1 总交易次数: 1 盈利: 9.46533273381284 亏损: 0 最大盈利: 9.47 最大亏损: 9.47 总收益: 9.47 平均盈利: 9.47 typeA: 9.47 胜率: 100.00%
趋势空且增强-L1-1-2 总交易次数: 1 盈利: 27.064954778318942 亏损: 0 最大盈利: 27.06 最大亏损: 27.06 总收益: 27.06 平均盈利: 27.06 typeA: 27.06 胜率: 100.00%
趋势多且增强-L3-1-4-4 总交易次数: 5 盈利: 5.137123620386489 亏损: -24.944401598541717 最大盈利: 2.21 最大亏损: -24.94 总收益: -19.81 平均盈利: -3.96 typeA: -3.17 胜率: 80.00%
趋势空且增强-L1-3-4-2 总交易次数: 4 盈利: 5.779411927485482 亏损: -10.671407942238384 最大盈利: 2.20 最大亏损: -10.67 总收益: -4.89 平均盈利: -1.22 typeA: -0.92 胜率: 75.00%
趋势空且增强-L2-3-5 总交易次数: 7 盈利: 60.79127226116928 亏损: -2.6773092552062505 最大盈利: 43.94 最大亏损: -1.74 总收益: 58.11 平均盈利: 8.30 typeA: 5.93 胜率: 71.43%
趋势空且增强-L2-3-3 总交易次数: 12 盈利: 14.049208787789624 亏损: -44.01916831209043 最大盈利: 4.79 最大亏损: -21.79 总收益: -29.97 平均盈利: -2.50 typeA: -1.46 胜率: 58.33%
趋势多且增强-L3-1-4-3 总交易次数: 6 盈利: 103.19370110145702 亏损: -51.6022721584188 最大盈利: 97.68 最大亏损: -32.62 总收益: 51.59 平均盈利: 8.60 typeA: 4.30 胜率: 50.00%
趋势空且增强-11 总交易次数: 4 盈利: 18.896792036899036 亏损: -11.297495613472703 最大盈利: 10.82 最大亏损: -8.97 总收益: 7.60 平均盈利: 1.90 typeA: 0.95 胜率: 50.00%
趋势多且增强-R-1-1-2 总交易次数: 7 盈利: 6.903857614004485 亏损: -31.845261243881914 最大盈利: 2.95 最大亏损: -11.03 总收益: -24.94 平均盈利: -3.56 typeA: -1.53 胜率: 42.86%
趋势多且增强-L3-1-3 总交易次数: 3 盈利: 26.816355959727165 亏损: -25.12619416646879 最大盈利: 26.82 最大亏损: -23.74 总收益: 1.69 平均盈利: 0.56 typeA: 0.19 胜率: 33.33%
趋势空且增强-L-4-2-3 总交易次数: 4 盈利: 1.8693793103447913 亏损: -12.286212650454924 最大盈利: 1.87 最大亏损: -5.07 总收益: -10.42 平均盈利: -2.60 typeA: -0.65 胜率: 25.00%
趋势多且增强-L3-1-4-1 总交易次数: 2 盈利: 0 亏损: -49.71157089003772 最大盈利: -19.20 最大亏损: -30.51 总收益: -49.71 平均盈利: -24.86 typeA: 0.00 胜率: 0.00%
趋势多且增强-L1-2-2 总交易次数: 1 盈利: 0 亏损: -57.314908109497544 最大盈利: -57.31 最大亏损: -57.31 总收益: -57.31 平均盈利: -57.31 typeA: 0.00 胜率: 0.00%
Loaded 3000 15m candles

      ========== 回测结果 ==========
      总交易次数:     93
      胜率:          72.04%
      总收益:        295.76 USDT
      期末余额:      1276.96 USDT
      盈亏比:        1.78
      最大单笔盈利:  102.09
      最大单笔亏损:  -95.74
      手续费:       37.36831840997566
      =============================
    
profit: 276.9555457499996
maxDrawdown 8.0%
startTime: 2022-04-26 00:00:00
趋势多且增强-R-1-2-2 总交易次数: 2 盈利: 8.567112282431927 亏损: 0 最大盈利: 7.78 最大亏损: 0.79 总收益: 8.57 平均盈利: 4.28 typeA: 4.28 胜率: 100.00%
趋势空且增强-11 总交易次数: 4 盈利: 28.260969747398853 亏损: 0 最大盈利: 17.67 最大亏损: 0.09 总收益: 28.26 平均盈利: 7.07 typeA: 7.07 胜率: 100.00%
趋势空且增强-L2-3-5 总交易次数: 4 盈利: 53.593232970589625 亏损: 0 最大盈利: 30.55 最大亏损: 0.52 总收益: 53.59 平均盈利: 13.40 typeA: 13.40 胜率: 100.00%
趋势多且增强-L3-1-5 总交易次数: 4 盈利: 22.664773799559477 亏损: 0 最大盈利: 13.26 最大亏损: 2.63 总收益: 22.66 平均盈利: 5.67 typeA: 5.67 胜率: 100.00%
趋势空且增强-L2-3-3 总交易次数: 10 盈利: 116.60919765674312 亏损: 0 最大盈利: 55.37 最大亏损: 0.64 总收益: 116.61 平均盈利: 11.66 typeA: 11.66 胜率: 100.00%
趋势多且增强-L3-1-4-1 总交易次数: 1 盈利: 3.841327780499718 亏损: 0 最大盈利: 3.84 最大亏损: 3.84 总收益: 3.84 平均盈利: 3.84 typeA: 3.84 胜率: 100.00%
趋势多且增强-L1-3-2 总交易次数: 1 盈利: 3.369120928157082 亏损: 0 最大盈利: 3.37 最大亏损: 3.37 总收益: 3.37 平均盈利: 3.37 typeA: 3.37 胜率: 100.00%
趋势多且增强-L3-1-3 总交易次数: 1 盈利: 1.5805877114870157 亏损: 0 最大盈利: 1.58 最大亏损: 1.58 总收益: 1.58 平均盈利: 1.58 typeA: 1.58 胜率: 100.00%
趋势多且增强-R-2-2 总交易次数: 1 盈利: 36.97171209314643 亏损: 0 最大盈利: 36.97 最大亏损: 36.97 总收益: 36.97 平均盈利: 36.97 typeA: 36.97 胜率: 100.00%
趋势多且增强-L3-1-4-3 总交易次数: 6 盈利: 13.904294731463976 亏损: -0.7436650353454088 最大盈利: 6.82 最大亏损: -0.74 总收益: 13.16 平均盈利: 2.19 typeA: 1.83 胜率: 83.33%
趋势空且增强-L2-3-4 总交易次数: 10 盈利: 130.03376197111209 亏损: -47.70148794227612 最大盈利: 102.09 最大亏损: -40.98 总收益: 82.33 平均盈利: 8.23 typeA: 6.59 胜率: 80.00%
趋势多且增强-L3-1-4-4 总交易次数: 4 盈利: 4.7015011318213284 亏损: -3.0704681394050497 最大盈利: 2.36 最大亏损: -3.07 总收益: 1.63 平均盈利: 0.41 typeA: 0.31 胜率: 75.00%
趋势多且增强-R-2-1 总交易次数: 6 盈利: 9.650956729471725 亏损: -17.287753859387475 最大盈利: 4.21 最大亏损: -11.98 总收益: -7.64 平均盈利: -1.27 typeA: -0.85 胜率: 66.67%
趋势多且增强-L3-1-4-2 总交易次数: 3 盈利: 20.34522072095514 亏损: -6.248729512704969 最大盈利: 14.79 最大亏损: -6.25 总收益: 14.10 平均盈利: 4.70 typeA: 3.13 胜率: 66.67%
趋势空且增强-L-4-2-3 总交易次数: 7 盈利: 13.393620671637255 亏损: -35.602832919778976 最大盈利: 5.29 最大亏损: -20.67 总收益: -22.21 平均盈利: -3.17 typeA: -1.81 胜率: 57.14%
趋势多且增强-R-3-1 总交易次数: 7 盈利: 24.90894963654341 亏损: -42.152557165520506 最大盈利: 17.89 最大亏损: -19.47 总收益: -17.24 平均盈利: -2.46 typeA: -1.41 胜率: 57.14%
趋势空且增强-2 总交易次数: 4 盈利: 7.1436158445587115 亏损: -24.229446673311816 最大盈利: 3.68 最大亏损: -12.34 总收益: -17.09 平均盈利: -4.27 typeA: -2.14 胜率: 50.00%
趋势多且增强-R-1-1-1 总交易次数: 2 盈利: 9.71943805063895 亏损: -1.4747905282331626 最大盈利: 9.72 最大亏损: -1.47 总收益: 8.24 平均盈利: 4.12 typeA: 2.06 胜率: 50.00%
趋势空且增强-L1-3-4-2 总交易次数: 4 盈利: 3.8277094804050558 亏损: -17.515160484798315 最大盈利: 2.03 最大亏损: -15.47 总收益: -13.69 平均盈利: -3.42 typeA: -1.71 胜率: 50.00%
趋势多且增强-R-1-1-2 总交易次数: 10 盈利: 163.8095830730661 亏损: -141.96435253943494 最大盈利: 70.43 最大亏损: -95.74 总收益: 21.85 平均盈利: 2.18 typeA: 0.87 胜率: 40.00%
趋势多且增强-L1-3-1 总交易次数: 1 盈利: 0 亏损: -21.58711438364867 最大盈利: -21.59 最大亏损: -21.59 总收益: -21.59 平均盈利: -21.59 typeA: 0.00 胜率: 0.00%
趋势多且增强-L1-3-9 总交易次数: 1 盈利: 0 亏损: -21.56278207783717 最大盈利: -21.56 最大亏损: -21.56 总收益: -21.56 平均盈利: -21.56 typeA: 0.00 胜率: 0.00%
Loaded 3000 15m candles

      ========== 回测结果 ==========
      总交易次数:     78
      胜率:          64.10%
      总收益:        79.60 USDT
      期末余额:      1064.00 USDT
      盈亏比:        1.18
      最大单笔盈利:  83.63
      最大单笔亏损:  -63.53
      手续费:       31.198258188613934
      =============================
    
profit: 64.0017979104548
maxDrawdown 16.0%
startTime: 2022-05-26 00:00:00
趋势多且增强-R-3-2 总交易次数: 3 盈利: 5.445130160498267 亏损: 0 最大盈利: 2.70 最大亏损: 0.33 总收益: 5.45 平均盈利: 1.82 typeA: 1.82 胜率: 100.00%
趋势多且增强-R-1-1-1 总交易次数: 1 盈利: 6.987304986234508 亏损: 0 最大盈利: 6.99 最大亏损: 6.99 总收益: 6.99 平均盈利: 6.99 typeA: 6.99 胜率: 100.00%
趋势空且增强-L-4-2-3 总交易次数: 5 盈利: 12.85209526642675 亏损: 0 最大盈利: 4.64 最大亏损: 0.14 总收益: 12.85 平均盈利: 2.57 typeA: 2.57 胜率: 100.00%
趋势多且增强-L3-1-4-2 总交易次数: 1 盈利: 17.25789120214908 亏损: 0 最大盈利: 17.26 最大亏损: 17.26 总收益: 17.26 平均盈利: 17.26 typeA: 17.26 胜率: 100.00%
趋势多且增强-L1-3-2 总交易次数: 1 盈利: 30.352042407234226 亏损: 0 最大盈利: 30.35 最大亏损: 30.35 总收益: 30.35 平均盈利: 30.35 typeA: 30.35 胜率: 100.00%
趋势多且增强-R-1-1-2 总交易次数: 6 盈利: 95.30029026826662 亏损: -4.581351186853308 最大盈利: 57.65 最大亏损: -4.58 总收益: 90.72 平均盈利: 15.12 typeA: 12.60 胜率: 83.33%
趋势多且增强-R-3-1 总交易次数: 3 盈利: 20.867825331463187 亏损: -3.0658762214983453 最大盈利: 19.70 最大亏损: -3.07 总收益: 17.80 平均盈利: 5.93 typeA: 3.96 胜率: 66.67%
趋势空且增强-L2-3-3 总交易次数: 12 盈利: 160.42609579716958 亏损: -99.27720272417305 最大盈利: 83.63 最大亏损: -63.53 总收益: 61.15 平均盈利: 5.10 typeA: 3.40 胜率: 66.67%
趋势多且增强-L3-1-3 总交易次数: 3 盈利: 1.0009951670572395 亏损: -8.914016364283128 最大盈利: 0.70 最大亏损: -8.91 总收益: -7.91 平均盈利: -2.64 typeA: -1.76 胜率: 66.67%
趋势空且增强-L1-3-4-2 总交易次数: 6 盈利: 32.199707636830695 亏损: -35.76847201381619 最大盈利: 13.33 最大亏损: -22.32 总收益: -3.57 平均盈利: -0.59 typeA: -0.40 胜率: 66.67%
趋势多且增强-L3-1-4-4 总交易次数: 9 盈利: 34.75861592681963 亏损: -63.30224048542244 最大盈利: 13.62 最大亏损: -60.90 总收益: -28.54 平均盈利: -3.17 typeA: -2.11 胜率: 66.67%
趋势空且增强-L2-3-5 总交易次数: 3 盈利: 3.325379026648131 亏损: -2.2064192577734123 最大盈利: 2.21 最大亏损: -2.21 总收益: 1.12 平均盈利: 0.37 typeA: 0.25 胜率: 66.67%
趋势多且增强-R-2-2 总交易次数: 2 盈利: 36.97171209314643 亏损: -11.14088282306654 最大盈利: 36.97 最大亏损: -11.14 总收益: 25.83 平均盈利: 12.92 typeA: 6.46 胜率: 50.00%
趋势多且增强-L3-1-4-3 总交易次数: 4 盈利: 19.126037136165976 亏损: -86.09031629096796 最大盈利: 17.65 最大亏损: -48.04 总收益: -66.96 平均盈利: -16.74 typeA: -8.37 胜率: 50.00%
趋势多且增强-L3-1-5 总交易次数: 4 盈利: 2.682034774667307 亏损: -7.518808244091424 最大盈利: 1.90 最大亏损: -4.70 总收益: -4.84 平均盈利: -1.21 typeA: -0.60 胜率: 50.00%
趋势多且增强-L1-3-1 总交易次数: 2 盈利: 29.51251303441078 亏损: -15.612057387057343 最大盈利: 29.51 最大亏损: -15.61 总收益: 13.90 平均盈利: 6.95 typeA: 3.48 胜率: 50.00%
趋势多且增强-R-2-1 总交易次数: 5 盈利: 0.9441261737225957 亏损: -51.02015906010246 最大盈利: 0.55 最大亏损: -20.37 总收益: -50.08 平均盈利: -10.02 typeA: -4.01 胜率: 40.00%
趋势空且增强-L2-3-4 总交易次数: 3 盈利: 9.130565209438512 亏损: -7.664546422602998 最大盈利: 9.13 最大亏损: -4.75 总收益: 1.47 平均盈利: 0.49 typeA: 0.16 胜率: 33.33%
趋势空且增强-11 总交易次数: 3 盈利: 14.5774494556764 亏损: -12.601031384480237 最大盈利: 14.58 最大亏损: -8.16 总收益: 1.98 平均盈利: 0.66 typeA: 0.22 胜率: 33.33%
趋势多且增强-R-1-2-2 总交易次数: 1 盈利: 0 亏损: -15.723960113960024 最大盈利: -15.72 最大亏损: -15.72 总收益: -15.72 平均盈利: -15.72 typeA: 0.00 胜率: 0.00%
趋势空且增强-L2-2-3 总交易次数: 1 盈利: 0 亏损: -29.628673163418327 最大盈利: -29.63 最大亏损: -29.63 总收益: -29.63 平均盈利: -29.63 typeA: 0.00 胜率: 0.00%
Loaded 3000 15m candles

      ========== 回测结果 ==========
      总交易次数:     77
      胜率:          59.74%
      总收益:        25.05 USDT
      期末余额:      1009.65 USDT
      盈亏比:        1.07
      最大单笔盈利:  44.73
      最大单笔亏损:  -40.23
      手续费:       30.751128367341455
      =============================
    
profit: 9.648658836769641
maxDrawdown 8.4%
startTime: 2022-06-25 00:00:00
趋势多且增强-L3-1-5 总交易次数: 5 盈利: 16.455556686353123 亏损: 0 最大盈利: 4.19 最大亏损: 2.38 总收益: 16.46 平均盈利: 3.29 typeA: 3.29 胜率: 100.00%
趋势多且增强-R-3-2 总交易次数: 2 盈利: 3.0676784675621205 亏损: 0 最大盈利: 1.77 最大亏损: 1.30 总收益: 3.07 平均盈利: 1.53 typeA: 1.53 胜率: 100.00%
趋势多且增强-R-2-2 总交易次数: 1 盈利: 4.221195486428768 亏损: 0 最大盈利: 4.22 最大亏损: 4.22 总收益: 4.22 平均盈利: 4.22 typeA: 4.22 胜率: 100.00%
趋势空且增强-L1-3-4-2 总交易次数: 2 盈利: 14.537211051432006 亏损: 0 最大盈利: 9.16 最大亏损: 5.38 总收益: 14.54 平均盈利: 7.27 typeA: 7.27 胜率: 100.00%
趋势空且增强-L2-3-5 总交易次数: 3 盈利: 27.313164161382883 亏损: 0 最大盈利: 24.80 最大亏损: 1.18 总收益: 27.31 平均盈利: 9.10 typeA: 9.10 胜率: 100.00%
趋势空且增强-L-4-2-3 总交易次数: 4 盈利: 6.417237707555659 亏损: -2.2373635966826892 最大盈利: 3.61 最大亏损: -2.24 总收益: 4.18 平均盈利: 1.04 typeA: 0.78 胜率: 75.00%
趋势空且增强-11 总交易次数: 4 盈利: 70.32136921188395 亏损: -1.6933311214333082 最大盈利: 44.73 最大亏损: -1.69 总收益: 68.63 平均盈利: 17.16 typeA: 12.87 胜率: 75.00%
趋势多且增强-R-2-1 总交易次数: 4 盈利: 13.024182724827373 亏损: -14.05861386138605 最大盈利: 5.26 最大亏损: -14.06 总收益: -1.03 平均盈利: -0.26 typeA: -0.19 胜率: 75.00%
趋势多且增强-L3-1-4-3 总交易次数: 4 盈利: 31.02811671670062 亏损: -0.6355161899230761 最大盈利: 28.89 最大亏损: -0.64 总收益: 30.39 平均盈利: 7.60 typeA: 5.70 胜率: 75.00%
趋势多且增强-R-3-1 总交易次数: 5 盈利: 23.020945475250528 亏损: -15.38381361973139 最大盈利: 18.26 最大亏损: -12.51 总收益: 7.64 平均盈利: 1.53 typeA: 0.92 胜率: 60.00%
趋势空且增强-L2-3-3 总交易次数: 7 盈利: 58.84638342027189 亏损: -39.44850301400163 最大盈利: 41.22 最大亏损: -33.75 总收益: 19.40 平均盈利: 2.77 typeA: 1.58 胜率: 57.14%
趋势空且增强-L2-3-4 总交易次数: 11 盈利: 55.27872096822532 亏损: -40.53858126023458 最大盈利: 28.08 最大亏损: -20.86 总收益: 14.74 平均盈利: 1.34 typeA: 0.73 胜率: 54.55%
趋势多且增强-R-1-1-2 总交易次数: 4 盈利: 11.038243348200549 亏损: -22.100681303571122 最大盈利: 10.77 最大亏损: -16.37 总收益: -11.06 平均盈利: -2.77 typeA: -1.38 胜率: 50.00%
趋势多且增强-L3-1-3 总交易次数: 5 盈利: 3.640673369223157 亏损: -43.75855342184793 最大盈利: 3.40 最大亏损: -40.23 总收益: -40.12 平均盈利: -8.02 typeA: -3.21 胜率: 40.00%
趋势多且增强-L1-3-2 总交易次数: 3 盈利: 16.76063176367371 亏损: -17.93446647701223 最大盈利: 16.76 最大亏损: -14.28 总收益: -1.17 平均盈利: -0.39 typeA: -0.13 胜率: 33.33%
趋势多且增强-L3-1-4-4 总交易次数: 10 盈利: 13.712786422624685 亏损: -108.25700948633198 最大盈利: 12.92 最大亏损: -27.15 总收益: -94.54 平均盈利: -9.45 typeA: -2.84 胜率: 30.00%
趋势多且增强-L1-3-1 总交易次数: 1 盈利: 0 亏损: -10.618811747191677 最大盈利: -10.62 最大亏损: -10.62 总收益: -10.62 平均盈利: -10.62 typeA: 0.00 胜率: 0.00%
趋势空且增强-L2-2-3 总交易次数: 1 盈利: 0 亏损: -12.788856485034556 最大盈利: -12.79 最大亏损: -12.79 总收益: -12.79 平均盈利: -12.79 typeA: 0.00 胜率: 0.00%
趋势多且增强-L1-2-1 总交易次数: 1 盈利: 0 亏损: -14.181336560441027 最大盈利: -14.18 最大亏损: -14.18 总收益: -14.18 平均盈利: -14.18 typeA: 0.00 胜率: 0.00%
Loaded 3000 15m candles

      ========== 回测结果 ==========
      总交易次数:     63
      胜率:          57.14%
      总收益:        10.63 USDT
      期末余额:      998.03 USDT
      盈亏比:        1.04
      最大单笔盈利:  38.20
      最大单笔亏损:  -35.73
      手续费:       25.203151295030935
      =============================
    
profit: -1.970804339762708
maxDrawdown 12.5%
startTime: 2022-07-25 00:00:00
趋势空且增强-L-4-2-3 总交易次数: 2 盈利: 4.624722510316792 亏损: 0 最大盈利: 4.53 最大亏损: 0.10 总收益: 4.62 平均盈利: 2.31 typeA: 2.31 胜率: 100.00%
趋势空且增强-L2-3-4 总交易次数: 6 盈利: 19.557075082994125 亏损: -0.05577505407359595 最大盈利: 5.66 最大亏损: -0.06 总收益: 19.50 平均盈利: 3.25 typeA: 2.71 胜率: 83.33%
趋势多且增强-L3-1-4-4 总交易次数: 5 盈利: 70.60351362476415 亏损: -16.218980126328752 最大盈利: 38.20 最大亏损: -16.22 总收益: 54.38 平均盈利: 10.88 typeA: 8.70 胜率: 80.00%
趋势空且增强-L2-3-5 总交易次数: 4 盈利: 2.5965362763127486 亏损: -11.291585127201612 最大盈利: 1.33 最大亏损: -11.29 总收益: -8.70 平均盈利: -2.17 typeA: -1.63 胜率: 75.00%
趋势空且增强-11 总交易次数: 4 盈利: 23.157414891637195 亏损: -0.2 最大盈利: 13.28 最大亏损: -0.20 总收益: 22.96 平均盈利: 5.74 typeA: 4.30 胜率: 75.00%
趋势多且增强-R-2-1 总交易次数: 6 盈利: 70.04449891328177 亏损: -14.096071185398468 最大盈利: 29.94 最大亏损: -14.06 总收益: 55.95 平均盈利: 9.32 typeA: 6.22 胜率: 66.67%
趋势多且增强-R-3-1 总交易次数: 3 盈利: 25.40289138633034 亏损: -3.7551317278163565 最大盈利: 18.26 最大亏损: -3.76 总收益: 21.65 平均盈利: 7.22 typeA: 4.81 胜率: 66.67%
趋势空且增强-L2-3-3 总交易次数: 5 盈利: 14.009304702023181 亏损: -30.834825194288175 最大盈利: 8.46 最大亏损: -16.67 总收益: -16.83 平均盈利: -3.37 typeA: -2.02 胜率: 60.00%
趋势多且增强-R-1-1-2 总交易次数: 2 盈利: 0.8853908188585705 亏损: -13.27953950811095 最大盈利: 0.89 最大亏损: -13.28 总收益: -12.39 平均盈利: -6.20 typeA: -3.10 胜率: 50.00%
趋势多且增强-L3-1-5 总交易次数: 4 盈利: 26.193969579949275 亏损: -36.07812097444576 最大盈利: 24.36 最大亏损: -35.73 总收益: -9.88 平均盈利: -2.47 typeA: -1.24 胜率: 50.00%
趋势多且增强-L3-1-4-3 总交易次数: 4 盈利: 13.435010791633507 亏损: -8.85750564066814 最大盈利: 9.76 最大亏损: -5.80 总收益: 4.58 平均盈利: 1.14 typeA: 0.57 胜率: 50.00%
趋势多且增强-R-2-2 总交易次数: 2 盈利: 5.642512783053289 亏损: -27.705181623931708 最大盈利: 5.64 最大亏损: -27.71 总收益: -22.06 平均盈利: -11.03 typeA: -5.52 胜率: 50.00%
趋势多且增强-L3-1-3 总交易次数: 5 盈利: 4.628417687434622 亏损: -60.337914175250134 最大盈利: 3.70 最大亏损: -32.29 总收益: -55.71 平均盈利: -11.14 typeA: -4.46 胜率: 40.00%
趋势空且增强-L1-3-4-2 总交易次数: 6 盈利: 5.043423835292305 亏损: -28.26760843562726 最大盈利: 3.29 最大亏损: -16.30 总收益: -23.22 平均盈利: -3.87 typeA: -1.29 胜率: 33.33%
趋势多且增强-L1-3-2 总交易次数: 1 盈利: 0 亏损: -2.7478339079598784 最大盈利: -2.75 最大亏损: -2.75 总收益: -2.75 平均盈利: -2.75 typeA: 0.00 胜率: 0.00%
趋势多且增强-L3-1-4-2 总交易次数: 2 盈利: 0 亏损: -15.284408585014827 最大盈利: -7.30 最大亏损: -7.99 总收益: -15.28 平均盈利: -7.64 typeA: 0.00 胜率: 0.00%
趋势多且增强-L1-3-1 总交易次数: 1 盈利: 0 亏损: -5.560101580135516 最大盈利: -5.56 最大亏损: -5.56 总收益: -5.56 平均盈利: -5.56 typeA: 0.00 胜率: 0.00%
趋势多且增强-R-3-2 总交易次数: 1 盈利: 0 亏损: -0.624904377390597 最大盈利: -0.62 最大亏损: -0.62 总收益: -0.62 平均盈利: -0.62 typeA: 0.00 胜率: 0.00%
Loaded 3000 15m candles

      ========== 回测结果 ==========
      总交易次数:     55
      胜率:          60.00%
      总收益:        61.38 USDT
      期末余额:      1050.18 USDT
      盈亏比:        1.39
      最大单笔盈利:  18.22
      最大单笔亏损:  -22.03
      手续费:       22.188235365112362
      =============================
    
profit: 50.17812693236738
maxDrawdown 6.3%
startTime: 2022-08-24 00:00:00
趋势空且增强-11 总交易次数: 1 盈利: 10.769935483870968 亏损: 0 最大盈利: 10.77 最大亏损: 10.77 总收益: 10.77 平均盈利: 10.77 typeA: 10.77 胜率: 100.00%
趋势多且增强-R-2-1 总交易次数: 1 盈利: 5.50662100456626 亏损: 0 最大盈利: 5.51 最大亏损: 5.51 总收益: 5.51 平均盈利: 5.51 typeA: 5.51 胜率: 100.00%
趋势多且增强-L3-1-3 总交易次数: 1 盈利: 0.27791586998091533 亏损: 0 最大盈利: 0.28 最大亏损: 0.28 总收益: 0.28 平均盈利: 0.28 typeA: 0.28 胜率: 100.00%
趋势多且增强-L3-1-4-2 总交易次数: 1 盈利: 5.041207307386766 亏损: 0 最大盈利: 5.04 最大亏损: 5.04 总收益: 5.04 平均盈利: 5.04 typeA: 5.04 胜率: 100.00%
趋势多且增强-R-3-2 总交易次数: 2 盈利: 24.44440860235597 亏损: 0 最大盈利: 12.60 最大亏损: 11.84 总收益: 24.44 平均盈利: 12.22 typeA: 12.22 胜率: 100.00%
趋势空且增强-L2-3-5 总交易次数: 1 盈利: 17.955445544554518 亏损: 0 最大盈利: 17.96 最大亏损: 17.96 总收益: 17.96 平均盈利: 17.96 typeA: 17.96 胜率: 100.00%
趋势多且增强-L3-1-5 总交易次数: 9 盈利: 24.855150344140753 亏损: -3.744647386144583 最大盈利: 7.43 最大亏损: -2.76 总收益: 21.11 平均盈利: 2.35 typeA: 1.82 胜率: 77.78%
趋势空且增强-L1-3-4-2 总交易次数: 4 盈利: 14.085652651742699 亏损: -20.71093697899303 最大盈利: 6.85 最大亏损: -20.71 总收益: -6.63 平均盈利: -1.66 typeA: -1.24 胜率: 75.00%
趋势空且增强-L2-3-3 总交易次数: 14 盈利: 65.29503393942684 亏损: -16.87248081979838 最大盈利: 18.22 最大亏损: -5.72 总收益: 48.42 平均盈利: 3.46 typeA: 2.22 胜率: 64.29%
趋势空且增强-L2-3-4 总交易次数: 4 盈利: 18.982680606139542 亏损: -28.697443105472864 最大盈利: 15.73 最大亏损: -22.03 总收益: -9.71 平均盈利: -2.43 typeA: -1.21 胜率: 50.00%
趋势多且增强-L3-1-4-4 总交易次数: 7 盈利: 20.60266889290206 亏损: -28.647454816498218 最大盈利: 18.07 最大亏损: -9.96 总收益: -8.04 平均盈利: -1.15 typeA: -0.49 胜率: 42.86%
趋势多且增强-R-3-1 总交易次数: 6 盈利: 12.48841071061259 亏损: -37.59498343180795 最大盈利: 9.12 最大亏损: -20.45 总收益: -25.11 平均盈利: -4.18 typeA: -1.39 胜率: 33.33%
趋势多且增强-L3-1-4-3 总交易次数: 1 盈利: 0 亏损: -13.547889750215337 最大盈利: -13.55 最大亏损: -13.55 总收益: -13.55 平均盈利: -13.55 typeA: 0.00 胜率: 0.00%
趋势多且增强-L1-3-2 总交易次数: 1 盈利: 0 亏损: -3.3090343698854774 最大盈利: -3.31 最大亏损: -3.31 总收益: -3.31 平均盈利: -3.31 typeA: 0.00 胜率: 0.00%
趋势多且增强-L1-3-1 总交易次数: 1 盈利: 0 亏损: -1.7754806177119895 最大盈利: -1.78 最大亏损: -1.78 总收益: -1.78 平均盈利: -1.78 typeA: 0.00 胜率: 0.00%
趋势多且增强-R-1-2-2 总交易次数: 1 盈利: 0 亏损: -4.02665274878227 最大盈利: -4.03 最大亏损: -4.03 总收益: -4.03 平均盈利: -4.03 typeA: 0.00 胜率: 0.00%
Loaded 3000 15m candles

      ========== 回测结果 ==========
      总交易次数:     50
      胜率:          62.00%
      总收益:        58.18 USDT
      期末余额:      1048.18 USDT
      盈亏比:        1.48
      最大单笔盈利:  58.96
      最大单笔亏损:  -63.36
      手续费:       20.035210079450938
      =============================
    
profit: 48.17727200164836
maxDrawdown 6.8%
startTime: 2022-09-23 00:00:00
趋势空且增强-11 总交易次数: 2 盈利: 9.547678842050786 亏损: 0 最大盈利: 7.44 最大亏损: 2.10 总收益: 9.55 平均盈利: 4.77 typeA: 4.77 胜率: 100.00%
趋势多且增强-R-3-1 总交易次数: 7 盈利: 55.358026295306104 亏损: 0 最大盈利: 22.64 最大亏损: 0.48 总收益: 55.36 平均盈利: 7.91 typeA: 7.91 胜率: 100.00%
趋势空且增强-L2-2-3 总交易次数: 2 盈利: 13.477301489537588 亏损: 0 最大盈利: 8.98 最大亏损: 4.49 总收益: 13.48 平均盈利: 6.74 typeA: 6.74 胜率: 100.00%
趋势多且增强-L3-1-5 总交易次数: 2 盈利: 3.7807583358096064 亏损: 0 最大盈利: 3.14 最大亏损: 0.64 总收益: 3.78 平均盈利: 1.89 typeA: 1.89 胜率: 100.00%
趋势多且增强-L3-1-4-4 总交易次数: 10 盈利: 64.06319312007409 亏损: -8.343362677922887 最大盈利: 58.96 最大亏损: -7.10 总收益: 55.72 平均盈利: 5.57 typeA: 3.90 胜率: 70.00%
趋势空且增强-L2-3-4 总交易次数: 7 盈利: 10.400295251992178 亏损: -18.028865786706255 最大盈利: 6.29 最大亏损: -8.43 总收益: -7.63 平均盈利: -1.09 typeA: -0.62 胜率: 57.14%
趋势空且增强-L2-3-3 总交易次数: 6 盈利: 5.256710594998982 亏损: -5.465285161331579 最大盈利: 3.28 最大亏损: -2.42 总收益: -0.21 平均盈利: -0.03 typeA: -0.02 胜率: 50.00%
趋势多且增强-L3-1-3 总交易次数: 6 盈利: 8.411906943130882 亏损: -6.478325868560545 最大盈利: 7.34 最大亏损: -2.95 总收益: 1.93 平均盈利: 0.32 typeA: 0.16 胜率: 50.00%
趋势多且增强-R-3-2 总交易次数: 2 盈利: 8.02292150902918 亏损: -0.6863628993027768 最大盈利: 8.02 最大亏损: -0.69 总收益: 7.34 平均盈利: 3.67 typeA: 1.83 胜率: 50.00%
趋势空且增强-L1-3-4-2 总交易次数: 1 盈利: 0 亏损: -3.8486280729580966 最大盈利: -3.85 最大亏损: -3.85 总收益: -3.85 平均盈利: -3.85 typeA: 0.00 胜率: 0.00%
趋势多且增强-L3-1-4-3 总交易次数: 1 盈利: 0 亏损: -5.308919170021632 最大盈利: -5.31 最大亏损: -5.31 总收益: -5.31 平均盈利: -5.31 typeA: 0.00 胜率: 0.00%
趋势空且增强-L2-3-5 总交易次数: 3 盈利: 0 亏损: -69.46894853594017 最大盈利: -2.21 最大亏损: -63.36 总收益: -69.47 平均盈利: -23.16 typeA: 0.00 胜率: 0.00%
趋势多且增强-L1-3-2 总交易次数: 1 盈利: 0 亏损: -2.5128222075346054 最大盈利: -2.51 最大亏损: -2.51 总收益: -2.51 平均盈利: -2.51 typeA: 0.00 胜率: 0.00%
Loaded 3000 15m candles

      ========== 回测结果 ==========
      总交易次数:     86
      胜率:          70.93%
      总收益:        419.73 USDT
      期末余额:      1402.33 USDT
      盈亏比:        2.04
      最大单笔盈利:  168.96
      最大单笔亏损:  -78.51
      手续费:       34.631014158357274
      =============================
    
profit: 402.331907147528
maxDrawdown 6.8%
startTime: 2022-10-23 00:00:00
趋势多且增强-L1-3-1 总交易次数: 1 盈利: 168.95961188599134 亏损: 0 最大盈利: 168.96 最大亏损: 168.96 总收益: 168.96 平均盈利: 168.96 typeA: 168.96 胜率: 100.00%
趋势空且增强-L1-1-2 总交易次数: 2 盈利: 28.62394392044088 亏损: 0 最大盈利: 22.76 最大亏损: 5.86 总收益: 28.62 平均盈利: 14.31 typeA: 14.31 胜率: 100.00%
趋势空且增强-2 总交易次数: 4 盈利: 33.048678709387225 亏损: 0 最大盈利: 13.00 最大亏损: 1.88 总收益: 33.05 平均盈利: 8.26 typeA: 8.26 胜率: 100.00%
趋势多且增强-R-1-2-2 总交易次数: 2 盈利: 1.7502936319810696 亏损: 0 最大盈利: 1.55 最大亏损: 0.20 总收益: 1.75 平均盈利: 0.88 typeA: 0.88 胜率: 100.00%
趋势多且增强-L3-1-4-3 总交易次数: 2 盈利: 11.824132575450498 亏损: 0 最大盈利: 10.32 最大亏损: 1.50 总收益: 11.82 平均盈利: 5.91 typeA: 5.91 胜率: 100.00%
趋势空且增强-L2-3-4 总交易次数: 2 盈利: 7.066795481594477 亏损: 0 最大盈利: 5.73 最大亏损: 1.33 总收益: 7.07 平均盈利: 3.53 typeA: 3.53 胜率: 100.00%
趋势空且增强-11 总交易次数: 3 盈利: 63.48257018093344 亏损: 0 最大盈利: 23.18 最大亏损: 19.91 总收益: 63.48 平均盈利: 21.16 typeA: 21.16 胜率: 100.00%
趋势空且增强-L-4-2-3 总交易次数: 2 盈利: 9.673923292550526 亏损: 0 最大盈利: 5.39 最大亏损: 4.28 总收益: 9.67 平均盈利: 4.84 typeA: 4.84 胜率: 100.00%
趋势多且增强-R-2-2 总交易次数: 1 盈利: 8.508606344253822 亏损: 0 最大盈利: 8.51 最大亏损: 8.51 总收益: 8.51 平均盈利: 8.51 typeA: 8.51 胜率: 100.00%
趋势空且增强-L2-3-3 总交易次数: 9 盈利: 50.97609644752787 亏损: -29.482841140529484 最大盈利: 19.94 最大亏损: -29.48 总收益: 21.49 平均盈利: 2.39 typeA: 2.12 胜率: 88.89%
趋势空且增强-L2-3-5 总交易次数: 7 盈利: 19.402648369051292 亏损: -0.19999999999999998 最大盈利: 6.76 最大亏损: -0.20 总收益: 19.20 平均盈利: 2.74 typeA: 2.35 胜率: 85.71%
趋势多且增强-R-1-1-2 总交易次数: 6 盈利: 131.15253724747427 亏损: -41.980429233242006 最大盈利: 87.79 最大亏损: -41.98 总收益: 89.17 平均盈利: 14.86 typeA: 12.38 胜率: 83.33%
趋势多且增强-L3-1-4-1 总交易次数: 5 盈利: 72.6413414114149 亏损: -17.12250686184823 最大盈利: 49.16 最大亏损: -17.12 总收益: 55.52 平均盈利: 11.10 typeA: 8.88 胜率: 80.00%
趋势空且增强-L2-1-3 总交易次数: 3 盈利: 21.598836753672472 亏损: -67.36892458100556 最大盈利: 10.88 最大亏损: -67.37 总收益: -45.77 平均盈利: -15.26 typeA: -10.17 胜率: 66.67%
趋势多且增强-L1-1-6 总交易次数: 5 盈利: 110.77422267489585 亏损: -39.480928280919876 最大盈利: 71.28 最大亏损: -24.89 总收益: 71.29 平均盈利: 14.26 typeA: 8.56 胜率: 60.00%
趋势多且增强-L3-1-5 总交易次数: 8 盈利: 23.095459731573555 亏损: -17.695476058302496 最大盈利: 13.32 最大亏损: -12.03 总收益: 5.40 平均盈利: 0.67 typeA: 0.34 胜率: 50.00%
趋势多且增强-R-1-1-1 总交易次数: 2 盈利: 13.79836653054422 亏损: -5.709045826063029 最大盈利: 13.80 最大亏损: -5.71 总收益: 8.09 平均盈利: 4.04 typeA: 2.02 胜率: 50.00%
趋势空且增强-L1-3-4-2 总交易次数: 2 盈利: 2.3104848830577502 亏损: -4.957958344047253 最大盈利: 2.31 最大亏损: -4.96 总收益: -2.65 平均盈利: -1.32 typeA: -0.66 胜率: 50.00%
趋势多且增强-R-3-1 总交易次数: 2 盈利: 4.084157688540684 亏损: -3.587568641196385 最大盈利: 4.08 最大亏损: -3.59 总收益: 0.50 平均盈利: 0.25 typeA: 0.12 胜率: 50.00%
趋势多且增强-R-3-2 总交易次数: 2 盈利: 2.8281675921250655 亏损: -0.57250372578227 最大盈利: 2.83 最大亏损: -0.57 总收益: 2.26 平均盈利: 1.13 typeA: 0.56 胜率: 50.00%
趋势多且增强-L3-1-4-4 总交易次数: 11 盈利: 7.072079870276624 亏损: -50.75164987455402 最大盈利: 4.57 最大亏损: -33.57 总收益: -43.68 平均盈利: -3.97 typeA: -1.80 胜率: 45.45%
趋势多且增强-L3-1-3 总交易次数: 3 盈利: 31.212028725314145 亏损: -85.50037250742584 最大盈利: 31.21 最大亏损: -78.51 总收益: -54.29 平均盈利: -18.10 typeA: -6.03 胜率: 33.33%
趋势多且增强-L1-2-2 总交易次数: 1 盈利: 0 亏损: -31.54508108108114 最大盈利: -31.55 最大亏损: -31.55 总收益: -31.55 平均盈利: -31.55 typeA: 0.00 胜率: 0.00%
趋势多且增强-L3-1-4-2 总交易次数: 1 盈利: 0 亏损: -8.197790644522287 最大盈利: -8.20 最大亏损: -8.20 总收益: -8.20 平均盈利: -8.20 typeA: 0.00 胜率: 0.00%
Loaded 3000 15m candles

      ========== 回测结果 ==========
      总交易次数:     86
      胜率:          60.47%
      总收益:        -14.63 USDT
      期末余额:      968.17 USDT
      盈亏比:        0.97
      最大单笔盈利:  63.39
      最大单笔亏损:  -66.89
      手续费:       34.37523065568542
      =============================
    
profit: -31.826165230082097
maxDrawdown 18.7%
startTime: 2022-11-22 00:00:00
趋势多且增强-L1-2-1 总交易次数: 1 盈利: 24.78067621776506 亏损: 0 最大盈利: 24.78 最大亏损: 24.78 总收益: 24.78 平均盈利: 24.78 typeA: 24.78 胜率: 100.00%
趋势空且增强-L2-3-5 总交易次数: 3 盈利: 104.00964994605617 亏损: 0 最大盈利: 63.39 最大亏损: 2.77 总收益: 104.01 平均盈利: 34.67 typeA: 34.67 胜率: 100.00%
趋势多且增强-R-1-1-1 总交易次数: 1 盈利: 44.31335667833926 亏损: 0 最大盈利: 44.31 最大亏损: 44.31 总收益: 44.31 平均盈利: 44.31 typeA: 44.31 胜率: 100.00%
趋势空且增强-2 总交易次数: 1 盈利: 0.8422697991663415 亏损: 0 最大盈利: 0.84 最大亏损: 0.84 总收益: 0.84 平均盈利: 0.84 typeA: 0.84 胜率: 100.00%
趋势多且增强-R-3-2 总交易次数: 1 盈利: 11.279711174242408 亏损: 0 最大盈利: 11.28 最大亏损: 11.28 总收益: 11.28 平均盈利: 11.28 typeA: 11.28 胜率: 100.00%
趋势多且增强-R-2-2 总交易次数: 3 盈利: 37.100455080824815 亏损: 0 最大盈利: 20.26 最大亏损: 1.42 总收益: 37.10 平均盈利: 12.37 typeA: 12.37 胜率: 100.00%
趋势空且增强-11 总交易次数: 6 盈利: 58.13848755271438 亏损: -10.88222440461571 最大盈利: 23.50 最大亏损: -10.88 总收益: 47.26 平均盈利: 7.88 typeA: 6.56 胜率: 83.33%
趋势多且增强-R-3-1 总交易次数: 5 盈利: 25.61397526053205 亏损: -4.840365999204391 最大盈利: 13.26 最大亏损: -4.84 总收益: 20.77 平均盈利: 4.15 typeA: 3.32 胜率: 80.00%
趋势多且增强-L3-1-4-3 总交易次数: 7 盈利: 39.1128540352519 亏损: -58.32454054871668 最大盈利: 19.13 最大亏损: -50.82 总收益: -19.21 平均盈利: -2.74 typeA: -1.96 胜率: 71.43%
趋势空且增强-L1-3-4-2 总交易次数: 6 盈利: 18.328103013051955 亏损: -63.762990212547855 最大盈利: 9.11 最大亏损: -58.81 总收益: -45.43 平均盈利: -7.57 typeA: -5.05 胜率: 66.67%
趋势空且增强-L-4-2-3 总交易次数: 5 盈利: 8.751553263114298 亏损: -12.362922006435829 最大盈利: 4.28 最大亏损: -11.87 总收益: -3.61 平均盈利: -0.72 typeA: -0.43 胜率: 60.00%
趋势空且增强-L2-3-3 总交易次数: 13 盈利: 23.5673283424133 亏损: -38.02223970700048 最大盈利: 5.86 最大亏损: -20.91 总收益: -14.45 平均盈利: -1.11 typeA: -0.60 胜率: 53.85%
趋势多且增强-L3-1-5 总交易次数: 6 盈利: 8.652478851058994 亏损: -21.441854654841013 最大盈利: 5.79 最大亏损: -16.05 总收益: -12.79 平均盈利: -2.13 typeA: -1.07 胜率: 50.00%
趋势多且增强-L3-1-4-2 总交易次数: 2 盈利: 3.723776300010893 亏损: -66.89268004722545 最大盈利: 3.72 最大亏损: -66.89 总收益: -63.17 平均盈利: -31.58 typeA: -15.79 胜率: 50.00%
趋势空且增强-L2-3-4 总交易次数: 8 盈利: 11.340994533154822 亏损: -45.13747704118549 最大盈利: 4.57 最大亏损: -22.94 总收益: -33.80 平均盈利: -4.22 typeA: -2.11 胜率: 50.00%
趋势多且增强-L3-1-4-4 总交易次数: 10 盈利: 17.280375178870464 亏损: -56.29653199526811 最大盈利: 10.02 最大亏损: -21.97 总收益: -39.02 平均盈利: -3.90 typeA: -1.95 胜率: 50.00%
趋势多且增强-R-2-1 总交易次数: 4 盈利: 0.22203461376106343 亏损: -31.2087773517473 最大盈利: 0.22 最大亏损: -29.31 总收益: -30.99 平均盈利: -7.75 typeA: -1.94 胜率: 25.00%
趋势多且增强-L1-3-1 总交易次数: 2 盈利: 0 亏损: -18.349070011198954 最大盈利: -6.48 最大亏损: -11.87 总收益: -18.35 平均盈利: -9.17 typeA: 0.00 胜率: 0.00%
趋势多且增强-L3-1-4-1 总交易次数: 1 盈利: 0 亏损: -19.06772878141304 最大盈利: -19.07 最大亏损: -19.07 总收益: -19.07 平均盈利: -19.07 typeA: 0.00 胜率: 0.00%
趋势多且增强-R-1-1-2 总交易次数: 1 盈利: 0 亏损: -5.094842309006031 最大盈利: -5.09 最大亏损: -5.09 总收益: -5.09 平均盈利: -5.09 typeA: 0.00 胜率: 0.00%
Loaded 3000 15m candles

      ========== 回测结果 ==========
      总交易次数:     81
      胜率:          67.90%
      总收益:        208.69 USDT
      期末余额:      1192.49 USDT
      盈亏比:        2.04
      最大单笔盈利:  34.96
      最大单笔亏损:  -57.08
      手续费:       32.41812994745097
      =============================
    
profit: 192.49054226627868
maxDrawdown 6.0%
startTime: 2022-12-22 00:00:00
趋势空且增强-L2-3-4 总交易次数: 8 盈利: 48.3239920168635 亏损: 0 最大盈利: 34.96 最大亏损: 0.66 总收益: 48.32 平均盈利: 6.04 typeA: 6.04 胜率: 100.00%
趋势空且增强-L-4-2-3 总交易次数: 2 盈利: 34.3816842199081 亏损: 0 最大盈利: 33.71 最大亏损: 0.68 总收益: 34.38 平均盈利: 17.19 typeA: 17.19 胜率: 100.00%
趋势空且增强-11 总交易次数: 1 盈利: 28.889387464387394 亏损: 0 最大盈利: 28.89 最大亏损: 28.89 总收益: 28.89 平均盈利: 28.89 typeA: 28.89 胜率: 100.00%
趋势多且增强-R-2-1 总交易次数: 1 盈利: 8.632375264402167 亏损: 0 最大盈利: 8.63 最大亏损: 8.63 总收益: 8.63 平均盈利: 8.63 typeA: 8.63 胜率: 100.00%
趋势多且增强-L3-1-5 总交易次数: 10 盈利: 50.66248921924846 亏损: -0.7198492135707575 最大盈利: 20.74 最大亏损: -0.72 总收益: 49.94 平均盈利: 4.99 typeA: 4.49 胜率: 90.00%
趋势多且增强-R-3-1 总交易次数: 5 盈利: 19.18512569876604 亏损: -0.05776070564808475 最大盈利: 5.99 最大亏损: -0.06 总收益: 19.13 平均盈利: 3.83 typeA: 3.06 胜率: 80.00%
趋势多且增强-R-3-2 总交易次数: 5 盈利: 45.46049954248906 亏损: -5.690145443751787 最大盈利: 26.69 最大亏损: -5.69 总收益: 39.77 平均盈利: 7.95 typeA: 6.36 胜率: 80.00%
趋势空且增强-L1-3-4-2 总交易次数: 5 盈利: 22.167199751372678 亏损: -2.5583079056865947 最大盈利: 10.54 最大亏损: -2.56 总收益: 19.61 平均盈利: 3.92 typeA: 3.14 胜率: 80.00%
趋势多且增强-L3-1-4-3 总交易次数: 4 盈利: 5.195322833364861 亏损: -7.506537337230866 最大盈利: 2.24 最大亏损: -7.51 总收益: -2.31 平均盈利: -0.58 typeA: -0.43 胜率: 75.00%
趋势空且增强-L2-3-3 总交易次数: 11 盈利: 49.94855980529513 亏损: -63.67628472473558 最大盈利: 17.44 最大亏损: -57.08 总收益: -13.73 平均盈利: -1.25 typeA: -0.79 胜率: 63.64%
趋势多且增强-L3-1-3 总交易次数: 5 盈利: 22.86145942084565 亏损: -15.992759957357569 最大盈利: 9.98 最大亏损: -11.42 总收益: 6.87 平均盈利: 1.37 typeA: 0.82 胜率: 60.00%
趋势多且增强-L3-1-4-4 总交易次数: 12 盈利: 66.63618419198413 亏损: -17.715746245644596 最大盈利: 28.57 最大亏损: -8.74 总收益: 48.92 平均盈利: 4.08 typeA: 2.38 胜率: 58.33%
趋势空且增强-L2-3-5 总交易次数: 10 盈利: 6.166466088895072 亏损: -63.899803343467774 最大盈利: 3.49 最大亏损: -25.50 总收益: -57.73 平均盈利: -5.77 typeA: -1.15 胜率: 20.00%
趋势多且增强-L1-3-2 总交易次数: 1 盈利: 0 亏损: -0.8600211249010874 最大盈利: -0.86 最大亏损: -0.86 总收益: -0.86 平均盈利: -0.86 typeA: 0.00 胜率: 0.00%
趋势多且增强-L1-3-1 总交易次数: 1 盈利: 0 亏损: -21.14298724954472 最大盈利: -21.14 最大亏损: -21.14 总收益: -21.14 平均盈利: -21.14 typeA: 0.00 胜率: 0.00%
Loaded 3000 15m candles

      ========== 回测结果 ==========
      总交易次数:     82
      胜率:          63.41%
      总收益:        105.55 USDT
      期末余额:      1089.15 USDT
      盈亏比:        1.34
      最大单笔盈利:  64.37
      最大单笔亏损:  -49.92
      手续费:       32.78924959179768
      =============================
    
profit: 89.15470190830865
maxDrawdown 9.4%
startTime: 2023-01-21 00:00:00
趋势多且增强-L3-1-5 总交易次数: 3 盈利: 12.839974620871454 亏损: 0 最大盈利: 6.17 最大亏损: 2.14 总收益: 12.84 平均盈利: 4.28 typeA: 4.28 胜率: 100.00%
趋势多且增强-L3-1-4-2 总交易次数: 1 盈利: 5.129545196778929 亏损: 0 最大盈利: 5.13 最大亏损: 5.13 总收益: 5.13 平均盈利: 5.13 typeA: 5.13 胜率: 100.00%
趋势多且增强-L1-2-2 总交易次数: 1 盈利: 4.44285876090166 亏损: 0 最大盈利: 4.44 最大亏损: 4.44 总收益: 4.44 平均盈利: 4.44 typeA: 4.44 胜率: 100.00%
趋势空且增强-L2-1-3 总交易次数: 1 盈利: 12.507361671811937 亏损: 0 最大盈利: 12.51 最大亏损: 12.51 总收益: 12.51 平均盈利: 12.51 typeA: 12.51 胜率: 100.00%
趋势多且增强-L1-3-1 总交易次数: 1 盈利: 0.8439958231812605 亏损: 0 最大盈利: 0.84 最大亏损: 0.84 总收益: 0.84 平均盈利: 0.84 typeA: 0.84 胜率: 100.00%
趋势多且增强-R-1-1-2 总交易次数: 1 盈利: 4.6174638617934844 亏损: 0 最大盈利: 4.62 最大亏损: 4.62 总收益: 4.62 平均盈利: 4.62 typeA: 4.62 胜率: 100.00%
趋势多且增强-L3-1-4-4 总交易次数: 9 盈利: 32.3831554526965 亏损: -0.20000000000000004 最大盈利: 16.17 最大亏损: -0.20 总收益: 32.18 平均盈利: 3.58 typeA: 3.18 胜率: 88.89%
趋势空且增强-L-4-2-3 总交易次数: 5 盈利: 51.73070848178597 亏损: -0.524354123878524 最大盈利: 33.58 最大亏损: -0.52 总收益: 51.21 平均盈利: 10.24 typeA: 8.19 胜率: 80.00%
趋势多且增强-L3-1-3 总交易次数: 4 盈利: 13.585727532884604 亏损: -21.26101735487729 最大盈利: 8.60 最大亏损: -21.26 总收益: -7.68 平均盈利: -1.92 typeA: -1.44 胜率: 75.00%
趋势空且增强-L2-3-3 总交易次数: 11 盈利: 44.95691508433708 亏损: -4.62095022858342 最大盈利: 23.17 最大亏损: -2.15 总收益: 40.34 平均盈利: 3.67 typeA: 2.67 胜率: 72.73%
趋势多且增强-R-2-1 总交易次数: 7 盈利: 74.4142875216473 亏损: -27.980988791601717 最大盈利: 34.38 最大亏损: -24.20 总收益: 46.43 平均盈利: 6.63 typeA: 4.74 胜率: 71.43%
趋势空且增强-L1-3-4-2 总交易次数: 5 盈利: 8.188552686247712 亏损: -50.22810719638908 最大盈利: 3.79 最大亏损: -49.92 总收益: -42.04 平均盈利: -8.41 typeA: -5.04 胜率: 60.00%
趋势空且增强-L2-3-5 总交易次数: 6 盈利: 33.49369653385634 亏损: -19.60610145643097 最大盈利: 31.99 最大亏损: -17.25 总收益: 13.89 平均盈利: 2.31 typeA: 1.16 胜率: 50.00%
趋势空且增强-L2-2-3 总交易次数: 2 盈利: 4.075320584926945 亏损: -30.081961668545656 最大盈利: 4.08 最大亏损: -30.08 总收益: -26.01 平均盈利: -13.00 typeA: -6.50 胜率: 50.00%
趋势多且增强-R-3-1 总交易次数: 2 盈利: 3.484766584766706 亏损: -1.3919150319713773 最大盈利: 3.48 最大亏损: -1.39 总收益: 2.09 平均盈利: 1.05 typeA: 0.52 胜率: 50.00%
趋势空且增强-11 总交易次数: 2 盈利: 18.95206338725658 亏损: -15.336131669059938 最大盈利: 18.95 最大亏损: -15.34 总收益: 3.62 平均盈利: 1.81 typeA: 0.90 胜率: 50.00%
趋势空且增强-L2-3-4 总交易次数: 12 盈利: 74.38890885177072 亏损: -48.830355084078576 最大盈利: 64.37 最大亏损: -19.19 总收益: 25.56 平均盈利: 2.13 typeA: 0.89 胜率: 41.67%
趋势多且增强-L3-1-4-3 总交易次数: 6 盈利: 12.2882955796022 亏损: -54.60073446211861 最大盈利: 11.33 最大亏损: -27.42 总收益: -42.31 平均盈利: -7.05 typeA: -2.35 胜率: 33.33%
趋势多且增强-R-1-2-2 总交易次数: 1 盈利: 0 亏损: -20.60654589371977 最大盈利: -20.61 最大亏损: -20.61 总收益: -20.61 平均盈利: -20.61 typeA: 0.00 胜率: 0.00%
趋势多且增强-L1-3-9 总交易次数: 1 盈利: 0 亏损: -4.51879049676025 最大盈利: -4.52 最大亏损: -4.52 总收益: -4.52 平均盈利: -4.52 typeA: 0.00 胜率: 0.00%
趋势多且增强-L1-3-2 总交易次数: 1 盈利: 0 亏损: -6.9809428507894085 最大盈利: -6.98 最大亏损: -6.98 总收益: -6.98 平均盈利: -6.98 typeA: 0.00 胜率: 0.00%
Loaded 3000 15m candles

      ========== 回测结果 ==========
      总交易次数:     61
      胜率:          52.46%
      总收益:        -174.40 USDT
      期末余额:      813.40 USDT
      盈亏比:        0.52
      最大单笔盈利:  19.71
      最大单笔亏损:  -55.32
      手续费:       24.401712860919087
      =============================
    
profit: -186.60240201861848
maxDrawdown 19.8%
startTime: 2023-02-20 00:00:00
趋势多且增强-R-1-1-1 总交易次数: 1 盈利: 3.8136491368927437 亏损: 0 最大盈利: 3.81 最大亏损: 3.81 总收益: 3.81 平均盈利: 3.81 typeA: 3.81 胜率: 100.00%
趋势多且增强-R-2-2 总交易次数: 1 盈利: 18.824257357974023 亏损: 0 最大盈利: 18.82 最大亏损: 18.82 总收益: 18.82 平均盈利: 18.82 typeA: 18.82 胜率: 100.00%
趋势空且增强-L-4-2-3 总交易次数: 1 盈利: 5.965616438356057 亏损: 0 最大盈利: 5.97 最大亏损: 5.97 总收益: 5.97 平均盈利: 5.97 typeA: 5.97 胜率: 100.00%
趋势多且增强-R-2-1 总交易次数: 1 盈利: 5.088512138885141 亏损: 0 最大盈利: 5.09 最大亏损: 5.09 总收益: 5.09 平均盈利: 5.09 typeA: 5.09 胜率: 100.00%
趋势空且增强-L2-3-3 总交易次数: 12 盈利: 52.18068477491063 亏损: -1.6040713463766347 最大盈利: 16.80 最大亏损: -0.82 总收益: 50.58 平均盈利: 4.21 typeA: 3.16 胜率: 75.00%
趋势多且增强-L3-1-5 总交易次数: 3 盈利: 9.869108138555491 亏损: -4.852087210848035 最大盈利: 6.03 最大亏损: -4.85 总收益: 5.02 平均盈利: 1.67 typeA: 1.11 胜率: 66.67%
趋势空且增强-L2-3-4 总交易次数: 3 盈利: 6.8222715208032 亏损: -35.706750524109026 最大盈利: 4.11 最大亏损: -35.71 总收益: -28.88 平均盈利: -9.63 typeA: -6.42 胜率: 66.67%
趋势多且增强-R-3-1 总交易次数: 11 盈利: 44.21354158173452 亏损: -109.95757655826549 最大盈利: 17.67 最大亏损: -51.28 总收益: -65.74 平均盈利: -5.98 typeA: -3.26 胜率: 54.55%
趋势多且增强-L3-1-4-4 总交易次数: 8 盈利: 9.866299494241781 亏损: -23.788516367923478 最大盈利: 6.22 最大亏损: -19.53 总收益: -13.92 平均盈利: -1.74 typeA: -0.87 胜率: 50.00%
趋势多且增强-L3-1-3 总交易次数: 6 盈利: 27.404700011751398 亏损: -20.970649335527835 最大盈利: 19.71 最大亏损: -12.82 总收益: 6.43 平均盈利: 1.07 typeA: 0.54 胜率: 50.00%
趋势空且增强-L1-3-4-2 总交易次数: 2 盈利: 4.060400397557981 亏损: -26.126057298772153 最大盈利: 4.06 最大亏损: -26.13 总收益: -22.07 平均盈利: -11.03 typeA: -5.52 胜率: 50.00%
趋势空且增强-L2-3-5 总交易次数: 4 盈利: 0.3378865286367083 亏损: -12.154262509566014 最大盈利: 0.34 最大亏损: -6.55 总收益: -11.82 平均盈利: -2.95 typeA: -0.74 胜率: 25.00%
趋势多且增强-R-3-2 总交易次数: 1 盈利: 0 亏损: -5.807752710955903 最大盈利: -5.81 最大亏损: -5.81 总收益: -5.81 平均盈利: -5.81 typeA: 0.00 胜率: 0.00%
趋势空且增强-11 总交易次数: 3 盈利: 0 亏损: -84.17529135746013 最大盈利: -10.34 最大亏损: -55.32 总收益: -84.18 平均盈利: -28.06 typeA: 0.00 胜率: 0.00%
趋势多且增强-L3-1-4-3 总交易次数: 2 盈利: 0 亏损: -13.940439620247151 最大盈利: -6.34 最大亏损: -7.60 总收益: -13.94 平均盈利: -6.97 typeA: 0.00 胜率: 0.00%
趋势多且增强-L1-3-2 总交易次数: 1 盈利: 0 亏损: -3.135551749449355 最大盈利: -3.14 最大亏损: -3.14 总收益: -3.14 平均盈利: -3.14 typeA: 0.00 胜率: 0.00%
趋势多且增强-R-1-1-2 总交易次数: 1 盈利: 0 亏损: -20.630322949414126 最大盈利: -20.63 最大亏损: -20.63 总收益: -20.63 平均盈利: -20.63 typeA: 0.00 胜率: 0.00%
Loaded 3000 15m candles

      ========== 回测结果 ==========
      总交易次数:     61
      胜率:          49.18%
      总收益:        103.55 USDT
      期末余额:      1091.15 USDT
      盈亏比:        1.40
      最大单笔盈利:  67.52
      最大单笔亏损:  -33.44
      手续费:       24.555455255373136
      =============================
    
profit: 91.15188543293607
maxDrawdown 10.7%
startTime: 2023-03-22 00:00:00
趋势多且增强-R-3-2 总交易次数: 1 盈利: 3.9734411687972977 亏损: 0 最大盈利: 3.97 最大亏损: 3.97 总收益: 3.97 平均盈利: 3.97 typeA: 3.97 胜率: 100.00%
趋势空且增强-L1-1-2 总交易次数: 1 盈利: 25.467732435843477 亏损: 0 最大盈利: 25.47 最大亏损: 25.47 总收益: 25.47 平均盈利: 25.47 typeA: 25.47 胜率: 100.00%
趋势空且增强-L2-2-3 总交易次数: 1 盈利: 1.0014414414414758 亏损: 0 最大盈利: 1.00 最大亏损: 1.00 总收益: 1.00 平均盈利: 1.00 typeA: 1.00 胜率: 100.00%
趋势多且增强-R-1-1-1 总交易次数: 1 盈利: 7.613670827015094 亏损: 0 最大盈利: 7.61 最大亏损: 7.61 总收益: 7.61 平均盈利: 7.61 typeA: 7.61 胜率: 100.00%
趋势空且增强-2 总交易次数: 1 盈利: 67.52130610461938 亏损: 0 最大盈利: 67.52 最大亏损: 67.52 总收益: 67.52 平均盈利: 67.52 typeA: 67.52 胜率: 100.00%
趋势空且增强-L2-3-4 总交易次数: 7 盈利: 20.46034765665173 亏损: -6.280079324217623 最大盈利: 6.23 最大亏损: -5.84 总收益: 14.18 平均盈利: 2.03 typeA: 1.45 胜率: 71.43%
趋势空且增强-L-4-2-3 总交易次数: 3 盈利: 5.342157041697973 亏损: -32.503269718403914 最大盈利: 3.92 最大亏损: -32.50 总收益: -27.16 平均盈利: -9.05 typeA: -6.04 胜率: 66.67%
趋势多且增强-L3-1-4-3 总交易次数: 4 盈利: 11.836735658606512 亏损: -9.242226335539833 最大盈利: 9.77 最大亏损: -7.60 总收益: 2.59 平均盈利: 0.65 typeA: 0.32 胜率: 50.00%
趋势空且增强-L2-3-3 总交易次数: 6 盈利: 89.23709394036092 亏损: -16.054141027269196 最大盈利: 63.72 最大亏损: -14.78 总收益: 73.18 平均盈利: 12.20 typeA: 6.10 胜率: 50.00%
趋势多且增强-L3-1-4-4 总交易次数: 6 盈利: 4.183029346686485 亏损: -23.37095239664216 最大盈利: 2.17 最大亏损: -20.68 总收益: -19.19 平均盈利: -3.20 typeA: -1.60 胜率: 50.00%
趋势多且增强-L3-1-3 总交易次数: 4 盈利: 60.14686079647175 亏损: -5.881568406318079 最大盈利: 47.93 最大亏损: -5.42 总收益: 54.27 平均盈利: 13.57 typeA: 6.78 胜率: 50.00%
趋势多且增强-L3-1-5 总交易次数: 2 盈利: 0.33803309565467843 亏损: -4.118150263128464 最大盈利: 0.34 最大亏损: -4.12 总收益: -3.78 平均盈利: -1.89 typeA: -0.95 胜率: 50.00%
趋势多且增强-R-2-1 总交易次数: 6 盈利: 5.7867646265388295 亏损: -21.26199138072862 最大盈利: 3.93 最大亏损: -18.60 总收益: -15.48 平均盈利: -2.58 typeA: -1.29 胜率: 50.00%
趋势多且增强-R-1-1-2 总交易次数: 2 盈利: 17.818987181114412 亏损: -11.91137401897623 最大盈利: 17.82 最大亏损: -11.91 总收益: 5.91 平均盈利: 2.95 typeA: 1.48 胜率: 50.00%
趋势多且增强-R-1-2-2 总交易次数: 2 盈利: 16.103055924628624 亏损: -2.8313673884435695 最大盈利: 16.10 最大亏损: -2.83 总收益: 13.27 平均盈利: 6.64 typeA: 3.32 胜率: 50.00%
趋势多且增强-R-3-1 总交易次数: 3 盈利: 0.2916041794713997 亏损: -37.36385540530573 最大盈利: 0.29 最大亏损: -33.04 总收益: -37.07 平均盈利: -12.36 typeA: -4.12 胜率: 33.33%
趋势空且增强-L2-3-5 总交易次数: 4 盈利: 25.601820940819355 亏损: -4.824145467401117 最大盈利: 25.60 最大亏损: -3.12 总收益: 20.78 平均盈利: 5.19 typeA: 1.30 胜率: 25.00%
趋势多且增强-L1-3-1 总交易次数: 3 盈利: 0 亏损: -66.09167347983292 最大盈利: -12.45 最大亏损: -33.44 总收益: -66.09 平均盈利: -22.03 typeA: 0.00 胜率: 0.00%
趋势多且增强-L3-1-4-2 总交易次数: 1 盈利: 0 亏损: -5.827392120075095 最大盈利: -5.83 最大亏损: -5.83 总收益: -5.83 平均盈利: -5.83 typeA: 0.00 胜率: 0.00%
趋势空且增强-L1-3-4-2 总交易次数: 1 盈利: 0 亏损: -10.520889006482193 最大盈利: -10.52 最大亏损: -10.52 总收益: -10.52 平均盈利: -10.52 typeA: 0.00 胜率: 0.00%
趋势多且增强-L1-3-2 总交易次数: 2 盈利: 0 亏损: -1.0891211947157322 最大盈利: -0.20 最大亏损: -0.89 总收益: -1.09 平均盈利: -0.54 typeA: 0.00 胜率: 0.00%
Loaded 3000 15m candles

      ========== 回测结果 ==========
      总交易次数:     52
      胜率:          61.54%
      总收益:        -8.15 USDT
      期末余额:      981.45 USDT
      盈亏比:        0.94
      最大单笔盈利:  25.07
      最大单笔亏损:  -28.15
      手续费:       20.783473673826812
      =============================
    
profit: -18.55200437533199
maxDrawdown 4.7%
startTime: 2023-04-21 00:00:00
趋势多且增强-R-2-2 总交易次数: 1 盈利: 3.8147409326423682 亏损: 0 最大盈利: 3.81 最大亏损: 3.81 总收益: 3.81 平均盈利: 3.81 typeA: 3.81 胜率: 100.00%
趋势空且增强-L-4-2-3 总交易次数: 1 盈利: 0.17843359818391027 亏损: 0 最大盈利: 0.18 最大亏损: 0.18 总收益: 0.18 平均盈利: 0.18 typeA: 0.18 胜率: 100.00%
趋势空且增强-L2-2-3 总交易次数: 1 盈利: 5.50667965488441 亏损: 0 最大盈利: 5.51 最大亏损: 5.51 总收益: 5.51 平均盈利: 5.51 typeA: 5.51 胜率: 100.00%
趋势多且增强-L3-1-4-4 总交易次数: 7 盈利: 7.257903674423073 亏损: -2.2052146008824356 最大盈利: 1.58 最大亏损: -2.21 总收益: 5.05 平均盈利: 0.72 typeA: 0.62 胜率: 85.71%
趋势空且增强-L2-3-4 总交易次数: 8 盈利: 11.120063627709106 亏损: -16.029344526198813 最大盈利: 2.83 最大亏损: -12.07 总收益: -4.91 平均盈利: -0.61 typeA: -0.46 胜率: 75.00%
趋势多且增强-R-3-1 总交易次数: 7 盈利: 18.44256989152679 亏损: -14.167027793408426 最大盈利: 7.61 最大亏损: -11.61 总收益: 4.28 平均盈利: 0.61 typeA: 0.44 胜率: 71.43%
趋势空且增强-L2-3-3 总交易次数: 12 盈利: 58.14368508611598 亏损: -10.201902630779209 最大盈利: 25.07 最大亏损: -5.46 总收益: 47.94 平均盈利: 4.00 typeA: 2.33 胜率: 58.33%
趋势多且增强-L3-1-5 总交易次数: 6 盈利: 14.678722861564275 亏损: -23.087413030458492 最大盈利: 12.31 最大亏损: -21.90 总收益: -8.41 平均盈利: -1.40 typeA: -0.70 胜率: 50.00%
趋势多且增强-L3-1-3 总交易次数: 2 盈利: 1.0505315822389352 亏损: -2.1590202939118437 最大盈利: 1.05 最大亏损: -2.16 总收益: -1.11 平均盈利: -0.55 typeA: -0.28 胜率: 50.00%
趋势空且增强-L2-3-5 总交易次数: 3 盈利: 5.030425481340739 亏损: -16.308003899080806 最大盈利: 5.03 最大亏损: -14.59 总收益: -11.28 平均盈利: -3.76 typeA: -1.25 胜率: 33.33%
趋势多且增强-R-2-1 总交易次数: 1 盈利: 0 亏损: -18.600453800579896 最大盈利: -18.60 最大亏损: -18.60 总收益: -18.60 平均盈利: -18.60 typeA: 0.00 胜率: 0.00%
趋势多且增强-R-1-1-2 总交易次数: 1 盈利: 0 亏损: -1.4855857014273222 最大盈利: -1.49 最大亏损: -1.49 总收益: -1.49 平均盈利: -1.49 typeA: 0.00 胜率: 0.00%
趋势多且增强-L1-3-1 总交易次数: 1 盈利: 0 亏损: -28.15374001452424 最大盈利: -28.15 最大亏损: -28.15 总收益: -28.15 平均盈利: -28.15 typeA: 0.00 胜率: 0.00%
趋势多且增强-R-3-2 总交易次数: 1 盈利: 0 亏损: -0.9780544747082294 最大盈利: -0.98 最大亏损: -0.98 总收益: -0.98 平均盈利: -0.98 typeA: 0.00 胜率: 0.00%
Loaded 3000 15m candles

      ========== 回测结果 ==========
      总交易次数:     60
      胜率:          55.00%
      总收益:        90.02 USDT
      期末余额:      1077.82 USDT
      盈亏比:        1.58
      最大单笔盈利:  132.66
      最大单笔亏损:  -28.52
      手续费:       24.179425533704766
      =============================
    
profit: 77.82291581632967
maxDrawdown 4.2%
startTime: 2023-05-21 00:00:00
趋势空且增强-L1-3-4-2 总交易次数: 1 盈利: 132.6647336094844 亏损: 0 最大盈利: 132.66 最大亏损: 132.66 总收益: 132.66 平均盈利: 132.66 typeA: 132.66 胜率: 100.00%
趋势空且增强-L-4-2-3 总交易次数: 1 盈利: 0.6101409363356786 亏损: 0 最大盈利: 0.61 最大亏损: 0.61 总收益: 0.61 平均盈利: 0.61 typeA: 0.61 胜率: 100.00%
趋势多且增强-L3-1-4-3 总交易次数: 1 盈利: 4.215933256993397 亏损: 0 最大盈利: 4.22 最大亏损: 4.22 总收益: 4.22 平均盈利: 4.22 typeA: 4.22 胜率: 100.00%
趋势多且增强-L3-1-5 总交易次数: 5 盈利: 4.087875230838638 亏损: -1.071538573296593 最大盈利: 1.17 最大亏损: -1.07 总收益: 3.02 平均盈利: 0.60 typeA: 0.48 胜率: 80.00%
趋势多且增强-L3-1-3 总交易次数: 4 盈利: 20.612245480467507 亏损: -24.565687540348684 最大盈利: 16.60 最大亏损: -24.57 总收益: -3.95 平均盈利: -0.99 typeA: -0.74 胜率: 75.00%
趋势多且增强-L3-1-4-4 总交易次数: 11 盈利: 16.390890976405956 亏损: -16.87719399945238 最大盈利: 5.87 最大亏损: -14.09 总收益: -0.49 平均盈利: -0.04 typeA: -0.03 胜率: 63.64%
趋势多且增强-R-3-1 总交易次数: 8 盈利: 18.829239676939174 亏损: -30.236249547474575 最大盈利: 16.14 最大亏损: -28.52 总收益: -11.41 平均盈利: -1.43 typeA: -0.71 胜率: 50.00%
趋势空且增强-L2-3-3 总交易次数: 10 盈利: 8.717930629549175 亏损: -20.74371170813837 最大盈利: 2.56 最大亏损: -13.17 总收益: -12.03 平均盈利: -1.20 typeA: -0.60 胜率: 50.00%
趋势多且增强-R-3-2 总交易次数: 2 盈利: 12.859356014580797 亏损: -0.9442310555306611 最大盈利: 12.86 最大亏损: -0.94 总收益: 11.92 平均盈利: 5.96 typeA: 2.98 胜率: 50.00%
趋势空且增强-L2-3-5 总交易次数: 5 盈利: 20.35998888194075 亏损: -9.84185396416072 最大盈利: 10.25 最大亏损: -5.02 总收益: 10.52 平均盈利: 2.10 typeA: 0.84 胜率: 40.00%
趋势空且增强-L2-3-4 总交易次数: 11 盈利: 6.17453786638282 亏损: -41.08394237108343 最大盈利: 2.80 最大亏损: -14.07 总收益: -34.91 平均盈利: -3.17 typeA: -1.15 胜率: 36.36%
趋势多且增强-L1-3-1 总交易次数: 1 盈利: 0 亏损: -10.13554798410003 最大盈利: -10.14 最大亏损: -10.14 总收益: -10.14 平均盈利: -10.14 typeA: 0.00 胜率: 0.00%
Loaded 3000 15m candles

      ========== 回测结果 ==========
      总交易次数:     66
      胜率:          51.52%
      总收益:        -234.46 USDT
      期末余额:      752.14 USDT
      盈亏比:        0.48
      最大单笔盈利:  32.71
      最大单笔亏损:  -77.48
      手续费:       26.621662582478397
      =============================
    
profit: -247.8553961397563
maxDrawdown 28.1%
startTime: 2023-06-20 00:00:00
趋势空且增强-L1-3-4-2 总交易次数: 2 盈利: 7.824574736261118 亏损: 0 最大盈利: 5.27 最大亏损: 2.56 总收益: 7.82 平均盈利: 3.91 typeA: 3.91 胜率: 100.00%
趋势多且增强-R-3-1 总交易次数: 3 盈利: 10.737896739652031 亏损: -0.2 最大盈利: 7.79 最大亏损: -0.20 总收益: 10.54 平均盈利: 3.51 typeA: 2.34 胜率: 66.67%
趋势空且增强-L2-2-3 总交易次数: 3 盈利: 24.771797520694058 亏损: -2.203261802575125 最大盈利: 15.84 最大亏损: -2.20 总收益: 22.57 平均盈利: 7.52 typeA: 5.02 胜率: 66.67%
趋势空且增强-L2-3-5 总交易次数: 5 盈利: 28.549565889692165 亏损: -27.448862131152303 最大盈利: 25.91 最大亏损: -17.45 总收益: 1.10 平均盈利: 0.22 typeA: 0.13 胜率: 60.00%
趋势空且增强-L2-3-3 总交易次数: 11 盈利: 18.759762701320327 亏损: -177.1504466704771 最大盈利: 5.54 最大亏损: -77.48 总收益: -158.39 平均盈利: -14.40 typeA: -7.85 胜率: 54.55%
趋势空且增强-L2-3-4 总交易次数: 13 盈利: 52.582911082096764 亏损: -97.29231896515248 最大盈利: 24.53 最大亏损: -36.65 总收益: -44.71 平均盈利: -3.44 typeA: -1.85 胜率: 53.85%
趋势多且增强-L3-1-4-4 总交易次数: 14 盈利: 41.905176810468944 亏损: -62.516763840898086 最大盈利: 32.71 最大亏损: -37.44 总收益: -20.61 平均盈利: -1.47 typeA: -0.74 胜率: 50.00%
趋势多且增强-R-2-1 总交易次数: 2 盈利: 5.8297636511816675 亏损: -4.690792034735868 最大盈利: 5.83 最大亏损: -4.69 总收益: 1.14 平均盈利: 0.57 typeA: 0.28 胜率: 50.00%
趋势多且增强-L3-1-4-3 总交易次数: 2 盈利: 9.007674597083705 亏损: -2.807240374290589 最大盈利: 9.01 最大亏损: -2.81 总收益: 6.20 平均盈利: 3.10 typeA: 1.55 胜率: 50.00%
趋势多且增强-L1-3-1 总交易次数: 2 盈利: 16.484908646237866 亏损: -3.1823579545454805 最大盈利: 16.48 最大亏损: -3.18 总收益: 13.30 平均盈利: 6.65 typeA: 3.33 胜率: 50.00%
趋势多且增强-L3-1-5 总交易次数: 5 盈利: 4.235593055473387 亏损: -60.16292833231709 最大盈利: 2.62 最大亏损: -27.55 总收益: -55.93 平均盈利: -11.19 typeA: -4.47 胜率: 40.00%
趋势多且增强-L1-3-2 总交易次数: 1 盈利: 0 亏损: -6.325689277899397 最大盈利: -6.33 最大亏损: -6.33 总收益: -6.33 平均盈利: -6.33 typeA: 0.00 胜率: 0.00%
趋势多且增强-L1-2-2 总交易次数: 1 盈利: 0 亏损: -7.019126396749357 最大盈利: -7.02 最大亏损: -7.02 总收益: -7.02 平均盈利: -7.02 typeA: 0.00 胜率: 0.00%
趋势多且增强-L3-1-3 总交易次数: 1 盈利: 0 亏损: -3.533171692680679 最大盈利: -3.53 最大亏损: -3.53 总收益: -3.53 平均盈利: -3.53 typeA: 0.00 胜率: 0.00%
趋势多且增强-L3-1-4-2 总交易次数: 1 盈利: 0 亏损: -0.6120620964416592 最大盈利: -0.61 最大亏损: -0.61 总收益: -0.61 平均盈利: -0.61 typeA: 0.00 胜率: 0.00%
Loaded 3000 15m candles

      ========== 回测结果 ==========
      总交易次数:     70
      胜率:          52.86%
      总收益:        169.67 USDT
      期末余额:      1155.67 USDT
      盈亏比:        1.98
      最大单笔盈利:  74.00
      最大单笔亏损:  -26.22
      手续费:       28.007875586987012
      =============================
    
profit: 155.67291956481995
maxDrawdown 3.6%
startTime: 2023-07-20 00:00:00
趋势空且增强-L1-3-4-2 总交易次数: 5 盈利: 43.8555740171523 亏损: 0 最大盈利: 27.50 最大亏损: 2.56 总收益: 43.86 平均盈利: 8.77 typeA: 8.77 胜率: 100.00%
趋势多且增强-L3-1-5 总交易次数: 4 盈利: 11.849300725912858 亏损: 0 最大盈利: 4.00 最大亏损: 1.57 总收益: 11.85 平均盈利: 2.96 typeA: 2.96 胜率: 100.00%
趋势多且增强-L3-1-4-1 总交易次数: 1 盈利: 23.43463441451346 亏损: 0 最大盈利: 23.43 最大亏损: 23.43 总收益: 23.43 平均盈利: 23.43 typeA: 23.43 胜率: 100.00%
趋势空且增强-L-4-2-3 总交易次数: 1 盈利: 1.9185067513899057 亏损: 0 最大盈利: 1.92 最大亏损: 1.92 总收益: 1.92 平均盈利: 1.92 typeA: 1.92 胜率: 100.00%
趋势多且增强-R-1-1-1 总交易次数: 1 盈利: 74.0003629105426 亏损: 0 最大盈利: 74.00 最大亏损: 74.00 总收益: 74.00 平均盈利: 74.00 typeA: 74.00 胜率: 100.00%
趋势多且增强-L3-1-3 总交易次数: 5 盈利: 14.180126956842955 亏损: -1.2577096006348931 最大盈利: 8.45 最大亏损: -1.26 总收益: 12.92 平均盈利: 2.58 typeA: 2.07 胜率: 80.00%
趋势空且增强-L2-3-4 总交易次数: 13 盈利: 92.69933556981695 亏损: -35.29380985422608 最大盈利: 37.91 最大亏损: -15.00 总收益: 57.41 平均盈利: 4.42 typeA: 2.38 胜率: 53.85%
趋势多且增强-R-3-1 总交易次数: 10 盈利: 39.04283830881164 亏损: -24.67271864861924 最大盈利: 11.43 最大亏损: -9.37 总收益: 14.37 平均盈利: 1.44 typeA: 0.72 胜率: 50.00%
趋势多且增强-R-2-2 总交易次数: 2 盈利: 1.0727298444131081 亏损: -0.622748414376353 最大盈利: 1.07 最大亏损: -0.62 总收益: 0.45 平均盈利: 0.22 typeA: 0.11 胜率: 50.00%
趋势多且增强-L3-1-4-4 总交易次数: 9 盈利: 17.573613706981313 亏损: -46.44779370520136 最大盈利: 14.35 最大亏损: -26.22 总收益: -28.87 平均盈利: -3.21 typeA: -1.43 胜率: 44.44%
趋势多且增强-L3-1-4-3 总交易次数: 3 盈利: 14.299674708593134 亏损: -3.6476511477588023 最大盈利: 14.30 最大亏损: -2.36 总收益: 10.65 平均盈利: 3.55 typeA: 1.18 胜率: 33.33%
趋势空且增强-L2-3-5 总交易次数: 3 盈利: 0.33622838761557927 亏损: -22.637118716548052 最大盈利: 0.34 最大亏损: -21.11 总收益: -22.30 平均盈利: -7.43 typeA: -2.48 胜率: 33.33%
趋势空且增强-L2-3-3 总交易次数: 8 盈利: 8.478828389959418 亏损: -21.580191132597573 最大盈利: 4.74 最大亏损: -11.70 总收益: -13.10 平均盈利: -1.64 typeA: -0.41 胜率: 25.00%
趋势空且增强-L2-2-3 总交易次数: 1 盈利: 0 亏损: -1.8114930182598699 最大盈利: -1.81 最大亏损: -1.81 总收益: -1.81 平均盈利: -1.81 typeA: 0.00 胜率: 0.00%
趋势多且增强-L1-3-2 总交易次数: 1 盈利: 0 亏损: -8.083634953464315 最大盈利: -8.08 最大亏损: -8.08 总收益: -8.08 平均盈利: -8.08 typeA: 0.00 胜率: 0.00%
趋势多且增强-L1-3-1 总交易次数: 1 盈利: 0 亏损: -3.3123147802266244 最大盈利: -3.31 最大亏损: -3.31 总收益: -3.31 平均盈利: -3.31 typeA: 0.00 胜率: 0.00%
趋势多且增强-R-3-2 总交易次数: 1 盈利: 0 亏损: -0.2 最大盈利: -0.20 最大亏损: -0.20 总收益: -0.20 平均盈利: -0.20 typeA: 0.00 胜率: 0.00%
趋势多且增强-R-2-1 总交易次数: 1 盈利: 0 亏损: -3.5016511558090357 最大盈利: -3.50 最大亏损: -3.50 总收益: -3.50 平均盈利: -3.50 typeA: 0.00 胜率: 0.00%
Loaded 3000 15m candles

      ========== 回测结果 ==========
      总交易次数:     53
      胜率:          52.83%
      总收益:        -53.81 USDT
      期末余额:      935.59 USDT
      盈亏比:        0.59
      最大单笔盈利:  9.28
      最大单笔亏损:  -29.60
      手续费:       21.19287330234199
      =============================
    
profit: -64.40802143148267
maxDrawdown 7.2%
startTime: 2023-08-19 00:00:00
趋势多且增强-R-3-1 总交易次数: 5 盈利: 21.611973635348374 亏损: 0 最大盈利: 8.29 最大亏损: 1.10 总收益: 21.61 平均盈利: 4.32 typeA: 4.32 胜率: 100.00%
趋势多且增强-L3-1-4-4 总交易次数: 10 盈利: 10.38123320360601 亏损: -27.722793410598477 最大盈利: 2.93 最大亏损: -18.83 总收益: -17.34 平均盈利: -1.73 typeA: -1.21 胜率: 70.00%
趋势空且增强-L2-3-4 总交易次数: 6 盈利: 12.326632419981916 亏损: -3.782393083858853 最大盈利: 7.50 最大亏损: -3.27 总收益: 8.54 平均盈利: 1.42 typeA: 0.95 胜率: 66.67%
趋势空且增强-L2-3-5 总交易次数: 6 盈利: 14.690613327110258 亏损: -11.087253495682901 最大盈利: 9.28 最大亏损: -9.25 总收益: 3.60 平均盈利: 0.60 typeA: 0.30 胜率: 50.00%
趋势多且增强-L3-1-5 总交易次数: 7 盈利: 2.95958846429204 亏损: -18.049018295375554 最大盈利: 1.58 最大亏损: -9.70 总收益: -15.09 平均盈利: -2.16 typeA: -0.92 胜率: 42.86%
趋势空且增强-L2-3-3 总交易次数: 12 盈利: 11.759903249542337 亏损: -30.445616086990032 最大盈利: 5.44 最大亏损: -10.43 总收益: -18.69 平均盈利: -1.56 typeA: -0.65 胜率: 41.67%
趋势多且增强-L1-3-2 总交易次数: 3 盈利: 4.045101431042717 亏损: -30.746907719837886 最大盈利: 4.05 最大亏损: -29.60 总收益: -26.70 平均盈利: -8.90 typeA: -2.97 胜率: 33.33%
趋势空且增强-L1-3-4-2 总交易次数: 1 盈利: 0 亏损: -2.253474415666537 最大盈利: -2.25 最大亏损: -2.25 总收益: -2.25 平均盈利: -2.25 typeA: 0.00 胜率: 0.00%
趋势多且增强-L3-1-3 总交易次数: 3 盈利: 0 亏损: -7.4956106543936025 最大盈利: -0.36 最大亏损: -6.77 总收益: -7.50 平均盈利: -2.50 typeA: 0.00 胜率: 0.00%
Loaded 3000 15m candles

      ========== 回测结果 ==========
      总交易次数:     54
      胜率:          55.56%
      总收益:        -20.66 USDT
      期末余额:      968.54 USDT
      盈亏比:        0.72
      最大单笔盈利:  8.02
      最大单笔亏损:  -9.25
      手续费:       21.6028550203472
      =============================
    
profit: -31.45870564445488
maxDrawdown 3.4%
startTime: 2023-09-18 00:00:00
趋势多且增强-L3-1-5 总交易次数: 6 盈利: 5.917478596642401 亏损: -1.5749682597720724 最大盈利: 2.07 最大亏损: -1.04 总收益: 4.34 平均盈利: 0.72 typeA: 0.48 胜率: 66.67%
趋势空且增强-L2-3-5 总交易次数: 3 盈利: 1.9436247372892907 亏损: -2.1688976377953093 最大盈利: 1.16 最大亏损: -2.17 总收益: -0.23 平均盈利: -0.08 typeA: -0.05 胜率: 66.67%
趋势空且增强-L2-3-3 总交易次数: 10 盈利: 8.682502972488637 亏损: -20.71563009243485 最大盈利: 2.37 最大亏损: -9.25 总收益: -12.03 平均盈利: -1.20 typeA: -0.72 胜率: 60.00%
趋势多且增强-L3-1-4-4 总交易次数: 18 盈利: 21.084967641091293 亏损: -23.37399658129209 最大盈利: 8.02 最大亏损: -7.58 总收益: -2.29 平均盈利: -0.13 typeA: -0.07 胜率: 55.56%
趋势空且增强-L2-3-4 总交易次数: 11 盈利: 9.40226771657843 亏损: -14.011756971488735 最大盈利: 4.11 最大亏损: -5.99 总收益: -4.61 平均盈利: -0.42 typeA: -0.23 胜率: 54.55%
趋势多且增强-R-3-1 总交易次数: 2 盈利: 2.558740464210412 亏损: -3.0925459496255367 最大盈利: 2.56 最大亏损: -3.09 总收益: -0.53 平均盈利: -0.27 typeA: -0.13 胜率: 50.00%
趋势多且增强-L3-1-3 总交易次数: 4 盈利: 3.917661967368863 亏损: -9.22815424771304 最大盈利: 3.92 最大亏损: -6.77 总收益: -5.31 平均盈利: -1.33 typeA: -0.33 胜率: 25.00%
Loaded 3000 15m candles

      ========== 回测结果 ==========
      总交易次数:     74
      胜率:          64.86%
      总收益:        115.30 USDT
      期末余额:      1100.50 USDT
      盈亏比:        1.39
      最大单笔盈利:  89.29
      最大单笔亏损:  -59.01
      手续费:       29.652857624404987
      =============================
    
profit: 100.50139378680365
maxDrawdown 7.8%
startTime: 2023-10-18 00:00:00
趋势多且增强-L3-1-5 总交易次数: 2 盈利: 90.70077749230327 亏损: 0 最大盈利: 89.29 最大亏损: 1.41 总收益: 90.70 平均盈利: 45.35 typeA: 45.35 胜率: 100.00%
趋势多且增强-R-3-2 总交易次数: 1 盈利: 1.7215552927260678 亏损: 0 最大盈利: 1.72 最大亏损: 1.72 总收益: 1.72 平均盈利: 1.72 typeA: 1.72 胜率: 100.00%
趋势多且增强-R-3-1 总交易次数: 4 盈利: 58.39953712145082 亏损: 0 最大盈利: 24.86 最大亏损: 1.75 总收益: 58.40 平均盈利: 14.60 typeA: 14.60 胜率: 100.00%
趋势多且增强-L3-1-3 总交易次数: 3 盈利: 20.467728168324797 亏损: 0 最大盈利: 15.04 最大亏损: 0.20 总收益: 20.47 平均盈利: 6.82 typeA: 6.82 胜率: 100.00%
趋势多且增强-L3-1-4-4 总交易次数: 16 盈利: 71.05869505571759 亏损: -17.043091473326264 最大盈利: 24.88 最大亏损: -17.04 总收益: 54.02 平均盈利: 3.38 typeA: 3.16 胜率: 93.75%
趋势空且增强-L1-3-4-2 总交易次数: 3 盈利: 6.429707070210123 亏损: -3.658506224066393 最大盈利: 3.76 最大亏损: -3.66 总收益: 2.77 平均盈利: 0.92 typeA: 0.62 胜率: 66.67%
趋势空且增强-L2-3-5 总交易次数: 6 盈利: 7.226397442555666 亏损: -8.110147472794504 最大盈利: 2.55 最大亏损: -5.89 总收益: -0.88 平均盈利: -0.15 typeA: -0.10 胜率: 66.67%
趋势空且增强-L-4-2-3 总交易次数: 6 盈利: 15.260451811766035 亏损: -88.3904172962423 最大盈利: 5.06 最大亏损: -59.01 总收益: -73.13 平均盈利: -12.19 typeA: -8.13 胜率: 66.67%
趋势空且增强-L2-3-3 总交易次数: 10 盈利: 77.50043886970228 亏损: -59.371563606029575 最大盈利: 55.21 最大亏损: -35.50 总收益: 18.13 平均盈利: 1.81 typeA: 0.91 胜率: 50.00%
趋势多且增强-R-2-1 总交易次数: 2 盈利: 9.289531095056013 亏损: -6.762281213535474 最大盈利: 9.29 最大亏损: -6.76 总收益: 2.53 平均盈利: 1.26 typeA: 0.63 胜率: 50.00%
趋势空且增强-L2-3-4 总交易次数: 14 盈利: 40.47916814878867 亏损: -62.245877437901505 最大盈利: 16.33 最大亏损: -16.41 总收益: -21.77 平均盈利: -1.55 typeA: -0.67 胜率: 42.86%
趋势多且增强-L1-3-1 总交易次数: 3 盈利: 11.310077274877912 亏损: -5.785921407738755 最大盈利: 11.31 最大亏损: -3.35 总收益: 5.52 平均盈利: 1.84 typeA: 0.61 胜率: 33.33%
趋势多且增强-L3-1-4-3 总交易次数: 1 盈利: 0 亏损: -19.053289189578315 最大盈利: -19.05 最大亏损: -19.05 总收益: -19.05 平均盈利: -19.05 typeA: 0.00 胜率: 0.00%
趋势多且增强-L1-3-2 总交易次数: 1 盈利: 0 亏损: -0.44923345382017016 最大盈利: -0.45 最大亏损: -0.45 总收益: -0.45 平均盈利: -0.45 typeA: 0.00 胜率: 0.00%
趋势多且增强-L3-1-4-1 总交易次数: 1 盈利: 0 亏损: -7.390083270249824 最大盈利: -7.39 最大亏损: -7.39 总收益: -7.39 平均盈利: -7.39 typeA: 0.00 胜率: 0.00%
趋势多且增强-L1-2-2 总交易次数: 1 盈利: 0 亏损: -16.282259011388945 最大盈利: -16.28 最大亏损: -16.28 总收益: -16.28 平均盈利: -16.28 typeA: 0.00 胜率: 0.00%
Loaded 3000 15m candles

      ========== 回测结果 ==========
      总交易次数:     71
      胜率:          67.61%
      总收益:        256.18 USDT
      期末余额:      1241.98 USDT
      盈亏比:        2.05
      最大单笔盈利:  47.20
      最大单笔亏损:  -55.36
      手续费:       28.37907645148409
      =============================
    
profit: 241.98109725460927
maxDrawdown 5.7%
startTime: 2023-11-17 00:00:00
趋势多且增强-L1-2-2 总交易次数: 1 盈利: 29.910755992624384 亏损: 0 最大盈利: 29.91 最大亏损: 29.91 总收益: 29.91 平均盈利: 29.91 typeA: 29.91 胜率: 100.00%
趋势空且增强-11 总交易次数: 4 盈利: 43.147490549398626 亏损: 0 最大盈利: 12.11 最大亏损: 9.69 总收益: 43.15 平均盈利: 10.79 typeA: 10.79 胜率: 100.00%
趋势多且增强-R-2-1 总交易次数: 2 盈利: 24.08889604879562 亏损: 0 最大盈利: 14.65 最大亏损: 9.44 总收益: 24.09 平均盈利: 12.04 typeA: 12.04 胜率: 100.00%
趋势多且增强-L3-1-5 总交易次数: 4 盈利: 28.3265365755289 亏损: 0 最大盈利: 17.12 最大亏损: 1.53 总收益: 28.33 平均盈利: 7.08 typeA: 7.08 胜率: 100.00%
趋势空且增强-L1-1-2 总交易次数: 1 盈利: 32.73636803874092 亏损: 0 最大盈利: 32.74 最大亏损: 32.74 总收益: 32.74 平均盈利: 32.74 typeA: 32.74 胜率: 100.00%
趋势多且增强-L1-3-9 总交易次数: 1 盈利: 15.510563665855592 亏损: 0 最大盈利: 15.51 最大亏损: 15.51 总收益: 15.51 平均盈利: 15.51 typeA: 15.51 胜率: 100.00%
趋势多且增强-R-1-2-2 总交易次数: 1 盈利: 5.147107618423973 亏损: 0 最大盈利: 5.15 最大亏损: 5.15 总收益: 5.15 平均盈利: 5.15 typeA: 5.15 胜率: 100.00%
趋势空且增强-L2-3-3 总交易次数: 9 盈利: 81.02884942371273 亏损: -1.1571291866029425 最大盈利: 47.20 最大亏损: -1.16 总收益: 79.87 平均盈利: 8.87 typeA: 7.89 胜率: 88.89%
趋势空且增强-L-4-2-3 总交易次数: 5 盈利: 43.75286705693204 亏损: -0.9217194103700712 最大盈利: 30.52 最大亏损: -0.92 总收益: 42.83 平均盈利: 8.57 typeA: 6.85 胜率: 80.00%
趋势空且增强-L1-3-4-2 总交易次数: 4 盈利: 13.823706497951534 亏损: -27.03617424242421 最大盈利: 6.43 最大亏损: -27.04 总收益: -13.21 平均盈利: -3.30 typeA: -2.48 胜率: 75.00%
趋势空且增强-L2-3-5 总交易次数: 3 盈利: 33.96956301911009 亏损: -2.2299012312271325 最大盈利: 31.94 最大亏损: -2.23 总收益: 31.74 平均盈利: 10.58 typeA: 7.05 胜率: 66.67%
趋势多且增强-L1-3-1 总交易次数: 3 盈利: 19.327349385840833 亏损: -2.067233865947288 最大盈利: 17.46 最大亏损: -2.07 总收益: 17.26 平均盈利: 5.75 typeA: 3.84 胜率: 66.67%
趋势多且增强-R-1-1-2 总交易次数: 3 盈利: 26.397879320142174 亏损: -2.3099504062466165 最大盈利: 23.11 最大亏损: -2.31 总收益: 24.09 平均盈利: 8.03 typeA: 5.35 胜率: 66.67%
趋势多且增强-L3-1-4-4 总交易次数: 9 盈利: 33.47660240884281 亏损: -35.433606500680014 最大盈利: 22.99 最大亏损: -16.64 总收益: -1.96 平均盈利: -0.22 typeA: -0.12 胜率: 55.56%
趋势多且增强-R-3-1 总交易次数: 2 盈利: 2.3501678077593735 亏损: -4.9064376590331955 最大盈利: 2.35 最大亏损: -4.91 总收益: -2.56 平均盈利: -1.28 typeA: -0.64 胜率: 50.00%
趋势空且增强-L2-3-4 总交易次数: 8 盈利: 27.5383438810103 亏损: -60.4383607631111 最大盈利: 18.57 最大亏损: -33.04 总收益: -32.90 平均盈利: -4.11 typeA: -2.06 胜率: 50.00%
趋势多且增强-L3-1-3 总交易次数: 2 盈利: 2.875328807806519 亏损: -0.45550728341416113 最大盈利: 2.88 最大亏损: -0.46 总收益: 2.42 平均盈利: 1.21 typeA: 0.60 胜率: 50.00%
趋势多且增强-L3-1-4-3 总交易次数: 6 盈利: 36.56743058461051 亏损: -84.82011165341571 最大盈利: 32.99 最大亏损: -55.36 总收益: -48.25 平均盈利: -8.04 typeA: -2.68 胜率: 33.33%
趋势多且增强-L3-1-4-2 总交易次数: 1 盈利: 0 亏损: -10.760872008090756 最大盈利: -10.76 最大亏损: -10.76 总收益: -10.76 平均盈利: -10.76 typeA: 0.00 胜率: 0.00%
趋势空且增强-2 总交易次数: 1 盈利: 0 亏损: -3.687447698744801 最大盈利: -3.69 最大亏损: -3.69 总收益: -3.69 平均盈利: -3.69 typeA: 0.00 胜率: 0.00%
趋势多且增强-L1-3-2 总交易次数: 1 盈利: 0 亏损: -7.57025751916651 最大盈利: -7.57 最大亏损: -7.57 总收益: -7.57 平均盈利: -7.57 typeA: 0.00 胜率: 0.00%
Loaded 3000 15m candles

      ========== 回测结果 ==========
      总交易次数:     92
      胜率:          71.74%
      总收益:        95.11 USDT
      期末余额:      1076.51 USDT
      盈亏比:        1.26
      最大单笔盈利:  41.42
      最大单笔亏损:  -89.77
      手续费:       36.99011017825181
      =============================
    
profit: 76.50803553345668
maxDrawdown 10.9%
startTime: 2023-12-17 00:00:00
趋势多且增强-R-2-1 总交易次数: 1 盈利: 2.6258288944450086 亏损: 0 最大盈利: 2.63 最大亏损: 2.63 总收益: 2.63 平均盈利: 2.63 typeA: 2.63 胜率: 100.00%
趋势多且增强-L1-3-1 总交易次数: 1 盈利: 11.160134184612003 亏损: 0 最大盈利: 11.16 最大亏损: 11.16 总收益: 11.16 平均盈利: 11.16 typeA: 11.16 胜率: 100.00%
趋势多且增强-R-2-2 总交易次数: 1 盈利: 22.83259631934338 亏损: 0 最大盈利: 22.83 最大亏损: 22.83 总收益: 22.83 平均盈利: 22.83 typeA: 22.83 胜率: 100.00%
趋势空且增强-L2-2-3 总交易次数: 1 盈利: 7.48202764976945 亏损: 0 最大盈利: 7.48 最大亏损: 7.48 总收益: 7.48 平均盈利: 7.48 typeA: 7.48 胜率: 100.00%
趋势多且增强-L3-1-4-2 总交易次数: 1 盈利: 3.972682433286922 亏损: 0 最大盈利: 3.97 最大亏损: 3.97 总收益: 3.97 平均盈利: 3.97 typeA: 3.97 胜率: 100.00%
趋势空且增强-L1-3-4-2 总交易次数: 7 盈利: 27.686934817760335 亏损: -0.7967780429593614 最大盈利: 14.66 最大亏损: -0.80 总收益: 26.89 平均盈利: 3.84 typeA: 3.29 胜率: 85.71%
趋势多且增强-L3-1-5 总交易次数: 6 盈利: 44.26397790255561 亏损: -11.630053863911174 最大盈利: 22.93 最大亏损: -11.63 总收益: 32.63 平均盈利: 5.44 typeA: 4.53 胜率: 83.33%
趋势空且增强-L2-3-3 总交易次数: 11 盈利: 67.17756772054304 亏损: -5.296723848049363 最大盈利: 23.34 最大亏损: -2.87 总收益: 61.88 平均盈利: 5.63 typeA: 4.60 胜率: 81.82%
趋势空且增强-L-4-2-3 总交易次数: 5 盈利: 51.50344480089928 亏损: -8.05053033517173 最大盈利: 41.42 最大亏损: -8.05 总收益: 43.45 平均盈利: 8.69 typeA: 6.95 胜率: 80.00%
趋势多且增强-L3-1-4-4 总交易次数: 11 盈利: 44.72846528619666 亏损: -39.604856332510366 最大盈利: 19.60 最大亏损: -32.40 总收益: 5.12 平均盈利: 0.47 typeA: 0.34 胜率: 72.73%
趋势空且增强-L2-3-4 总交易次数: 18 盈利: 28.256133977060262 亏损: -19.520366118787855 最大盈利: 5.35 最大亏损: -6.97 总收益: 8.74 平均盈利: 0.49 typeA: 0.35 胜率: 72.22%
趋势多且增强-L3-1-4-3 总交易次数: 7 盈利: 19.88063005522523 亏损: -2.5323533124212245 最大盈利: 7.42 最大亏损: -1.29 总收益: 17.35 平均盈利: 2.48 typeA: 1.77 胜率: 71.43%
趋势空且增强-11 总交易次数: 3 盈利: 57.25696196083584 亏损: -89.77014925373139 最大盈利: 32.71 最大亏损: -89.77 总收益: -32.51 平均盈利: -10.84 typeA: -7.23 胜率: 66.67%
趋势多且增强-R-1-1-2 总交易次数: 3 盈利: 35.56029605580625 亏损: -17.20633551090833 最大盈利: 27.99 最大亏损: -17.21 总收益: 18.35 平均盈利: 6.12 typeA: 4.08 胜率: 66.67%
趋势多且增强-L1-3-2 总交易次数: 2 盈利: 2.4908170954892905 亏损: -15.75963645418328 最大盈利: 2.49 最大亏损: -15.76 总收益: -13.27 平均盈利: -6.63 typeA: -3.32 胜率: 50.00%
趋势多且增强-R-3-1 总交易次数: 7 盈利: 32.90566960807101 亏损: -109.6697487794425 最大盈利: 24.00 最大亏损: -73.28 总收益: -76.76 平均盈利: -10.97 typeA: -4.70 胜率: 42.86%
趋势空且增强-L2-3-5 总交易次数: 7 盈利: 6.387201005554945 亏损: -51.22580238191762 最大盈利: 4.51 最大亏损: -17.37 总收益: -44.84 平均盈利: -6.41 typeA: -2.75 胜率: 42.86%
Loaded 3000 15m candles

      ========== 回测结果 ==========
      总交易次数:     45
      胜率:          57.78%
      总收益:        185.10 USDT
      期末余额:      1176.10 USDT
      盈亏比:        3.07
      最大单笔盈利:  86.75
      最大单笔亏损:  -22.94
      手续费:       18.026524465368247
      =============================
    
profit: 176.10409416243056
maxDrawdown 4.4%
startTime: 2024-01-16 00:00:00
趋势空且增强-L1-3-4-2 总交易次数: 3 盈利: 43.82372213410712 亏损: 0 最大盈利: 21.09 最大亏损: 3.55 总收益: 43.82 平均盈利: 14.61 typeA: 14.61 胜率: 100.00%
趋势空且增强-11 总交易次数: 1 盈利: 19.501660059464747 亏损: 0 最大盈利: 19.50 最大亏损: 19.50 总收益: 19.50 平均盈利: 19.50 typeA: 19.50 胜率: 100.00%
趋势多且增强-L3-1-4-2 总交易次数: 1 盈利: 14.972981714143536 亏损: 0 最大盈利: 14.97 最大亏损: 14.97 总收益: 14.97 平均盈利: 14.97 typeA: 14.97 胜率: 100.00%
趋势多且增强-L3-1-5 总交易次数: 3 盈利: 43.8546748701896 亏损: 0 最大盈利: 40.07 最大亏损: 1.82 总收益: 43.85 平均盈利: 14.62 typeA: 14.62 胜率: 100.00%
趋势多且增强-R-3-1 总交易次数: 5 盈利: 2.3821745678119255 亏损: -22.94282825729824 最大盈利: 1.33 最大亏损: -22.94 总收益: -20.56 平均盈利: -4.11 typeA: -3.29 胜率: 80.00%
趋势多且增强-L3-1-3 总交易次数: 5 盈利: 103.19198122743026 亏损: -2.5923436583419917 最大盈利: 86.75 最大亏损: -1.66 总收益: 100.60 平均盈利: 20.12 typeA: 12.07 胜率: 60.00%
趋势多且增强-L3-1-4-4 总交易次数: 7 盈利: 21.88542660959629 亏损: -7.8267305152640105 最大盈利: 20.35 最大亏损: -3.10 总收益: 14.06 平均盈利: 2.01 typeA: 1.15 胜率: 57.14%
趋势多且增强-L3-1-4-3 总交易次数: 2 盈利: 7.41518427518422 亏损: -1.596723393446774 最大盈利: 7.42 最大亏损: -1.60 总收益: 5.82 平均盈利: 2.91 typeA: 1.45 胜率: 50.00%
趋势空且增强-L2-3-3 总交易次数: 5 盈利: 12.615806118524493 亏损: -21.708621350063932 最大盈利: 10.24 最大亏损: -17.74 总收益: -9.09 平均盈利: -1.82 typeA: -0.73 胜率: 40.00%
趋势空且增强-L2-3-5 总交易次数: 8 盈利: 3.1239609247385056 亏损: -10.963386269205785 最大盈利: 1.65 最大亏损: -5.34 总收益: -7.84 平均盈利: -0.98 typeA: -0.37 胜率: 37.50%
趋势空且增强-L2-3-4 总交易次数: 5 盈利: 1.7185421994886347 亏损: -21.751387094625525 最大盈利: 1.72 最大亏损: -20.14 总收益: -20.03 平均盈利: -4.01 typeA: -0.80 胜率: 20.00%
Loaded 3000 15m candles

      ========== 回测结果 ==========
      总交易次数:     76
      胜率:          56.58%
      总收益:        446.66 USDT
      期末余额:      1431.46 USDT
      盈亏比:        1.68
      最大单笔盈利:  258.83
      最大单笔亏损:  -64.30
      手续费:       30.43098492746055
      =============================
    
profit: 431.4601477159142
maxDrawdown 18.4%
startTime: 2024-02-15 00:00:00
趋势多且增强-R-3-1 总交易次数: 2 盈利: 1.524821557963705 亏损: 0 最大盈利: 1.12 最大亏损: 0.40 总收益: 1.52 平均盈利: 0.76 typeA: 0.76 胜率: 100.00%
趋势多且增强-L3-1-4-3 总交易次数: 2 盈利: 17.611045603715148 亏损: 0 最大盈利: 13.86 最大亏损: 3.75 总收益: 17.61 平均盈利: 8.81 typeA: 8.81 胜率: 100.00%
趋势多且增强-L1-3-2 总交易次数: 1 盈利: 88.02755136409573 亏损: 0 最大盈利: 88.03 最大亏损: 88.03 总收益: 88.03 平均盈利: 88.03 typeA: 88.03 胜率: 100.00%
趋势多且增强-L3-1-5 总交易次数: 2 盈利: 84.74984169434212 亏损: 0 最大盈利: 77.57 最大亏损: 7.18 总收益: 84.75 平均盈利: 42.37 typeA: 42.37 胜率: 100.00%
趋势多且增强-L3-1-4-2 总交易次数: 3 盈利: 29.939672507400378 亏损: 0 最大盈利: 22.09 最大亏损: 2.49 总收益: 29.94 平均盈利: 9.98 typeA: 9.98 胜率: 100.00%
趋势空且增强-L1-1-2 总交易次数: 1 盈利: 18.287507270729666 亏损: 0 最大盈利: 18.29 最大亏损: 18.29 总收益: 18.29 平均盈利: 18.29 typeA: 18.29 胜率: 100.00%
趋势空且增强-L2-2-3 总交易次数: 1 盈利: 56.21186420053541 亏损: 0 最大盈利: 56.21 最大亏损: 56.21 总收益: 56.21 平均盈利: 56.21 typeA: 56.21 胜率: 100.00%
趋势多且增强-L3-1-4-4 总交易次数: 4 盈利: 11.978873005301173 亏损: -15.88924293243881 最大盈利: 7.39 最大亏损: -15.89 总收益: -3.91 平均盈利: -0.98 typeA: -0.73 胜率: 75.00%
趋势空且增强-11 总交易次数: 4 盈利: 66.29617388980243 亏损: -63.937490505848466 最大盈利: 60.43 最大亏损: -63.94 总收益: 2.36 平均盈利: 0.59 typeA: 0.44 胜率: 75.00%
趋势多且增强-R-1-1-2 总交易次数: 4 盈利: 93.29648480031754 亏损: -11.352582371526271 最大盈利: 54.86 最大亏损: -11.35 总收益: 81.94 平均盈利: 20.49 typeA: 15.36 胜率: 75.00%
趋势空且增强-L1-3-4-2 总交易次数: 3 盈利: 6.106505900188039 亏损: -0.4359101362109338 最大盈利: 4.91 最大亏损: -0.44 总收益: 5.67 平均盈利: 1.89 typeA: 1.26 胜率: 66.67%
趋势多且增强-L3-1-3 总交易次数: 5 盈利: 51.40236868968142 亏损: -16.344516600236826 最大盈利: 42.99 最大亏损: -15.53 总收益: 35.06 平均盈利: 7.01 typeA: 4.21 胜率: 60.00%
趋势空且增强-L2-3-5 总交易次数: 2 盈利: 1.5939734545019415 亏损: -0.6653175157013069 最大盈利: 1.59 最大亏损: -0.67 总收益: 0.93 平均盈利: 0.46 typeA: 0.23 胜率: 50.00%
趋势空且增强-L-4-2-3 总交易次数: 4 盈利: 9.05127627681079 亏损: -38.69595803515416 最大盈利: 5.32 最大亏损: -30.14 总收益: -29.64 平均盈利: -7.41 typeA: -3.71 胜率: 50.00%
趋势多且增强-L3-1-4-1 总交易次数: 6 盈利: 90.80736179296939 亏损: -81.64753469105574 最大盈利: 60.33 最大亏损: -43.96 总收益: 9.16 平均盈利: 1.53 typeA: 0.76 胜率: 50.00%
趋势多且增强-L1-1-6 总交易次数: 2 盈利: 36.16097066463913 亏损: -22.53210812033482 最大盈利: 36.16 最大亏损: -22.53 总收益: 13.63 平均盈利: 6.81 typeA: 3.41 胜率: 50.00%
趋势空且增强-L2-3-4 总交易次数: 11 盈利: 49.19786433416881 亏损: -77.71429723126961 最大盈利: 34.89 最大亏损: -42.87 总收益: -28.52 平均盈利: -2.59 typeA: -1.18 胜率: 45.45%
趋势空且增强-L2-3-3 总交易次数: 8 盈利: 321.5911823264005 亏损: -99.51935878246465 最大盈利: 258.83 最大亏损: -41.27 总收益: 222.07 平均盈利: 27.76 typeA: 10.41 胜率: 37.50%
趋势多且增强-R-1-2-2 总交易次数: 3 盈利: 13.377988868274567 亏损: -19.953088755047155 最大盈利: 13.38 最大亏损: -18.41 总收益: -6.58 平均盈利: -2.19 typeA: -0.73 胜率: 33.33%
趋势空且增强-2 总交易次数: 6 盈利: 60.42654017980255 亏损: -162.28061130654825 最大盈利: 60.43 最大亏损: -64.30 总收益: -101.85 平均盈利: -16.98 typeA: -2.83 胜率: 16.67%
趋势多且增强-L1-3-1 总交易次数: 1 盈利: 0 亏损: -48.26199580064103 最大盈利: -48.26 最大亏损: -48.26 总收益: -48.26 平均盈利: -48.26 typeA: 0.00 胜率: 0.00%
趋势多且增强-R-2-1 总交易次数: 1 盈利: 0 亏损: -1.7497078812448443 最大盈利: -1.75 最大亏损: -1.75 总收益: -1.75 平均盈利: -1.75 typeA: 0.00 胜率: 0.00%
Loaded 3000 15m candles

      ========== 回测结果 ==========
      总交易次数:     86
      胜率:          59.30%
      总收益:        137.79 USDT
      期末余额:      1120.59 USDT
      盈亏比:        1.23
      最大单笔盈利:  127.84
      最大单笔亏损:  -64.69
      手续费:       34.38372235290916
      =============================
    
profit: 120.59278932247958
maxDrawdown 12.9%
startTime: 2024-03-16 00:00:00
趋势空且增强-L2-2-3 总交易次数: 2 盈利: 33.121703696883856 亏损: 0 最大盈利: 17.92 最大亏损: 15.20 总收益: 33.12 平均盈利: 16.56 typeA: 16.56 胜率: 100.00%
趋势多且增强-L1-2-2 总交易次数: 1 盈利: 3.7651091762774396 亏损: 0 最大盈利: 3.77 最大亏损: 3.77 总收益: 3.77 平均盈利: 3.77 typeA: 3.77 胜率: 100.00%
趋势空且增强-L1-3-4-2 总交易次数: 2 盈利: 7.885983723666117 亏损: 0 最大盈利: 5.44 最大亏损: 2.45 总收益: 7.89 平均盈利: 3.94 typeA: 3.94 胜率: 100.00%
趋势多且增强-R-1-1-1 总交易次数: 3 盈利: 14.850525899783499 亏损: 0 最大盈利: 9.65 最大亏损: 0.50 总收益: 14.85 平均盈利: 4.95 typeA: 4.95 胜率: 100.00%
趋势空且增强-L2-1-3 总交易次数: 1 盈利: 3.7755889481338594 亏损: 0 最大盈利: 3.78 最大亏损: 3.78 总收益: 3.78 平均盈利: 3.78 typeA: 3.78 胜率: 100.00%
趋势空且增强-L-4-2-3 总交易次数: 1 盈利: 2.7243969637335983 亏损: 0 最大盈利: 2.72 最大亏损: 2.72 总收益: 2.72 平均盈利: 2.72 typeA: 2.72 胜率: 100.00%
趋势多且增强-L3-1-4-1 总交易次数: 6 盈利: 24.355862335014834 亏损: -6.428677114766882 最大盈利: 13.11 最大亏损: -6.43 总收益: 17.93 平均盈利: 2.99 typeA: 2.49 胜率: 83.33%
趋势多且增强-L3-1-4-2 总交易次数: 5 盈利: 198.98457253756558 亏损: -23.568032168886596 最大盈利: 127.84 最大亏损: -23.57 总收益: 175.42 平均盈利: 35.08 typeA: 28.07 胜率: 80.00%
趋势多且增强-L1-1-6 总交易次数: 3 盈利: 52.791792925610935 亏损: -11.087864724532388 最大盈利: 45.80 最大亏损: -11.09 总收益: 41.70 平均盈利: 13.90 typeA: 9.27 胜率: 66.67%
趋势多且增强-R-1-1-2 总交易次数: 11 盈利: 57.18403616627037 亏损: -114.12366563713891 最大盈利: 23.07 最大亏损: -51.19 总收益: -56.94 平均盈利: -5.18 typeA: -3.29 胜率: 63.64%
趋势空且增强-11 总交易次数: 5 盈利: 54.600540051605876 亏损: -5.02738786912643 最大盈利: 25.33 最大亏损: -3.65 总收益: 49.57 平均盈利: 9.91 typeA: 5.95 胜率: 60.00%
趋势多且增强-L3-1-5 总交易次数: 7 盈利: 19.93622849496912 亏损: -17.662619304081353 最大盈利: 9.34 最大亏损: -15.73 总收益: 2.27 平均盈利: 0.32 typeA: 0.19 胜率: 57.14%
趋势空且增强-L2-3-3 总交易次数: 7 盈利: 33.24178398050664 亏损: -40.58259156007563 最大盈利: 9.83 最大亏损: -17.67 总收益: -7.34 平均盈利: -1.05 typeA: -0.60 胜率: 57.14%
趋势多且增强-R-1-2-2 总交易次数: 4 盈利: 5.8317235429872625 亏损: -19.953088755047155 最大盈利: 4.05 最大亏损: -18.41 总收益: -14.12 平均盈利: -3.53 typeA: -1.77 胜率: 50.00%
趋势空且增强-L2-3-4 总交易次数: 2 盈利: 6.2485061327183615 亏损: -4.9543262606778455 最大盈利: 6.25 最大亏损: -4.95 总收益: 1.29 平均盈利: 0.65 typeA: 0.32 胜率: 50.00%
趋势空且增强-L2-3-5 总交易次数: 2 盈利: 71.79680592524016 亏损: -14.69897001602207 最大盈利: 71.80 最大亏损: -14.70 总收益: 57.10 平均盈利: 28.55 typeA: 14.27 胜率: 50.00%
趋势空且增强-L1-1-2 总交易次数: 2 盈利: 15.195377769705793 亏损: -2.1214380460138305 最大盈利: 15.20 最大亏损: -2.12 总收益: 13.07 平均盈利: 6.54 typeA: 3.27 胜率: 50.00%
趋势多且增强-L1-3-9 总交易次数: 2 盈利: 57.84952543038566 亏损: -41.80905473706848 最大盈利: 57.85 最大亏损: -41.81 总收益: 16.04 平均盈利: 8.02 typeA: 4.01 胜率: 50.00%
趋势空且增强-2 总交易次数: 11 盈利: 73.05234632009058 亏损: -123.05230972089123 最大盈利: 47.52 最大亏损: -40.06 总收益: -50.00 平均盈利: -4.55 typeA: -2.07 胜率: 45.45%
趋势多且增强-L3-1-3 总交易次数: 7 盈利: 1.1120017496855499 亏损: -143.24905663725005 最大盈利: 1.11 最大亏损: -64.69 总收益: -142.14 平均盈利: -20.31 typeA: -2.90 胜率: 14.29%
趋势多且增强-L3-1-4-3 总交易次数: 1 盈利: 0 亏损: -13.686032065313874 最大盈利: -13.69 最大亏损: -13.69 总收益: -13.69 平均盈利: -13.69 typeA: 0.00 胜率: 0.00%
趋势多且增强-L1-2-1 总交易次数: 1 盈利: 0 亏损: -18.50650783145829 最大盈利: -18.51 最大亏损: -18.51 总收益: -18.51 平均盈利: -18.51 typeA: 0.00 胜率: 0.00%
Loaded 3000 15m candles

      ========== 回测结果 ==========
      总交易次数:     86
      胜率:          55.81%
      总收益:        91.26 USDT
      期末余额:      1074.06 USDT
      盈亏比:        1.27
      最大单笔盈利:  76.67
      最大单笔亏损:  -48.06
      手续费:       34.366278784830236
      =============================
    
profit: 74.05625006064429
maxDrawdown 5.4%
startTime: 2024-04-15 00:00:00
趋势空且增强-L2-3-3 总交易次数: 4 盈利: 39.15987990948789 亏损: 0 最大盈利: 18.04 最大亏损: 2.96 总收益: 39.16 平均盈利: 9.79 typeA: 9.79 胜率: 100.00%
趋势空且增强-L2-3-5 总交易次数: 4 盈利: 22.88052435573119 亏损: 0 最大盈利: 13.07 最大亏损: 2.31 总收益: 22.88 平均盈利: 5.72 typeA: 5.72 胜率: 100.00%
趋势空且增强-L2-1-3 总交易次数: 1 盈利: 9.780946441100829 亏损: 0 最大盈利: 9.78 最大亏损: 9.78 总收益: 9.78 平均盈利: 9.78 typeA: 9.78 胜率: 100.00%
趋势多且增强-L1-2-1 总交易次数: 1 盈利: 76.67169887009415 亏损: 0 最大盈利: 76.67 最大亏损: 76.67 总收益: 76.67 平均盈利: 76.67 typeA: 76.67 胜率: 100.00%
趋势空且增强-2 总交易次数: 8 盈利: 33.87473970213472 亏损: -26.480364312070176 最大盈利: 16.00 最大亏损: -20.72 总收益: 7.39 平均盈利: 0.92 typeA: 0.69 胜率: 75.00%
趋势空且增强-11 总交易次数: 8 盈利: 51.15164660882626 亏损: -43.07273476004275 最大盈利: 22.46 最大亏损: -29.01 总收益: 8.08 平均盈利: 1.01 typeA: 0.76 胜率: 75.00%
趋势空且增强-L2-3-4 总交易次数: 9 盈利: 74.58282911851752 亏损: -24.219049481039292 最大盈利: 26.60 最大亏损: -13.36 总收益: 50.36 平均盈利: 5.60 typeA: 3.73 胜率: 66.67%
趋势空且增强-L-4-2-3 总交易次数: 3 盈利: 29.74908900767058 亏损: -4.250906598542039 最大盈利: 26.26 最大亏损: -4.25 总收益: 25.50 平均盈利: 8.50 typeA: 5.67 胜率: 66.67%
趋势多且增强-L3-1-4-3 总交易次数: 7 盈利: 27.608867409957128 亏损: -1.771720809116489 最大盈利: 21.99 最大亏损: -1.06 总收益: 25.84 平均盈利: 3.69 typeA: 2.11 胜率: 57.14%
趋势多且增强-R-1-1-2 总交易次数: 10 盈利: 17.215230999889936 亏损: -47.453719334907966 最大盈利: 7.28 最大亏损: -20.44 总收益: -30.24 平均盈利: -3.02 typeA: -1.51 胜率: 50.00%
趋势多且增强-L3-1-4-4 总交易次数: 2 盈利: 5.243108141549071 亏损: -6.088960953011263 最大盈利: 5.24 最大亏损: -6.09 总收益: -0.85 平均盈利: -0.42 typeA: -0.21 胜率: 50.00%
趋势多且增强-L3-1-4-2 总交易次数: 4 盈利: 28.436825995552606 亏损: -6.572380592369322 最大盈利: 24.23 最大亏损: -3.42 总收益: 21.86 平均盈利: 5.47 typeA: 2.73 胜率: 50.00%
趋势空且增强-L1-3-4-2 总交易次数: 4 盈利: 2.343556533768443 亏损: -35.15815131799944 最大盈利: 1.28 最大亏损: -28.93 总收益: -32.81 平均盈利: -8.20 typeA: -4.10 胜率: 50.00%
趋势多且增强-L3-1-5 总交易次数: 8 盈利: 13.557784197142903 亏损: -86.74523136141477 最大盈利: 5.08 最大亏损: -48.06 总收益: -73.19 平均盈利: -9.15 typeA: -3.43 胜率: 37.50%
趋势多且增强-R-1-2-2 总交易次数: 4 盈利: 1.2602726387537608 亏损: -15.305703512383323 最大盈利: 1.26 最大亏损: -9.32 总收益: -14.05 平均盈利: -3.51 typeA: -0.88 胜率: 25.00%
趋势多且增强-L1-3-1 总交易次数: 1 盈利: 0 亏损: -4.01979295045606 最大盈利: -4.02 最大亏损: -4.02 总收益: -4.02 平均盈利: -4.02 typeA: 0.00 胜率: 0.00%
趋势多且增强-L1-3-2 总交易次数: 1 盈利: 0 亏损: -6.070189484921401 最大盈利: -6.07 最大亏损: -6.07 总收益: -6.07 平均盈利: -6.07 typeA: 0.00 胜率: 0.00%
趋势多且增强-R-2-1 总交易次数: 1 盈利: 0 亏损: -0.47196191771495755 最大盈利: -0.47 最大亏损: -0.47 总收益: -0.47 平均盈利: -0.47 typeA: 0.00 胜率: 0.00%
趋势多且增强-R-2-2 总交易次数: 1 盈利: 0 亏损: -0.8195400716056647 最大盈利: -0.82 最大亏损: -0.82 总收益: -0.82 平均盈利: -0.82 typeA: 0.00 胜率: 0.00%
趋势多且增强-L3-1-4-1 总交易次数: 2 盈利: 0 亏损: -28.28360149355181 最大盈利: -3.85 最大亏损: -24.44 总收益: -28.28 平均盈利: -14.14 typeA: 0.00 胜率: 0.00%
趋势多且增强-L3-1-3 总交易次数: 2 盈利: 0 亏损: -0.4662689732883277 最大盈利: -0.20 最大亏损: -0.27 总收益: -0.47 平均盈利: -0.23 typeA: 0.00 胜率: 0.00%
趋势多且增强-R-3-1 总交易次数: 1 盈利: 0 亏损: -5.010471945093143 最大盈利: -5.01 最大亏损: -5.01 总收益: -5.01 平均盈利: -5.01 typeA: 0.00 胜率: 0.00%
Loaded 3000 15m candles

      ========== 回测结果 ==========
      总交易次数:     88
      胜率:          54.55%
      总收益:        23.38 USDT
      期末余额:      1005.78 USDT
      盈亏比:        1.06
      最大单笔盈利:  46.80
      最大单笔亏损:  -53.66
      手续费:       35.2226401193002
      =============================
    
profit: 5.7825713341318306
maxDrawdown 10.8%
startTime: 2024-05-15 00:00:00
趋势多且增强-L1-2-1 总交易次数: 1 盈利: 0.4129230014714122 亏损: 0 最大盈利: 0.41 最大亏损: 0.41 总收益: 0.41 平均盈利: 0.41 typeA: 0.41 胜率: 100.00%
趋势空且增强-L2-3-3 总交易次数: 8 盈利: 73.91058811323563 亏损: -18.85004644990051 最大盈利: 46.80 最大亏损: -18.85 总收益: 55.06 平均盈利: 6.88 typeA: 6.02 胜率: 87.50%
趋势多且增强-R-2-1 总交易次数: 5 盈利: 51.90435507675981 亏损: -3.6746646277889794 最大盈利: 22.63 最大亏损: -3.67 总收益: 48.23 平均盈利: 9.65 typeA: 7.72 胜率: 80.00%
趋势多且增强-R-1-1-2 总交易次数: 4 盈利: 27.41629863864641 亏损: -53.65769970509048 最大盈利: 16.79 最大亏损: -53.66 总收益: -26.24 平均盈利: -6.56 typeA: -4.92 胜率: 75.00%
趋势空且增强-L2-3-5 总交易次数: 7 盈利: 23.146211680426184 亏损: -8.080721914274529 最大盈利: 11.57 最大亏损: -5.27 总收益: 15.07 平均盈利: 2.15 typeA: 1.54 胜率: 71.43%
趋势多且增强-L3-1-3 总交易次数: 3 盈利: 3.6366186844307022 亏损: -0.2662689732883277 最大盈利: 2.17 最大亏损: -0.27 总收益: 3.37 平均盈利: 1.12 typeA: 0.75 胜率: 66.67%
趋势多且增强-L3-1-5 总交易次数: 6 盈利: 33.89034826790703 亏损: -13.356674352242418 最大盈利: 23.60 最大亏损: -10.91 总收益: 20.53 平均盈利: 3.42 typeA: 2.28 胜率: 66.67%
趋势多且增强-L3-1-4-4 总交易次数: 10 盈利: 60.89651838007185 亏损: -32.16281417348228 最大盈利: 44.31 最大亏损: -18.62 总收益: 28.73 平均盈利: 2.87 typeA: 1.72 胜率: 60.00%
趋势空且增强-L-4-2-3 总交易次数: 7 盈利: 15.569767761223138 亏损: -11.82707813642913 最大盈利: 10.16 最大亏损: -6.98 总收益: 3.74 平均盈利: 0.53 typeA: 0.31 胜率: 57.14%
趋势多且增强-L3-1-4-3 总交易次数: 4 盈利: 27.304439369198768 亏损: -10.122693574318138 最大盈利: 24.07 最大亏损: -6.42 总收益: 17.18 平均盈利: 4.30 typeA: 2.15 胜率: 50.00%
趋势空且增强-11 总交易次数: 4 盈利: 31.072963390942057 亏损: -71.54922357250818 最大盈利: 24.06 最大亏损: -53.27 总收益: -40.48 平均盈利: -10.12 typeA: -5.06 胜率: 50.00%
趋势空且增强-L1-3-4-2 总交易次数: 6 盈利: 9.998981120987835 亏损: -15.10491480245482 最大盈利: 8.35 最大亏损: -9.70 总收益: -5.11 平均盈利: -0.85 typeA: -0.43 胜率: 50.00%
趋势空且增强-L2-1-3 总交易次数: 2 盈利: 5.978474697077768 亏损: -0.4455683771175085 最大盈利: 5.98 最大亏损: -0.45 总收益: 5.53 平均盈利: 2.77 typeA: 1.38 胜率: 50.00%
趋势多且增强-L1-3-9 总交易次数: 2 盈利: 11.875025793530327 亏损: -4.621250149396383 最大盈利: 11.88 最大亏损: -4.62 总收益: 7.25 平均盈利: 3.63 typeA: 1.81 胜率: 50.00%
趋势多且增强-L3-1-4-1 总交易次数: 2 盈利: 2.1221971123666616 亏损: -6.45002378202082 最大盈利: 2.12 最大亏损: -6.45 总收益: -4.33 平均盈利: -2.16 typeA: -1.08 胜率: 50.00%
趋势多且增强-L3-1-4-2 总交易次数: 4 盈利: 10.13290777554871 亏损: -15.281338833421792 最大盈利: 10.13 最大亏损: -5.76 总收益: -5.15 平均盈利: -1.29 typeA: -0.32 胜率: 25.00%
趋势空且增强-L2-3-4 总交易次数: 7 盈利: 1.4349302150132666 亏损: -63.02113381351484 最大盈利: 1.43 最大亏损: -20.12 总收益: -61.59 平均盈利: -8.80 typeA: -1.26 胜率: 14.29%
趋势空且增强-2 总交易次数: 3 盈利: 0 亏损: -17.138141975075605 最大盈利: -3.78 最大亏损: -9.36 总收益: -17.14 平均盈利: -5.71 typeA: 0.00 胜率: 0.00%
趋势多且增强-R-3-1 总交易次数: 1 盈利: 0 亏损: -0.9531707985207436 最大盈利: -0.95 最大亏损: -0.95 总收益: -0.95 平均盈利: -0.95 typeA: 0.00 胜率: 0.00%
趋势多且增强-R-1-2-2 总交易次数: 1 盈利: 0 亏损: -7.431559524688232 最大盈利: -7.43 最大亏损: -7.43 总收益: -7.43 平均盈利: -7.43 typeA: 0.00 胜率: 0.00%
趋势多且增强-R-1-1-1 总交易次数: 1 盈利: 0 亏损: -13.325990209167733 最大盈利: -13.33 最大亏损: -13.33 总收益: -13.33 平均盈利: -13.33 typeA: 0.00 胜率: 0.00%
Loaded 3000 15m candles

      ========== 回测结果 ==========
      总交易次数:     73
      胜率:          58.90%
      总收益:        9.00 USDT
      期末余额:      994.40 USDT
      盈亏比:        1.02
      最大单笔盈利:  66.70
      最大单笔亏损:  -57.51
      手续费:       29.228012929941332
      =============================
    
profit: -5.598786185600829
maxDrawdown 12.0%
startTime: 2024-06-14 00:00:00
趋势空且增强-L1-3-4-2 总交易次数: 5 盈利: 35.239830085829496 亏损: 0 最大盈利: 25.71 最大亏损: 1.08 总收益: 35.24 平均盈利: 7.05 typeA: 7.05 胜率: 100.00%
趋势多且增强-R-3-1 总交易次数: 2 盈利: 4.067965281677704 亏损: 0 最大盈利: 2.88 最大亏损: 1.19 总收益: 4.07 平均盈利: 2.03 typeA: 2.03 胜率: 100.00%
趋势多且增强-L1-3-1 总交易次数: 1 盈利: 22.950688952303263 亏损: 0 最大盈利: 22.95 最大亏损: 22.95 总收益: 22.95 平均盈利: 22.95 typeA: 22.95 胜率: 100.00%
趋势多且增强-L1-3-2 总交易次数: 2 盈利: 78.84365567155581 亏损: 0 最大盈利: 66.70 最大亏损: 12.15 总收益: 78.84 平均盈利: 39.42 typeA: 39.42 胜率: 100.00%
趋势多且增强-R-2-2 总交易次数: 1 盈利: 3.337922318645124 亏损: 0 最大盈利: 3.34 最大亏损: 3.34 总收益: 3.34 平均盈利: 3.34 typeA: 3.34 胜率: 100.00%
趋势多且增强-R-1-2-2 总交易次数: 1 盈利: 29.78647987965399 亏损: 0 最大盈利: 29.79 最大亏损: 29.79 总收益: 29.79 平均盈利: 29.79 typeA: 29.79 胜率: 100.00%
趋势空且增强-11 总交易次数: 2 盈利: 15.98540860184167 亏损: 0 最大盈利: 13.41 最大亏损: 2.57 总收益: 15.99 平均盈利: 7.99 typeA: 7.99 胜率: 100.00%
趋势多且增强-L3-1-4-4 总交易次数: 6 盈利: 8.793595989586386 亏损: -35.26803114214634 最大盈利: 5.51 最大亏损: -35.27 总收益: -26.47 平均盈利: -4.41 typeA: -3.68 胜率: 83.33%
趋势多且增强-R-1-1-2 总交易次数: 10 盈利: 83.0774403345752 亏损: -50.044975650772585 最大盈利: 33.78 最大亏损: -44.19 总收益: 33.03 平均盈利: 3.30 typeA: 2.64 胜率: 80.00%
趋势空且增强-L2-3-5 总交易次数: 4 盈利: 59.747215712174 亏损: -56.08650514330763 最大盈利: 35.19 最大亏损: -49.75 总收益: 3.66 平均盈利: 0.92 typeA: 0.46 胜率: 50.00%
趋势多且增强-R-2-1 总交易次数: 4 盈利: 32.21077062516905 亏损: -51.1416745908265 最大盈利: 21.26 最大亏损: -46.38 总收益: -18.93 平均盈利: -4.73 typeA: -2.37 胜率: 50.00%
趋势多且增强-L3-1-4-2 总交易次数: 2 盈利: 16.03974660927465 亏损: -3.756741373176784 最大盈利: 16.04 最大亏损: -3.76 总收益: 12.28 平均盈利: 6.14 typeA: 3.07 胜率: 50.00%
趋势空且增强-L2-3-4 总交易次数: 8 盈利: 5.292880248253381 亏损: -7.560361843990698 最大盈利: 2.50 最大亏损: -3.52 总收益: -2.27 平均盈利: -0.28 typeA: -0.11 胜率: 37.50%
趋势空且增强-L2-3-3 总交易次数: 8 盈利: 13.722469200774075 亏损: -147.91040628915246 最大盈利: 6.36 最大亏损: -57.51 总收益: -134.19 平均盈利: -16.77 typeA: -6.29 胜率: 37.50%
趋势空且增强-L-4-2-3 总交易次数: 8 盈利: 69.73485984816455 亏损: -53.39474544411945 最大盈利: 49.19 最大亏损: -20.50 总收益: 16.34 平均盈利: 2.04 typeA: 0.77 胜率: 37.50%
趋势多且增强-L3-1-5 总交易次数: 3 盈利: 1.0874540103017039 亏损: -30.670278283070548 最大盈利: 1.09 最大亏损: -21.37 总收益: -29.58 平均盈利: -9.86 typeA: -3.29 胜率: 33.33%
趋势多且增强-L3-1-4-3 总交易次数: 4 盈利: 0.7538559389410795 亏损: -10.578806802735876 最大盈利: 0.75 最大亏损: -8.83 总收益: -9.82 平均盈利: -2.46 typeA: -0.61 胜率: 25.00%
趋势多且增强-R-1-1-1 总交易次数: 1 盈利: 0 亏损: -13.325990209167733 最大盈利: -13.33 最大亏损: -13.33 总收益: -13.33 平均盈利: -13.33 typeA: 0.00 胜率: 0.00%
趋势多且增强-L3-1-3 总交易次数: 1 盈利: 0 亏损: -11.932508721852274 最大盈利: -11.93 最大亏损: -11.93 总收益: -11.93 平均盈利: -11.93 typeA: 0.00 胜率: 0.00%
Loaded 3000 15m candles

      ========== 回测结果 ==========
      总交易次数:     75
      胜率:          57.33%
      总收益:        92.57 USDT
      期末余额:      1077.57 USDT
      盈亏比:        1.20
      最大单笔盈利:  46.54
      最大单笔亏损:  -68.26
      手续费:       29.99657839671034
      =============================
    
profit: 77.57391350246075
maxDrawdown 10.6%
startTime: 2024-07-14 00:00:00
趋势空且增强-L2-2-3 总交易次数: 1 盈利: 18.490886055903196 亏损: 0 最大盈利: 18.49 最大亏损: 18.49 总收益: 18.49 平均盈利: 18.49 typeA: 18.49 胜率: 100.00%
趋势多且增强-R-1-1-1 总交易次数: 1 盈利: 6.354208481709221 亏损: 0 最大盈利: 6.35 最大亏损: 6.35 总收益: 6.35 平均盈利: 6.35 typeA: 6.35 胜率: 100.00%
趋势空且增强-L1-3-4-2 总交易次数: 4 盈利: 14.547161271046571 亏损: -1.3622860764842486 最大盈利: 7.19 最大亏损: -1.36 总收益: 13.18 平均盈利: 3.30 typeA: 2.47 胜率: 75.00%
趋势空且增强-11 总交易次数: 4 盈利: 55.53702489735835 亏损: -25.709787310742602 最大盈利: 42.15 最大亏损: -25.71 总收益: 29.83 平均盈利: 7.46 typeA: 5.59 胜率: 75.00%
趋势多且增强-L3-1-5 总交易次数: 6 盈利: 54.00440284800635 亏损: -27.265370002112594 最大盈利: 40.03 最大亏损: -20.81 总收益: 26.74 平均盈利: 4.46 typeA: 2.97 胜率: 66.67%
趋势多且增强-R-1-1-2 总交易次数: 13 盈利: 65.8383864076234 亏损: -97.61289815342688 最大盈利: 44.00 最大亏损: -68.26 总收益: -31.77 平均盈利: -2.44 typeA: -1.50 胜率: 61.54%
趋势空且增强-L2-3-3 总交易次数: 11 盈利: 116.95970740291382 亏损: -85.5506714771893 最大盈利: 44.26 最大亏损: -43.05 总收益: 31.41 平均盈利: 2.86 typeA: 1.56 胜率: 54.55%
趋势空且增强-L-4-2-3 总交易次数: 8 盈利: 30.581065030931345 亏损: -21.24677336511921 最大盈利: 25.45 最大亏损: -13.21 总收益: 9.33 平均盈利: 1.17 typeA: 0.58 胜率: 50.00%
趋势多且增强-L3-1-4-2 总交易次数: 4 盈利: 61.09190376673139 亏损: -9.982743885448162 最大盈利: 46.54 最大亏损: -7.49 总收益: 51.11 平均盈利: 12.78 typeA: 6.39 胜率: 50.00%
趋势多且增强-L3-1-3 总交易次数: 4 盈利: 36.894583227565086 亏损: -23.383268915565054 最大盈利: 19.14 最大亏损: -22.36 总收益: 13.51 平均盈利: 3.38 typeA: 1.69 胜率: 50.00%
趋势空且增强-L2-3-5 总交易次数: 4 盈利: 44.71286838604857 亏损: -84.30321674479106 最大盈利: 22.43 最大亏损: -57.26 总收益: -39.59 平均盈利: -9.90 typeA: -4.95 胜率: 50.00%
趋势空且增强-2 总交易次数: 2 盈利: 8.332863501483718 亏损: -27.546495236619975 最大盈利: 8.33 最大亏损: -27.55 总收益: -19.21 平均盈利: -9.61 typeA: -4.80 胜率: 50.00%
趋势多且增强-R-1-2-2 总交易次数: 2 盈利: 25.091630231105505 亏损: -10.355712237093732 最大盈利: 25.09 最大亏损: -10.36 总收益: 14.74 平均盈利: 7.37 typeA: 3.68 胜率: 50.00%
趋势多且增强-L3-1-4-4 总交易次数: 4 盈利: 2.359710000586543 亏损: -30.716218254563167 最大盈利: 2.02 最大亏损: -29.85 总收益: -28.36 平均盈利: -7.09 typeA: -3.54 胜率: 50.00%
趋势多且增强-R-2-1 总交易次数: 2 盈利: 2.016851441241628 亏损: -11.942186026575312 最大盈利: 2.02 最大亏损: -11.94 总收益: -9.93 平均盈利: -4.96 typeA: -2.48 胜率: 50.00%
趋势空且增强-L2-3-4 总交易次数: 2 盈利: 21.408974240605747 亏损: -9.69959855086653 最大盈利: 21.41 最大亏损: -9.70 总收益: 11.71 平均盈利: 5.85 typeA: 2.93 胜率: 50.00%
趋势多且增强-L1-3-1 总交易次数: 3 盈利: 1.8091822538260183 亏损: -6.780269705624586 最大盈利: 1.81 最大亏损: -3.55 总收益: -4.97 平均盈利: -1.66 typeA: -0.55 胜率: 33.33%
Loaded 3000 15m candles

      ========== 回测结果 ==========
      总交易次数:     61
      胜率:          44.26%
      总收益:        -235.49 USDT
      期末余额:      752.31 USDT
      盈亏比:        0.39
      最大单笔盈利:  32.37
      最大单笔亏损:  -54.10
      手续费:       24.423810894209875
      =============================
    
profit: -247.6906897099342
maxDrawdown 27.4%
startTime: 2024-08-13 00:00:00
趋势空且增强-L2-1-3 总交易次数: 1 盈利: 0.4493600445186479 亏损: 0 最大盈利: 0.45 最大亏损: 0.45 总收益: 0.45 平均盈利: 0.45 typeA: 0.45 胜率: 100.00%
趋势多且增强-L3-1-4-1 总交易次数: 1 盈利: 7.986693961105478 亏损: 0 最大盈利: 7.99 最大亏损: 7.99 总收益: 7.99 平均盈利: 7.99 typeA: 7.99 胜率: 100.00%
趋势多且增强-R-1-2-2 总交易次数: 1 盈利: 27.087606263982234 亏损: 0 最大盈利: 27.09 最大亏损: 27.09 总收益: 27.09 平均盈利: 27.09 typeA: 27.09 胜率: 100.00%
趋势多且增强-L1-3-2 总交易次数: 1 盈利: 12.800495356037123 亏损: 0 最大盈利: 12.80 最大亏损: 12.80 总收益: 12.80 平均盈利: 12.80 typeA: 12.80 胜率: 100.00%
趋势空且增强-L-4-2-3 总交易次数: 3 盈利: 33.95901406820638 亏损: -0.39731702505431177 最大盈利: 32.37 最大亏损: -0.40 总收益: 33.56 平均盈利: 11.19 typeA: 7.46 胜率: 66.67%
趋势多且增强-L3-1-4-4 总交易次数: 6 盈利: 10.418093970306543 亏损: -0.6243288544048338 最大盈利: 7.38 最大亏损: -0.62 总收益: 9.79 平均盈利: 1.63 typeA: 1.09 胜率: 66.67%
趋势空且增强-L2-3-3 总交易次数: 8 盈利: 14.092766627074633 亏损: -14.36889733597636 最大盈利: 4.78 最大亏损: -6.18 总收益: -0.28 平均盈利: -0.03 typeA: -0.02 胜率: 62.50%
趋势空且增强-L1-3-4-2 总交易次数: 5 盈利: 11.908568486883667 亏损: -64.20535416011047 最大盈利: 6.58 最大亏损: -54.10 总收益: -52.30 平均盈利: -10.46 typeA: -6.28 胜率: 60.00%
趋势多且增强-R-2-1 总交易次数: 4 盈利: 9.954747868700963 亏损: -24.790741395704835 最大盈利: 8.40 最大亏损: -24.19 总收益: -14.84 平均盈利: -3.71 typeA: -1.85 胜率: 50.00%
趋势多且增强-L3-1-5 总交易次数: 7 盈利: 7.901540957334781 亏损: -29.883486935725756 最大盈利: 3.18 最大亏损: -18.46 总收益: -21.98 平均盈利: -3.14 typeA: -1.35 胜率: 42.86%
趋势空且增强-11 总交易次数: 6 盈利: 10.177549946211645 亏损: -79.6791688857585 最大盈利: 9.01 最大亏损: -32.19 总收益: -69.50 平均盈利: -11.58 typeA: -3.86 胜率: 33.33%
趋势多且增强-R-3-1 总交易次数: 3 盈利: 1.8208723404254863 亏损: -42.1765041803524 最大盈利: 1.82 最大亏损: -40.48 总收益: -40.36 平均盈利: -13.45 typeA: -4.48 胜率: 33.33%
趋势空且增强-L2-3-4 总交易次数: 4 盈利: 3.9240885416667237 亏损: -55.06917681228789 最大盈利: 3.92 最大亏损: -41.09 总收益: -51.15 平均盈利: -12.79 typeA: -3.20 胜率: 25.00%
趋势多且增强-L3-1-3 总交易次数: 4 盈利: 0 亏损: -11.970400759520064 最大盈利: -0.40 最大亏损: -5.48 总收益: -11.97 平均盈利: -2.99 typeA: 0.00 胜率: 0.00%
趋势多且增强-L3-1-4-3 总交易次数: 2 盈利: 0 亏损: -6.304738617168519 最大盈利: -1.23 最大亏损: -5.07 总收益: -6.30 平均盈利: -3.15 typeA: 0.00 胜率: 0.00%
趋势空且增强-L2-2-3 总交易次数: 1 盈利: 0 亏损: -37.586340562990294 最大盈利: -37.59 最大亏损: -37.59 总收益: -37.59 平均盈利: -37.59 typeA: 0.00 胜率: 0.00%
趋势多且增强-R-3-2 总交易次数: 1 盈利: 0 亏损: -13.234279939363311 最大盈利: -13.23 最大亏损: -13.23 总收益: -13.23 平均盈利: -13.23 typeA: 0.00 胜率: 0.00%
趋势空且增强-L2-3-5 总交易次数: 1 盈利: 0 亏损: -0.2 最大盈利: -0.20 最大亏损: -0.20 总收益: -0.20 平均盈利: -0.20 typeA: 0.00 胜率: 0.00%
趋势多且增强-L1-3-1 总交易次数: 2 盈利: 0 亏损: -7.481352677968153 最大盈利: -3.58 最大亏损: -3.90 总收益: -7.48 平均盈利: -3.74 typeA: 0.00 胜率: 0.00%
Loaded 3000 15m candles

      ========== 回测结果 ==========
      总交易次数:     73
      胜率:          58.90%
      总收益:        115.24 USDT
      期末余额:      1100.64 USDT
      盈亏比:        1.48
      最大单笔盈利:  36.81
      最大单笔亏损:  -36.36
      手续费:       29.20749367507493
      =============================
    
profit: 100.6423240713234
maxDrawdown 5.2%
startTime: 2024-09-12 00:00:00
趋势多且增强-L3-1-4-2 总交易次数: 2 盈利: 37.889706479356605 亏损: 0 最大盈利: 26.42 最大亏损: 11.47 总收益: 37.89 平均盈利: 18.94 typeA: 18.94 胜率: 100.00%
趋势多且增强-R-1-2-2 总交易次数: 2 盈利: 16.63889253467245 亏损: 0 最大盈利: 15.45 最大亏损: 1.19 总收益: 16.64 平均盈利: 8.32 typeA: 8.32 胜率: 100.00%
趋势多且增强-L3-1-4-4 总交易次数: 4 盈利: 9.40553957643473 亏损: 0 最大盈利: 5.29 最大亏损: 0.46 总收益: 9.41 平均盈利: 2.35 typeA: 2.35 胜率: 100.00%
趋势空且增强-L2-3-5 总交易次数: 1 盈利: 0.6465111905210338 亏损: 0 最大盈利: 0.65 最大亏损: 0.65 总收益: 0.65 平均盈利: 0.65 typeA: 0.65 胜率: 100.00%
趋势多且增强-R-2-2 总交易次数: 1 盈利: 0.653873089076803 亏损: 0 最大盈利: 0.65 最大亏损: 0.65 总收益: 0.65 平均盈利: 0.65 typeA: 0.65 胜率: 100.00%
趋势多且增强-L3-1-3 总交易次数: 6 盈利: 26.18462689521599 亏损: -14.894720025561103 最大盈利: 14.45 最大亏损: -14.89 总收益: 11.29 平均盈利: 1.88 typeA: 1.57 胜率: 83.33%
趋势多且增强-L3-1-4-3 总交易次数: 3 盈利: 11.26293957125 亏损: -3.4333790670326425 最大盈利: 7.81 最大亏损: -3.43 总收益: 7.83 平均盈利: 2.61 typeA: 1.74 胜率: 66.67%
趋势多且增强-L3-1-5 总交易次数: 3 盈利: 5.046383146148994 亏损: -15.042261528742944 最大盈利: 2.98 最大亏损: -15.04 总收益: -10.00 平均盈利: -3.33 typeA: -2.22 胜率: 66.67%
趋势多且增强-R-1-1-2 总交易次数: 3 盈利: 36.2138886945022 亏损: -36.355862941867855 最大盈利: 19.75 最大亏损: -36.36 总收益: -0.14 平均盈利: -0.05 typeA: -0.03 胜率: 66.67%
趋势空且增强-L2-3-3 总交易次数: 5 盈利: 13.626444807299883 亏损: -8.200580846700417 最大盈利: 6.79 最大亏损: -7.54 总收益: 5.43 平均盈利: 1.09 typeA: 0.65 胜率: 60.00%
趋势空且增强-11 总交易次数: 7 盈利: 85.95751677403824 亏损: -23.153063850718695 最大盈利: 36.81 最大亏损: -15.84 总收益: 62.80 平均盈利: 8.97 typeA: 5.13 胜率: 57.14%
趋势空且增强-L1-3-4-2 总交易次数: 11 盈利: 14.809597346965063 亏损: -19.07224090200847 最大盈利: 5.89 最大亏损: -7.96 总收益: -4.26 平均盈利: -0.39 typeA: -0.21 胜率: 54.55%
趋势空且增强-L2-2-3 总交易次数: 2 盈利: 1.4030357311209907 亏损: -25.433068115660827 最大盈利: 1.40 最大亏损: -25.43 总收益: -24.03 平均盈利: -12.02 typeA: -6.01 胜率: 50.00%
趋势多且增强-R-3-1 总交易次数: 2 盈利: 24.454442525427012 亏损: -8.828667917448444 最大盈利: 24.45 最大亏损: -8.83 总收益: 15.63 平均盈利: 7.81 typeA: 3.91 胜率: 50.00%
趋势空且增强-L-4-2-3 总交易次数: 7 盈利: 6.7263244800551725 亏损: -38.67486626614174 最大盈利: 3.98 最大亏损: -28.37 总收益: -31.95 平均盈利: -4.56 typeA: -1.96 胜率: 42.86%
趋势空且增强-L2-3-4 总交易次数: 7 盈利: 40.37183329784614 亏损: -10.807484316576868 最大盈利: 22.72 最大亏损: -4.28 总收益: 29.56 平均盈利: 4.22 typeA: 1.81 胜率: 42.86%
趋势多且增强-L1-3-2 总交易次数: 3 盈利: 23.35743970315386 亏损: -8.348237499043204 最大盈利: 23.36 最大亏损: -5.09 总收益: 15.01 平均盈利: 5.00 typeA: 1.67 胜率: 33.33%
趋势多且增强-L1-3-1 总交易次数: 1 盈利: 0 亏损: -3.9033239107125968 最大盈利: -3.90 最大亏损: -3.90 总收益: -3.90 平均盈利: -3.90 typeA: 0.00 胜率: 0.00%
趋势多且增强-L1-3-9 总交易次数: 2 盈利: 0 亏损: -11.905901822619821 最大盈利: -5.03 最大亏损: -6.87 总收益: -11.91 平均盈利: -5.95 typeA: 0.00 胜率: 0.00%
趋势多且增强-L1-2-1 总交易次数: 1 盈利: 0 亏损: -11.353012760922855 最大盈利: -11.35 最大亏损: -11.35 总收益: -11.35 平均盈利: -11.35 typeA: 0.00 胜率: 0.00%
Loaded 3000 15m candles

      ========== 回测结果 ==========
      总交易次数:     61
      胜率:          63.93%
      总收益:        104.44 USDT
      期末余额:      1092.24 USDT
      盈亏比:        1.27
      最大单笔盈利:  78.32
      最大单笔亏损:  -110.69
      手续费:       24.511338292727714
      =============================
    
profit: 92.23835000248232
maxDrawdown 15.0%
startTime: 2024-10-12 00:00:00
趋势多且增强-L3-1-4-4 总交易次数: 1 盈利: 5.2879690452623 亏损: 0 最大盈利: 5.29 最大亏损: 5.29 总收益: 5.29 平均盈利: 5.29 typeA: 5.29 胜率: 100.00%
趋势多且增强-R-3-1 总交易次数: 2 盈利: 36.658442767760306 亏损: 0 最大盈利: 19.30 最大亏损: 17.35 总收益: 36.66 平均盈利: 18.33 typeA: 18.33 胜率: 100.00%
趋势多且增强-L1-3-2 总交易次数: 1 盈利: 17.695455730298082 亏损: 0 最大盈利: 17.70 最大亏损: 17.70 总收益: 17.70 平均盈利: 17.70 typeA: 17.70 胜率: 100.00%
趋势多且增强-R-2-1 总交易次数: 1 盈利: 27.69768801488174 亏损: 0 最大盈利: 27.70 最大亏损: 27.70 总收益: 27.70 平均盈利: 27.70 typeA: 27.70 胜率: 100.00%
趋势多且增强-L1-3-1 总交易次数: 2 盈利: 87.65065026351252 亏损: 0 最大盈利: 78.32 最大亏损: 9.33 总收益: 87.65 平均盈利: 43.83 typeA: 43.83 胜率: 100.00%
趋势空且增强-11 总交易次数: 2 盈利: 27.62131005887034 亏损: 0 最大盈利: 26.68 最大亏损: 0.94 总收益: 27.62 平均盈利: 13.81 typeA: 13.81 胜率: 100.00%
趋势空且增强-L2-3-5 总交易次数: 2 盈利: 29.377680187307405 亏损: 0 最大盈利: 19.37 最大亏损: 10.01 总收益: 29.38 平均盈利: 14.69 typeA: 14.69 胜率: 100.00%
趋势空且增强-L2-1-3 总交易次数: 2 盈利: 5.097404114816458 亏损: 0 最大盈利: 3.12 最大亏损: 1.97 总收益: 5.10 平均盈利: 2.55 typeA: 2.55 胜率: 100.00%
趋势多且增强-L3-1-4-3 总交易次数: 2 盈利: 36.66277334642551 亏损: 0 最大盈利: 32.10 最大亏损: 4.57 总收益: 36.66 平均盈利: 18.33 typeA: 18.33 胜率: 100.00%
趋势多且增强-L1-2-2 总交易次数: 1 盈利: 14.956589976814676 亏损: 0 最大盈利: 14.96 最大亏损: 14.96 总收益: 14.96 平均盈利: 14.96 typeA: 14.96 胜率: 100.00%
趋势多且增强-L3-1-4-2 总交易次数: 5 盈利: 49.22903904818313 亏损: -0.4736179529283815 最大盈利: 32.99 最大亏损: -0.47 总收益: 48.76 平均盈利: 9.75 typeA: 7.80 胜率: 80.00%
趋势多且增强-L3-1-5 总交易次数: 5 盈利: 37.257927916465896 亏损: -6.9569797250057945 最大盈利: 15.58 最大亏损: -6.96 总收益: 30.30 平均盈利: 6.06 typeA: 4.85 胜率: 80.00%
趋势多且增强-R-1-1-2 总交易次数: 4 盈利: 30.59556132981625 亏损: -10.61115138733275 最大盈利: 25.83 最大亏损: -10.61 总收益: 19.98 平均盈利: 5.00 typeA: 3.75 胜率: 75.00%
趋势多且增强-L3-1-4-1 总交易次数: 3 盈利: 48.342970236245755 亏损: -1.9943466773019551 最大盈利: 41.48 最大亏损: -1.99 总收益: 46.35 平均盈利: 15.45 typeA: 10.30 胜率: 66.67%
趋势空且增强-L-4-2-3 总交易次数: 5 盈利: 7.640327648645179 亏损: -7.928513814617819 最大盈利: 3.32 最大亏损: -5.10 总收益: -0.29 平均盈利: -0.06 typeA: -0.03 胜率: 60.00%
趋势空且增强-L1-3-4-2 总交易次数: 4 盈利: 5.103350861205506 亏损: -8.820699293953606 最大盈利: 3.24 最大亏损: -8.17 总收益: -3.72 平均盈利: -0.93 typeA: -0.46 胜率: 50.00%
趋势空且增强-2 总交易次数: 7 盈利: 17.57690380646018 亏损: -193.81441620302138 最大盈利: 6.89 最大亏损: -110.69 总收益: -176.24 平均盈利: -25.18 typeA: -10.79 胜率: 42.86%
趋势多且增强-L3-1-3 总交易次数: 3 盈利: 0.10402919264090382 亏损: -10.34083855860662 最大盈利: 0.10 最大亏损: -6.26 总收益: -10.24 平均盈利: -3.41 typeA: -1.14 胜率: 33.33%
趋势空且增强-L2-3-4 总交易次数: 4 盈利: 1.7805940594058856 亏损: -44.16182546945711 最大盈利: 1.78 最大亏损: -42.64 总收益: -42.38 平均盈利: -10.60 typeA: -2.65 胜率: 25.00%
趋势空且增强-L2-3-3 总交易次数: 2 盈利: 0 亏损: -18.27538300463586 最大盈利: -2.99 最大亏损: -15.29 总收益: -18.28 平均盈利: -9.14 typeA: 0.00 胜率: 0.00%
趋势多且增强-L1-1-6 总交易次数: 1 盈利: 0 亏损: -14.93832731648615 最大盈利: -14.94 最大亏损: -14.94 总收益: -14.94 平均盈利: -14.94 typeA: 0.00 胜率: 0.00%
趋势多且增强-L1-2-1 总交易次数: 1 盈利: 0 亏损: -16.570603398892445 最大盈利: -16.57 最大亏损: -16.57 总收益: -16.57 平均盈利: -16.57 typeA: 0.00 胜率: 0.00%
趋势空且增强-L1-1-2 总交易次数: 1 盈利: 0 亏损: -47.01161480029404 最大盈利: -47.01 最大亏损: -47.01 总收益: -47.01 平均盈利: -47.01 typeA: 0.00 胜率: 0.00%
Loaded 3000 15m candles

      ========== 回测结果 ==========
      总交易次数:     81
      胜率:          56.79%
      总收益:        274.20 USDT
      期末余额:      1257.80 USDT
      盈亏比:        1.45
      最大单笔盈利:  87.22
      最大单笔亏损:  -110.69
      手续费:       32.64145314974153
      =============================
    
profit: 257.8037163598383
maxDrawdown 10.7%
startTime: 2024-11-11 00:00:00
趋势空且增强-L1-1-2 总交易次数: 3 盈利: 118.94777005911433 亏损: 0 最大盈利: 75.69 最大亏损: 10.37 总收益: 118.95 平均盈利: 39.65 typeA: 39.65 胜率: 100.00%
趋势多且增强-R-1-1-1 总交易次数: 1 盈利: 17.565246919001098 亏损: 0 最大盈利: 17.57 最大亏损: 17.57 总收益: 17.57 平均盈利: 17.57 typeA: 17.57 胜率: 100.00%
趋势多且增强-R-1-2-2 总交易次数: 1 盈利: 41.661125632478914 亏损: 0 最大盈利: 41.66 最大亏损: 41.66 总收益: 41.66 平均盈利: 41.66 typeA: 41.66 胜率: 100.00%
趋势多且增强-L3-1-4-3 总交易次数: 1 盈利: 1.0789655864352623 亏损: 0 最大盈利: 1.08 最大亏损: 1.08 总收益: 1.08 平均盈利: 1.08 typeA: 1.08 胜率: 100.00%
趋势空且增强-L2-2-3 总交易次数: 1 盈利: 7.634782397158636 亏损: 0 最大盈利: 7.63 最大亏损: 7.63 总收益: 7.63 平均盈利: 7.63 typeA: 7.63 胜率: 100.00%
趋势多且增强-L3-1-5 总交易次数: 4 盈利: 13.301404447605968 亏损: -7.372401828625032 最大盈利: 7.27 最大亏损: -7.37 总收益: 5.93 平均盈利: 1.48 typeA: 1.11 胜率: 75.00%
趋势空且增强-L2-3-3 总交易次数: 4 盈利: 34.40244291694773 亏损: -10.484832904884247 最大盈利: 18.88 最大亏损: -10.48 总收益: 23.92 平均盈利: 5.98 typeA: 4.48 胜率: 75.00%
趋势多且增强-R-1-1-2 总交易次数: 9 盈利: 94.58549767578546 亏损: -43.46482823352457 最大盈利: 37.46 最大亏损: -29.02 总收益: 51.12 平均盈利: 5.68 typeA: 3.79 胜率: 66.67%
趋势空且增强-L2-1-3 总交易次数: 3 盈利: 17.352210053502475 亏损: -38.940537617448996 最大盈利: 8.75 最大亏损: -38.94 总收益: -21.59 平均盈利: -7.20 typeA: -4.80 胜率: 66.67%
趋势多且增强-L1-1-6 总交易次数: 11 盈利: 240.53720452973434 亏损: -49.21037876684078 最大盈利: 87.22 最大亏损: -20.44 总收益: 191.33 平均盈利: 17.39 typeA: 9.49 胜率: 54.55%
趋势空且增强-2 总交易次数: 19 盈利: 169.39075925771493 亏损: -210.80066446078905 最大盈利: 64.35 最大亏损: -110.69 总收益: -41.41 平均盈利: -2.18 typeA: -1.15 胜率: 52.63%
趋势多且增强-L3-1-3 总交易次数: 4 盈利: 17.642384664056706 亏损: -37.91215973573465 最大盈利: 12.37 最大亏损: -20.57 总收益: -20.27 平均盈利: -5.07 typeA: -2.53 胜率: 50.00%
趋势空且增强-11 总交易次数: 2 盈利: 27.804261561028337 亏损: -45.59851136140215 最大盈利: 27.80 最大亏损: -45.60 总收益: -17.79 平均盈利: -8.90 typeA: -4.45 胜率: 50.00%
趋势空且增强-L2-3-4 总交易次数: 4 盈利: 9.483611295901369 亏损: -20.674819799059783 最大盈利: 6.38 最大亏损: -13.43 总收益: -11.19 平均盈利: -2.80 typeA: -1.40 胜率: 50.00%
趋势多且增强-L3-1-4-1 总交易次数: 9 盈利: 77.03939256561247 亏损: -107.4848018691319 最大盈利: 40.48 最大亏损: -75.39 总收益: -30.45 平均盈利: -3.38 typeA: -1.50 胜率: 44.44%
趋势空且增强-L2-3-5 总交易次数: 2 盈利: 0 亏损: -24.518443054822594 最大盈利: -7.36 最大亏损: -17.16 总收益: -24.52 平均盈利: -12.26 typeA: 0.00 胜率: 0.00%
趋势多且增强-L1-3-9 总交易次数: 3 盈利: 0 亏损: -17.760963569971352 最大盈利: -3.38 最大亏损: -8.64 总收益: -17.76 平均盈利: -5.92 typeA: 0.00 胜率: 0.00%
Loaded 3000 15m candles

      ========== 回测结果 ==========
      总交易次数:     86
      胜率:          55.81%
      总收益:        396.64 USDT
      期末余额:      1379.44 USDT
      盈亏比:        2.15
      最大单笔盈利:  92.05
      最大单笔亏损:  -29.65
      手续费:       34.44160933766332
      =============================
    
profit: 379.44385925093843
maxDrawdown 7.3%
startTime: 2024-12-11 00:00:00
趋势空且增强-L2-2-3 总交易次数: 3 盈利: 18.198283563091003 亏损: 0 最大盈利: 10.82 最大亏损: 3.23 总收益: 18.20 平均盈利: 6.07 typeA: 6.07 胜率: 100.00%
趋势多且增强-L1-3-9 总交易次数: 1 盈利: 0.34008897362568624 亏损: 0 最大盈利: 0.34 最大亏损: 0.34 总收益: 0.34 平均盈利: 0.34 typeA: 0.34 胜率: 100.00%
趋势空且增强-L2-3-4 总交易次数: 3 盈利: 56.939326022364824 亏损: 0 最大盈利: 54.46 最大亏损: 0.36 总收益: 56.94 平均盈利: 18.98 typeA: 18.98 胜率: 100.00%
趋势多且增强-L1-2-2 总交易次数: 1 盈利: 20.19766911976539 亏损: 0 最大盈利: 20.20 最大亏损: 20.20 总收益: 20.20 平均盈利: 20.20 typeA: 20.20 胜率: 100.00%
趋势多且增强-L3-1-4-2 总交易次数: 5 盈利: 6.386402037118711 亏损: -15.595807050092887 最大盈利: 2.38 最大亏损: -15.60 总收益: -9.21 平均盈利: -1.84 typeA: -1.47 胜率: 80.00%
趋势多且增强-L1-1-6 总交易次数: 4 盈利: 92.71492773839566 亏损: -10.354296524942816 最大盈利: 57.77 最大亏损: -10.35 总收益: 82.36 平均盈利: 20.59 typeA: 15.44 胜率: 75.00%
趋势多且增强-L3-1-4-1 总交易次数: 4 盈利: 6.019778108439549 亏损: -5.393028063465843 最大盈利: 3.69 最大亏损: -5.39 总收益: 0.63 平均盈利: 0.16 typeA: 0.12 胜率: 75.00%
趋势空且增强-L2-1-3 总交易次数: 5 盈利: 27.328785387544098 亏损: -16.126472653640754 最大盈利: 12.64 最大亏损: -15.81 总收益: 11.20 平均盈利: 2.24 typeA: 1.34 胜率: 60.00%
趋势多且增强-R-1-1-2 总交易次数: 16 盈利: 222.8642873298947 亏损: -47.78434956984099 最大盈利: 92.05 最大亏损: -16.12 总收益: 175.08 平均盈利: 10.94 typeA: 6.16 胜率: 56.25%
趋势空且增强-2 总交易次数: 13 盈利: 89.02524196249264 亏损: -26.789885441248813 最大盈利: 39.28 最大亏损: -10.99 总收益: 62.24 平均盈利: 4.79 typeA: 2.58 胜率: 53.85%
趋势多且增强-L3-1-5 总交易次数: 4 盈利: 59.88650646513067 亏损: -21.907047017607148 最大盈利: 57.43 最大亏损: -13.23 总收益: 37.98 平均盈利: 9.49 typeA: 4.75 胜率: 50.00%
趋势空且增强-L-4-2-3 总交易次数: 2 盈利: 0.7143172361619357 亏损: -0.8613204873901577 最大盈利: 0.71 最大亏损: -0.86 总收益: -0.15 平均盈利: -0.07 typeA: -0.04 胜率: 50.00%
趋势多且增强-R-1-2-2 总交易次数: 7 盈利: 32.636752810410755 亏损: -15.967145348742427 最大盈利: 17.90 最大亏损: -8.43 总收益: 16.67 平均盈利: 2.38 typeA: 1.02 胜率: 42.86%
趋势空且增强-11 总交易次数: 7 盈利: 87.73148902063792 亏损: -72.4435244253597 最大盈利: 75.08 最大亏损: -29.65 总收益: 15.29 平均盈利: 2.18 typeA: 0.94 胜率: 42.86%
趋势多且增强-L3-1-3 总交易次数: 3 盈利: 7.019972202078812 亏损: -19.484208600502022 最大盈利: 7.02 最大亏损: -19.19 总收益: -12.46 平均盈利: -4.15 typeA: -1.38 胜率: 33.33%
趋势空且增强-L2-3-3 总交易次数: 5 盈利: 12.058015679913408 亏损: -49.38470901053426 最大盈利: 12.06 最大亏损: -29.52 总收益: -37.33 平均盈利: -7.47 typeA: -1.49 胜率: 20.00%
趋势空且增强-L1-3-4-2 总交易次数: 2 盈利: 0 亏损: -31.44957284002308 最大盈利: -14.72 最大亏损: -16.73 总收益: -31.45 平均盈利: -15.72 typeA: 0.00 胜率: 0.00%
趋势多且增强-R-1-1-1 总交易次数: 1 盈利: 0 亏损: -9.876617372732358 最大盈利: -9.88 最大亏损: -9.88 总收益: -9.88 平均盈利: -9.88 typeA: 0.00 胜率: 0.00%
Loaded 3000 15m candles

      ========== 回测结果 ==========
      总交易次数:     89
      胜率:          59.55%
      总收益:        260.48 USDT
      期末余额:      1242.48 USDT
      盈亏比:        1.49
      最大单笔盈利:  113.50
      最大单笔亏损:  -53.71
      手续费:       35.79241419790271
      =============================
    
profit: 242.48360790474317
maxDrawdown 11.7%
startTime: 2025-01-10 00:00:00
趋势多且增强-L1-3-9 总交易次数: 1 盈利: 11.775445425961815 亏损: 0 最大盈利: 11.78 最大亏损: 11.78 总收益: 11.78 平均盈利: 11.78 typeA: 11.78 胜率: 100.00%
趋势空且增强-L1-3-4-2 总交易次数: 3 盈利: 6.511860996891548 亏损: 0 最大盈利: 4.18 最大亏损: 0.93 总收益: 6.51 平均盈利: 2.17 typeA: 2.17 胜率: 100.00%
趋势空且增强-L2-3-4 总交易次数: 4 盈利: 61.11290989501386 亏损: 0 最大盈利: 49.32 最大亏损: 2.81 总收益: 61.11 平均盈利: 15.28 typeA: 15.28 胜率: 100.00%
趋势多且增强-L3-1-4-4 总交易次数: 1 盈利: 0.8172731625568799 亏损: 0 最大盈利: 0.82 最大亏损: 0.82 总收益: 0.82 平均盈利: 0.82 typeA: 0.82 胜率: 100.00%
趋势多且增强-L3-1-4-3 总交易次数: 2 盈利: 14.843350591266798 亏损: 0 最大盈利: 12.91 最大亏损: 1.93 总收益: 14.84 平均盈利: 7.42 typeA: 7.42 胜率: 100.00%
趋势空且增强-L-4-2-3 总交易次数: 1 盈利: 0.8637192342753056 亏损: 0 最大盈利: 0.86 最大亏损: 0.86 总收益: 0.86 平均盈利: 0.86 typeA: 0.86 胜率: 100.00%
趋势空且增强-L2-1-3 总交易次数: 6 盈利: 153.43020401617457 亏损: -21.00591678592472 最大盈利: 98.26 最大亏损: -18.03 总收益: 132.42 平均盈利: 22.07 typeA: 14.71 胜率: 66.67%
趋势多且增强-L3-1-4-1 总交易次数: 9 盈利: 54.23898755680882 亏损: -58.29091100063043 最大盈利: 18.65 最大亏损: -45.79 总收益: -4.05 平均盈利: -0.45 typeA: -0.30 胜率: 66.67%
趋势空且增强-11 总交易次数: 3 盈利: 39.350345047517976 亏损: -7.232656249999876 最大盈利: 34.49 最大亏损: -7.23 总收益: 32.12 平均盈利: 10.71 typeA: 7.14 胜率: 66.67%
趋势多且增强-R-1-2-2 总交易次数: 3 盈利: 1.996343777603557 亏损: -37.90300062383029 最大盈利: 1.64 最大亏损: -37.90 总收益: -35.91 平均盈利: -11.97 typeA: -7.98 胜率: 66.67%
趋势多且增强-R-1-1-2 总交易次数: 16 盈利: 154.50243997607112 亏损: -43.755341795599165 最大盈利: 47.01 最大亏损: -17.99 总收益: 110.75 平均盈利: 6.92 typeA: 4.33 胜率: 62.50%
趋势空且增强-L2-3-5 总交易次数: 5 盈利: 61.38262390326871 亏损: -43.50295631217348 最大盈利: 58.80 最大亏损: -31.86 总收益: 17.88 平均盈利: 3.58 typeA: 2.15 胜率: 60.00%
趋势空且增强-L2-3-3 总交易次数: 5 盈利: 20.539671133840468 亏损: -4.919587669563072 最大盈利: 11.93 最大亏损: -2.79 总收益: 15.62 平均盈利: 3.12 typeA: 1.87 胜率: 60.00%
趋势多且增强-L3-1-5 总交易次数: 7 盈利: 47.86939594162463 亏损: -61.92668904885024 最大盈利: 32.96 最大亏损: -39.52 总收益: -14.06 平均盈利: -2.01 typeA: -1.15 胜率: 57.14%
趋势多且增强-L3-1-4-2 总交易次数: 4 盈利: 114.55027950809773 亏损: -50.89516280131562 最大盈利: 113.50 最大亏损: -45.11 总收益: 63.66 平均盈利: 15.91 typeA: 7.96 胜率: 50.00%
趋势空且增强-L1-1-2 总交易次数: 4 盈利: 28.563114459072892 亏损: -54.58197443967216 最大盈利: 14.45 最大亏损: -53.71 总收益: -26.02 平均盈利: -6.50 typeA: -3.25 胜率: 50.00%
趋势多且增强-R-1-1-1 总交易次数: 2 盈利: 11.174160847037534 亏损: -30.67556727294261 最大盈利: 11.17 最大亏损: -30.68 总收益: -19.50 平均盈利: -9.75 typeA: -4.88 胜率: 50.00%
趋势空且增强-2 总交易次数: 10 盈利: 9.586679917265824 亏损: -100.16390034821063 最大盈利: 8.48 最大亏损: -28.32 总收益: -90.58 平均盈利: -9.06 typeA: -1.81 胜率: 20.00%
趋势多且增强-L1-2-2 总交易次数: 1 盈利: 0 亏损: -5.063055494141012 最大盈利: -5.06 最大亏损: -5.06 总收益: -5.06 平均盈利: -5.06 typeA: 0.00 胜率: 0.00%
趋势多且增强-L3-1-3 总交易次数: 1 盈利: 0 亏损: -2.3617600808715964 最大盈利: -2.36 最大亏损: -2.36 总收益: -2.36 平均盈利: -2.36 typeA: 0.00 胜率: 0.00%
趋势多且增强-L1-1-6 总交易次数: 1 盈利: 0 亏损: -10.346717561877123 最大盈利: -10.35 最大亏损: -10.35 总收益: -10.35 平均盈利: -10.35 typeA: 0.00 胜率: 0.00%
Loaded 3000 15m candles

      ========== 回测结果 ==========
      总交易次数:     85
      胜率:          60.00%
      总收益:        -209.64 USDT
      期末余额:      773.16 USDT
      盈亏比:        0.68
      最大单笔盈利:  41.92
      最大单笔亏损:  -70.40
      手续费:       34.14481914545001
      =============================
    
profit: -226.83832028931727
maxDrawdown 28.3%
startTime: 2025-02-09 00:00:00
趋势空且增强-L1-3-4-2 总交易次数: 3 盈利: 7.7538365121609125 亏损: 0 最大盈利: 4.60 最大亏损: 0.93 总收益: 7.75 平均盈利: 2.58 typeA: 2.58 胜率: 100.00%
趋势空且增强-L2-2-3 总交易次数: 2 盈利: 15.22839505542278 亏损: 0 最大盈利: 9.96 最大亏损: 5.27 总收益: 15.23 平均盈利: 7.61 typeA: 7.61 胜率: 100.00%
趋势空且增强-L1-1-2 总交易次数: 1 盈利: 8.271732463612869 亏损: 0 最大盈利: 8.27 最大亏损: 8.27 总收益: 8.27 平均盈利: 8.27 typeA: 8.27 胜率: 100.00%
趋势空且增强-2 总交易次数: 6 盈利: 15.301400366752798 亏损: -5.859489218534872 最大盈利: 6.62 最大亏损: -5.86 总收益: 9.44 平均盈利: 1.57 typeA: 1.31 胜率: 83.33%
趋势多且增强-L3-1-5 总交易次数: 6 盈利: 21.3793220143056 亏损: -38.01592568015917 最大盈利: 5.95 最大亏损: -38.02 总收益: -16.64 平均盈利: -2.77 typeA: -2.31 胜率: 83.33%
趋势空且增强-L2-3-5 总交易次数: 5 盈利: 79.25209489369814 亏损: -7.021518621088681 最大盈利: 41.92 最大亏损: -7.02 总收益: 72.23 平均盈利: 14.45 typeA: 11.56 胜率: 80.00%
趋势多且增强-R-1-1-2 总交易次数: 17 盈利: 138.4787807034871 亏损: -78.28358098793994 最大盈利: 38.08 最大亏损: -32.88 总收益: 60.20 平均盈利: 3.54 typeA: 2.50 胜率: 70.59%
趋势多且增强-R-1-2-2 总交易次数: 6 盈利: 22.214860344163203 亏损: -75.8282107815923 最大盈利: 12.57 最大亏损: -64.70 总收益: -53.61 平均盈利: -8.94 typeA: -5.96 胜率: 66.67%
趋势空且增强-L2-1-3 总交易次数: 2 盈利: 10.263770752786037 亏损: -0.9200287953927911 最大盈利: 10.26 最大亏损: -0.92 总收益: 9.34 平均盈利: 4.67 typeA: 2.34 胜率: 50.00%
趋势多且增强-L3-1-4-2 总交易次数: 6 盈利: 5.436556977285489 亏损: -106.56330114398958 最大盈利: 2.68 最大亏损: -70.40 总收益: -101.13 平均盈利: -16.85 typeA: -8.43 胜率: 50.00%
趋势空且增强-L2-3-3 总交易次数: 2 盈利: 8.180757006645571 亏损: -5.344944967661305 最大盈利: 8.18 最大亏损: -5.34 总收益: 2.84 平均盈利: 1.42 typeA: 0.71 胜率: 50.00%
趋势多且增强-L1-3-9 总交易次数: 2 盈利: 7.403491212861484 亏损: -4.213996693694485 最大盈利: 7.40 最大亏损: -4.21 总收益: 3.19 平均盈利: 1.59 typeA: 0.80 胜率: 50.00%
趋势多且增强-L1-1-6 总交易次数: 4 盈利: 25.73050499973985 亏损: -24.276230569770668 最大盈利: 20.29 最大亏损: -19.73 总收益: 1.45 平均盈利: 0.36 typeA: 0.18 胜率: 50.00%
趋势空且增强-L2-3-4 总交易次数: 7 盈利: 48.300247970988266 亏损: -59.349801919780866 最大盈利: 22.41 最大亏损: -27.09 总收益: -11.05 平均盈利: -1.58 typeA: -0.68 胜率: 42.86%
趋势空且增强-11 总交易次数: 5 盈利: 20.25251268230813 亏损: -94.05831726618354 最大盈利: 13.87 最大亏损: -67.70 总收益: -73.81 平均盈利: -14.76 typeA: -5.90 胜率: 40.00%
趋势多且增强-L3-1-4-1 总交易次数: 6 盈利: 20.21020499201101 亏损: -154.29756413785108 最大盈利: 16.98 最大亏损: -56.04 总收益: -134.09 平均盈利: -22.35 typeA: -7.45 胜率: 33.33%
趋势多且增强-L3-1-3 总交易次数: 2 盈利: 0 亏损: -1.8536202384412475 最大盈利: -0.20 最大亏损: -1.65 总收益: -1.85 平均盈利: -0.93 typeA: 0.00 胜率: 0.00%
趋势空且增强-L-4-2-3 总交易次数: 2 盈利: 0 亏损: -5.636940035630736 最大盈利: -0.91 最大亏损: -4.73 总收益: -5.64 平均盈利: -2.82 typeA: 0.00 胜率: 0.00%
趋势多且增强-R-1-1-1 总交易次数: 1 盈利: 0 亏损: -1.7733181798312683 最大盈利: -1.77 最大亏损: -1.77 总收益: -1.77 平均盈利: -1.77 typeA: 0.00 胜率: 0.00%
Loaded 3000 15m candles

      ========== 回测结果 ==========
      总交易次数:     87
      胜率:          64.37%
      总收益:        189.54 USDT
      期末余额:      1171.94 USDT
      盈亏比:        1.48
      最大单笔盈利:  91.59
      最大单笔亏损:  -41.40
      手续费:       35.05933501372909
      =============================
    
profit: 171.9357688633038
maxDrawdown 10.5%
startTime: 2025-03-11 00:00:00
趋势空且增强-L1-3-4-2 总交易次数: 3 盈利: 42.2960524427804 亏损: 0 最大盈利: 38.53 最大亏损: 1.46 总收益: 42.30 平均盈利: 14.10 typeA: 14.10 胜率: 100.00%
趋势空且增强-L2-1-3 总交易次数: 3 盈利: 15.987493736995107 亏损: 0 最大盈利: 10.31 最大亏损: 2.60 总收益: 15.99 平均盈利: 5.33 typeA: 5.33 胜率: 100.00%
趋势多且增强-R-2-1 总交易次数: 1 盈利: 7.447472769550856 亏损: 0 最大盈利: 7.45 最大亏损: 7.45 总收益: 7.45 平均盈利: 7.45 typeA: 7.45 胜率: 100.00%
趋势多且增强-L3-1-4-3 总交易次数: 2 盈利: 67.64485949047213 亏损: 0 最大盈利: 43.38 最大亏损: 24.26 总收益: 67.64 平均盈利: 33.82 typeA: 33.82 胜率: 100.00%
趋势空且增强-L2-3-3 总交易次数: 1 盈利: 8.675114085792524 亏损: 0 最大盈利: 8.68 最大亏损: 8.68 总收益: 8.68 平均盈利: 8.68 typeA: 8.68 胜率: 100.00%
趋势空且增强-L2-3-5 总交易次数: 2 盈利: 4.462193378599293 亏损: 0 最大盈利: 2.88 最大亏损: 1.58 总收益: 4.46 平均盈利: 2.23 typeA: 2.23 胜率: 100.00%
趋势多且增强-L3-1-5 总交易次数: 8 盈利: 113.35235923296808 亏损: -6.488426979753177 最大盈利: 41.20 最大亏损: -6.49 总收益: 106.86 平均盈利: 13.36 typeA: 11.69 胜率: 87.50%
趋势多且增强-L3-1-4-2 总交易次数: 7 盈利: 110.435053671551 亏损: -1.1346108903949141 最大盈利: 91.59 最大亏损: -1.13 总收益: 109.30 平均盈利: 15.61 typeA: 13.38 胜率: 85.71%
趋势多且增强-R-1-2-2 总交易次数: 9 盈利: 24.510759890875793 亏损: -46.21841154511601 最大盈利: 6.32 最大亏损: -41.40 总收益: -21.71 平均盈利: -2.41 typeA: -1.88 胜率: 77.78%
趋势多且增强-L3-1-4-4 总交易次数: 3 盈利: 7.083641519149332 亏损: -0.2 最大盈利: 3.94 最大亏损: -0.20 总收益: 6.88 平均盈利: 2.29 typeA: 1.53 胜率: 66.67%
趋势空且增强-11 总交易次数: 7 盈利: 35.59804772714982 亏损: -57.11653843545198 最大盈利: 14.42 最大亏损: -35.09 总收益: -21.52 平均盈利: -3.07 typeA: -1.76 胜率: 57.14%
趋势多且增强-R-1-1-2 总交易次数: 7 盈利: 58.89071814733627 亏损: -21.913107545858914 最大盈利: 42.47 最大亏损: -15.38 总收益: 36.98 平均盈利: 5.28 typeA: 3.02 胜率: 57.14%
趋势空且增强-L2-2-3 总交易次数: 2 盈利: 8.69951413686133 亏损: -18.508399770393414 最大盈利: 8.70 最大亏损: -18.51 总收益: -9.81 平均盈利: -4.90 typeA: -2.45 胜率: 50.00%
趋势多且增强-L1-1-6 总交易次数: 2 盈利: 5.558387329013778 亏损: -19.731662366384175 最大盈利: 5.56 最大亏损: -19.73 总收益: -14.17 平均盈利: -7.09 typeA: -3.54 胜率: 50.00%
趋势空且增强-L2-3-4 总交易次数: 6 盈利: 13.474370958632456 亏损: -30.22160704388059 最大盈利: 8.02 最大亏损: -23.07 总收益: -16.75 平均盈利: -2.79 typeA: -1.40 胜率: 50.00%
趋势空且增强-2 总交易次数: 11 盈利: 19.927346867596203 亏损: -54.02605466811017 最大盈利: 9.77 最大亏损: -23.38 总收益: -34.10 平均盈利: -3.10 typeA: -1.41 胜率: 45.45%
趋势空且增强-L-4-2-3 总交易次数: 8 盈利: 36.66381300058304 亏损: -79.36029679785453 最大盈利: 32.47 最大亏损: -32.49 总收益: -42.70 平均盈利: -5.34 typeA: -2.00 胜率: 37.50%
趋势多且增强-L3-1-3 总交易次数: 3 盈利: 3.1008047320999257 亏损: -51.05205433199525 最大盈利: 3.10 最大亏损: -35.73 总收益: -47.95 平均盈利: -15.98 typeA: -5.33 胜率: 33.33%
趋势多且增强-L1-3-2 总交易次数: 1 盈利: 0 亏损: -2.5950803388839834 最大盈利: -2.60 最大亏损: -2.60 总收益: -2.60 平均盈利: -2.60 typeA: 0.00 胜率: 0.00%
趋势多且增强-R-2-2 总交易次数: 1 盈利: 0 亏损: -5.705983540622498 最大盈利: -5.71 最大亏损: -5.71 总收益: -5.71 平均盈利: -5.71 typeA: 0.00 胜率: 0.00%
Loaded 3000 15m candles

      ========== 回测结果 ==========
      总交易次数:     69
      胜率:          68.12%
      总收益:        168.05 USDT
      期末余额:      1154.25 USDT
      盈亏比:        1.80
      最大单笔盈利:  66.67
      最大单笔亏损:  -41.47
      手续费:       27.62313636207344
      =============================
    
profit: 154.2478627532155
maxDrawdown 4.5%
startTime: 2025-04-10 00:00:00
趋势多且增强-L1-3-9 总交易次数: 1 盈利: 14.854504329843602 亏损: 0 最大盈利: 14.85 最大亏损: 14.85 总收益: 14.85 平均盈利: 14.85 typeA: 14.85 胜率: 100.00%
趋势空且增强-L-4-2-3 总交易次数: 5 盈利: 12.114072696782745 亏损: 0 最大盈利: 5.29 最大亏损: 0.90 总收益: 12.11 平均盈利: 2.42 typeA: 2.42 胜率: 100.00%
趋势多且增强-L1-3-2 总交易次数: 2 盈利: 29.875371043826178 亏损: 0 最大盈利: 15.15 最大亏损: 14.72 总收益: 29.88 平均盈利: 14.94 typeA: 14.94 胜率: 100.00%
趋势空且增强-L2-2-3 总交易次数: 1 盈利: 13.283014798394355 亏损: 0 最大盈利: 13.28 最大亏损: 13.28 总收益: 13.28 平均盈利: 13.28 typeA: 13.28 胜率: 100.00%
趋势空且增强-L2-3-5 总交易次数: 1 盈利: 1.2429279307531846 亏损: 0 最大盈利: 1.24 最大亏损: 1.24 总收益: 1.24 平均盈利: 1.24 typeA: 1.24 胜率: 100.00%
趋势空且增强-L2-1-3 总交易次数: 1 盈利: 6.94474547911706 亏损: 0 最大盈利: 6.94 最大亏损: 6.94 总收益: 6.94 平均盈利: 6.94 typeA: 6.94 胜率: 100.00%
趋势多且增强-L1-2-2 总交易次数: 1 盈利: 66.66690358287207 亏损: 0 最大盈利: 66.67 最大亏损: 66.67 总收益: 66.67 平均盈利: 66.67 typeA: 66.67 胜率: 100.00%
趋势多且增强-L3-1-4-2 总交易次数: 1 盈利: 6.045613252272754 亏损: 0 最大盈利: 6.05 最大亏损: 6.05 总收益: 6.05 平均盈利: 6.05 typeA: 6.05 胜率: 100.00%
趋势多且增强-L3-1-4-1 总交易次数: 1 盈利: 1.3096203623813767 亏损: 0 最大盈利: 1.31 最大亏损: 1.31 总收益: 1.31 平均盈利: 1.31 typeA: 1.31 胜率: 100.00%
趋势空且增强-11 总交易次数: 7 盈利: 56.24050623478167 亏损: -30.981534772182155 最大盈利: 19.29 最大亏损: -30.98 总收益: 25.26 平均盈利: 3.61 typeA: 3.09 胜率: 85.71%
趋势空且增强-2 总交易次数: 6 盈利: 21.44080296671826 亏损: -10.289899740066794 最大盈利: 9.54 最大亏损: -10.29 总收益: 11.15 平均盈利: 1.86 typeA: 1.55 胜率: 83.33%
趋势空且增强-L2-3-3 总交易次数: 6 盈利: 18.059448199565086 亏损: -7.480747728860942 最大盈利: 6.30 最大亏损: -7.48 总收益: 10.58 平均盈利: 1.76 typeA: 1.47 胜率: 83.33%
趋势多且增强-L3-1-4-4 总交易次数: 3 盈利: 3.9359893640684627 亏损: -20.54348183254345 最大盈利: 2.31 最大亏损: -20.54 总收益: -16.61 平均盈利: -5.54 typeA: -3.69 胜率: 66.67%
趋势多且增强-L3-1-4-3 总交易次数: 3 盈利: 2.6484546094981916 亏损: -1.341804411853073 最大盈利: 2.27 最大亏损: -1.34 总收益: 1.31 平均盈利: 0.44 typeA: 0.29 胜率: 66.67%
趋势空且增强-L2-3-4 总交易次数: 4 盈利: 5.926286675725504 亏损: -7.030287483658693 最大盈利: 4.34 最大亏损: -5.43 总收益: -1.10 平均盈利: -0.28 typeA: -0.14 胜率: 50.00%
趋势空且增强-L1-3-4-2 总交易次数: 6 盈利: 11.459248576300197 亏损: -17.83149584521791 最大盈利: 5.37 最大亏损: -12.28 总收益: -6.37 平均盈利: -1.06 typeA: -0.53 胜率: 50.00%
趋势多且增强-L3-1-5 总交易次数: 4 盈利: 3.43187395783393 亏损: -39.6831237788542 最大盈利: 2.11 最大亏损: -29.65 总收益: -36.25 平均盈利: -9.06 typeA: -4.53 胜率: 50.00%
趋势多且增强-R-1-1-2 总交易次数: 4 盈利: 17.999862145043195 亏损: -5.666899497491035 最大盈利: 16.59 最大亏损: -3.31 总收益: 12.33 平均盈利: 3.08 typeA: 1.54 胜率: 50.00%
趋势多且增强-L1-3-1 总交易次数: 2 盈利: 53.19451249387562 亏损: -2.9789376158120957 最大盈利: 53.19 最大亏损: -2.98 总收益: 50.22 平均盈利: 25.11 typeA: 12.55 胜率: 50.00%
趋势多且增强-L3-1-3 总交易次数: 8 盈利: 32.60749422301314 亏损: -19.60930276761564 最大盈利: 14.18 最大亏损: -11.79 总收益: 13.00 平均盈利: 1.62 typeA: 0.61 胜率: 37.50%
趋势空且增强-L1-1-2 总交易次数: 2 盈利: 0 亏损: -47.79587469529189 最大盈利: -6.33 最大亏损: -41.47 总收益: -47.80 平均盈利: -23.90 typeA: 0.00 胜率: 0.00%
tradeNumTotal 3909
profitTotal 16390.267607836988
maxLossTotal -183.03
winRateTotal 3209.210000000001
period month 53
avgRate 60.55
maxDrawdownTotal 28.3
趋势空且增强-L2-1-3 总交易次数: 73 盈利: 958.8373035427859 亏损: -192.00938853436762 最大盈利: 122.10 最大亏损: -67.37 总收益: 766.83 平均盈利: 10.50 typeA: 8.20 胜率: 78.08%
趋势空且增强-L2-2-3 总交易次数: 39 盈利: 395.3730473711797 亏损: -169.2635210343179 最大盈利: 114.24 最大亏损: -37.59 总收益: 226.11 平均盈利: 5.80 typeA: 4.31 胜率: 74.36%
趋势多且增强-L3-1-4-2 总交易次数: 114 盈利: 1003.1725102393915 亏损: -614.1445699964848 最大盈利: 127.84 最大亏损: -183.03 总收益: 389.03 平均盈利: 3.41 typeA: 2.39 胜率: 70.18%
趋势多且增强-R-2-2 总交易次数: 23 盈利: 186.36922008930114 亏损: -60.56407534113363 最大盈利: 36.97 最大亏损: -27.71 总收益: 125.81 平均盈利: 5.47 typeA: 3.81 胜率: 69.57%
趋势多且增强-R-1-1-1 总交易次数: 35 盈利: 387.35138476111456 亏损: -120.21936169414755 最大盈利: 74.00 最大亏损: -30.68 总收益: 267.13 平均盈利: 7.63 typeA: 5.23 胜率: 68.57%
趋势多且增强-L3-1-5 总交易次数: 257 盈利: 1691.056376201543 亏损: -919.3520404250016 最大盈利: 137.35 最大亏损: -48.06 总收益: 771.70 平均盈利: 3.00 typeA: 2.06 胜率: 68.48%
趋势空且增强-11 总交易次数: 174 盈利: 1934.508977834908 亏损: -1302.0696640532474 最大盈利: 77.83 最大亏损: -89.77 总收益: 632.44 平均盈利: 3.63 typeA: 2.42 胜率: 66.67%
趋势多且增强-R-3-2 总交易次数: 29 盈利: 126.50238847744141 亏损: -34.11947765410041 最大盈利: 26.69 最大亏损: -13.23 总收益: 92.38 平均盈利: 3.19 typeA: 2.09 胜率: 65.52%
趋势空且增强-L-4-2-3 总交易次数: 160 盈利: 670.4156142534715 亏损: -534.4731410046844 最大盈利: 49.19 最大亏损: -59.01 总收益: 135.94 平均盈利: 0.85 typeA: 0.55 胜率: 65.00%
趋势多且增强-R-3-1 总交易次数: 140 盈利: 765.3131262173113 亏损: -573.757150718602 最大盈利: 125.40 最大亏损: -73.28 总收益: 191.56 平均盈利: 1.37 typeA: 0.89 胜率: 65.00%
趋势多且增强-R-1-2-2 总交易次数: 82 盈利: 739.4968391357269 亏损: -444.7048885122962 最大盈利: 140.35 最大亏损: -83.03 总收益: 294.79 平均盈利: 3.60 typeA: 2.32 胜率: 64.63%
趋势多且增强-L3-1-4-4 总交易次数: 306 盈利: 1250.107479102257 亏损: -985.4551312813866 最大盈利: 127.27 最大亏损: -60.90 总收益: 264.65 平均盈利: 0.86 typeA: 0.55 胜率: 64.05%
趋势空且增强-L1-1-2 总交易次数: 40 盈利: 677.9637673401679 亏损: -424.6528576920251 最大盈利: 206.84 最大亏损: -80.81 总收益: 253.31 平均盈利: 6.33 typeA: 3.96 胜率: 62.50%
趋势空且增强-L2-3-3 总交易次数: 396 盈利: 2692.4557212094323 亏损: -1788.7217221500089 最大盈利: 258.83 最大亏损: -77.48 总收益: 903.73 平均盈利: 2.28 typeA: 1.42 胜率: 62.37%
趋势空且增强-L1-3-4-2 总交易次数: 191 盈利: 776.9844277217862 亏损: -731.076569326022 最大盈利: 132.66 最大亏损: -58.81 总收益: 45.91 平均盈利: 0.24 typeA: 0.15 胜率: 62.30%
趋势多且增强-R-1-1-2 总交易次数: 284 盈利: 3017.9751019704067 亏损: -1688.4347967311514 最大盈利: 235.85 最大亏损: -119.73 总收益: 1329.54 平均盈利: 4.68 typeA: 2.88 胜率: 61.62%
趋势多且增强-L3-1-4-3 总交易次数: 136 盈利: 728.4575941885538 亏损: -615.8882598441543 最大盈利: 97.68 最大亏损: -55.36 总收益: 112.57 平均盈利: 0.83 typeA: 0.50 胜率: 60.29%
趋势多且增强-R-2-1 总交易次数: 91 盈利: 629.7082321821886 亏损: -418.206242183355 最大盈利: 169.96 最大亏损: -46.38 总收益: 211.50 平均盈利: 2.32 typeA: 1.38 胜率: 59.34%
趋势多且增强-L3-1-4-1 总交易次数: 136 盈利: 1604.7761603838812 亏损: -970.6666503397933 最大盈利: 185.55 最大亏损: -90.48 总收益: 634.11 平均盈利: 4.66 typeA: 2.74 胜率: 58.82%
趋势空且增强-L2-3-4 总交易次数: 352 盈利: 1733.2594379885227 亏损: -1493.6801639380394 最大盈利: 102.09 最大亏损: -64.70 总收益: 239.58 平均盈利: 0.68 typeA: 0.39 胜率: 57.10%
趋势空且增强-L2-3-5 总交易次数: 203 盈利: 1357.272977081407 亏损: -859.309805073269 最大盈利: 129.83 最大亏损: -63.36 总收益: 497.96 平均盈利: 2.45 typeA: 1.38 胜率: 56.16%
趋势空且增强-2 总交易次数: 230 盈利: 3076.397685158427 亏损: -2041.8792836563355 最大盈利: 388.95 最大亏损: -140.33 总收益: 1034.52 平均盈利: 4.50 typeA: 2.50 胜率: 55.65%
趋势多且增强-L1-2-1 总交易次数: 13 盈利: 220.72503108222404 亏损: -66.2813069632484 最大盈利: 76.67 最大亏损: -18.51 总收益: 154.44 平均盈利: 11.88 typeA: 6.40 胜率: 53.85%
趋势多且增强-L3-1-3 总交易次数: 175 盈利: 1340.2393472030117 亏损: -828.9412024233372 最大盈利: 259.12 最大亏损: -78.51 总收益: 511.30 平均盈利: 2.92 typeA: 1.47 胜率: 50.29%
趋势多且增强-L1-1-6 总交易次数: 74 盈利: 2065.908577318098 亏损: -673.3697564086867 最大盈利: 855.81 最大亏损: -63.73 总收益: 1392.54 平均盈利: 18.82 typeA: 8.65 胜率: 45.95%
趋势多且增强-L1-3-9 总交易次数: 38 盈利: 465.32079721247135 亏损: -249.81155155221612 最大盈利: 111.54 最大亏损: -42.63 总收益: 215.51 平均盈利: 5.67 typeA: 2.54 胜率: 44.74%
趋势多且增强-L1-2-2 总交易次数: 20 盈利: 1163.1322099112742 亏损: -162.21477539442756 最大盈利: 710.67 最大亏损: -57.31 总收益: 1000.92 平均盈利: 50.05 typeA: 20.02 胜率: 40.00%
趋势多且增强-L1-3-2 总交易次数: 45 盈利: 409.42904360752016 亏损: -182.0288922336568 最大盈利: 88.03 最大亏损: -29.60 总收益: 227.40 平均盈利: 5.05 typeA: 1.91 胜率: 37.78%
趋势多且增强-L1-3-1 总交易次数: 53 盈利: 4615.165450647675 亏损: -363.71197543683473 最大盈利: 4116.61 最大亏损: -48.26 总收益: 4251.45 平均盈利: 80.22 typeA: 27.24 胜率: 33.96%







      ========== 回测结果 ==========
      总交易次数:     64
      胜率:          50.00%
      总收益:        -69.39 USDT
      期末余额:      917.81 USDT
      盈亏比:        0.80
      最大单笔盈利:  66.77
      最大单笔亏损:  -47.93
      手续费:       25.5827238989503
      =============================
    
profit: -82.19415981277314
maxDrawdown 12.9%
startTime: 2025-05-10 00:00:00
趋势空且增强-L2-1-3 总交易次数: 1 盈利: 66.76737625701973 亏损: 0 最大盈利: 66.77 最大亏损: 66.77 总收益: 66.77 平均盈利: 66.77 typeA: 66.77 胜率: 100.00%
趋势多且增强-R-1-2-2 总交易次数: 1 盈利: 24.759943899018158 亏损: 0 最大盈利: 24.76 最大亏损: 24.76 总收益: 24.76 平均盈利: 24.76 typeA: 24.76 胜率: 100.00%
趋势多且增强-R-1-1-1 总交易次数: 1 盈利: 19.6339896881906 亏损: 0 最大盈利: 19.63 最大亏损: 19.63 总收益: 19.63 平均盈利: 19.63 typeA: 19.63 胜率: 100.00%
趋势空且增强-11 总交易次数: 4 盈利: 42.148924276782196 亏损: -10.581934628975224 最大盈利: 25.53 最大亏损: -10.58 总收益: 31.57 平均盈利: 7.89 typeA: 5.92 胜率: 75.00%
趋势多且增强-L3-1-4-1 总交易次数: 2 盈利: 10.837193392977001 亏损: 0 最大盈利: 10.42 最大亏损: 0.41 总收益: 10.84 平均盈利: 5.42 typeA: 5.42 胜率: 100.00%
趋势多且增强-L1-3-9 总交易次数: 2 盈利: 19.732327287830625 亏损: -6.190784743171233 最大盈利: 19.73 最大亏损: -6.19 总收益: 13.54 平均盈利: 6.77 typeA: 3.39 胜率: 50.00%
趋势空且增强-L-4-2-3 总交易次数: 2 盈利: 1.7686185473743428 亏损: 0 最大盈利: 0.90 最大亏损: 0.87 总收益: 1.77 平均盈利: 0.88 typeA: 0.88 胜率: 100.00%
趋势空且增强-L2-2-3 总交易次数: 2 盈利: 2.766586550754268 亏损: -2.751946148417557 最大盈利: 2.77 最大亏损: -2.75 总收益: 0.01 平均盈利: 0.01 typeA: 0.00 胜率: 50.00%
趋势空且增强-L1-1-2 总交易次数: 1 盈利: 0 亏损: -23.425418771603276 最大盈利: -23.43 最大亏损: -23.43 总收益: -23.43 平均盈利: -23.43 typeA: 0.00 胜率: 0.00%
趋势多且增强-L1-1-6 总交易次数: 3 盈利: 0 亏损: -11.958122498344224 最大盈利: -2.31 最大亏损: -6.15 总收益: -11.96 平均盈利: -3.99 typeA: 0.00 胜率: 0.00%
趋势空且增强-L-PLUS-4-3 总交易次数: 2 盈利: 0 亏损: -8.430248978596184 最大盈利: -0.08 最大亏损: -8.35 总收益: -8.43 平均盈利: -4.22 typeA: 0.00 胜率: 0.00%
趋势多且增强-L3-1-4-3 总交易次数: 2 盈利: 0 亏损: -21.826322043140713 最大盈利: -8.23 最大亏损: -13.60 总收益: -21.83 平均盈利: -10.91 typeA: 0.00 胜率: 0.00%
趋势多且增强-L1-3-2 总交易次数: 1 盈利: 0 亏损: -16.125828522557104 最大盈利: -16.13 最大亏损: -16.13 总收益: -16.13 平均盈利: -16.13 typeA: 0.00 胜率: 0.00%
趋势空且增强-L1-3-4-2 总交易次数: 2 盈利: 0.37851041110513983 亏损: -1.7795038025183536 最大盈利: 0.38 最大亏损: -1.78 总收益: -1.40 平均盈利: -0.70 typeA: -0.35 胜率: 50.00%
趋势空且增强-L2-3-5 总交易次数: 6 盈利: 25.26658934545775 亏损: -30.955950664493177 最大盈利: 21.41 最大亏损: -19.09 总收益: -5.69 平均盈利: -0.95 typeA: -0.47 胜率: 50.00%
趋势多且增强-L3-1-3 总交易次数: 5 盈利: 18.13583957565885 亏损: -24.51158064266303 最大盈利: 14.18 最大亏损: -19.39 总收益: -6.38 平均盈利: -1.28 typeA: -0.51 胜率: 40.00%
趋势空且增强-L2-4-2 总交易次数: 5 盈利: 4.017648873804316 亏损: -45.74433280896775 最大盈利: 4.02 最大亏损: -20.68 总收益: -41.73 平均盈利: -8.35 typeA: -1.67 胜率: 20.00%
趋势空且增强-L-PLUS-3-1 总交易次数: 3 盈利: 1.9062380890852904 亏损: -12.06364497361653 最大盈利: 1.15 最大亏损: -12.06 总收益: -10.16 平均盈利: -3.39 typeA: -2.26 胜率: 66.67%
趋势多且增强-L3-1-5 总交易次数: 6 盈利: 9.856821914947986 亏损: -37.99870034205087 最大盈利: 3.80 最大亏损: -19.55 总收益: -28.14 平均盈利: -4.69 typeA: -2.35 胜率: 50.00%
趋势多且增强-L3-1-4-4 总交易次数: 2 盈利: 6.419680365296834 亏损: -16.207714350693635 最大盈利: 6.42 最大亏损: -16.21 总收益: -9.79 平均盈利: -4.89 typeA: -2.45 胜率: 50.00%
趋势多且增强-R-1-1-2 总交易次数: 11 盈利: 16.225773201097997 亏损: -69.46418756936254 最大盈利: 6.88 最大亏损: -47.93 总收益: -53.24 平均盈利: -4.84 typeA: -3.08 胜率: 63.64%




          ========== 回测结果 ==========
          总交易次数:     63
    盈利次数:       32
    亏损次数:       31
          胜率:          50.79%
          总收益:        -51.93 USDT
          盈亏比:        0.84
    rw:        0.0085
    rl:        0.0104
    carry:        -9.42
          =============================

tradeNumTotal 63
profitTotal -64.73477348234405
maxLossTotal -47.93
winRateTotal 50.79
period month 1
avgRate 50.79
maxDrawdownTotal 11.2
趋势空且增强-L2-1-3 总交易次数: 1 盈利: 66.76737625701973 亏损: 0 最大盈利: 66.77 最大亏损: 66.77 总收益: 66.77 平均盈利: 66.77 typeA: 66.77 胜率: 100.00%
趋势多且增强-R-1-2-2 总交易次数: 1 盈利: 24.759943899018158 亏损: 0 最大盈利: 24.76 最大亏损: 24.76 总收益: 24.76 平均盈利: 24.76 typeA: 24.76 胜率: 100.00%
趋势多且增强-R-1-1-1 总交易次数: 1 盈利: 19.6339896881906 亏损: 0 最大盈利: 19.63 最大亏损: 19.63 总收益: 19.63 平均盈利: 19.63 typeA: 19.63 胜率: 100.00%
趋势空且增强-11 总交易次数: 4 盈利: 42.148924276782196 亏损: -10.581934628975224 最大盈利: 25.53 最大亏损: -10.58 总收益: 31.57 平均盈利: 7.89 typeA: 5.92 胜率: 75.00%
趋势多且增强-L3-1-4-1 总交易次数: 2 盈利: 10.837193392977001 亏损: 0 最大盈利: 10.42 最大亏损: 0.41 总收益: 10.84 平均盈利: 5.42 typeA: 5.42 胜率: 100.00%
趋势多且增强-L1-3-9 总交易次数: 2 盈利: 19.732327287830625 亏损: -6.190784743171233 最大盈利: 19.73 最大亏损: -6.19 总收益: 13.54 平均盈利: 6.77 typeA: 3.39 胜率: 50.00%
趋势空且增强-L-4-2-3 总交易次数: 2 盈利: 1.7686185473743428 亏损: 0 最大盈利: 0.90 最大亏损: 0.87 总收益: 1.77 平均盈利: 0.88 typeA: 0.88 胜率: 100.00%
趋势空且增强-L2-2-3 总交易次数: 2 盈利: 2.766586550754268 亏损: -2.751946148417557 最大盈利: 2.77 最大亏损: -2.75 总收益: 0.01 平均盈利: 0.01 typeA: 0.00 胜率: 50.00%
趋势空且增强-L1-1-2 总交易次数: 1 盈利: 0 亏损: -23.425418771603276 最大盈利: -23.43 最大亏损: -23.43 总收益: -23.43 平均盈利: -23.43 typeA: 0.00 胜率: 0.00%
趋势多且增强-L1-1-6 总交易次数: 3 盈利: 0 亏损: -11.958122498344224 最大盈利: -2.31 最大亏损: -6.15 总收益: -11.96 平均盈利: -3.99 typeA: 0.00 胜率: 0.00%
趋势空且增强-L-PLUS-4-3 总交易次数: 2 盈利: 0 亏损: -8.430248978596184 最大盈利: -0.08 最大亏损: -8.35 总收益: -8.43 平均盈利: -4.22 typeA: 0.00 胜率: 0.00%
趋势多且增强-L3-1-4-3 总交易次数: 2 盈利: 0 亏损: -21.826322043140713 最大盈利: -8.23 最大亏损: -13.60 总收益: -21.83 平均盈利: -10.91 typeA: 0.00 胜率: 0.00%
趋势多且增强-L1-3-2 总交易次数: 1 盈利: 0 亏损: -16.125828522557104 最大盈利: -16.13 最大亏损: -16.13 总收益: -16.13 平均盈利: -16.13 typeA: 0.00 胜率: 0.00%
趋势空且增强-L1-3-4-2 总交易次数: 2 盈利: 0.37851041110513983 亏损: -1.7795038025183536 最大盈利: 0.38 最大亏损: -1.78 总收益: -1.40 平均盈利: -0.70 typeA: -0.35 胜率: 50.00%
趋势空且增强-L2-3-5 总交易次数: 6 盈利: 25.26658934545775 亏损: -30.955950664493177 最大盈利: 21.41 最大亏损: -19.09 总收益: -5.69 平均盈利: -0.95 typeA: -0.47 胜率: 50.00%
趋势多且增强-L3-1-3 总交易次数: 5 盈利: 18.13583957565885 亏损: -24.51158064266303 最大盈利: 14.18 最大亏损: -19.39 总收益: -6.38 平均盈利: -1.28 typeA: -0.51 胜率: 40.00%
趋势多且增强-L3-1-5 总交易次数: 5 盈利: 9.856821914947986 亏损: -20.539314011621737 最大盈利: 3.80 最大亏损: -19.55 总收益: -10.68 平均盈利: -2.14 typeA: -1.28 胜率: 60.00%
趋势空且增强-L2-4-2 总交易次数: 5 盈利: 4.017648873804316 亏损: -45.74433280896775 最大盈利: 4.02 最大亏损: -20.68 总收益: -41.73 平均盈利: -8.35 typeA: -1.67 胜率: 20.00%
趋势空且增强-L-PLUS-3-1 总交易次数: 3 盈利: 1.9062380890852904 亏损: -12.06364497361653 最大盈利: 1.15 最大亏损: -12.06 总收益: -10.16 平均盈利: -3.39 typeA: -2.26 胜率: 66.67%
趋势多且增强-L3-1-4-4 总交易次数: 2 盈利: 6.419680365296834 亏损: -16.207714350693635 最大盈利: 6.42 最大亏损: -16.21 总收益: -9.79 平均盈利: -4.89 typeA: -2.45 胜率: 50.00%
趋势多且增强-R-1-1-2 总交易次数: 11 盈利: 16.225773201097997 亏损: -69.46418756936254 最大盈利: 6.88 最大亏损: -47.93 总收益: -53.24 平均盈利: -4.84 typeA: -3.08 胜率: 63.64%




          ========== 回测结果 ==========
          总交易次数:     3962
    盈利次数:       2321
    亏损次数:       1641
          胜率:          58.58%
          总收益:        14014.68 USDT
          盈亏比:        1.60
    rw:        0.0161
    rl:        0.0143
    carry:        15.18
          =============================

tradeNumTotal 3962
profitTotal 13219.483982473232
maxLossTotal -148.55
winRateTotal 3168.79
period month 54
avgRate 58.68
maxDrawdownTotal 21.8
趋势多且增强-L1-3-1 总交易次数: 55 盈利: 4539.932588306598 亏损: -466.0282809824694 最大盈利: 4084.38 最大亏损: -55.62 总收益: 4073.90 平均盈利: 74.07 typeA: 22.90 胜率: 30.91%
趋势多且增强-L1-2-2 总交易次数: 20 盈利: 1163.1322099112742 亏损: -188.93589280165781 最大盈利: 710.67 最大亏损: -65.21 总收益: 974.20 平均盈利: 48.71 typeA: 19.48 胜率: 40.00%
趋势多且增强-R-1-1-1 总交易次数: 91 盈利: 1719.8997843853906 亏损: -862.8510223875627 最大盈利: 326.83 最大亏损: -148.55 总收益: 857.05 平均盈利: 9.42 typeA: 6.52 胜率: 69.23%
趋势多且增强-L1-2-1 总交易次数: 13 盈利: 220.72503108222404 亏损: -86.80586336062804 最大盈利: 76.67 最大亏损: -29.98 总收益: 133.92 平均盈利: 10.30 typeA: 5.55 胜率: 53.85%
趋势多且增强-L1-1-6 总交易次数: 78 盈利: 2010.3584297403038 亏损: -956.6513917838267 最大盈利: 855.81 最大亏损: -63.73 总收益: 1053.71 平均盈利: 13.51 typeA: 5.54 胜率: 41.03%
趋势空且增强-L2-1-3 总交易次数: 121 盈利: 1493.855100355676 亏损: -779.683843116616 最大盈利: 122.17 最大亏损: -45.11 总收益: 714.17 平均盈利: 5.90 typeA: 4.10 胜率: 69.42%
趋势空且增强-L1-1-2 总交易次数: 49 盈利: 861.6108691878376 亏损: -512.7422512477686 最大盈利: 206.84 最大亏损: -49.77 总收益: 348.87 平均盈利: 7.12 typeA: 4.07 胜率: 57.14%
趋势空且增强-L2-4-2 总交易次数: 195 盈利: 2935.573164407577 亏损: -1465.3609254904657 最大盈利: 388.95 最大亏损: -69.04 总收益: 1470.21 平均盈利: 7.54 typeA: 3.56 胜率: 47.18%
趋势多且增强-R-2-2 总交易次数: 24 盈利: 188.40346934516916 亏损: -73.7662101918911 最大盈利: 36.97 最大亏损: -26.24 总收益: 114.64 平均盈利: 4.78 typeA: 3.18 胜率: 66.67%
趋势多且增强-L1-3-9 总交易次数: 40 盈利: 460.3541382093941 亏损: -237.10107684720708 最大盈利: 111.54 最大亏损: -29.28 总收益: 223.25 平均盈利: 5.58 typeA: 2.51 胜率: 45.00%
趋势多且增强-R-1-1-2 总交易次数: 307 盈利: 3342.660819107714 亏损: -2110.190268602203 最大盈利: 235.85 最大亏损: -93.85 总收益: 1232.47 平均盈利: 4.01 typeA: 2.42 胜率: 60.26%
趋势多且增强-R-3-2 总交易次数: 30 盈利: 133.08712655682857 亏损: -34.11947765410041 最大盈利: 26.69 最大亏损: -13.23 总收益: 98.97 平均盈利: 3.30 typeA: 2.20 胜率: 66.67%
趋势空且增强-L-PLUS-4-3 总交易次数: 66 盈利: 743.9440664631775 亏损: -441.48018437580123 最大盈利: 64.48 最大亏损: -38.74 总收益: 302.46 平均盈利: 4.58 typeA: 2.15 胜率: 46.97%
趋势多且增强-L3-1-5 总交易次数: 279 盈利: 1914.0417755221197 亏损: -1409.753991270397 最大盈利: 137.35 最大亏损: -50.50 总收益: 504.29 平均盈利: 1.81 typeA: 1.17 胜率: 64.87%
趋势多且增强-L3-1-4-3 总交易次数: 155 盈利: 973.8206857051346 亏损: -730.7107085211485 最大盈利: 97.68 最大亏损: -55.36 总收益: 243.11 平均盈利: 1.57 typeA: 0.96 胜率: 61.29%
趋势多且增强-L1-3-2 总交易次数: 50 盈利: 421.77552545378796 亏损: -312.04796072933397 最大盈利: 88.03 最大亏损: -46.38 总收益: 109.73 平均盈利: 2.19 typeA: 0.83 胜率: 38.00%
趋势空且增强-L-PLUS-3-1 总交易次数: 431 盈利: 2464.6509068641867 亏损: -1932.800291760872 最大盈利: 144.27 最大亏损: -66.54 总收益: 531.85 平均盈利: 1.23 typeA: 0.74 胜率: 60.09%
趋势空且增强-L-4-2-3 总交易次数: 169 盈利: 669.5397771272312 亏损: -515.5699856954983 最大盈利: 41.42 最大亏损: -41.54 总收益: 153.97 平均盈利: 0.91 typeA: 0.60 胜率: 65.68%
趋势多且增强-R-2-1 总交易次数: 96 盈利: 672.729440401873 亏损: -575.4048191463102 最大盈利: 169.96 最大亏损: -41.61 总收益: 97.32 平均盈利: 1.01 typeA: 0.59 胜率: 58.33%
趋势多且增强-R-3-1 总交易次数: 141 盈利: 814.7720698122198 亏损: -687.4771601099266 最大盈利: 170.35 最大亏损: -104.97 总收益: 127.29 平均盈利: 0.90 typeA: 0.58 胜率: 63.83%
趋势空且增强-L2-3-5 总交易次数: 335 盈利: 1924.5573411606663 亏损: -1603.8511726448232 最大盈利: 129.83 最大亏损: -67.56 总收益: 320.71 平均盈利: 0.96 typeA: 0.55 胜率: 57.61%
趋势空且增强-L2-2-3 总交易次数: 125 盈利: 646.9502902232175 亏损: -566.4855559790332 最大盈利: 114.24 最大亏损: -62.86 总收益: 80.46 平均盈利: 0.64 typeA: 0.45 胜率: 69.60%
趋势多且增强-L3-1-4-4 总交易次数: 305 盈利: 1279.1145574563377 亏损: -1125.2323973909135 最大盈利: 127.27 最大亏损: -66.73 总收益: 153.88 平均盈利: 0.50 typeA: 0.32 胜率: 62.62%
趋势多且增强-L3-1-4-1 总交易次数: 140 盈利: 1459.0189919270044 亏损: -1376.1619023787257 最大盈利: 185.55 最大亏损: -63.15 总收益: 82.86 平均盈利: 0.59 typeA: 0.31 胜率: 52.86%
趋势空且增强-L1-3-4-2 总交易次数: 196 盈利: 815.7676623357007 亏损: -720.6271781532587 最大盈利: 132.66 最大亏损: -58.81 总收益: 95.14 平均盈利: 0.49 typeA: 0.30 胜率: 61.73%
趋势多且增强-L3-1-3 总交易次数: 182 盈利: 1335.5796804761417 亏损: -1312.247153727902 最大盈利: 259.12 最大亏损: -86.03 总收益: 23.33 平均盈利: 0.13 typeA: 0.06 胜率: 47.25%
趋势空且增强-11 总交易次数: 177 盈利: 1633.2725154847922 亏损: -1651.7892832632465 最大盈利: 75.08 最大亏损: -97.04 总收益: -18.52 平均盈利: -0.10 typeA: -0.06 胜率: 57.06%
趋势多且增强-R-1-2-2 总交易次数: 92 盈利: 607.1693305845517 亏损: -695.7371155071468 最大盈利: 114.08 最大亏损: -60.98 总收益: -88.57 平均盈利: -0.96 typeA: -0.59 胜率: 60.87%

tradeNumTotal 3860
profitTotal 15125.414229547887
maxLossTotal -148.55
winRateTotal 3212.9200000000005
period month 54
avgRate 59.50
maxDrawdownTotal 28.4
趋势多且增强-L1-3-1 总交易次数: 54 盈利: 4615.165450647675 亏损: -393.29356482351295 最大盈利: 4116.61 最大亏损: -55.62 总收益: 4221.87 平均盈利: 78.18 typeA: 26.06 胜率: 33.33%
趋势多且增强-L1-2-2 总交易次数: 20 盈利: 1163.1322099112742 亏损: -195.87599547164766 最大盈利: 710.67 最大亏损: -65.21 总收益: 967.26 平均盈利: 48.36 typeA: 19.35 胜率: 40.00%
趋势多且增强-R-1-1-1 总交易次数: 56 盈利: 1252.416763318721 亏损: -558.6720721804534 最大盈利: 326.83 最大亏损: -148.55 总收益: 693.74 平均盈利: 12.39 typeA: 8.41 胜率: 67.86%
趋势多且增强-L1-1-6 总交易次数: 78 盈利: 2079.0181884927174 亏损: -834.9643769841614 最大盈利: 855.81 最大亏损: -68.77 总收益: 1244.05 平均盈利: 15.95 typeA: 6.95 胜率: 43.59%
趋势多且增强-L1-2-1 总交易次数: 13 盈利: 220.72503108222404 亏损: -66.2813069632484 最大盈利: 76.67 最大亏损: -18.51 总收益: 154.44 平均盈利: 11.88 typeA: 6.40 胜率: 53.85%
趋势空且增强-L2-1-3 总交易次数: 116 盈利: 1521.6677886020275 亏损: -719.5912997091674 最大盈利: 122.17 最大亏损: -74.59 总收益: 802.08 平均盈利: 6.91 typeA: 4.95 胜率: 71.55%
趋势空且增强-L-PLUS-4-3 总交易次数: 64 盈利: 756.7426315451362 亏损: -305.28806147026046 最大盈利: 64.48 最大亏损: -38.34 总收益: 451.45 平均盈利: 7.05 typeA: 3.53 胜率: 50.00%
趋势多且增强-R-2-2 总交易次数: 23 盈利: 185.71534700022434 亏损: -75.36337094234466 最大盈利: 36.97 最大亏损: -27.71 总收益: 110.35 平均盈利: 4.80 typeA: 3.13 胜率: 65.22%
趋势空且增强-L2-4-2 总交易次数: 186 盈利: 2561.407043778128 亏损: -1448.7868185284663 最大盈利: 388.95 最大亏损: -69.04 总收益: 1112.62 平均盈利: 5.98 typeA: 2.80 胜率: 46.77%
趋势多且增强-R-1-1-2 总交易次数: 297 盈利: 3384.380726261221 亏损: -2034.5522628063907 最大盈利: 235.85 最大亏损: -115.10 总收益: 1349.83 平均盈利: 4.54 typeA: 2.75 胜率: 60.61%
趋势多且增强-R-3-2 总交易次数: 29 盈利: 131.08862700955152 亏损: -34.11947765410041 最大盈利: 26.69 最大亏损: -13.23 总收益: 96.97 平均盈利: 3.34 typeA: 2.19 胜率: 65.52%
趋势多且增强-L3-1-5 总交易次数: 279 盈利: 1926.0889935949272 亏损: -1192.2327590592324 最大盈利: 137.35 最大亏损: -52.87 总收益: 733.86 平均盈利: 2.63 typeA: 1.74 胜率: 66.31%
趋势多且增强-L1-3-9 总交易次数: 40 盈利: 460.3541382093941 亏损: -306.7213301115026 最大盈利: 111.54 最大亏损: -57.04 总收益: 153.63 平均盈利: 3.84 typeA: 1.73 胜率: 45.00%
趋势多且增强-L1-3-2 总交易次数: 49 盈利: 421.77552545378796 亏损: -215.25645023028667 最大盈利: 88.03 最大亏损: -29.60 总收益: 206.52 平均盈利: 4.21 typeA: 1.63 胜率: 38.78%
趋势空且增强-L2-3-5 总交易次数: 334 盈利: 2306.6628428955805 亏损: -1423.64224896753 最大盈利: 251.08 最大亏损: -68.86 总收益: 883.02 平均盈利: 2.64 typeA: 1.54 胜率: 58.38%
趋势多且增强-L3-1-4-3 总交易次数: 154 盈利: 963.5146689599396 亏损: -658.8612105088694 最大盈利: 97.68 最大亏损: -56.01 总收益: 304.65 平均盈利: 1.98 typeA: 1.21 胜率: 61.04%
趋势空且增强-L1-1-2 总交易次数: 43 盈利: 677.4444441258147 亏损: -591.147988077895 最大盈利: 206.84 最大亏损: -73.11 总收益: 86.30 平均盈利: 2.01 typeA: 1.12 胜率: 55.81%
趋势空且增强-11 总交易次数: 175 盈利: 1846.2420814324378 亏损: -1552.783705753195 最大盈利: 77.83 最大亏损: -97.04 总收益: 293.46 平均盈利: 1.68 typeA: 1.06 胜率: 63.43%
趋势多且增强-L3-1-4-1 总交易次数: 140 盈利: 1524.393660976355 亏损: -1266.819890173525 最大盈利: 185.55 最大亏损: -76.91 总收益: 257.57 平均盈利: 1.84 typeA: 1.04 胜率: 56.43%
趋势多且增强-R-2-1 总交易次数: 90 盈利: 643.5837781432326 亏损: -498.3286808176821 最大盈利: 169.96 最大亏损: -61.97 总收益: 145.26 平均盈利: 1.61 typeA: 0.93 胜率: 57.78%
趋势空且增强-L-PLUS-3-1 总交易次数: 425 盈利: 2452.00850381786 亏损: -1848.1326922062965 最大盈利: 144.27 最大亏损: -66.54 总收益: 603.88 平均盈利: 1.42 typeA: 0.86 胜率: 60.71%
趋势多且增强-R-3-1 总交易次数: 138 盈利: 784.7994992534334 亏损: -606.9336500413135 最大盈利: 125.40 最大亏损: -104.97 总收益: 177.87 平均盈利: 1.29 typeA: 0.84 胜率: 65.22%
趋势多且增强-R-1-2-2 总交易次数: 85 盈利: 745.5040377525319 亏损: -648.064076645326 最大盈利: 140.35 最大亏损: -94.52 总收益: 97.44 平均盈利: 1.15 typeA: 0.71 胜率: 62.35%
趋势多且增强-L3-1-3 总交易次数: 182 盈利: 1340.1114336572061 亏损: -1115.1555616952398 最大盈利: 259.12 最大亏损: -86.03 总收益: 224.96 平均盈利: 1.24 typeA: 0.60 胜率: 48.35%
趋势空且增强-L-4-2-3 总交易次数: 167 盈利: 639.8538911101035 亏损: -507.50878567733713 最大盈利: 41.42 最大亏损: -59.01 总收益: 132.35 平均盈利: 0.79 typeA: 0.53 胜率: 66.47%
趋势多且增强-L3-1-4-4 总交易次数: 305 盈利: 1279.1145574563377 亏损: -1042.3554833970566 最大盈利: 127.27 最大亏损: -66.73 总收益: 236.76 平均盈利: 0.78 typeA: 0.49 胜率: 62.62%
趋势空且增强-L1-3-4-2 总交易次数: 196 盈利: 822.1287796186717 亏损: -717.6083685724531 最大盈利: 132.66 最大亏损: -58.81 总收益: 104.52 平均盈利: 0.53 typeA: 0.33 胜率: 62.24%
趋势空且增强-L2-2-3 总交易次数: 122 盈利: 631.6228780273548 亏损: -578.1078031173313 最大盈利: 114.24 最大亏损: -62.86 总收益: 53.52 平均盈利: 0.44 typeA: 0.30 胜率: 68.85%


############################################################

if (macdHistogram > lastMacdHistogram && macd > 0) {
			marketType = '趋势多';
		}

		if (macdHistogram < lastMacdHistogram && macd < 0) {
			marketType = '趋势空';
		}

		if (close > emaFast && emaFast > emaSlow) {
			if (
				close > emaSlow &&
				macdHistogram > lastMacdHistogram &&
				lastMacdHistogram < 0
			) {
				marketType =
					adx >= 60
						? '趋势多且增强-L-1'
						: adx >= 50
						? '趋势多且增强-L-2'
						: adx >= 40
						? '趋势多且增强-L-3'
						: adx >= 35
						? '趋势多且增强-L-4'
						: adx >= 30
						? '趋势多且增强-L-5'
						: adx >= 25
						? '趋势多且增强-L-6'
						: adx >= 20
						? '趋势多且增强-L-7'
						: adx >= 15
						? '趋势多且增强-L-8'
						: adx >= 10
						? '趋势多且增强-L-9'
						: '趋势多且增强-L-10';
			}
		}

		if (close < emaFast && emaFast < emaSlow) {
			if (
				close < emaSlow &&
				macdHistogram < lastMacdHistogram &&
				lastMacdHistogram > 0
			) {
				marketType =
					adx >= 60
						? '趋势空且增强-R-1'
						: adx >= 50
						? '趋势空且增强-R-2'
						: adx >= 40
						? '趋势空且增强-R-3'
						: adx >= 35
						? '趋势空且增强-R-4'
						: adx >= 30
						? '趋势空且增强-R-5'
						: adx >= 25
						? '趋势空且增强-R-6'
						: adx >= 20
						? '趋势空且增强-R-7'
						: adx >= 15
						? '趋势空且增强-R-8'
						: adx >= 10
						? '趋势空且增强-R-9'
						: '趋势空且增强-R-10';
			}
		}

    #####################################################


    if (lastMacd < lastLastMacd && macd > lastMacd) {
			if (macd < 0) {
				if (emaSlope > config.emaSlope.emaSlopeThreshold * 3) {
					marketType =
						adx > 50
							? '趋势多且增强-L1-1-1'
							: adx >= 40
							? '趋势多且增强-L1-1-2'
							: adx >= 30
							? '趋势多且增强-L1-1-3'
							: adx >= 35
							? '趋势空且增强-L1-1-4'
							: adx > 25
							? '趋势多且增强-L1-1-5'
							: adx > 20
							? '趋势多且增强-L1-1-6'
							: adx > 15
							? '趋势空且增强-L1-1-7'
							: adx > 10
							? '趋势多且增强-L1-1-8'
							: '趋势多且增强-L1-1-9';
				} else if (emaSlope > config.emaSlope.emaSlopeThreshold * 2) {
					marketType =
						adx > 50
							? '趋势空且增强-L1-2-1'
							: adx >= 40
							? '趋势空且增强-L1-2-2'
							: adx >= 30
							? '趋势空且增强-L1-2-3'
							: adx >= 35
							? '趋势空且增强-L1-2-4'
							: adx > 25
							? '趋势空且增强-L1-2-5'
							: adx > 20
							? '趋势多且增强-L1-2-6'
							: adx > 15
							? '趋势多且增强-L1-2-7'
							: adx > 10
							? '趋势多且增强-L1-2-8'
							: '趋势空且增强-L1-2-9';
				} else if (emaSlope > config.emaSlope.emaSlopeThreshold) {
					marketType =
						adx > 50
							? '趋势空且增强-L1-3-1'
							: adx >= 40
							? '趋势多且增强-L1-3-2'
							: adx >= 30
							? '趋势空且增强-L1-3-3'
							: adx >= 35
							? '趋势空且增强-L1-3-4'
							: adx > 25
							? '趋势空且增强-L1-3-5'
							: adx > 20
							? '趋势多且增强-L1-3-6'
							: adx > 15
							? '趋势空且增强-L1-3-7'
							: adx > 10
							? '趋势多且增强-L1-3-8'
							: '趋势空且增强-L1-3-9';
				} else if (emaSlope > 0) {
					marketType =
						adx > 50
							? '趋势多且增强-L1-4-1'
							: adx >= 40
							? '趋势多且增强-L1-4-2'
							: adx >= 30
							? '趋势多且增强-L1-4-3'
							: adx >= 35
							? '趋势空且增强-L1-4-4'
							: adx > 25
							? '趋势空且增强-L1-4-5'
							: adx > 20
							? '趋势多且增强-L1-4-6'
							: adx > 15
							? '趋势多且增强-L1-4-7'
							: adx > 10
							? '趋势空且增强-L1-4-8'
							: '趋势空且增强-L1-4-9';
				} else {
					marketType =
						adx > 50
							? '趋势多且增强-L1-5-1'
							: adx >= 40
							? '趋势多且增强-L1-5-2'
							: adx >= 30
							? '趋势多且增强-L1-5-3'
							: adx >= 35
							? '趋势空且增强-L1-5-4'
							: adx > 25
							? '趋势多且增强-L1-5-5'
							: adx > 20
							? '趋势多且增强-L1-5-6'
							: adx > 15
							? '趋势多且增强-L1-5-7'
							: adx > 10
							? '趋势空且增强-L1-5-8'
							: '趋势空且增强-L1-5-9';
				}
			} else {
				// marketType = adx > 30 ? '趋势多' : '';
			}
		}

		if (lastMacd > lastLastMacd && macd < lastMacd) {
			if (macd > 0) {
				if (emaSlope > config.emaSlope.emaSlopeThreshold * 3) {
					marketType =
						adx > 50
							? '趋势空且增强-R1-1-1'
							: adx >= 40
							? '趋势多且增强-R1-1-2'
							: adx >= 30
							? '趋势空且增强-R1-1-3'
							: adx >= 35
							? '趋势空且增强-R1-1-4'
							: adx > 25
							? '趋势空且增强-R1-1-5'
							: adx > 20
							? '趋势多且增强-R1-1-6'
							: adx > 15
							? '趋势空且增强-R1-1-7'
							: adx > 10
							? '趋势多且增强-R1-1-8'
							: '趋势空且增强-R1-1-9';
				} else if (emaSlope > config.emaSlope.emaSlopeThreshold * 2) {
					marketType =
						adx > 50
							? '趋势多且增强-R1-2-1'
							: adx >= 40
							? '趋势多且增强-R1-2-2'
							: adx >= 30
							? '趋势空且增强-R1-2-3'
							: adx >= 35
							? '趋势空且增强-R1-2-4'
							: adx > 25
							? '趋势多且增强-R1-2-5'
							: adx > 20
							? '趋势多且增强-R1-2-6'
							: adx > 15
							? '趋势空且增强-R1-2-7'
							: adx > 10
							? '趋势多且增强-R1-2-8'
							: '趋势空且增强-R1-2-9';
				} else if (emaSlope > config.emaSlope.emaSlopeThreshold) {
					marketType =
						adx > 50
							? '趋势空且增强-R1-3-1'
							: adx >= 40
							? '趋势多且增强-R1-3-2'
							: adx >= 30
							? '趋势多且增强-R1-3-3'
							: adx >= 35
							? '趋势空且增强-R1-3-4'
							: adx > 25
							? '趋势多且增强-R1-3-5'
							: adx > 20
							? '趋势空且增强-R1-3-6'
							: adx > 15
							? '趋势多且增强-R1-3-7'
							: adx > 10
							? '趋势多且增强-R1-3-8'
							: '趋势空且增强-R1-3-9';
				} else if (emaSlope > 0) {
					marketType =
						adx > 50
							? '趋势空且增强-R1-4-1'
							: adx >= 40
							? '趋势空且增强-R1-4-2'
							: adx >= 30
							? '趋势多且增强-R1-4-3'
							: adx >= 35
							? '趋势空且增强-R1-4-4'
							: adx > 25
							? '趋势多且增强-R1-4-5'
							: adx > 20
							? '趋势空且增强-R1-4-6'
							: adx > 15
							? '趋势多且增强-R1-4-7'
							: adx > 10
							? '趋势空且增强-R1-4-8'
							: '趋势多且增强-R1-4-9';
				} else {
					marketType =
						adx > 50
							? '趋势空且增强-R1-5-1'
							: adx >= 40
							? '趋势多且增强-R1-5-2'
							: adx >= 30
							? '趋势空且增强-R1-5-3'
							: adx >= 35
							? '趋势空且增强-R1-5-4'
							: adx > 25
							? '趋势空且增强-R1-5-5'
							: adx > 20
							? '趋势空且增强-R1-5-6'
							: adx > 15
							? '趋势空且增强-R1-5-7'
							: adx > 10
							? '趋势多且增强-R1-5-8'
							: '趋势空且增强-R1-5-9';
				}
			} else {
				// marketType = adx > 30 ? '趋势空' : '';
			}
		}


    #######################################################

    
          ========== 回测结果 ==========
          总交易次数:     44664
    盈利次数:       28527
    亏损次数:       16137
          胜率:          63.87%
          总收益:        -13503.48 USDT
          盈亏比:        0.91
    rw:        0.0049
    rl:        0.0094
    carry:        -6.55
          =============================

tradeNumTotal 44664
profitTotal -22447.076819631773
maxLossTotal -704.36
winRateTotal 3445.67
period month 54
avgRate 63.81
maxDrawdownTotal 379.2
趋势多且增强-L-1-2 总交易次数: 12781 盈利: 44891.63011335553 亏损: -45590.57582253698 最大盈利: 202.30 最大亏损: -310.11 总收益: -698.95 平均盈利: -0.05 typeA: -0.03 胜率: 63.41%
趋势多且增强-R-1-2 总交易次数: 9553 盈利: 25769.423407277638 亏损: -27219.606518544308 最大盈利: 182.89 最大亏损: -304.20 总收益: -1450.18 平均盈利: -0.15 typeA: -0.10 胜率: 65.69%
趋势空且增强-R-1-1 总交易次数: 12252 盈利: 42465.51512919305 亏损: -47437.634837631376 最大盈利: 185.33 最大亏损: -475.01 总收益: -4972.12 平均盈利: -0.41 typeA: -0.25 胜率: 61.92%
趋势空且增强-L-1-1 总交易次数: 10078 盈利: 25785.35630771029 亏损: -32167.584598453795 最大盈利: 96.27 最大亏损: -704.36 总收益: -6382.23 平均盈利: -0.63 typeA: -0.41 胜率: 65.10%

####################################################################



          ========== 回测结果 ==========
          总交易次数:     5259
    盈利次数:       2679
    亏损次数:       2580
          胜率:          50.94%
          总收益:        5367.46 USDT
          盈亏比:        1.19
    rw:        0.0128
    rl:        0.0112
    carry:        7.06
          =============================

tradeNumTotal 5259
profitTotal 4310.062176145464
maxLossTotal -377.46
winRateTotal 2760.32
period month 54
avgRate 51.12
maxDrawdownTotal 47.2
趋势多且增强-L-1-1 总交易次数: 2675 盈利: 18803.99947212317 亏损: -13913.375070513306 最大盈利: 703.68 最大亏损: -141.42 总收益: 4890.62 平均盈利: 1.83 typeA: 0.93 胜率: 51.03%
趋势空且增强-R-1-1 总交易次数: 2584 盈利: 15533.717859587516 亏损: -15056.880085051695 最大盈利: 287.92 最大亏损: -377.46 总收益: 476.84 平均盈利: 0.18 typeA: 0.09 胜率: 50.85%

##############################################################

   ========== 回测结果 ==========
          总交易次数:     4263
    盈利次数:       1934
    亏损次数:       2329
          胜率:          45.37%
          总收益:        5818.86 USDT
          盈亏比:        1.22
    rw:        0.0166
    rl:        0.0113
    carry:        7.13
          =============================

tradeNumTotal 4263
profitTotal 4961.057679564876
maxLossTotal -376.49
winRateTotal 2465.669999999999
period month 54
avgRate 45.66
maxDrawdownTotal 49.7
趋势多且增强-L-1-1 总交易次数: 2227 盈利: 19887.951550813606 亏损: -12976.35891926821 最大盈利: 3521.33 最大亏损: -123.91 总收益: 6911.59 平均盈利: 3.10 typeA: 1.46 胜率: 47.15%
趋势空且增强-R-1-1 总交易次数: 2036 盈利: 12299.289498715894 亏损: -13392.024450696283 最大盈利: 252.07 最大亏损: -376.49 总收益: -1092.73 平均盈利: -0.54 typeA: -0.23 胜率: 43.42%





#############################################################



          ========== 回测结果 ==========
          总交易次数:     3920
    盈利次数:       1632
    亏损次数:       2288
          胜率:          41.63%
          总收益:        6235.33 USDT
          盈亏比:        1.25
    rw:        0.0190
    rl:        0.0109
    carry:        7.52
          =============================

tradeNumTotal 3920
profitTotal 5445.9336928014745
maxLossTotal -163.61
winRateTotal 2269.2400000000002
period month 54
avgRate 42.02
maxDrawdownTotal 42.6
趋势多且增强-L1-5-1 总交易次数: 28 盈利: 1651.922889161511 亏损: -150.12465620627242 最大盈利: 1111.26 最大亏损: -35.54 总收益: 1501.80 平均盈利: 53.64 typeA: 28.73 胜率: 53.57%
趋势多且增强-L1-5-2 总交易次数: 83 盈利: 5090.125019593554 亏损: -591.7251870712986 最大盈利: 3521.33 最大亏损: -44.15 总收益: 4498.40 平均盈利: 54.20 typeA: 21.55 胜率: 39.76%
趋势多且增强-L1-5-3 总交易次数: 92 盈利: 1824.709835318171 亏损: -960.2489659605048 最大盈利: 871.27 最大亏损: -76.28 总收益: 864.46 平均盈利: 9.40 typeA: 3.17 胜率: 33.70%
趋势空且增强-R1-5-4 总交易次数: 169 盈利: 1804.1660557336938 亏损: -1349.470145493284 最大盈利: 177.46 最大亏损: -92.34 总收益: 454.70 平均盈利: 2.69 typeA: 1.02 胜率: 37.87%
趋势多且增强-L1-5-8 总交易次数: 485 盈利: 2508.327328781641 亏损: -2068.5172732518786 最大盈利: 370.65 最大亏损: -123.91 总收益: 439.81 平均盈利: 0.91 typeA: 0.41 胜率: 45.15%
趋势多且增强-L1-5-7 总交易次数: 515 盈利: 2437.1866629291776 亏损: -2249.3336084474504 最大盈利: 136.36 最大亏损: -83.46 总收益: 187.85 平均盈利: 0.36 typeA: 0.17 胜率: 46.21%
趋势空且增强-R1-5-2 总交易次数: 134 盈利: 1014.1737274666042 亏损: -962.6263151782007 最大盈利: 150.68 最大亏损: -50.99 总收益: 51.55 平均盈利: 0.38 typeA: 0.11 胜率: 29.10%
趋势多且增强-L1-5-6 总交易次数: 393 盈利: 2427.9708248399547 亏损: -2359.8781537444042 最大盈利: 127.34 最大亏损: -56.38 总收益: 68.09 平均盈利: 0.17 typeA: 0.07 胜率: 42.24%
趋势空且增强-R1-5-9 总交易次数: 44 盈利: 151.3091480425107 亏损: -144.31326318001257 最大盈利: 19.70 最大亏损: -34.36 总收益: 7.00 平均盈利: 0.16 typeA: 0.07 胜率: 45.45%
趋势空且增强-R1-5-8 总交易次数: 334 盈利: 1595.8524481432542 亏损: -1578.6063492781905 最大盈利: 161.90 最大亏损: -94.82 总收益: 17.25 平均盈利: 0.05 typeA: 0.02 胜率: 43.11%
趋势空且增强-R1-5-6 总交易次数: 375 盈利: 2440.601891052608 亏损: -2442.409934355144 最大盈利: 218.02 最大亏损: -101.70 总收益: -1.81 平均盈利: -0.00 typeA: -0.00 胜率: 42.40%
趋势多且增强-L1-5-4 总交易次数: 150 盈利: 1351.54196515396 亏损: -1382.3126444488232 最大盈利: 131.32 最大亏损: -77.91 总收益: -30.77 平均盈利: -0.21 typeA: -0.08 胜率: 41.33%
趋势空且增强-R1-5-7 总交易次数: 392 盈利: 1902.2651604915166 亏损: -2033.9577779315823 最大盈利: 116.80 最大亏损: -107.23 总收益: -131.69 平均盈利: -0.34 typeA: -0.15 胜率: 43.88%
趋势空且增强-R1-5-3 总交易次数: 118 盈利: 785.9427657085969 亏损: -941.8640010798515 最大盈利: 252.07 最大亏损: -102.29 总收益: -155.92 平均盈利: -1.32 typeA: -0.43 胜率: 32.20%
趋势空且增强-R1-5-5 总交易次数: 250 盈利: 1742.9261894959452 亏损: -2139.897402252605 最大盈利: 132.27 最大亏损: -141.32 总收益: -396.97 平均盈利: -1.59 typeA: -0.65 胜率: 40.80%
趋势多且增强-L1-5-9 总交易次数: 56 盈利: 183.2555738921065 亏损: -280.8154023788854 最大盈利: 41.39 最大亏损: -32.55 总收益: -97.56 平均盈利: -1.74 typeA: -0.75 胜率: 42.86%
趋势多且增强-L1-5-5 总交易次数: 238 盈利: 1961.0245739473794 亏损: -2488.2977588739122 最大盈利: 206.58 最大亏损: -163.61 总收益: -527.27 平均盈利: -2.22 typeA: -0.88 胜率: 39.92%
趋势空且增强-R1-5-1 总交易次数: 64 盈利: 238.53134087142547 亏损: -752.1008686896699 最大盈利: 85.90 最大亏损: -49.66 总收益: -513.57 平均盈利: -8.02 typeA: -1.38 胜率: 17.19%


  ========== 回测结果 ==========
          总交易次数:     5485
    盈利次数:       3012
    亏损次数:       2473
          胜率:          54.91%
          总收益:        13213.04 USDT
          盈亏比:        1.57
    rw:        0.0121
    rl:        0.0095
    carry:        20.75
          =============================

tradeNumTotal 5485
profitTotal 12112.643343744297
maxLossTotal -119.73
winRateTotal 2954.95
period month 54
avgRate 54.72
maxDrawdownTotal 30.3
趋势多且增强-L1-3-1 总交易次数: 33 盈利: 3607.422974764451 亏损: -290.77955135976737 最大盈利: 3521.33 最大亏损: -63.25 总收益: 3316.64 平均盈利: 100.50 typeA: 30.45 胜率: 30.30%
趋势多且增强-L1-2-2 总交易次数: 14 盈利: 1067.5897464768136 亏损: -144.58922700600408 最大盈利: 710.67 最大亏损: -78.95 总收益: 923.00 平均盈利: 65.93 typeA: 28.26 胜率: 42.86%
趋势空且增强-R1-5-3 总交易次数: 2 盈利: 35.197509878052294 亏损: -4.5075966024644005 最大盈利: 35.20 最大亏损: -4.51 总收益: 30.69 平均盈利: 15.34 typeA: 7.67 胜率: 50.00%
趋势多且增强-L1-1-6 总交易次数: 79 盈利: 1937.0062898223534 亏损: -676.4852439719008 最大盈利: 855.81 最大亏损: -63.73 总收益: 1260.52 平均盈利: 15.96 typeA: 6.66 胜率: 41.77%
趋势空且增强-L1-1-2 总交易次数: 49 盈利: 746.3474169440866 亏损: -284.3841735995678 最大盈利: 206.84 最大亏损: -51.38 总收益: 461.96 平均盈利: 9.43 typeA: 5.58 胜率: 59.18%
趋势多且增强-R-1-1-1 总交易次数: 37 盈利: 402.4351187736668 亏损: -190.74862979179298 最大盈利: 74.00 最大亏损: -77.71 总收益: 211.69 平均盈利: 5.72 typeA: 4.17 胜率: 72.97%
趋势空且增强-L2-1-3 总交易次数: 81 盈利: 701.6169485207743 亏损: -244.0829317552269 最大盈利: 85.99 最大亏损: -67.37 总收益: 457.53 平均盈利: 5.65 typeA: 4.04 胜率: 71.60%
趋势多且增强-L3-1-4-1 总交易次数: 109 盈利: 1283.6884792407996 亏损: -672.6747849353197 最大盈利: 185.55 最大亏损: -111.27 总收益: 611.01 平均盈利: 5.61 typeA: 3.03 胜率: 54.13%
趋势多且增强-R-3-2 总交易次数: 29 盈利: 121.08334749055211 亏损: -14.359723631891562 最大盈利: 17.89 最大亏损: -5.81 总收益: 106.72 平均盈利: 3.68 typeA: 2.92 胜率: 79.31%
趋势多且增强-L1-5-1 总交易次数: 99 盈利: 1677.0947218915721 亏损: -1030.9319168533643 最大盈利: 240.25 最大亏损: -65.84 总收益: 646.16 平均盈利: 6.53 typeA: 2.77 胜率: 42.42%
趋势多且增强-L1-3-9 总交易次数: 35 盈利: 285.79698593370966 亏损: -108.63282161071861 最大盈利: 111.54 最大亏损: -21.56 总收益: 177.16 平均盈利: 5.06 typeA: 2.31 胜率: 45.71%
趋势多且增强-R-1-1-2 总交易次数: 309 盈利: 2448.7457242100018 亏损: -1350.3408614177893 最大盈利: 175.28 最大亏损: -119.73 总收益: 1098.40 平均盈利: 3.55 typeA: 2.30 胜率: 64.72%
趋势空且增强-L2-2-3 总交易次数: 47 盈利: 266.22352875534807 亏损: -112.74162151559126 最大盈利: 23.82 最大亏损: -29.63 总收益: 153.48 平均盈利: 3.27 typeA: 2.29 胜率: 70.21%
趋势空且增强-L2-3-5 总交易次数: 227 盈利: 1399.3632153035824 亏损: -634.0893869297391 最大盈利: 159.87 最大亏损: -42.54 总收益: 765.27 平均盈利: 3.37 typeA: 2.08 胜率: 61.67%
趋势多且增强-R-1-2-2 总交易次数: 83 盈利: 607.7811600300067 亏损: -376.5393500213195 最大盈利: 71.07 最大亏损: -83.03 总收益: 231.24 平均盈利: 2.79 typeA: 2.05 胜率: 73.49%
趋势多且增强-L3-1-5 总交易次数: 231 盈利: 1605.0229535878802 亏损: -878.3381384973866 最大盈利: 137.35 最大亏损: -45.64 总收益: 726.68 平均盈利: 3.15 typeA: 1.97 胜率: 62.77%
趋势空且增强-L-PLUS-4-3 总交易次数: 79 盈利: 600.3240678598769 亏损: -321.6803432227257 最大盈利: 64.48 最大亏损: -39.23 总收益: 278.64 平均盈利: 3.53 typeA: 1.96 胜率: 55.70%
趋势多且增强-R-2-1 总交易次数: 96 盈利: 552.3817696997543 亏损: -307.922128665165 最大盈利: 62.39 最大亏损: -29.31 总收益: 244.46 平均盈利: 2.55 typeA: 1.80 胜率: 70.83%
趋势多且增强-L3-1-3 总交易次数: 131 盈利: 1060.4939988069639 亏损: -597.1146188221342 最大盈利: 259.12 最大亏损: -53.84 总收益: 463.38 平均盈利: 3.54 typeA: 1.59 胜率: 45.04%
趋势多且增强-R-2-2 总交易次数: 23 盈利: 113.62558352797274 亏损: -67.70892729657452 最大盈利: 18.82 最大亏损: -27.71 总收益: 45.92 平均盈利: 2.00 typeA: 1.39 胜率: 69.57%
趋势空且增强-L-PLUS-3-1 总交易次数: 387 盈利: 1726.3342599577506 亏损: -1152.7094970237538 最大盈利: 73.67 最大亏损: -55.61 总收益: 573.62 平均盈利: 1.48 typeA: 0.92 胜率: 62.27%
趋势多且增强-L1-5-3 总交易次数: 139 盈利: 1074.0587734840997 亏损: -829.5969060886276 最大盈利: 137.34 最大亏损: -54.12 总收益: 244.46 平均盈利: 1.76 typeA: 0.73 胜率: 41.73%
趋势空且增强-L2-4-2 总交易次数: 197 盈利: 1709.611836376648 亏损: -1488.779546277279 最大盈利: 241.08 最大亏损: -110.69 总收益: 220.83 平均盈利: 1.12 typeA: 0.55 胜率: 48.73%
趋势空且增强-L2-3-3 总交易次数: 451 盈利: 1916.8363125550134 亏损: -1612.526331247291 最大盈利: 107.50 最大亏损: -76.90 总收益: 304.31 平均盈利: 0.67 typeA: 0.42 胜率: 62.53%
趋势多且增强-L1-5-5 总交易次数: 906 盈利: 3596.4895916049654 亏损: -3137.9975744684148 最大盈利: 265.18 最大亏损: -84.77 总收益: 458.49 平均盈利: 0.51 typeA: 0.20 胜率: 39.29%
趋势空且增强-L-4-2-3 总交易次数: 168 盈利: 456.4626016327338 亏损: -411.8303407515272 最大盈利: 32.37 最大亏损: -58.65 总收益: 44.63 平均盈利: 0.27 typeA: 0.16 胜率: 61.31%
趋势多且增强-R-3-1 总交易次数: 136 盈利: 510.11573977059265 亏损: -491.85346782717 最大盈利: 32.59 最大亏损: -60.90 总收益: 18.26 平均盈利: 0.13 typeA: 0.09 胜率: 70.59%
趋势多且增强-L1-5-2 总交易次数: 70 盈利: 563.8070178364105 亏损: -556.1915299563439 最大盈利: 117.74 最大亏损: -57.69 总收益: 7.62 平均盈利: 0.11 typeA: 0.04 胜率: 37.14%
趋势空且增强-L2-3-4 总交易次数: 390 盈利: 1312.86819774523 亏损: -1403.3102935595866 最大盈利: 64.37 最大亏损: -64.70 总收益: -90.44 平均盈利: -0.23 typeA: -0.14 胜率: 60.26%
趋势多且增强-L3-1-4-3 总交易次数: 135 盈利: 524.2066417080847 亏损: -558.5103993525397 最大盈利: 89.90 最大亏损: -55.36 总收益: -34.30 平均盈利: -0.25 typeA: -0.14 胜率: 57.04%
趋势空且增强-L1-3-4-2 总交易次数: 206 盈利: 644.2617172448569 亏损: -702.6689997373709 最大盈利: 132.66 最大亏损: -58.81 总收益: -58.41 平均盈利: -0.28 typeA: -0.16 胜率: 57.28%
趋势多且增强-L1-3-2 总交易次数: 31 盈利: 142.76287076590611 亏损: -171.58485840211196 最大盈利: 30.35 最大亏损: -23.02 总收益: -28.82 平均盈利: -0.93 typeA: -0.30 胜率: 32.26%
趋势多且增强-L3-1-4-4 总交易次数: 271 盈利: 706.0625981668021 亏损: -845.8961055762051 最大盈利: 58.96 最大亏损: -42.02 总收益: -139.83 平均盈利: -0.52 typeA: -0.31 胜率: 60.52%
趋势多且增强-L1-2-1 总交易次数: 8 盈利: 42.95613016748095 亏损: -54.96245936533989 最大盈利: 24.78 最大亏损: -16.20 总收益: -12.01 平均盈利: -1.50 typeA: -0.56 胜率: 37.50%
趋势空且增强-11 总交易次数: 197 盈利: 1149.204326347374 亏损: -1655.166525997628 最大盈利: 60.43 最大亏损: -106.79 总收益: -505.96 平均盈利: -2.57 typeA: -1.00 胜率: 39.09%


tradeNumTotal 4220
profitTotal 16928.234911220407
maxLossTotal -119.73
winRateTotal 3218.3799999999997
period month 54
avgRate 59.60
maxDrawdownTotal 24.5
趋势多且增强-L1-3-1 总交易次数: 54 盈利: 4615.165450647675 亏损: -365.82387225512747 最大盈利: 4116.61 最大亏损: -48.26 总收益: 4249.34 平均盈利: 78.69 typeA: 26.23 胜率: 33.33%
趋势多且增强-L1-2-2 总交易次数: 20 盈利: 1163.1322099112742 亏损: -162.21477539442756 最大盈利: 710.67 最大亏损: -57.31 总收益: 1000.92 平均盈利: 50.05 typeA: 20.02 胜率: 40.00%
趋势空且增强-L2-1-3 总交易次数: 70 盈利: 940.050492412507 亏损: -216.90582361045173 最大盈利: 122.10 最大亏损: -67.37 总收益: 723.14 平均盈利: 10.33 typeA: 7.97 胜率: 77.14%
趋势多且增强-L1-1-6 总交易次数: 78 盈利: 2079.0181884927174 亏损: -699.504532465321 最大盈利: 855.81 最大亏损: -63.73 总收益: 1379.51 平均盈利: 17.69 typeA: 7.71 胜率: 43.59%
趋势多且增强-L1-2-1 总交易次数: 13 盈利: 220.72503108222404 亏损: -66.2813069632484 最大盈利: 76.67 最大亏损: -18.51 总收益: 154.44 平均盈利: 11.88 typeA: 6.40 胜率: 53.85%
趋势多且增强-R-1-1-1 总交易次数: 36 盈利: 419.42768677367286 亏损: -120.21936169414755 最大盈利: 74.00 最大亏损: -30.68 总收益: 299.21 平均盈利: 8.31 typeA: 5.77 胜率: 69.44%
趋势空且增强-L-PLUS-4-3 总交易次数: 62 盈利: 744.9041970364726 亏损: -302.1502570399583 最大盈利: 64.48 最大亏损: -38.34 总收益: 442.75 平均盈利: 7.14 typeA: 3.57 胜率: 50.00%
趋势多且增强-R-2-2 总交易次数: 23 盈利: 185.71534700022434 亏损: -75.36337094234466 最大盈利: 36.97 最大亏损: -27.71 总收益: 110.35 平均盈利: 4.80 typeA: 3.13 胜率: 65.22%
趋势多且增强-R-1-1-2 总交易次数: 290 盈利: 3123.062816609796 亏损: -1756.1095586748124 最大盈利: 235.85 最大亏损: -119.73 总收益: 1366.95 平均盈利: 4.71 typeA: 2.84 胜率: 60.34%
趋势空且增强-L2-4-2 总交易次数: 179 盈利: 2496.8107447210755 亏损: -1472.4485180318327 最大盈利: 388.95 最大亏损: -110.69 总收益: 1024.36 平均盈利: 5.72 typeA: 2.65 胜率: 46.37%
趋势多且增强-R-1-2-2 总交易次数: 83 盈利: 764.256783034745 亏损: -444.7048885122962 最大盈利: 140.35 最大亏损: -83.03 总收益: 319.55 平均盈利: 3.85 typeA: 2.50 胜率: 65.06%
趋势空且增强-11 总交易次数: 171 盈利: 1902.1201211949274 亏损: -1276.0355909771188 最大盈利: 77.83 最大亏损: -89.77 总收益: 626.08 平均盈利: 3.66 typeA: 2.40 胜率: 65.50%
趋势空且增强-L2-2-3 总交易次数: 37 盈利: 321.74008513447353 亏损: -190.53258813673878 最大盈利: 114.24 最大亏损: -37.59 总收益: 131.21 平均盈利: 3.55 typeA: 2.40 胜率: 67.57%
趋势空且增强-L1-1-2 总交易次数: 43 盈利: 677.9637673401679 亏损: -502.1346798458108 最大盈利: 206.84 最大亏损: -80.81 总收益: 175.83 平均盈利: 4.09 typeA: 2.38 胜率: 58.14%
趋势多且增强-L3-1-4-1 总交易次数: 140 盈利: 1588.485362774468 亏损: -1033.17280274229 最大盈利: 185.55 最大亏损: -90.48 总收益: 555.31 平均盈利: 3.97 typeA: 2.32 胜率: 58.57%
趋势多且增强-R-3-2 总交易次数: 29 盈利: 131.08862700955152 亏损: -34.11947765410041 最大盈利: 26.69 最大亏损: -13.23 总收益: 96.97 平均盈利: 3.34 typeA: 2.19 胜率: 65.52%
趋势多且增强-L3-1-5 总交易次数: 284 盈利: 1903.53603016815 亏损: -1054.0308493212049 最大盈利: 137.35 最大亏损: -66.32 总收益: 849.51 平均盈利: 2.99 typeA: 2.02 胜率: 67.61%
趋势多且增强-L1-3-9 总交易次数: 40 盈利: 460.3541382093941 亏损: -281.605409278742 最大盈利: 111.54 最大亏损: -46.29 总收益: 178.75 平均盈利: 4.47 typeA: 2.01 胜率: 45.00%
趋势空且增强-L-PLUS-3-1 总交易次数: 340 盈利: 2249.8938258627245 亏损: -1316.7814724230295 最大盈利: 144.27 最大亏损: -60.93 总收益: 933.11 平均盈利: 2.74 typeA: 1.70 胜率: 62.06%
趋势多且增强-L1-3-2 总交易次数: 49 盈利: 419.4361279691434 亏损: -210.09022776632148 最大盈利: 88.03 最大亏损: -29.60 总收益: 209.35 平均盈利: 4.27 typeA: 1.66 胜率: 38.78%
趋势空且增强-L2-3-5 总交易次数: 208 盈利: 1391.2459230622064 亏损: -832.8783428812461 最大盈利: 129.83 最大亏损: -63.36 总收益: 558.37 平均盈利: 2.68 typeA: 1.50 胜率: 55.77%
趋势多且增强-R-2-1 总交易次数: 89 盈利: 638.2826777030565 亏损: -441.96667776738195 最大盈利: 169.96 最大亏损: -46.38 总收益: 196.32 平均盈利: 2.21 typeA: 1.26 胜率: 57.30%
趋势多且增强-L3-1-3 总交易次数: 186 盈利: 1397.1112795066297 亏损: -966.7721066148828 最大盈利: 259.12 最大亏损: -78.51 总收益: 430.34 平均盈利: 2.31 typeA: 1.14 胜率: 49.46%
趋势空且增强-L2-3-3 总交易次数: 392 盈利: 2399.131228751367 亏损: -1793.8687872382238 最大盈利: 258.83 最大亏损: -77.48 总收益: 605.26 平均盈利: 1.54 typeA: 0.93 胜率: 60.20%
趋势多且增强-R-3-1 总交易次数: 139 盈利: 769.0097775705856 亏损: -588.4762426425618 最大盈利: 125.40 最大亏损: -73.28 总收益: 180.53 平均盈利: 1.30 typeA: 0.84 胜率: 64.75%
趋势多且增强-L3-1-4-3 总交易次数: 154 盈利: 820.8590052876782 亏损: -649.6670696504435 最大盈利: 97.68 最大亏损: -55.36 总收益: 171.19 平均盈利: 1.11 typeA: 0.69 胜率: 61.69%
趋势多且增强-L3-1-4-4 总交易次数: 314 盈利: 1291.0062479637754 亏损: -1005.6300080567521 最大盈利: 127.27 最大亏损: -60.90 总收益: 285.38 平均盈利: 0.91 typeA: 0.60 胜率: 66.24%
趋势空且增强-L2-3-4 总交易次数: 356 盈利: 1809.5441292399594 亏损: -1448.6167820560433 最大盈利: 102.09 最大亏损: -64.70 总收益: 360.93 平均盈利: 1.01 typeA: 0.59 胜率: 58.43%
趋势空且增强-L-4-2-3 总交易次数: 156 盈利: 602.8326726017581 亏损: -481.8919433842852 最大盈利: 41.42 最大亏损: -59.01 总收益: 120.94 平均盈利: 0.78 typeA: 0.51 胜率: 66.03%
趋势空且增强-L1-3-4-2 总交易次数: 185 盈利: 749.1204233799414 亏损: -709.5981632106348 最大盈利: 132.66 最大亏损: -58.81 总收益: 39.52 平均盈利: 0.21 typeA: 0.13 胜率: 61.62%


          ========== 回测结果 ==========
          总交易次数:     1641
    盈利次数:       722
    亏损次数:       919
          胜率:          44.00%
          总收益:        7052.77 USDT
          盈亏比:        1.67
    rw:        0.0238
    rl:        0.0116
    carry:        14.35
          =============================

tradeNumTotal 1641
profitTotal 6722.171187438971
maxLossTotal -102.6
winRateTotal 2390.9999999999995
period month 54
avgRate 44.28
maxDrawdownTotal 25
趋势空且增强-R1-5-3 总交易次数: 5 盈利: 212.188818597397 亏损: -98.64078099926832 最大盈利: 163.85 最大亏损: -85.10 总收益: 113.55 平均盈利: 22.71 typeA: 13.63 胜率: 60.00%
趋势多且增强-L1-5-1 总交易次数: 147 盈利: 4366.353407767191 亏损: -1687.771286034304 最大盈利: 1111.26 最大亏损: -102.60 总收益: 2678.58 平均盈利: 18.22 typeA: 9.05 胜率: 49.66%
趋势多且增强-L1-5-3 总交易次数: 279 盈利: 5915.393395308813 亏损: -2036.2344405979507 最大盈利: 3521.33 最大亏损: -85.26 总收益: 3879.16 平均盈利: 13.90 typeA: 6.58 胜率: 47.31%
趋势多且增强-L1-5-5 总交易次数: 1083 盈利: 5757.52844545543 亏损: -5277.588415968945 最大盈利: 871.27 最大亏损: -83.46 总收益: 479.94 平均盈利: 0.44 typeA: 0.19 胜率: 42.66%
趋势多且增强-L1-5-2 总交易次数: 127 盈利: 1366.1934979324342 亏损: -1464.651454021736 最大盈利: 293.83 最大亏损: -67.57 总收益: -98.46 平均盈利: -0.78 typeA: -0.32 胜率: 40.94%


if (emaFast > emaSlow) {
			if (lastMacd > lastLastMacd && macd < lastMacd && lastMacd > 0) {
				marketType =
					adx > 50
						? '趋势多'
						: adx >= 40
						? '趋势多'
						: adx >= 35
						? '趋势多'
						: adx >= 30
						? '趋势多'
						: adx > 25
						? '趋势多'
						: adx > 20
						? '趋势空'
						: adx > 15
						? '趋势空'
						: adx > 10
						? '趋势空'
						: '趋势空';
			}
			if (lastMacd < lastLastMacd && macd > lastMacd && lastMacd < 0) {
				marketType =
					emaSlope > config.emaSlope.emaSlopeThreshold * 3
						? '趋势多且增强-L1-5-1'
						: emaSlope > config.emaSlope.emaSlopeThreshold * 2
						? '趋势多且增强-L1-5-2'
						: emaSlope > config.emaSlope.emaSlopeThreshold
						? '趋势多且增强-L1-5-3'
						: emaSlope > config.emaSlope.emaSlopeThreshold / 2
						? ''
						: emaSlope > 0
						? '趋势多且增强-L1-5-5'
						: emaSlope > -config.emaSlope.emaSlopeThreshold / 2
						? adx >= 25
							? ''
							: ''
						: emaSlope > -config.emaSlope.emaSlopeThreshold
						? ''
						: emaSlope > -config.emaSlope.emaSlopeThreshold * 2
						? ''
						: emaSlope > -config.emaSlope.emaSlopeThreshold * 3
						? ''
						: '';
			}
		}
		if (emaFast < emaSlow) {
			if (lastMacd < lastLastMacd && macd > lastMacd && lastMacd < 0) {
				marketType =
					adx > 50
						? '趋势空'
						: adx >= 40
						? '趋势空'
						: adx >= 35
						? '趋势空'
						: adx >= 30
						? '趋势空'
						: adx > 25
						? '趋势空'
						: adx > 20
						? '趋势多'
						: adx > 15
						? '趋势多'
						: adx > 10
						? '趋势多'
						: '趋势多';
			}
			if (lastMacd > lastLastMacd && macd < lastMacd && lastMacd > 0) {
				marketType =
					emaSlope > config.emaSlope.emaSlopeThreshold * 3
						? '趋势空且增强-R1-5-1'
						: emaSlope > config.emaSlope.emaSlopeThreshold * 2
						? '趋势空且增强-R1-5-2'
						: emaSlope > config.emaSlope.emaSlopeThreshold
						? '趋势空且增强-R1-5-3'
						: emaSlope > config.emaSlope.emaSlopeThreshold / 2
						? ''
						: emaSlope > 0
						? ''
						: emaSlope > -config.emaSlope.emaSlopeThreshold / 2
						? adx >= 25
							? ''
							: ''
						: emaSlope > -config.emaSlope.emaSlopeThreshold
						? ''
						: emaSlope > -config.emaSlope.emaSlopeThreshold * 2
						? ''
						: emaSlope > -config.emaSlope.emaSlopeThreshold * 3
						? ''
						: '';
			}
		}


    #######################################################



    
          ========== 回测结果 ==========
          总交易次数:     40
    盈利次数:       17
    亏损次数:       23
          胜率:          42.50%
          总收益:        148.52 USDT
          盈亏比:        2.56
    rw:        0.0143
    rl:        0.0042
    carry:        62.16
          =============================

tradeNumTotal 40
profitTotal 140.51913598381952
maxLossTotal -7.2
winRateTotal 42.5
period month 1
avgRate 42.50
maxDrawdownTotal 1.6
趋势多且增强 总交易次数: 20 盈利: 162.74168264873404 亏损: -42.0006080678844 最大盈利: 49.36 最大亏损: -7.20 总收益: 120.74 平均盈利: 6.04 typeA: 2.72 胜率: 45.00%
趋势空且增强 总交易次数: 20 盈利: 81.27633206408274 亏损: -53.49827066111112 最大盈利: 25.94 最大亏损: -6.50 总收益: 27.78 平均盈利: 1.39 typeA: 0.56 胜率: 40.00%

###############################################################

*/
