/*


      ========== 回测结果 ==========
      总交易次数:     53
      盈利次数:       34
      亏损次数:       19
      胜率:          64.15%
      总收益:        4278.20 USDT
      期末余额:      5267.40 USDT
      盈亏比:        15.69
      最大单笔盈利:  3372.64
      最大单笔亏损:  -59.92
      手续费:       22.131562218685737
      最大连续盈利:  3870.4544751038693
      最大连续亏损:  -93.14766903153588
      最大连盈次数:  5
      最大连亏次数:  2
      =============================
    
profit: 4267.400359639917
maxDrawdown 7.0%
startTime: 2021-01-01 00:00:00
趋势多且增强-L-1 总交易次数: 7 盈利: 3687.9012466724416 亏损: -59.919029254068306 最大盈利: 3372.64 最大亏损: -59.92 总收益: 3627.98 平均盈利: 518.28 typeA: 444.22 胜率: 85.71%
趋势空且增强-R-3-1 总交易次数: 6 盈利: 116.18782897554846 亏损: 0 最大盈利: 30.97 最大亏损: 5.34 总收益: 116.19 平均盈利: 19.36 typeA: 19.36 胜率: 100.00%
趋势多且增强-L-3-1 总交易次数: 14 盈利: 479.5031792243109 亏损: -115.65235544039751 最大盈利: 381.24 最大亏损: -34.80 总收益: 363.85 平均盈利: 25.99 typeA: 16.71 胜率: 64.29%
趋势空且增强-R-2 总交易次数: 2 盈利: 35.29585753978277 亏损: -7.90199249205876 最大盈利: 35.30 最大亏损: -7.90 总收益: 27.39 平均盈利: 13.70 typeA: 6.85 胜率: 50.00%
趋势空且增强-R-1 总交易次数: 19 盈利: 248.82497317555544 亏损: -81.88308090108558 最大盈利: 75.63 最大亏损: -58.35 总收益: 166.94 平均盈利: 8.79 typeA: 5.09 胜率: 57.89%
趋势多且增强-L-2 总交易次数: 5 盈利: 1.6835276109735844 亏损: -25.83979547108439 最大盈利: 1.68 最大亏损: -17.27 总收益: -24.16 平均盈利: -4.83 typeA: -0.97 胜率: 20.00%
Loaded 3000 15m candles

      ========== 回测结果 ==========
      总交易次数:     54
      盈利次数:       42
      亏损次数:       12
      胜率:          77.78%
      总收益:        747.18 USDT
      期末余额:      1736.18 USDT
      盈亏比:        3.01
      最大单笔盈利:  100.97
      最大单笔亏损:  -145.60
      手续费:       21.810998109033658
      最大连续盈利:  341.44772668720407
      最大连续亏损:  -145.60487759928722
      最大连盈次数:  9
      最大连亏次数:  2
      =============================
    
profit: 736.1754010287373
maxDrawdown 11.3%
startTime: 2021-01-31 00:00:00
趋势多且增强-L-1 总交易次数: 9 盈利: 251.71234479073553 亏损: -21.560086307480987 最大盈利: 94.08 最大亏损: -12.07 总收益: 230.15 平均盈利: 25.57 typeA: 19.89 胜率: 77.78%
趋势多且增强-L-2 总交易次数: 3 盈利: 62.67182670489376 亏损: -3.0177759624221228 最大盈利: 56.00 最大亏损: -3.02 总收益: 59.65 平均盈利: 19.88 typeA: 13.26 胜率: 66.67%
趋势空且增强-R-1 总交易次数: 12 盈利: 195.9963520179442 亏损: -26.84698636666463 最大盈利: 100.97 最大亏损: -16.93 总收益: 169.15 平均盈利: 14.10 typeA: 10.57 胜率: 75.00%
趋势空且增强-R-3-1 总交易次数: 16 盈利: 323.7297749305566 亏损: -145.60487759928722 最大盈利: 59.91 最大亏损: -145.60 总收益: 178.12 平均盈利: 11.13 typeA: 10.44 胜率: 93.75%
趋势多且增强-L-3-1 总交易次数: 13 盈利: 284.15952073776435 亏损: -172.5586555048244 最大盈利: 76.52 最大亏损: -67.55 总收益: 111.60 平均盈利: 8.58 typeA: 5.94 胜率: 69.23%
趋势空且增强-R-2 总交易次数: 1 盈利: 0 亏损: -1.5060364124756318 最大盈利: -1.51 最大亏损: -1.51 总收益: -1.51 平均盈利: -1.51 typeA: 0.00 胜率: 0.00%
Loaded 3000 15m candles

      ========== 回测结果 ==========
      总交易次数:     64
      盈利次数:       41
      亏损次数:       23
      胜率:          64.06%
      总收益:        178.19 USDT
      期末余额:      1165.39 USDT
      盈亏比:        1.95
      最大单笔盈利:  50.61
      最大单笔亏损:  -24.10
      手续费:       25.612558225234242
      最大连续盈利:  145.3270808301762
      最大连续亏损:  -38.24791948763921
      最大连盈次数:  16
      最大连亏次数:  5
      =============================
    
profit: 165.3890860148415
maxDrawdown 7.7%
startTime: 2021-03-02 00:00:00
趋势多且增强-L-1 总交易次数: 13 盈利: 125.39451371175883 亏损: -33.355495007008386 最大盈利: 50.61 最大亏损: -24.10 总收益: 92.04 平均盈利: 7.08 typeA: 4.90 胜率: 69.23%
趋势空且增强-R-1 总交易次数: 16 盈利: 72.65193970401846 亏损: -25.288718423944623 最大盈利: 13.35 最大亏损: -20.46 总收益: 47.36 平均盈利: 2.96 typeA: 2.04 胜率: 68.75%
趋势多且增强-L-3-1 总交易次数: 14 盈利: 86.83630087666538 亏损: -55.47166850096929 最大盈利: 17.50 最大亏损: -14.82 总收益: 31.36 平均盈利: 2.24 typeA: 1.44 胜率: 64.29%
趋势空且增强-R-3-1 总交易次数: 16 盈利: 78.37276587474187 亏损: -68.15586971416629 最大盈利: 12.04 最大亏损: -24.05 总收益: 10.22 平均盈利: 0.64 typeA: 0.40 胜率: 62.50%
趋势空且增强-R-2 总交易次数: 2 盈利: 1.905911569400188 亏损: -2.167948923867669 最大盈利: 1.91 最大亏损: -2.17 总收益: -0.26 平均盈利: -0.13 typeA: -0.07 胜率: 50.00%
趋势多且增强-L-2 总交易次数: 3 盈利: 0.5246139265206801 亏损: -3.057259078304717 最大盈利: 0.52 最大亏损: -2.75 总收益: -2.53 平均盈利: -0.84 typeA: -0.28 胜率: 33.33%
Loaded 3000 15m candles

      ========== 回测结果 ==========
      总交易次数:     48
      盈利次数:       38
      亏损次数:       10
      胜率:          79.17%
      总收益:        1258.66 USDT
      期末余额:      2249.06 USDT
      盈亏比:        6.42
      最大单笔盈利:  460.73
      最大单笔亏损:  -120.25
      手续费:       19.33812328779138
      最大连续盈利:  695.1799062979342
      最大连续亏损:  -120.24676356154006
      最大连盈次数:  9
      最大连亏次数:  2
      =============================
    
profit: 1249.064169302124
maxDrawdown 6.6%
startTime: 2021-04-01 00:00:00
趋势多且增强-L-1 总交易次数: 20 盈利: 985.0957576937773 亏损: -3.9435550429077315 最大盈利: 460.73 最大亏损: -2.02 总收益: 981.15 平均盈利: 49.06 typeA: 44.15 胜率: 90.00%
趋势空且增强-R-1 总交易次数: 7 盈利: 209.525621928868 亏损: -25.39560030811014 最大盈利: 89.68 最大亏损: -15.08 总收益: 184.13 平均盈利: 26.30 typeA: 11.27 胜率: 42.86%
趋势空且增强-R-3-1 总交易次数: 8 盈利: 169.08985401132028 亏损: -67.26917023025189 最大盈利: 71.08 最大亏损: -67.27 总收益: 101.82 平均盈利: 12.73 typeA: 11.14 胜率: 87.50%
趋势多且增强-L-2 总交易次数: 1 盈利: 1.8452443115520483 亏损: 0 最大盈利: 1.85 最大亏损: 1.85 总收益: 1.85 平均盈利: 1.85 typeA: 1.85 胜率: 100.00%
趋势多且增强-L-3-1 总交易次数: 12 盈利: 125.48323298567442 亏损: -135.76721604779866 最大盈利: 51.06 最大亏损: -120.25 总收益: -10.28 平均盈利: -0.86 typeA: -0.64 胜率: 75.00%
Loaded 3000 15m candles

      ========== 回测结果 ==========
      总交易次数:     59
      盈利次数:       49
      亏损次数:       10
      胜率:          83.05%
      总收益:        987.25 USDT
      期末余额:      1975.45 USDT
      盈亏比:        4.84
      最大单笔盈利:  199.97
      最大单笔亏损:  -96.70
      手续费:       23.565771270712766
      最大连续盈利:  380.97571099652885
      最大连续亏损:  -96.70253690052873
      最大连盈次数:  12
      最大连亏次数:  2
      =============================
    
profit: 975.4497330744609
maxDrawdown 7.1%
startTime: 2021-05-01 00:00:00
趋势多且增强-L-1 总交易次数: 12 盈利: 285.58740895242744 亏损: -11.012910494001042 最大盈利: 97.73 最大亏损: -11.01 总收益: 274.57 平均盈利: 22.88 typeA: 20.98 胜率: 91.67%
趋势空且增强-R-3-1 总交易次数: 14 盈利: 366.6800166863248 亏损: -28.55206213027267 最大盈利: 199.97 最大亏损: -14.88 总收益: 338.13 平均盈利: 24.15 typeA: 20.70 胜率: 85.71%
趋势空且增强-R-1 总交易次数: 15 盈利: 357.8443464268047 亏损: -116.57570967718968 最大盈利: 112.56 最大亏损: -96.70 总收益: 241.27 平均盈利: 16.08 typeA: 12.87 胜率: 80.00%
趋势多且增强-L-2 总交易次数: 4 盈利: 51.952513230715226 亏损: -0.6215281831744794 最大盈利: 48.09 最大亏损: -0.62 总收益: 51.33 平均盈利: 12.83 typeA: 9.62 胜率: 75.00%
趋势多且增强-L-3-1 总交易次数: 14 盈利: 182.03751717562477 亏损: -100.08985891279548 最大盈利: 30.10 最大亏损: -59.15 总收益: 81.95 平均盈利: 5.85 typeA: 4.60 胜率: 78.57%
Loaded 3000 15m candles

      ========== 回测结果 ==========
      总交易次数:     50
      盈利次数:       33
      亏损次数:       17
      胜率:          66.00%
      总收益:        456.18 USDT
      期末余额:      1445.98 USDT
      盈亏比:        2.87
      最大单笔盈利:  272.43
      最大单笔亏损:  -47.91
      手续费:       20.153066457282833
      最大连续盈利:  272.4296414757512
      最大连续亏损:  -47.90752533466779
      最大连盈次数:  9
      最大连亏次数:  2
      =============================
    
profit: 445.9823363689309
maxDrawdown 5.5%
startTime: 2021-05-31 00:00:00
趋势空且增强-R-1 总交易次数: 12 盈利: 352.43865718422205 亏损: -49.77615857880929 最大盈利: 272.43 最大亏损: -26.36 总收益: 302.66 平均盈利: 25.22 typeA: 21.02 胜率: 83.33%
趋势多且增强-L-2 总交易次数: 6 盈利: 135.62419769596647 亏损: -7.435136077037373 最大盈利: 131.47 最大亏损: -4.19 总收益: 128.19 平均盈利: 21.36 typeA: 10.68 胜率: 50.00%
趋势空且增强-R-3-1 总交易次数: 11 盈利: 124.92706054987801 亏损: -86.31903807568568 最大盈利: 36.06 最大亏损: -47.91 总收益: 38.61 平均盈利: 3.51 typeA: 2.23 胜率: 63.64%
趋势多且增强-L-1 总交易次数: 6 盈利: 38.25643828610864 亏损: -30.140344867345735 最大盈利: 18.74 最大亏损: -30.10 总收益: 8.12 平均盈利: 1.35 typeA: 0.90 胜率: 66.67%
趋势空且增强-R-2 总交易次数: 7 盈利: 5.3939151031024775 亏损: -2.1927976650763163 最大盈利: 2.53 最大亏损: -1.37 总收益: 3.20 平均盈利: 0.46 typeA: 0.26 胜率: 57.14%
趋势多且增强-L-3-1 总交易次数: 8 盈利: 43.66642299647897 亏损: -68.26088018286912 最大盈利: 17.49 最大亏损: -44.81 总收益: -24.59 平均盈利: -3.07 typeA: -1.92 胜率: 62.50%
Loaded 3000 15m candles

      ========== 回测结果 ==========
      总交易次数:     58
      盈利次数:       44
      亏损次数:       14
      胜率:          75.86%
      总收益:        244.05 USDT
      期末余额:      1232.45 USDT
      盈亏比:        2.10
      最大单笔盈利:  76.85
      最大单笔亏损:  -53.41
      手续费:       23.20623776600648
      最大连续盈利:  100.12082189381005
      最大连续亏损:  -68.52769179603946
      最大连盈次数:  8
      最大连亏次数:  3
      =============================
    
profit: 232.451002322583
maxDrawdown 5.5%
startTime: 2021-06-30 00:00:00
趋势多且增强-L-1 总交易次数: 15 盈利: 164.24242714788534 亏损: -18.749193908712563 最大盈利: 76.85 最大亏损: -12.70 总收益: 145.49 平均盈利: 9.70 typeA: 7.76 胜率: 80.00%
趋势空且增强-R-1 总交易次数: 17 盈利: 172.92744647954052 亏损: -61.5333156545134 最大盈利: 45.02 最大亏损: -30.24 总收益: 111.39 平均盈利: 6.55 typeA: 5.40 胜率: 82.35%
趋势多且增强-L-2 总交易次数: 2 盈利: 7.245263760870628 亏损: -1.801842487357868 最大盈利: 7.25 最大亏损: -1.80 总收益: 5.44 平均盈利: 2.72 typeA: 1.36 胜率: 50.00%
趋势空且增强-R-2 总交易次数: 7 盈利: 17.96457714513535 亏损: -16.45025066074334 最大盈利: 7.24 最大亏损: -11.33 总收益: 1.51 平均盈利: 0.22 typeA: 0.12 胜率: 57.14%
趋势空且增强-R-3-1 总交易次数: 8 盈利: 46.360286330648094 亏损: -53.41209177104054 最大盈利: 17.80 最大亏损: -53.41 总收益: -7.05 平均盈利: -0.88 typeA: -0.77 胜率: 87.50%
趋势多且增强-L-3-1 总交易次数: 9 盈利: 58.14736861148317 亏损: -70.88967267060923 最大盈利: 27.45 最大亏损: -40.39 总收益: -12.74 平均盈利: -1.42 typeA: -0.94 胜率: 66.67%
Loaded 3000 15m candles

      ========== 回测结果 ==========
      总交易次数:     56
      盈利次数:       36
      亏损次数:       20
      胜率:          64.29%
      总收益:        293.41 USDT
      期末余额:      1282.01 USDT
      盈亏比:        1.98
      最大单笔盈利:  149.25
      最大单笔亏损:  -53.04
      手续费:       22.647413331671345
      最大连续盈利:  252.40497955629252
      最大连续亏损:  -90.30940062965462
      最大连盈次数:  7
      最大连亏次数:  3
      =============================
    
profit: 282.0098579619546
maxDrawdown 10.5%
startTime: 2021-07-30 00:00:00
趋势多且增强-L-1 总交易次数: 11 盈利: 218.32466521880522 亏损: -20.405700461622033 最大盈利: 149.25 最大亏损: -16.45 总收益: 197.92 平均盈利: 17.99 typeA: 14.72 胜率: 81.82%
趋势空且增强-R-2 总交易次数: 3 盈利: 11.542043171134864 亏损: 0 最大盈利: 9.98 最大亏损: 0.50 总收益: 11.54 平均盈利: 3.85 typeA: 3.85 胜率: 100.00%
趋势多且增强-L-3-1 总交易次数: 12 盈利: 135.28567098887976 亏损: -69.65892612354921 最大盈利: 34.80 最大亏损: -53.04 总收益: 65.63 平均盈利: 5.47 typeA: 3.65 胜率: 66.67%
趋势空且增强-R-1 总交易次数: 15 盈利: 148.29656110165075 亏损: -121.25229174043386 最大盈利: 79.97 最大亏损: -43.19 总收益: 27.04 平均盈利: 1.80 typeA: 0.96 胜率: 53.33%
趋势多且增强-L-2 总交易次数: 5 盈利: 9.82075643300433 亏损: -8.158673623272412 最大盈利: 9.12 最大亏损: -3.07 总收益: 1.66 平均盈利: 0.33 typeA: 0.13 胜率: 40.00%
趋势空且增强-R-3-1 总交易次数: 10 盈利: 69.90976387168413 亏损: -80.2940108743244 最大盈利: 20.98 最大亏损: -39.18 总收益: -10.38 平均盈利: -1.04 typeA: -0.62 胜率: 60.00%
Loaded 3000 15m candles

      ========== 回测结果 ==========
      总交易次数:     56
      盈利次数:       40
      亏损次数:       16
      胜率:          71.43%
      总收益:        116.72 USDT
      期末余额:      1105.52 USDT
      盈亏比:        1.64
      最大单笔盈利:  30.94
      最大单笔亏损:  -33.26
      手续费:       22.400576732649313
      最大连续盈利:  71.66503472331273
      最大连续亏损:  -54.98188263964312
      最大连盈次数:  11
      最大连亏次数:  3
      =============================
    
profit: 105.51874174453519
maxDrawdown 5.5%
startTime: 2021-08-29 00:00:00
趋势多且增强-L-3-1 总交易次数: 13 盈利: 93.7331852083577 亏损: -34.1867825927508 最大盈利: 20.01 最大亏损: -21.23 总收益: 59.55 平均盈利: 4.58 typeA: 3.88 胜率: 84.62%
趋势空且增强-R-1 总交易次数: 23 盈利: 106.45685911589439 亏损: -37.610982759302075 最大盈利: 30.94 最大亏损: -32.53 总收益: 68.85 平均盈利: 2.99 typeA: 2.47 胜率: 82.61%
趋势多且增强-L-1 总交易次数: 13 盈利: 82.45746714307937 亏损: -80.73899877425765 最大盈利: 30.36 最大亏损: -33.26 总收益: 1.72 平均盈利: 0.13 typeA: 0.07 胜率: 53.85%
趋势多且增强-L-2 总交易次数: 2 盈利: 0.6067131964336375 亏损: -2.083173617077572 最大盈利: 0.61 最大亏损: -2.08 总收益: -1.48 平均盈利: -0.74 typeA: -0.37 胜率: 50.00%
趋势空且增强-R-3-1 总交易次数: 5 盈利: 16.370899115571774 亏损: -28.286444291410888 最大盈利: 11.10 最大亏损: -11.16 总收益: -11.92 平均盈利: -2.38 typeA: -0.95 胜率: 40.00%
Loaded 3000 15m candles

      ========== 回测结果 ==========
      总交易次数:     64
      盈利次数:       40
      亏损次数:       24
      胜率:          62.50%
      总收益:        95.01 USDT
      期末余额:      1082.01 USDT
      盈亏比:        1.29
      最大单笔盈利:  72.39
      最大单笔亏损:  -51.65
      手续费:       25.83646238060429
      最大连续盈利:  76.41982695140322
      最大连续亏损:  -70.95031308129361
      最大连盈次数:  8
      最大连亏次数:  4
      =============================
    
profit: 82.01071560313653
maxDrawdown 14.5%
startTime: 2021-09-28 00:00:00
趋势多且增强-L-2 总交易次数: 3 盈利: 21.384359492449484 亏损: -1.3862955455580066 最大盈利: 21.18 最大亏损: -1.39 总收益: 20.00 平均盈利: 6.67 typeA: 4.44 胜率: 66.67%
趋势多且增强-L-3-1 总交易次数: 18 盈利: 142.1656314064681 亏损: -67.72432676134915 最大盈利: 22.41 最大亏损: -25.72 总收益: 74.44 平均盈利: 4.14 typeA: 3.22 胜率: 77.78%
趋势空且增强-R-1 总交易次数: 14 盈利: 113.98565617083412 亏损: -70.9287183320017 最大盈利: 72.39 最大亏损: -24.45 总收益: 43.06 平均盈利: 3.08 typeA: 1.76 胜率: 57.14%
趋势多且增强-L-1 总交易次数: 17 盈利: 91.27189823700733 亏损: -48.26074223443914 最大盈利: 33.35 最大亏损: -20.50 总收益: 43.01 平均盈利: 2.53 typeA: 1.64 胜率: 64.71%
趋势空且增强-R-2 总交易次数: 2 盈利: 0 亏损: -26.066949286406764 最大盈利: -0.69 最大亏损: -25.38 总收益: -26.07 平均盈利: -13.03 typeA: 0.00 胜率: 0.00%
趋势空且增强-R-3-1 总交易次数: 10 盈利: 51.68138595977394 亏损: -111.11118350363878 最大盈利: 17.32 最大亏损: -51.65 总收益: -59.43 平均盈利: -5.94 typeA: -2.97 胜率: 50.00%
Loaded 3000 15m candles

      ========== 回测结果 ==========
      总交易次数:     69
      盈利次数:       50
      亏损次数:       19
      胜率:          72.46%
      总收益:        219.28 USDT
      期末余额:      1205.48 USDT
      盈亏比:        1.98
      最大单笔盈利:  66.78
      最大单笔亏损:  -40.49
      手续费:       27.53783746036998
      最大连续盈利:  126.06743886767566
      最大连续亏损:  -44.52109181203687
      最大连盈次数:  9
      最大连亏次数:  3
      =============================
    
profit: 205.47560407378342
maxDrawdown 7.3%
startTime: 2021-10-28 00:00:00
趋势空且增强-R-2 总交易次数: 3 盈利: 38.09856557993429 亏损: 0 最大盈利: 19.38 最大亏损: 4.20 总收益: 38.10 平均盈利: 12.70 typeA: 12.70 胜率: 100.00%
趋势多且增强-L-2 总交易次数: 1 盈利: 6.918193301435515 亏损: 0 最大盈利: 6.92 最大亏损: 6.92 总收益: 6.92 平均盈利: 6.92 typeA: 6.92 胜率: 100.00%
趋势空且增强-R-3-1 总交易次数: 21 盈利: 163.40719436845924 亏损: -23.005486609608262 最大盈利: 17.32 最大亏损: -16.71 总收益: 140.40 平均盈利: 6.69 typeA: 5.73 胜率: 85.71%
趋势空且增强-R-1 总交易次数: 20 盈利: 132.44059481470035 亏损: -47.773415697450105 最大盈利: 66.78 最大亏损: -19.40 总收益: 84.67 平均盈利: 4.23 typeA: 2.75 胜率: 65.00%
趋势多且增强-L-3-1 总交易次数: 9 盈利: 69.40324095514896 亏损: -69.00142352163968 最大盈利: 37.41 最大亏损: -40.49 总收益: 0.40 平均盈利: 0.04 typeA: 0.03 胜率: 66.67%
趋势多且增强-L-1 总交易次数: 15 盈利: 33.81690746095935 亏损: -85.02876657815291 最大盈利: 12.48 最大亏损: -24.67 总收益: -51.21 平均盈利: -3.41 typeA: -2.05 胜率: 60.00%
Loaded 3000 15m candles

      ========== 回测结果 ==========
      总交易次数:     58
      盈利次数:       38
      亏损次数:       20
      胜率:          65.52%
      总收益:        81.76 USDT
      期末余额:      1069.96 USDT
      盈亏比:        1.29
      最大单笔盈利:  53.11
      最大单笔亏损:  -63.64
      手续费:       23.412879935196536
      最大连续盈利:  105.64274552565166
      最大连续亏损:  -63.63558460421199
      最大连盈次数:  7
      最大连亏次数:  3
      =============================
    
profit: 69.95839493254016
maxDrawdown 10.8%
startTime: 2021-11-27 00:00:00
趋势多且增强-L-2 总交易次数: 3 盈利: 37.76607105062986 亏损: 0 最大盈利: 25.40 最大亏损: 1.90 总收益: 37.77 平均盈利: 12.59 typeA: 12.59 胜率: 100.00%
趋势空且增强-R-2 总交易次数: 4 盈利: 61.54594998768164 亏损: -3.130531195505237 最大盈利: 53.11 最大亏损: -3.08 总收益: 58.42 平均盈利: 14.60 typeA: 7.30 胜率: 50.00%
趋势空且增强-R-3-1 总交易次数: 9 盈利: 63.00506821537109 亏损: -9.74289371109432 最大盈利: 16.67 最大亏损: -9.74 总收益: 53.26 平均盈利: 5.92 typeA: 5.26 胜率: 88.89%
趋势多且增强-L-1 总交易次数: 15 盈利: 103.81864556196363 亏损: -53.55163651919407 最大盈利: 28.78 最大亏损: -31.78 总收益: 50.27 平均盈利: 3.35 typeA: 2.01 胜率: 60.00%
趋势多且增强-L-3-1 总交易次数: 12 盈利: 41.58790784113951 亏损: -56.751289604364665 最大盈利: 11.26 最大亏损: -19.74 总收益: -15.16 平均盈利: -1.26 typeA: -0.74 胜率: 58.33%
趋势空且增强-R-1 总交易次数: 15 盈利: 60.78317817365232 亏损: -163.5720748677368 最大盈利: 19.43 最大亏损: -63.64 总收益: -102.79 平均盈利: -6.85 typeA: -4.11 胜率: 60.00%
Loaded 3000 15m candles

      ========== 回测结果 ==========
      总交易次数:     52
      盈利次数:       35
      亏损次数:       17
      胜率:          67.31%
      总收益:        228.73 USDT
      期末余额:      1218.33 USDT
      盈亏比:        2.60
      最大单笔盈利:  77.94
      最大单笔亏损:  -37.54
      手续费:       20.790542124453694
      最大连续盈利:  119.94582635704481
      最大连续亏损:  -37.54366654637311
      最大连盈次数:  8
      最大连亏次数:  4
      =============================
    
profit: 218.33065460398916
maxDrawdown 3.1%
startTime: 2021-12-27 00:00:00
趋势多且增强-L-1 总交易次数: 5 盈利: 82.2137273652488 亏损: -5.012364835077437 最大盈利: 77.94 最大亏损: -3.88 总收益: 77.20 平均盈利: 15.44 typeA: 9.26 胜率: 60.00%
趋势空且增强-R-2 总交易次数: 2 盈利: 10.683555073468007 亏损: 0 最大盈利: 10.32 最大亏损: 0.36 总收益: 10.68 平均盈利: 5.34 typeA: 5.34 胜率: 100.00%
趋势空且增强-R-1 总交易次数: 19 盈利: 168.88336358441387 亏损: -31.55685236370435 最大盈利: 33.71 最大亏损: -14.78 总收益: 137.33 平均盈利: 7.23 typeA: 4.95 胜率: 68.42%
趋势多且增强-L-3-1 总交易次数: 14 盈利: 88.98710376819051 亏损: -39.47421492180729 最大盈利: 25.92 最大亏损: -15.62 总收益: 49.51 平均盈利: 3.54 typeA: 2.27 胜率: 64.29%
趋势空且增强-R-3-1 总交易次数: 8 盈利: 17.85031102361046 亏损: -28.426449030407518 最大盈利: 5.56 最大亏损: -22.17 总收益: -10.58 平均盈利: -1.32 typeA: -0.99 胜率: 75.00%
趋势多且增强-L-2 总交易次数: 4 盈利: 3.029186279341298 亏损: -38.446711339285116 最大盈利: 2.54 最大亏损: -37.54 总收益: -35.42 平均盈利: -8.85 typeA: -4.43 胜率: 50.00%
Loaded 3000 15m candles

      ========== 回测结果 ==========
      总交易次数:     53
      盈利次数:       39
      亏损次数:       14
      胜率:          73.58%
      总收益:        -70.00 USDT
      期末余额:      919.40 USDT
      盈亏比:        0.79
      最大单笔盈利:  49.85
      最大单笔亏损:  -104.37
      手续费:       21.190406088329517
      最大连续盈利:  87.64933791480091
      最大连续亏损:  -132.60352929527895
      最大连盈次数:  11
      最大连亏次数:  3
      =============================
    
profit: -80.60164779953311
maxDrawdown 16.3%
startTime: 2022-01-26 00:00:00
趋势多且增强-L-2 总交易次数: 7 盈利: 16.970760248898696 亏损: -3.370541798798989 最大盈利: 8.63 最大亏损: -3.37 总收益: 13.60 平均盈利: 1.94 typeA: 1.67 胜率: 85.71%
趋势空且增强-R-2 总交易次数: 4 盈利: 23.45582697378101 亏损: -20.51063527180775 最大盈利: 21.21 最大亏损: -20.51 总收益: 2.95 平均盈利: 0.74 typeA: 0.55 胜率: 75.00%
趋势空且增强-R-3-1 总交易次数: 8 盈利: 31.847896693569655 亏损: -34.72320886605083 最大盈利: 9.12 最大亏损: -24.94 总收益: -2.88 平均盈利: -0.36 typeA: -0.27 胜率: 75.00%
趋势空且增强-R-1 总交易次数: 15 盈利: 111.25332035381973 亏损: -122.44518573108681 最大盈利: 49.85 最大亏损: -104.37 总收益: -11.19 平均盈利: -0.75 typeA: -0.55 胜率: 73.33%
趋势多且增强-L-1 总交易次数: 13 盈利: 49.73044959717961 亏损: -87.73925009789387 最大盈利: 15.68 最大亏损: -32.67 总收益: -38.01 平均盈利: -2.92 typeA: -2.02 胜率: 69.23%
趋势多且增强-L-3-1 总交易次数: 6 盈利: 22.879403208234425 亏损: -57.35048310937559 最大盈利: 7.87 最大亏损: -36.25 总收益: -34.47 平均盈利: -5.75 typeA: -3.83 胜率: 66.67%
Loaded 3000 15m candles

      ========== 回测结果 ==========
      总交易次数:     62
      盈利次数:       42
      亏损次数:       20
      胜率:          67.74%
      总收益:        100.40 USDT
      期末余额:      1088.00 USDT
      盈亏比:        1.59
      最大单笔盈利:  49.31
      最大单笔亏损:  -34.01
      手续费:       24.79464487643922
      最大连续盈利:  72.42992924135203
      最大连续亏损:  -58.67186303287295
      最大连盈次数:  7
      最大连亏次数:  5
      =============================
    
profit: 88.00040040346289
maxDrawdown 5.8%
startTime: 2022-02-25 00:00:00
趋势空且增强-R-2 总交易次数: 3 盈利: 17.306310080547036 亏损: -1.3331570996979702 最大盈利: 15.21 最大亏损: -1.33 总收益: 15.97 平均盈利: 5.32 typeA: 3.55 胜率: 66.67%
趋势多且增强-L-2 总交易次数: 9 盈利: 65.44590195423513 亏损: -18.65858099211932 最大盈利: 49.31 最大亏损: -9.98 总收益: 46.79 平均盈利: 5.20 typeA: 3.47 胜率: 66.67%
趋势空且增强-R-3-1 总交易次数: 11 盈利: 44.09315744712343 亏损: -16.279396989993558 最大盈利: 9.20 最大亏损: -9.02 总收益: 27.81 平均盈利: 2.53 typeA: 1.84 胜率: 72.73%
趋势空且增强-R-1 总交易次数: 19 盈利: 47.808309692308754 亏损: -28.395934522159582 最大盈利: 14.11 最大亏损: -15.86 总收益: 19.41 平均盈利: 1.02 typeA: 0.70 胜率: 68.42%
趋势多且增强-L-1 总交易次数: 10 盈利: 51.156934797968674 亏损: -41.580544102253214 最大盈利: 13.35 最大亏损: -21.03 总收益: 9.58 平均盈利: 0.96 typeA: 0.67 胜率: 70.00%
趋势多且增强-L-3-1 总交易次数: 10 盈利: 45.89262223926078 亏损: -65.05522210175522 最大盈利: 12.97 最大亏损: -34.01 总收益: -19.16 平均盈利: -1.92 typeA: -1.15 胜率: 60.00%
Loaded 3000 15m candles

      ========== 回测结果 ==========
      总交易次数:     61
      盈利次数:       39
      亏损次数:       22
      胜率:          63.93%
      总收益:        29.27 USDT
      期末余额:      1017.07 USDT
      盈亏比:        1.08
      最大单笔盈利:  50.87
      最大单笔亏损:  -61.46
      手续费:       24.428830226732483
      最大连续盈利:  140.6334622056824
      最大连续亏损:  -132.30348510634317
      最大连盈次数:  7
      最大连亏次数:  4
      =============================
    
profit: 17.073798955831194
maxDrawdown 18.1%
startTime: 2022-03-27 00:00:00
趋势多且增强-L-1 总交易次数: 17 盈利: 155.88183680436993 亏损: -98.01902374619645 最大盈利: 32.47 最大亏损: -57.42 总收益: 57.86 平均盈利: 3.40 typeA: 2.60 胜率: 76.47%
趋势多且增强-L-2 总交易次数: 6 盈利: 18.127636718082794 亏损: -5.550129538540245 最大盈利: 7.95 最大亏损: -4.28 总收益: 12.58 平均盈利: 2.10 typeA: 1.40 胜率: 66.67%
趋势多且增强-L-3-1 总交易次数: 5 盈利: 55.20742773307305 亏损: -38.43943192450459 最大盈利: 49.58 最大亏损: -18.28 总收益: 16.77 平均盈利: 3.35 typeA: 1.34 胜率: 40.00%
趋势空且增强-R-2 总交易次数: 3 盈利: 0 亏损: -6.66873849976177 最大盈利: -0.91 最大亏损: -4.27 总收益: -6.67 平均盈利: -2.22 typeA: 0.00 胜率: 0.00%
趋势空且增强-R-1 总交易次数: 18 盈利: 123.71281624976835 亏损: -149.78791326692152 最大盈利: 50.87 最大亏损: -61.46 总收益: -26.08 平均盈利: -1.45 typeA: -0.97 胜率: 66.67%
趋势空且增强-R-3-1 总交易次数: 12 盈利: 50.70256984676038 亏损: -75.89325142029529 最大盈利: 12.07 最大亏损: -30.74 总收益: -25.19 平均盈利: -2.10 typeA: -1.40 胜率: 66.67%
Loaded 3000 15m candles

      ========== 回测结果 ==========
      总交易次数:     62
      盈利次数:       48
      亏损次数:       14
      胜率:          77.42%
      总收益:        232.15 USDT
      期末余额:      1219.75 USDT
      盈亏比:        2.13
      最大单笔盈利:  102.85
      最大单笔亏损:  -54.95
      手续费:       24.768611923040925
      最大连续盈利:  186.87702171834627
      最大连续亏损:  -54.94729267429522
      最大连盈次数:  12
      最大连亏次数:  3
      =============================
    
profit: 219.74759695863213
maxDrawdown 4.6%
startTime: 2022-04-26 00:00:00
趋势空且增强-R-1 总交易次数: 24 盈利: 253.77293707200397 亏损: -66.99244312750496 最大盈利: 102.85 最大亏损: -32.13 总收益: 186.78 平均盈利: 7.78 typeA: 6.49 胜率: 83.33%
趋势多且增强-L-1 总交易次数: 7 盈利: 46.48154635057713 亏损: -6.248729512704969 最大盈利: 19.89 最大亏损: -6.25 总收益: 40.23 平均盈利: 5.75 typeA: 4.93 胜率: 85.71%
趋势空且增强-R-2 总交易次数: 2 盈利: 15.376498348277508 亏损: -0.08061589878257194 最大盈利: 15.38 最大亏损: -0.08 总收益: 15.30 平均盈利: 7.65 typeA: 3.82 胜率: 50.00%
趋势多且增强-L-2 总交易次数: 5 盈利: 4.747691548446156 亏损: -1.6923448717038576 最大盈利: 1.75 最大亏损: -1.69 总收益: 3.06 平均盈利: 0.61 typeA: 0.49 胜率: 80.00%
趋势多且增强-L-3-1 总交易次数: 11 盈利: 58.21230470295849 亏损: -62.32131375676031 最大盈利: 19.94 最大亏损: -25.88 总收益: -4.11 平均盈利: -0.37 typeA: -0.24 胜率: 63.64%
趋势空且增强-R-3-1 总交易次数: 13 盈利: 58.71144866276762 亏损: -67.81938255893954 最大盈利: 16.78 最大亏损: -54.95 总收益: -9.11 平均盈利: -0.70 typeA: -0.54 胜率: 76.92%
Loaded 3000 15m candles

      ========== 回测结果 ==========
      总交易次数:     63
      盈利次数:       43
      亏损次数:       20
      胜率:          68.25%
      总收益:        70.10 USDT
      期末余额:      1057.50 USDT
      盈亏比:        1.24
      最大单笔盈利:  47.35
      最大单笔亏损:  -55.08
      手续费:       25.18148928402251
      最大连续盈利:  148.20719973000502
      最大连续亏损:  -80.19250662606044
      最大连盈次数:  10
      最大连亏次数:  3
      =============================
    
profit: 57.50366541491576
maxDrawdown 12.3%
startTime: 2022-05-26 00:00:00
趋势空且增强-R-3-1 总交易次数: 10 盈利: 103.14626669117322 亏损: -12.887526427061406 最大盈利: 47.19 最大亏损: -12.89 总收益: 90.26 平均盈利: 9.03 typeA: 8.12 胜率: 90.00%
趋势多且增强-L-2 总交易次数: 2 盈利: 15.904816140579204 亏损: -1.401863260706187 最大盈利: 15.90 最大亏损: -1.40 总收益: 14.50 平均盈利: 7.25 typeA: 3.63 胜率: 50.00%
趋势多且增强-L-1 总交易次数: 16 盈利: 116.77841793123231 亏损: -94.00653672549313 最大盈利: 47.35 最大亏损: -55.08 总收益: 22.77 平均盈利: 1.42 typeA: 1.16 胜率: 81.25%
趋势空且增强-R-1 总交易次数: 17 盈利: 69.23653995978509 亏损: -51.887350542793506 最大盈利: 42.14 最大亏损: -12.09 总收益: 17.35 平均盈利: 1.02 typeA: 0.54 胜率: 52.94%
趋势多且增强-L-3-1 总交易次数: 14 盈利: 55.76901842558253 亏损: -104.37707826288623 最大盈利: 9.94 最大亏损: -35.91 总收益: -48.61 平均盈利: -3.47 typeA: -2.23 胜率: 64.29%
趋势空且增强-R-2 总交易次数: 4 盈利: 6.278463920924349 亏损: -32.44950243541812 最大盈利: 5.25 最大亏损: -25.11 总收益: -26.17 平均盈利: -6.54 typeA: -3.27 胜率: 50.00%
Loaded 3000 15m candles

      ========== 回测结果 ==========
      总交易次数:     66
      盈利次数:       45
      亏损次数:       21
      胜率:          68.18%
      总收益:        -19.93 USDT
      期末余额:      966.87 USDT
      盈亏比:        0.95
      最大单笔盈利:  45.12
      最大单笔亏损:  -78.44
      手续费:       26.401514903408994
      最大连续盈利:  113.04062916473426
      最大连续亏损:  -78.43730664240216
      最大连盈次数:  11
      最大连亏次数:  3
      =============================
    
profit: -33.13106751468047
maxDrawdown 12.5%
startTime: 2022-06-25 00:00:00
趋势空且增强-R-2 总交易次数: 1 盈利: 12.17835659807166 亏损: 0 最大盈利: 12.18 最大亏损: 12.18 总收益: 12.18 平均盈利: 12.18 typeA: 12.18 胜率: 100.00%
趋势多且增强-L-3-1 总交易次数: 12 盈利: 88.38687568870287 亏损: -15.190612947972397 最大盈利: 24.18 最大亏损: -10.89 总收益: 73.20 平均盈利: 6.10 typeA: 4.57 胜率: 75.00%
趋势空且增强-R-1 总交易次数: 23 盈利: 135.62204708028463 亏损: -143.70557431087852 最大盈利: 45.12 最大亏损: -27.62 总收益: -8.08 平均盈利: -0.35 typeA: -0.21 胜率: 60.87%
趋势空且增强-R-3-1 总交易次数: 9 盈利: 48.16748530183239 亏损: -66.0157799044378 最大盈利: 9.83 最大亏损: -47.26 总收益: -17.85 平均盈利: -1.98 typeA: -1.54 胜率: 77.78%
趋势多且增强-L-2 总交易次数: 4 盈利: 5.1889504416828744 亏损: -36.638724722013905 最大盈利: 5.19 最大亏损: -24.69 总收益: -31.45 平均盈利: -7.86 typeA: -1.97 胜率: 25.00%
趋势多且增强-L-1 总交易次数: 17 盈利: 84.6636065694983 亏损: -132.587697309448 最大盈利: 25.28 最大亏损: -78.44 总收益: -47.92 平均盈利: -2.82 typeA: -2.16 胜率: 76.47%
Loaded 3000 15m candles

      ========== 回测结果 ==========
      总交易次数:     57
      盈利次数:       43
      亏损次数:       14
      胜率:          75.44%
      总收益:        163.89 USDT
      期末余额:      1152.49 USDT
      盈亏比:        2.06
      最大单笔盈利:  38.12
      最大单笔亏损:  -25.42
      手续费:       22.79648401919473
      最大连续盈利:  47.33314008379728
      最大连续亏损:  -25.41750741839773
      最大连盈次数:  7
      最大连亏次数:  2
      =============================
    
profit: 152.4884574544492
maxDrawdown 3.1%
startTime: 2022-07-25 00:00:00
趋势多且增强-L-1 总交易次数: 12 盈利: 98.04385696225077 亏损: -21.498824180384563 最大盈利: 38.12 最大亏损: -21.50 总收益: 76.55 平均盈利: 6.38 typeA: 5.85 胜率: 91.67%
趋势空且增强-R-2 总交易次数: 6 盈利: 17.170047874326567 亏损: -0.03752436647179788 最大盈利: 6.98 最大亏损: -0.04 总收益: 17.13 平均盈利: 2.86 typeA: 2.38 胜率: 83.33%
趋势空且增强-R-1 总交易次数: 17 盈利: 91.24927290758545 亏损: -38.59006797229571 最大盈利: 26.33 最大亏损: -11.88 总收益: 52.66 平均盈利: 3.10 typeA: 2.19 胜率: 70.59%
趋势空且增强-R-3-1 总交易次数: 8 盈利: 42.74054492197858 亏损: -22.2805641306315 最大盈利: 13.35 最大亏损: -13.65 总收益: 20.46 平均盈利: 2.56 typeA: 1.92 胜率: 75.00%
趋势多且增强-L-2 总交易次数: 5 盈利: 14.270484904151967 亏损: -2.986523657530675 最大盈利: 11.39 最大亏损: -2.93 总收益: 11.28 平均盈利: 2.26 typeA: 1.35 胜率: 60.00%
趋势多且增强-L-3-1 总交易次数: 9 盈利: 55.30802931833944 亏损: -69.50027512686617 最大盈利: 26.05 最大亏损: -25.42 总收益: -14.19 平均盈利: -1.58 typeA: -1.05 胜率: 66.67%
Loaded 3000 15m candles

      ========== 回测结果 ==========
      总交易次数:     65
      盈利次数:       44
      亏损次数:       21
      胜率:          67.69%
      总收益:        49.27 USDT
      期末余额:      1036.27 USDT
      盈亏比:        1.20
      最大单笔盈利:  59.93
      最大单笔亏损:  -32.89
      手续费:       25.985590166689427
      最大连续盈利:  101.22269712285254
      最大连续亏损:  -42.64097081890941
      最大连盈次数:  12
      最大连亏次数:  3
      =============================
    
profit: 36.27094048991603
maxDrawdown 12.4%
startTime: 2022-08-24 00:00:00
趋势空且增强-R-2 总交易次数: 6 盈利: 69.87715688135852 亏损: -9.73208493562951 最大盈利: 59.93 最大亏损: -9.73 总收益: 60.15 平均盈利: 10.02 typeA: 8.35 胜率: 83.33%
趋势空且增强-R-3-1 总交易次数: 14 盈利: 85.71908349926018 亏损: -62.60843588736422 最大盈利: 41.66 最大亏损: -30.22 总收益: 23.11 平均盈利: 1.65 typeA: 1.18 胜率: 71.43%
趋势多且增强-L-3-1 总交易次数: 9 盈利: 40.600880908575235 亏损: -32.83405737045311 最大盈利: 13.24 最大亏损: -15.87 总收益: 7.77 平均盈利: 0.86 typeA: 0.58 胜率: 66.67%
趋势多且增强-L-1 总交易次数: 16 盈利: 44.651937723997165 亏损: -51.63148628614875 最大盈利: 12.46 最大亏损: -16.99 总收益: -6.98 平均盈利: -0.44 typeA: -0.30 胜率: 68.75%
趋势空且增强-R-1 总交易次数: 16 盈利: 57.219419723067396 亏损: -80.50886010629519 最大盈利: 32.63 最大亏损: -32.89 总收益: -23.29 平均盈利: -1.46 typeA: -0.91 胜率: 62.50%
趋势多且增强-L-2 总交易次数: 4 盈利: 3.7970922292237113 亏损: -15.279705889672458 最大盈利: 3.49 最大亏损: -14.26 总收益: -11.48 平均盈利: -2.87 typeA: -1.44 胜率: 50.00%
Loaded 3000 15m candles

      ========== 回测结果 ==========
      总交易次数:     70
      盈利次数:       43
      亏损次数:       27
      胜率:          61.43%
      总收益:        -31.56 USDT
      期末余额:      954.44 USDT
      盈亏比:        0.86
      最大单笔盈利:  24.02
      最大单笔亏损:  -43.87
      手续费:       28.03093088504288
      最大连续盈利:  40.087677999789385
      最大连续亏损:  -44.23560267363036
      最大连盈次数:  5
      最大连亏次数:  3
      =============================
    
profit: -45.56207986447339
maxDrawdown 9.8%
startTime: 2022-09-23 00:00:00
趋势多且增强-L-2 总交易次数: 4 盈利: 27.627819423897268 亏损: -8.628542722161631 最大盈利: 24.02 最大亏损: -8.26 总收益: 19.00 平均盈利: 4.75 typeA: 2.37 胜率: 50.00%
趋势多且增强-L-1 总交易次数: 16 盈利: 46.95015926940203 亏损: -16.185348973373408 最大盈利: 12.67 最大亏损: -12.66 总收益: 30.76 平均盈利: 1.92 typeA: 1.56 胜率: 81.25%
趋势多且增强-L-3-1 总交易次数: 15 盈利: 70.04045655371314 亏损: -58.25661776154842 最大盈利: 20.02 最大亏损: -26.21 总收益: 11.78 平均盈利: 0.79 typeA: 0.47 胜率: 60.00%
趋势空且增强-R-1 总交易次数: 22 盈利: 39.71752595405856 亏损: -41.40858739794185 最大盈利: 7.41 最大亏损: -15.30 总收益: -1.69 平均盈利: -0.08 typeA: -0.05 胜率: 68.18%
趋势空且增强-R-3-1 总交易次数: 6 盈利: 4.832733354883136 亏损: -28.852573103147947 最大盈利: 3.34 最大亏损: -9.66 总收益: -24.02 平均盈利: -4.00 typeA: -1.33 胜率: 33.33%
趋势空且增强-R-2 总交易次数: 7 盈利: 6.156036258780406 亏损: -73.55514072103163 最大盈利: 5.25 最大亏损: -43.87 总收益: -67.40 平均盈利: -9.63 typeA: -2.75 胜率: 28.57%
Loaded 3000 15m candles

      ========== 回测结果 ==========
      总交易次数:     60
      盈利次数:       46
      亏损次数:       14
      胜率:          76.67%
      总收益:        572.56 USDT
      期末余额:      1560.56 USDT
      盈亏比:        2.88
      最大单笔盈利:  160.75
      最大单笔亏损:  -93.81
      手续费:       23.98699582741432
      最大连续盈利:  385.3155569363739
      最大连续亏损:  -93.81183361224006
      最大连盈次数:  14
      最大连亏次数:  3
      =============================
    
profit: 560.559913431325
maxDrawdown 7.2%
startTime: 2022-10-23 00:00:00
趋势多且增强-L-2 总交易次数: 4 盈利: 173.9387420875884 亏损: -16.146303372653307 最大盈利: 90.18 最大亏损: -16.15 总收益: 157.79 平均盈利: 39.45 typeA: 29.59 胜率: 75.00%
趋势空且增强-R-1 总交易次数: 19 盈利: 357.49200298693404 亏损: -29.915441411961538 最大盈利: 160.75 最大亏损: -28.07 总收益: 327.58 平均盈利: 17.24 typeA: 15.43 胜率: 89.47%
趋势多且增强-L-3-1 总交易次数: 10 盈利: 166.90106738998898 亏损: -66.63653900854584 最大盈利: 55.35 最大亏损: -57.37 总收益: 100.26 平均盈利: 10.03 typeA: 8.02 胜率: 80.00%
趋势空且增强-R-2 总交易次数: 3 盈利: 9.258156028368774 亏损: -3.68461604273294 最大盈利: 9.26 最大亏损: -3.65 总收益: 5.57 平均盈利: 1.86 typeA: 0.62 胜率: 33.33%
趋势多且增强-L-1 总交易次数: 14 盈利: 80.11298137880812 亏损: -84.05887791459568 最大盈利: 19.53 最大亏损: -31.64 总收益: -3.95 平均盈利: -0.28 typeA: -0.18 胜率: 64.29%
趋势空且增强-R-3-1 总交易次数: 10 盈利: 89.47972298827978 亏损: -104.18098167815113 最大盈利: 49.18 最大亏损: -93.81 总收益: -14.70 平均盈利: -1.47 typeA: -1.18 胜率: 80.00%
Loaded 3000 15m candles

      ========== 回测结果 ==========
      总交易次数:     54
      盈利次数:       35
      亏损次数:       19
      胜率:          64.81%
      总收益:        39.55 USDT
      期末余额:      1028.75 USDT
      盈亏比:        1.12
      最大单笔盈利:  71.42
      最大单笔亏损:  -60.50
      手续费:       21.593322306593805
      最大连续盈利:  76.28223146728223
      最大连续亏损:  -124.05408004531103
      最大连盈次数:  7
      最大连亏次数:  3
      =============================
    
profit: 28.75494138076033
maxDrawdown 13.2%
startTime: 2022-11-22 00:00:00
趋势多且增强-L-3-1 总交易次数: 6 盈利: 34.281459399117594 亏损: -1.7357910906298708 最大盈利: 12.76 最大亏损: -1.74 总收益: 32.55 平均盈利: 5.42 typeA: 4.52 胜率: 83.33%
趋势空且增强-R-3-1 总交易次数: 9 盈利: 64.53336088064889 亏损: -31.60381042632321 最大盈利: 20.00 最大亏损: -29.96 总收益: 32.93 平均盈利: 3.66 typeA: 2.85 胜率: 77.78%
趋势空且增强-R-2 总交易次数: 3 盈利: 7.592147086319733 亏损: -0.42929901848891816 最大盈利: 7.59 最大亏损: -0.33 总收益: 7.16 平均盈利: 2.39 typeA: 0.80 胜率: 33.33%
趋势空且增强-R-1 总交易次数: 17 盈利: 161.67260417350613 亏损: -165.68826366347804 最大盈利: 71.42 最大亏损: -48.85 总收益: -4.02 平均盈利: -0.24 typeA: -0.14 胜率: 58.82%
趋势多且增强-L-1 总交易次数: 13 盈利: 91.97524756594215 亏损: -105.87073566056229 最大盈利: 40.36 最大亏损: -60.50 总收益: -13.90 平均盈利: -1.07 typeA: -0.74 胜率: 69.23%
趋势多且增强-L-2 总交易次数: 6 盈利: 15.003328413629752 亏损: -30.17530627891955 最大盈利: 11.44 最大亏损: -17.88 总收益: -15.17 平均盈利: -2.53 typeA: -1.26 胜率: 50.00%
Loaded 3000 15m candles

      ========== 回测结果 ==========
      总交易次数:     52
      盈利次数:       31
      亏损次数:       21
      胜率:          59.62%
      总收益:        113.86 USDT
      期末余额:      1103.46 USDT
      盈亏比:        1.73
      最大单笔盈利:  42.69
      最大单笔亏损:  -26.67
      手续费:       20.824946464987008
      最大连续盈利:  75.34302700569549
      最大连续亏损:  -34.71832253267952
      最大连盈次数:  10
      最大连亏次数:  3
      =============================
    
profit: 103.45913564840976
maxDrawdown 7.6%
startTime: 2022-12-22 00:00:00
趋势多且增强-L-2 总交易次数: 4 盈利: 47.35559934563906 亏损: -10.892631546273712 最大盈利: 42.69 最大亏损: -8.28 总收益: 36.46 平均盈利: 9.12 typeA: 4.56 胜率: 50.00%
趋势多且增强-L-3-1 总交易次数: 9 盈利: 49.483858925960085 亏损: -11.161002349255986 最大盈利: 14.74 最大亏损: -11.16 总收益: 38.32 平均盈利: 4.26 typeA: 3.79 胜率: 88.89%
趋势多且增强-L-1 总交易次数: 18 盈利: 90.35987116793962 亏损: -46.86239366044959 最大盈利: 29.82 最大亏损: -10.75 总收益: 43.50 平均盈利: 2.42 typeA: 1.61 胜率: 66.67%
趋势空且增强-R-3-1 总交易次数: 4 盈利: 17.296039553100883 亏损: -9.043718531253818 最大盈利: 9.27 最大亏损: -9.04 总收益: 8.25 平均盈利: 2.06 typeA: 1.55 胜率: 75.00%
趋势空且增强-R-2 总交易次数: 5 盈利: 15.391582229150513 亏损: -20.13646745257345 最大盈利: 15.39 最大亏损: -15.18 总收益: -4.74 平均盈利: -0.95 typeA: -0.19 胜率: 20.00%
趋势空且增强-R-1 总交易次数: 12 盈利: 49.84899189455141 亏损: -57.78059392812254 最大盈利: 35.15 最大亏损: -26.67 总收益: -7.93 平均盈利: -0.66 typeA: -0.28 胜率: 41.67%
Loaded 3000 15m candles

      ========== 回测结果 ==========
      总交易次数:     61
      盈利次数:       42
      亏损次数:       19
      胜率:          68.85%
      总收益:        81.22 USDT
      期末余额:      1068.82 USDT
      盈亏比:        1.45
      最大单笔盈利:  48.65
      最大单笔亏损:  -32.20
      手续费:       24.596309477776515
      最大连续盈利:  70.35939976134698
      最大连续亏损:  -41.00752658843487
      最大连盈次数:  6
      最大连亏次数:  3
      =============================
    
profit: 68.8159102153545
maxDrawdown 6.9%
startTime: 2023-01-21 00:00:00
趋势空且增强-R-3-1 总交易次数: 6 盈利: 34.19274677854403 亏损: 0 最大盈利: 13.59 最大亏损: 2.42 总收益: 34.19 平均盈利: 5.70 typeA: 5.70 胜率: 100.00%
趋势多且增强-L-2 总交易次数: 4 盈利: 19.44092443291047 亏损: 0 最大盈利: 14.82 最大亏损: 1.07 总收益: 19.44 平均盈利: 4.86 typeA: 4.86 胜率: 100.00%
趋势多且增强-L-1 总交易次数: 17 盈利: 90.86890852015146 亏损: -44.865134867724805 最大盈利: 22.45 最大亏损: -22.11 总收益: 46.00 平均盈利: 2.71 typeA: 2.07 胜率: 76.47%
趋势空且增强-R-1 总交易次数: 22 盈利: 83.12459676733498 亏损: -63.780399302450306 最大盈利: 48.65 最大亏损: -24.01 总收益: 19.34 平均盈利: 0.88 typeA: 0.52 胜率: 59.09%
趋势空且增强-R-2 总交易次数: 2 盈利: 0.37167352537732473 亏损: -3.9650158804846587 最大盈利: 0.37 最大亏损: -3.97 总收益: -3.59 平均盈利: -1.80 typeA: -0.90 胜率: 50.00%
趋势多且增强-L-3-1 总交易次数: 10 盈利: 33.08181814679494 亏损: -67.25420790509573 最大盈利: 10.10 最大亏损: -32.20 总收益: -34.17 平均盈利: -3.42 typeA: -1.71 胜率: 50.00%
Loaded 3000 15m candles

      ========== 回测结果 ==========
      总交易次数:     63
      盈利次数:       40
      亏损次数:       23
      胜率:          63.49%
      总收益:        82.55 USDT
      期末余额:      1069.95 USDT
      盈亏比:        1.41
      最大单笔盈利:  44.92
      最大单笔亏损:  -42.73
      手续费:       25.230734702932427
      最大连续盈利:  88.22634390614374
      最大连续亏损:  -42.72906733584271
      最大连盈次数:  5
      最大连亏次数:  3
      =============================
    
profit: 69.94672512918874
maxDrawdown 6.1%
startTime: 2023-02-20 00:00:00
趋势多且增强-L-1 总交易次数: 8 盈利: 81.93322865587558 亏损: -11.275662083966482 最大盈利: 43.91 最大亏损: -10.71 总收益: 70.66 平均盈利: 8.83 typeA: 6.62 胜率: 75.00%
趋势空且增强-R-2 总交易次数: 6 盈利: 58.8817267346029 亏损: -8.8165074962605 最大盈利: 44.92 最大亏损: -5.67 总收益: 50.07 平均盈利: 8.34 typeA: 5.56 胜率: 66.67%
趋势多且增强-L-2 总交易次数: 7 盈利: 37.69631288998541 亏损: -9.622029540756236 最大盈利: 19.92 最大亏损: -5.74 总收益: 28.07 平均盈利: 4.01 typeA: 2.29 胜率: 57.14%
趋势多且增强-L-3-1 总交易次数: 11 盈利: 34.73789637233529 亏损: -14.269144143721514 最大盈利: 11.88 最大亏损: -11.34 总收益: 20.47 平均盈利: 1.86 typeA: 1.35 胜率: 72.73%
趋势空且增强-R-1 总交易次数: 24 盈利: 55.72247682706505 亏损: -106.3201570811143 最大盈利: 21.19 最大亏损: -42.73 总收益: -50.60 平均盈利: -2.11 typeA: -1.32 胜率: 62.50%
趋势空且增强-R-3-1 总交易次数: 7 盈利: 12.80366881155535 亏损: -48.92508481640872 最大盈利: 7.75 最大亏损: -15.57 总收益: -36.12 平均盈利: -5.16 typeA: -2.21 胜率: 42.86%
Loaded 3000 15m candles

      ========== 回测结果 ==========
      总交易次数:     55
      盈利次数:       39
      亏损次数:       16
      胜率:          70.91%
      总收益:        152.59 USDT
      期末余额:      1141.59 USDT
      盈亏比:        2.19
      最大单笔盈利:  41.67
      最大单笔亏损:  -21.35
      手续费:       21.989648285485696
      最大连续盈利:  73.80469996874734
      最大连续亏损:  -23.298301357722977
      最大连盈次数:  6
      最大连亏次数:  3
      =============================
    
profit: 141.59090420366192
maxDrawdown 3.8%
startTime: 2023-03-22 00:00:00
趋势空且增强-R-1 总交易次数: 17 盈利: 90.52169999403287 亏损: -3.0515438979918743 最大盈利: 28.59 最大亏损: -2.48 总收益: 87.47 平均盈利: 5.15 typeA: 4.54 胜率: 88.24%
趋势多且增强-L-3-1 总交易次数: 6 盈利: 31.408624798936657 亏损: -9.820313613685022 最大盈利: 9.71 最大亏损: -9.82 总收益: 21.59 平均盈利: 3.60 typeA: 3.00 胜率: 83.33%
趋势空且增强-R-3-1 总交易次数: 6 盈利: 25.337731093125164 亏损: -9.181136709691296 最大盈利: 9.70 最大亏损: -8.18 总收益: 16.16 平均盈利: 2.69 typeA: 1.80 胜率: 66.67%
趋势多且增强-L-1 总交易次数: 16 盈利: 111.99568473997458 亏损: -83.410184651919 最大盈利: 41.67 最大亏损: -21.35 总收益: 28.59 平均盈利: 1.79 typeA: 1.12 胜率: 62.50%
趋势空且增强-R-2 总交易次数: 1 盈利: 0 亏损: -0.7356540366849428 最大盈利: -0.74 最大亏损: -0.74 总收益: -0.74 平均盈利: -0.74 typeA: 0.00 胜率: 0.00%
趋势多且增强-L-2 总交易次数: 9 盈利: 21.624300511678936 亏损: -22.09830402411105 最大盈利: 11.24 最大亏损: -16.12 总收益: -0.47 平均盈利: -0.05 typeA: -0.03 胜率: 55.56%
Loaded 3000 15m candles

      ========== 回测结果 ==========
      总交易次数:     67
      盈利次数:       37
      亏损次数:       30
      胜率:          55.22%
      总收益:        -156.94 USDT
      期末余额:      829.66 USDT
      盈亏比:        0.44
      最大单笔盈利:  11.60
      最大单笔亏损:  -58.58
      手续费:       26.78324352970517
      最大连续盈利:  19.917635301762335
      最大连续亏损:  -58.57538012407247
      最大连盈次数:  5
      最大连亏次数:  4
      =============================
    
profit: -170.34396391125654
maxDrawdown 19.4%
startTime: 2023-04-21 00:00:00
趋势空且增强-R-2 总交易次数: 5 盈利: 0 亏损: -10.55594569849848 最大盈利: -0.33 最大亏损: -6.46 总收益: -10.56 平均盈利: -2.11 typeA: 0.00 胜率: 0.00%
趋势空且增强-R-3-1 总交易次数: 19 盈利: 53.277000545027846 亏损: -65.63312755902774 最大盈利: 8.73 最大亏损: -19.62 总收益: -12.36 平均盈利: -0.65 typeA: -0.41 胜率: 63.16%
趋势空且增强-R-1 总交易次数: 22 盈利: 37.32630774647635 亏损: -53.50939732464795 最大盈利: 10.34 最大亏损: -15.34 总收益: -16.18 平均盈利: -0.74 typeA: -0.47 胜率: 63.64%
趋势多且增强-L-3-1 总交易次数: 11 盈利: 25.2133922200811 亏损: -60.65866760180842 最大盈利: 11.60 最大亏损: -23.72 总收益: -35.45 平均盈利: -3.22 typeA: -2.05 胜率: 63.64%
趋势多且增强-L-2 总交易次数: 6 盈利: 2.7751902943970856 亏损: -59.539195343578484 最大盈利: 2.43 最大亏损: -58.58 总收益: -56.76 平均盈利: -9.46 typeA: -3.15 胜率: 33.33%
趋势多且增强-L-1 总交易次数: 4 盈利: 3.046729392422393 亏损: -28.686250582097276 最大盈利: 2.23 最大亏损: -20.65 总收益: -25.64 平均盈利: -6.41 typeA: -3.20 胜率: 50.00%
Loaded 3000 15m candles

      ========== 回测结果 ==========
      总交易次数:     46
      盈利次数:       30
      亏损次数:       16
      胜率:          65.22%
      总收益:        35.61 USDT
      期末余额:      1026.41 USDT
      盈亏比:        1.27
      最大单笔盈利:  73.46
      最大单笔亏损:  -47.20
      手续费:       18.394122284266235
      最大连续盈利:  73.46083808993461
      最大连续亏损:  -48.82946388423862
      最大连盈次数:  5
      最大连亏次数:  3
      =============================
    
profit: 26.41460410580362
maxDrawdown 6.1%
startTime: 2023-05-21 00:00:00
趋势空且增强-R-3-1 总交易次数: 8 盈利: 17.27552373829426 亏损: 0 最大盈利: 4.35 最大亏损: 0.54 总收益: 17.28 平均盈利: 2.16 typeA: 2.16 胜率: 100.00%
趋势多且增强-L-3-1 总交易次数: 5 盈利: 11.851612481173486 亏损: -4.47382790954226 最大盈利: 4.19 最大亏损: -4.47 总收益: 7.38 平均盈利: 1.48 typeA: 1.18 胜率: 80.00%
趋势多且增强-L-1 总交易次数: 10 盈利: 21.12095516972304 亏损: -14.707679358315874 最大盈利: 7.28 最大亏损: -13.01 总收益: 6.41 平均盈利: 0.64 typeA: 0.45 胜率: 70.00%
趋势空且增强-R-2 总交易次数: 2 盈利: 2.0574238271804166 亏损: -0.609526409171588 最大盈利: 2.06 最大亏损: -0.61 总收益: 1.45 平均盈利: 0.72 typeA: 0.36 胜率: 50.00%
趋势空且增强-R-1 总交易次数: 17 盈利: 112.14732909620228 亏损: -99.16467799258753 最大盈利: 73.46 最大亏损: -47.20 总收益: 12.98 平均盈利: 0.76 typeA: 0.31 胜率: 41.18%
趋势多且增强-L-2 总交易次数: 4 盈利: 2.714501030909883 亏损: -12.597029568060965 最大盈利: 1.05 最大亏损: -12.60 总收益: -9.88 平均盈利: -2.47 typeA: -1.85 胜率: 75.00%
Loaded 3000 15m candles

      ========== 回测结果 ==========
      总交易次数:     52
      盈利次数:       34
      亏损次数:       18
      胜率:          65.38%
      总收益:        -37.81 USDT
      期末余额:      951.59 USDT
      盈亏比:        0.83
      最大单笔盈利:  24.65
      最大单笔亏损:  -66.53
      手续费:       21.0229125743369
      最大连续盈利:  35.0585967008473
      最大连续亏损:  -66.53012680367291
      最大连盈次数:  6
      最大连亏次数:  3
      =============================
    
profit: -48.40756553124811
maxDrawdown 10.5%
startTime: 2023-06-20 00:00:00
趋势空且增强-R-2 总交易次数: 1 盈利: 4.530569131325788 亏损: 0 最大盈利: 4.53 最大亏损: 4.53 总收益: 4.53 平均盈利: 4.53 typeA: 4.53 胜率: 100.00%
趋势多且增强-L-1 总交易次数: 10 盈利: 34.871978896021254 亏损: -12.326295393698384 最大盈利: 16.00 最大亏损: -5.67 总收益: 22.55 平均盈利: 2.25 typeA: 1.58 胜率: 70.00%
趋势多且增强-L-2 总交易次数: 8 盈利: 19.822589056458455 亏损: -5.562707178181233 最大盈利: 7.46 最大亏损: -4.13 总收益: 14.26 平均盈利: 1.78 typeA: 1.11 胜率: 62.50%
趋势多且增强-L-3-1 总交易次数: 3 盈利: 14.59497048811707 亏损: -12.020144326731044 最大盈利: 10.36 最大亏损: -12.02 总收益: 2.57 平均盈利: 0.86 typeA: 0.57 胜率: 66.67%
趋势空且增强-R-3-1 总交易次数: 7 盈利: 22.20415574108737 亏损: -38.00787831811742 最大盈利: 13.09 最大亏损: -23.92 总收益: -15.80 平均盈利: -2.26 typeA: -1.61 胜率: 71.43%
趋势空且增强-R-1 总交易次数: 23 盈利: 83.73095479563796 亏损: -149.6457584231659 最大盈利: 24.65 最大亏损: -66.53 总收益: -65.91 平均盈利: -2.87 typeA: -1.74 胜率: 60.87%
Loaded 3000 15m candles

      ========== 回测结果 ==========
      总交易次数:     58
      盈利次数:       32
      亏损次数:       26
      胜率:          55.17%
      总收益:        -42.32 USDT
      期末余额:      945.88 USDT
      盈亏比:        0.85
      最大单笔盈利:  73.01
      最大单笔亏损:  -76.26
      手续费:       23.377586477649274
      最大连续盈利:  140.43327450446412
      最大连续亏损:  -83.15259565601474
      最大连盈次数:  5
      最大连亏次数:  3
      =============================
    
profit: -54.11576962538243
maxDrawdown 20.3%
startTime: 2023-07-20 00:00:00
趋势空且增强-R-2 总交易次数: 4 盈利: 78.14464602718971 亏损: 0 最大盈利: 73.01 最大亏损: 0.33 总收益: 78.14 平均盈利: 19.54 typeA: 19.54 胜率: 100.00%
趋势空且增强-R-3-1 总交易次数: 8 盈利: 29.520895111422014 亏损: -29.70825116539178 最大盈利: 22.95 最大亏损: -8.85 总收益: -0.19 平均盈利: -0.02 typeA: -0.01 胜率: 37.50%
趋势多且增强-L-3-1 总交易次数: 9 盈利: 16.244760812598788 亏损: -30.153166438782556 最大盈利: 5.00 最大亏损: -12.72 总收益: -13.91 平均盈利: -1.55 typeA: -0.69 胜率: 44.44%
趋势多且增强-L-2 总交易次数: 6 盈利: 9.725242319650139 亏损: -23.81281647643125 最大盈利: 7.46 最大亏损: -14.96 总收益: -14.09 平均盈利: -2.35 typeA: -1.17 胜率: 50.00%
趋势空且增强-R-1 总交易次数: 18 盈利: 88.36936967314296 亏损: -131.6538124006233 最大盈利: 49.40 最大亏损: -76.26 总收益: -43.28 平均盈利: -2.40 typeA: -1.34 胜率: 55.56%
趋势多且增强-L-1 总交易次数: 13 盈利: 24.541331214412665 亏损: -73.5339683025671 最大盈利: 5.09 最大亏损: -28.35 总收益: -48.99 平均盈利: -3.77 typeA: -2.32 胜率: 61.54%
Loaded 3000 15m candles

      ========== 回测结果 ==========
      总交易次数:     56
      盈利次数:       29
      亏损次数:       27
      胜率:          51.79%
      总收益:        -173.94 USDT
      期末余额:      814.66 USDT
      盈亏比:        0.32
      最大单笔盈利:  12.96
      最大单笔亏损:  -42.92
      手续费:       22.610998028557926
      最大连续盈利:  20.035316753701835
      最大连续亏损:  -72.98697415292433
      最大连盈次数:  7
      最大连亏次数:  4
      =============================
    
profit: -185.33891159308303
maxDrawdown 18.9%
startTime: 2023-08-19 00:00:00
趋势空且增强-R-3-1 总交易次数: 6 盈利: 14.626850361858171 亏损: -5.213128536782502 最大盈利: 6.58 最大亏损: -5.21 总收益: 9.41 平均盈利: 1.57 typeA: 1.31 胜率: 83.33%
趋势多且增强-L-3-1 总交易次数: 12 盈利: 14.008191257181748 亏损: -19.755516673716365 最大盈利: 4.09 最大亏损: -8.56 总收益: -5.75 平均盈利: -0.48 typeA: -0.28 胜率: 58.33%
趋势多且增强-L-1 总交易次数: 12 盈利: 24.964018362283873 亏损: -57.43137042492883 最大盈利: 12.96 最大亏损: -37.93 总收益: -32.47 平均盈利: -2.71 typeA: -1.35 胜率: 50.00%
趋势空且增强-R-2 总交易次数: 6 盈利: 0.5894238358328077 亏损: -63.858523374763564 最大盈利: 0.59 最大亏损: -42.92 总收益: -63.27 平均盈利: -10.54 typeA: -1.76 胜率: 16.67%
趋势多且增强-L-2 总交易次数: 7 盈利: 11.40781179272417 亏损: -33.2512459238446 最大盈利: 6.61 最大亏损: -22.44 总收益: -21.84 平均盈利: -3.12 typeA: -1.78 胜率: 57.14%
趋势空且增强-R-1 总交易次数: 13 盈利: 16.455548203397278 亏损: -76.4809704723225 最大盈利: 5.78 最大亏损: -20.51 总收益: -60.03 平均盈利: -4.62 typeA: -2.13 胜率: 46.15%
Loaded 3000 15m candles

      ========== 回测结果 ==========
      总交易次数:     58
      盈利次数:       35
      亏损次数:       23
      胜率:          60.34%
      总收益:        -26.35 USDT
      期末余额:      962.05 USDT
      盈亏比:        0.77
      最大单笔盈利:  8.88
      最大单笔亏损:  -21.13
      手续费:       23.201562506207527
      最大连续盈利:  28.65795266252493
      最大连续亏损:  -29.659789105797522
      最大连盈次数:  8
      最大连亏次数:  4
      =============================
    
profit: -37.94916118363062
maxDrawdown 5.1%
startTime: 2023-09-18 00:00:00
趋势空且增强-R-3-1 总交易次数: 7 盈利: 11.218757558899524 亏损: -7.567654280569635 最大盈利: 2.61 最大亏损: -7.57 总收益: 3.65 平均盈利: 0.52 typeA: 0.45 胜率: 85.71%
趋势多且增强-L-1 总交易次数: 18 盈利: 40.14563990759742 亏损: -33.00379858359113 最大盈利: 8.88 最大亏损: -13.29 总收益: 7.14 平均盈利: 0.40 typeA: 0.29 胜率: 72.22%
趋势空且增强-R-2 总交易次数: 3 盈利: 0 亏损: -8.579807955152893 最大盈利: -0.03 最大亏损: -5.90 总收益: -8.58 平均盈利: -2.86 typeA: 0.00 胜率: 0.00%
趋势多且增强-L-2 总交易次数: 5 盈利: 5.842048346055844 亏损: -14.401330725679843 最大盈利: 5.84 最大亏损: -10.29 总收益: -8.56 平均盈利: -1.71 typeA: -0.34 胜率: 20.00%
趋势空且增强-R-1 总交易次数: 20 盈利: 25.85068737385119 亏损: -38.2043035675975 最大盈利: 6.47 最大亏损: -21.13 总收益: -12.35 平均盈利: -0.62 typeA: -0.37 胜率: 60.00%
趋势多且增强-L-3-1 总交易次数: 5 盈利: 5.061469986878162 亏损: -12.710869244319106 最大盈利: 1.74 最大亏损: -8.10 总收益: -7.65 平均盈利: -1.53 typeA: -0.92 胜率: 60.00%
Loaded 3000 15m candles

      ========== 回测结果 ==========
      总交易次数:     60
      盈利次数:       39
      亏损次数:       21
      胜率:          65.00%
      总收益:        182.33 USDT
      期末余额:      1170.33 USDT
      盈亏比:        1.82
      最大单笔盈利:  85.08
      最大单笔亏损:  -26.51
      手续费:       24.04546945681421
      最大连续盈利:  85.07528631705844
      最大连续亏损:  -57.29211603004729
      最大连盈次数:  9
      最大连亏次数:  5
      =============================
    
profit: 170.33445282348634
maxDrawdown 7.3%
startTime: 2023-10-18 00:00:00
趋势多且增强-L-1 总交易次数: 9 盈利: 153.04588995489618 亏损: 0 最大盈利: 85.08 最大亏损: 1.28 总收益: 153.05 平均盈利: 17.01 typeA: 17.01 胜率: 100.00%
趋势多且增强-L-3-1 总交易次数: 12 盈利: 64.30459575919154 亏损: -37.81252595500968 最大盈利: 15.38 最大亏损: -25.88 总收益: 26.49 平均盈利: 2.21 typeA: 1.84 胜率: 83.33%
趋势多且增强-L-2 总交易次数: 13 盈利: 88.180112931813 亏损: -63.696642235779784 最大盈利: 37.89 最大亏损: -25.40 总收益: 24.48 平均盈利: 1.88 typeA: 1.16 胜率: 61.54%
趋势空且增强-R-2 总交易次数: 1 盈利: 0 亏损: -1.5594291539245115 最大盈利: -1.56 最大亏损: -1.56 总收益: -1.56 平均盈利: -1.56 typeA: 0.00 胜率: 0.00%
趋势空且增强-R-1 总交易次数: 17 盈利: 67.48088779912983 亏损: -72.46693017770902 最大盈利: 25.32 最大亏损: -22.49 总收益: -4.99 平均盈利: -0.29 typeA: -0.14 胜率: 47.06%
趋势空且增强-R-3-1 总交易次数: 8 盈利: 31.102424928959273 亏损: -46.24393102807795 最大盈利: 18.68 最大亏损: -26.51 总收益: -15.14 平均盈利: -1.89 typeA: -0.95 胜率: 50.00%
Loaded 3000 15m candles

      ========== 回测结果 ==========
      总交易次数:     62
      盈利次数:       41
      亏损次数:       21
      胜率:          66.13%
      总收益:        102.92 USDT
      期末余额:      1090.32 USDT
      盈亏比:        1.44
      最大单笔盈利:  92.33
      最大单笔亏损:  -34.32
      手续费:       25.00945071843738
      最大连续盈利:  101.61254516369223
      最大连续亏损:  -38.70114360744009
      最大连盈次数:  9
      最大连亏次数:  3
      =============================
    
profit: 90.31820377215467
maxDrawdown 6.4%
startTime: 2023-11-17 00:00:00
趋势空且增强-R-2 总交易次数: 1 盈利: 10.710105871029763 亏损: 0 最大盈利: 10.71 最大亏损: 10.71 总收益: 10.71 平均盈利: 10.71 typeA: 10.71 胜率: 100.00%
趋势空且增强-R-1 总交易次数: 18 盈利: 94.99564917425596 亏损: -52.22084967044926 最大盈利: 19.38 最大亏损: -23.53 总收益: 42.77 平均盈利: 2.38 typeA: 1.72 胜率: 72.22%
趋势多且增强-L-3-1 总交易次数: 6 盈利: 32.240914050671705 亏损: -18.953546855902182 最大盈利: 13.01 最大亏损: -15.31 总收益: 13.29 平均盈利: 2.21 typeA: 1.48 胜率: 66.67%
趋势多且增强-L-1 总交易次数: 17 盈利: 69.96331739162753 亏损: -40.40438148264265 最大盈利: 13.53 最大亏损: -18.46 总收益: 29.56 平均盈利: 1.74 typeA: 1.43 胜率: 82.35%
趋势多且增强-L-2 总交易次数: 12 盈利: 101.11755260661492 亏损: -69.68949049622037 最大盈利: 92.33 最大亏损: -34.32 总收益: 31.43 平均盈利: 2.62 typeA: 1.09 胜率: 41.67%
趋势空且增强-R-3-1 总交易次数: 8 盈利: 27.127110866212057 亏损: -51.96817768304071 最大盈利: 14.77 最大亏损: -20.64 总收益: -24.84 平均盈利: -3.11 typeA: -1.55 胜率: 50.00%
Loaded 3000 15m candles

      ========== 回测结果 ==========
      总交易次数:     61
      盈利次数:       37
      亏损次数:       24
      胜率:          60.66%
      总收益:        -71.25 USDT
      期末余额:      916.55 USDT
      盈亏比:        0.72
      最大单笔盈利:  17.58
      最大单笔亏损:  -51.29
      手续费:       24.42512928897979
      最大连续盈利:  40.04001200607198
      最大连续亏损:  -76.46732799457735
      最大连盈次数:  5
      最大连亏次数:  4
      =============================
    
profit: -83.44953991525767
maxDrawdown 10.5%
startTime: 2023-12-17 00:00:00
趋势多且增强-L-1 总交易次数: 10 盈利: 48.342984872857 亏损: -24.708605931201696 最大盈利: 15.21 最大亏损: -16.25 总收益: 23.63 平均盈利: 2.36 typeA: 1.65 胜率: 70.00%
趋势多且增强-L-2 总交易次数: 5 盈利: 8.981524628537237 亏损: -0.7479897615791943 最大盈利: 4.25 最大亏损: -0.44 总收益: 8.23 平均盈利: 1.65 typeA: 0.99 胜率: 60.00%
趋势空且增强-R-2 总交易次数: 2 盈利: 0 亏损: -5.465882608804604 最大盈利: -1.61 最大亏损: -3.85 总收益: -5.47 平均盈利: -2.73 typeA: 0.00 胜率: 0.00%
趋势多且增强-L-3-1 总交易次数: 9 盈利: 48.361299120298824 亏损: -51.72485799596142 最大盈利: 17.58 最大亏损: -19.71 总收益: -3.36 平均盈利: -0.37 typeA: -0.21 胜率: 55.56%
趋势空且增强-R-1 总交易次数: 23 盈利: 37.80431422058058 亏损: -98.38430674688254 最大盈利: 12.30 最大亏损: -36.65 总收益: -60.58 平均盈利: -2.63 typeA: -1.37 胜率: 52.17%
趋势空且增强-R-3-1 总交易次数: 12 盈利: 37.332262617515696 亏损: -71.04028233061467 最大盈利: 8.03 最大亏损: -51.29 总收益: -33.71 平均盈利: -2.81 typeA: -2.34 胜率: 83.33%
Loaded 3000 15m candles

      ========== 回测结果 ==========
      总交易次数:     62
      盈利次数:       39
      亏损次数:       23
      胜率:          62.90%
      总收益:        56.79 USDT
      期末余额:      1044.19 USDT
      盈亏比:        1.29
      最大单笔盈利:  58.45
      最大单笔亏损:  -31.87
      手续费:       24.996504877969787
      最大连续盈利:  69.60586207731366
      最大连续亏损:  -42.413117857442344
      最大连盈次数:  13
      最大连亏次数:  4
      =============================
    
profit: 44.186924815093334
maxDrawdown 7.0%
startTime: 2024-01-16 00:00:00
趋势多且增强-L-3-1 总交易次数: 7 盈利: 20.92968173216088 亏损: -6.446532441545464 最大盈利: 5.35 最大亏损: -5.86 总收益: 14.48 平均盈利: 2.07 typeA: 1.48 胜率: 71.43%
趋势空且增强-R-3-1 总交易次数: 10 盈利: 32.12374444522516 亏损: -17.533281458039582 最大盈利: 7.89 最大亏损: -9.73 总收益: 14.59 平均盈利: 1.46 typeA: 1.17 胜率: 80.00%
趋势多且增强-L-1 总交易次数: 16 盈利: 93.90274859892568 亏损: -74.05193559786721 最大盈利: 48.54 最大亏损: -31.87 总收益: 19.85 平均盈利: 1.24 typeA: 0.85 胜率: 68.75%
趋势空且增强-R-1 总交易次数: 22 盈利: 104.03843891384221 亏损: -80.79631137395948 最大盈利: 58.45 最大亏损: -25.34 总收益: 23.24 平均盈利: 1.06 typeA: 0.53 胜率: 50.00%
趋势空且增强-R-2 总交易次数: 1 盈利: 0 亏损: -1.0944047010730789 最大盈利: -1.09 最大亏损: -1.09 总收益: -1.09 平均盈利: -1.09 typeA: 0.00 胜率: 0.00%
趋势多且增强-L-2 总交易次数: 6 盈利: 3.653495543022334 亏损: -17.938718845595954 最大盈利: 1.65 最大亏损: -14.99 总收益: -14.29 平均盈利: -2.38 typeA: -1.59 胜率: 66.67%
Loaded 3000 15m candles

      ========== 回测结果 ==========
      总交易次数:     57
      盈利次数:       32
      亏损次数:       25
      胜率:          56.14%
      总收益:        36.02 USDT
      期末余额:      1024.62 USDT
      盈亏比:        1.10
      最大单笔盈利:  79.78
      最大单笔亏损:  -54.83
      手续费:       22.83682052548881
      最大连续盈利:  146.468972876531
      最大连续亏损:  -64.18107724480193
      最大连盈次数:  5
      最大连亏次数:  3
      =============================
    
profit: 24.624125385833395
maxDrawdown 13.6%
startTime: 2024-02-15 00:00:00
趋势空且增强-R-2 总交易次数: 1 盈利: 3.3602614226527368 亏损: 0 最大盈利: 3.36 最大亏损: 3.36 总收益: 3.36 平均盈利: 3.36 typeA: 3.36 胜率: 100.00%
趋势多且增强-L-1 总交易次数: 12 盈利: 142.3014085251521 亏损: -79.4434477278203 最大盈利: 79.78 最大亏损: -29.54 总收益: 62.86 平均盈利: 5.24 typeA: 3.06 胜率: 58.33%
趋势多且增强-L-2 总交易次数: 6 盈利: 26.929707747066352 亏损: -2.5215419163643222 最大盈利: 15.72 最大亏损: -1.37 总收益: 24.41 平均盈利: 4.07 typeA: 2.71 胜率: 66.67%
趋势多且增强-L-3-1 总交易次数: 13 盈利: 123.92583998848505 亏损: -101.6333362961346 最大盈利: 28.00 最大亏损: -50.23 总收益: 22.29 平均盈利: 1.71 typeA: 1.06 胜率: 61.54%
趋势空且增强-R-3-1 总交易次数: 7 盈利: 45.095779940127315 亏损: -53.55649839559651 最大盈利: 18.92 最大亏损: -33.60 总收益: -8.46 平均盈利: -1.21 typeA: -0.69 胜率: 57.14%
趋势空且增强-R-1 总交易次数: 18 盈利: 70.37745612781504 亏损: -138.8115040295467 最大盈利: 25.70 最大亏损: -54.83 总收益: -68.43 平均盈利: -3.80 typeA: -1.69 胜率: 44.44%
Loaded 3000 15m candles

      ========== 回测结果 ==========
      总交易次数:     51
      盈利次数:       25
      亏损次数:       26
      胜率:          49.02%
      总收益:        -133.44 USDT
      期末余额:      856.16 USDT
      盈亏比:        0.71
      最大单笔盈利:  79.34
      最大单笔亏损:  -88.80
      手续费:       20.59919850848843
      最大连续盈利:  79.37936946012739
      最大连续亏损:  -88.7977768063449
      最大连盈次数:  5
      最大连亏次数:  5
      =============================
    
profit: -143.83605845703676
maxDrawdown 18.1%
startTime: 2024-03-16 00:00:00
趋势多且增强-L-3-1 总交易次数: 12 盈利: 117.91709731722544 亏损: -29.040885057901193 最大盈利: 22.72 最大亏损: -16.98 总收益: 88.88 平均盈利: 7.41 typeA: 5.55 胜率: 75.00%
趋势空且增强-R-1 总交易次数: 15 盈利: 80.75966084376715 亏损: -49.130591691669295 最大盈利: 37.03 最大亏损: -21.30 总收益: 31.63 平均盈利: 2.11 typeA: 1.12 胜率: 53.33%
趋势多且增强-L-1 总交易次数: 13 盈利: 114.0537442105084 亏损: -177.89232652299685 最大盈利: 79.34 最大亏损: -44.92 总收益: -63.84 平均盈利: -4.91 typeA: -1.51 胜率: 30.77%
趋势空且增强-R-2 总交易次数: 3 盈利: 4.46604465178278 亏损: -29.48515880624056 最大盈利: 4.47 最大亏损: -28.40 总收益: -25.02 平均盈利: -8.34 typeA: -2.78 胜率: 33.33%
趋势多且增强-L-2 总交易次数: 5 盈利: 0.9870872592311187 亏损: -95.63415152747466 最大盈利: 0.93 最大亏损: -88.80 总收益: -94.65 平均盈利: -18.93 typeA: -7.57 胜率: 40.00%
趋势空且增强-R-3-1 总交易次数: 3 盈利: 7.410622901902223 亏损: -77.84720203516878 最大盈利: 7.41 最大亏损: -44.66 总收益: -70.44 平均盈利: -23.48 typeA: -7.83 胜率: 33.33%
Loaded 3000 15m candles

      ========== 回测结果 ==========
      总交易次数:     49
      盈利次数:       27
      亏损次数:       22
      胜率:          55.10%
      总收益:        -58.49 USDT
      期末余额:      931.71 USDT
      盈亏比:        0.83
      最大单笔盈利:  52.85
      最大单笔亏损:  -47.40
      手续费:       19.59803454304454
      最大连续盈利:  79.03809181972116
      最大连续亏损:  -47.39569403583853
      最大连盈次数:  6
      最大连亏次数:  4
      =============================
    
profit: -68.28686265871715
maxDrawdown 15.1%
startTime: 2024-04-15 00:00:00
趋势多且增强-L-2 总交易次数: 5 盈利: 89.34260940323566 亏损: -4.900194875278885 最大盈利: 52.85 最大亏损: -3.41 总收益: 84.44 平均盈利: 16.89 typeA: 6.76 胜率: 40.00%
趋势空且增强-R-1 总交易次数: 16 盈利: 99.93319003474653 亏损: -40.4008078697754 最大盈利: 34.27 最大亏损: -23.00 总收益: 59.53 平均盈利: 3.72 typeA: 2.56 胜率: 68.75%
趋势空且增强-R-3-1 总交易次数: 7 盈利: 43.17540356073374 亏损: -44.74272317058178 最大盈利: 16.00 最大亏损: -18.65 总收益: -1.57 平均盈利: -0.22 typeA: -0.13 胜率: 57.14%
趋势多且增强-L-1 总交易次数: 8 盈利: 26.721716035433154 亏损: -69.67231585113065 最大盈利: 21.61 最大亏损: -37.66 总收益: -42.95 平均盈利: -5.37 typeA: -2.68 胜率: 50.00%
趋势多且增强-L-3-1 总交易次数: 8 盈利: 26.832844264961263 亏损: -101.77686381237618 最大盈利: 8.28 最大亏损: -47.40 总收益: -74.94 平均盈利: -9.37 typeA: -4.68 胜率: 50.00%
趋势空且增强-R-2 总交易次数: 5 盈利: 6.053312642935679 亏损: -89.05303302161808 最大盈利: 3.77 最大亏损: -44.72 总收益: -83.00 平均盈利: -16.60 typeA: -6.64 胜率: 40.00%
Loaded 3000 15m candles

      ========== 回测结果 ==========
      总交易次数:     58
      盈利次数:       36
      亏损次数:       22
      胜率:          62.07%
      总收益:        -50.70 USDT
      期末余额:      937.70 USDT
      盈亏比:        0.84
      最大单笔盈利:  42.14
      最大单笔亏损:  -32.39
      手续费:       23.20564296139579
      最大连续盈利:  67.85711247516129
      最大连续亏损:  -89.63758307604081
      最大连盈次数:  6
      最大连亏次数:  4
      =============================
    
profit: -62.29680941599395
maxDrawdown 16.6%
startTime: 2024-05-15 00:00:00
趋势多且增强-L-1 总交易次数: 12 盈利: 58.40690571405366 亏损: -29.638175627719235 最大盈利: 15.24 最大亏损: -14.72 总收益: 28.77 平均盈利: 2.40 typeA: 1.60 胜率: 66.67%
趋势空且增强-R-1 总交易次数: 16 盈利: 78.64334386232275 亏损: -45.15044251460979 最大盈利: 24.88 最大亏损: -23.16 总收益: 33.49 平均盈利: 2.09 typeA: 1.57 胜率: 75.00%
趋势多且增强-L-2 总交易次数: 7 盈利: 51.4884073140171 亏损: -62.757048681417366 最大盈利: 42.14 最大亏损: -31.36 总收益: -11.27 平均盈利: -1.61 typeA: -0.92 胜率: 57.14%
趋势多且增强-L-3-1 总交易次数: 8 盈利: 27.658835920619104 亏损: -55.99601674137349 最大盈利: 10.95 最大亏损: -23.00 总收益: -28.34 平均盈利: -3.54 typeA: -1.77 胜率: 50.00%
趋势空且增强-R-3-1 总交易次数: 11 盈利: 35.999160656117894 亏损: -81.16029493177693 最大盈利: 10.54 最大亏损: -30.77 总收益: -45.16 平均盈利: -4.11 typeA: -2.24 胜率: 54.55%
趋势空且增强-R-2 总交易次数: 4 盈利: 8.379592798862467 亏损: -36.571077185087226 最大盈利: 6.06 最大亏损: -32.39 总收益: -28.19 平均盈利: -7.05 typeA: -3.52 胜率: 50.00%
Loaded 3000 15m candles

      ========== 回测结果 ==========
      总交易次数:     64
      盈利次数:       34
      亏损次数:       30
      胜率:          53.13%
      总收益:        -148.55 USDT
      期末余额:      838.65 USDT
      盈亏比:        0.60
      最大单笔盈利:  27.16
      最大单笔亏损:  -78.20
      手续费:       25.634251846433603
      最大连续盈利:  31.625705346148173
      最大连续亏损:  -78.19913580246917
      最大连盈次数:  5
      最大连亏次数:  4
      =============================
    
profit: -161.35399715552057
maxDrawdown 20.4%
startTime: 2024-06-14 00:00:00
趋势多且增强-L-3-1 总交易次数: 10 盈利: 46.5680665280821 亏损: -31.481162650679785 最大盈利: 10.00 最大亏损: -15.36 总收益: 15.09 平均盈利: 1.51 typeA: 1.06 胜率: 70.00%
趋势多且增强-L-1 总交易次数: 14 盈利: 80.51378487216839 亏损: -72.2006568841472 最大盈利: 27.16 最大亏损: -23.19 总收益: 8.31 平均盈利: 0.59 typeA: 0.34 胜率: 57.14%
趋势空且增强-R-2 总交易次数: 5 盈利: 0.5290087463557397 亏损: -12.064856600585271 最大盈利: 0.53 最大亏损: -8.24 总收益: -11.54 平均盈利: -2.31 typeA: -0.46 胜率: 20.00%
趋势多且增强-L-2 总交易次数: 10 盈利: 20.19806140966594 亏损: -32.63190379422822 最大盈利: 7.32 最大亏损: -26.57 总收益: -12.43 平均盈利: -1.24 typeA: -0.62 胜率: 50.00%
趋势空且增强-R-3-1 总交易次数: 8 盈利: 10.878337440405183 亏损: -45.83550648317666 最大盈利: 4.58 最大亏损: -15.72 总收益: -34.96 平均盈利: -4.37 typeA: -1.64 胜率: 37.50%
趋势空且增强-R-1 总交易次数: 17 盈利: 65.92754027272517 亏损: -178.9547100121031 最大盈利: 16.78 最大亏损: -78.20 总收益: -113.03 平均盈利: -6.65 typeA: -3.91 胜率: 58.82%
Loaded 3000 15m candles

      ========== 回测结果 ==========
      总交易次数:     55
      盈利次数:       32
      亏损次数:       23
      胜率:          58.18%
      总收益:        -191.86 USDT
      期末余额:      797.14 USDT
      盈亏比:        0.56
      最大单笔盈利:  26.34
      最大单笔亏损:  -145.44
      手续费:       22.025248889834586
      最大连续盈利:  44.84132687914587
      最大连续亏损:  -158.5109098058152
      最大连盈次数:  8
      最大连亏次数:  5
      =============================
    
profit: -202.8603340978642
maxDrawdown 21.2%
startTime: 2024-07-14 00:00:00
趋势多且增强-L-3-1 总交易次数: 5 盈利: 47.72462283489775 亏损: -10.577887820207671 最大盈利: 14.64 最大亏损: -10.58 总收益: 37.15 平均盈利: 7.43 typeA: 5.94 胜率: 80.00%
趋势空且增强-R-2 总交易次数: 4 盈利: 26.692798195752236 亏损: -0.7872860392563991 最大盈利: 19.65 最大亏损: -0.68 总收益: 25.91 平均盈利: 6.48 typeA: 3.24 胜率: 50.00%
趋势多且增强-L-2 总交易次数: 9 盈利: 32.04748011873485 亏损: -18.70932497045424 最大盈利: 19.55 最大亏损: -10.65 总收益: 13.34 平均盈利: 1.48 typeA: 0.49 胜率: 33.33%
趋势空且增强-R-3-1 总交易次数: 5 盈利: 33.93152107939418 亏损: -44.613539573005795 最大盈利: 15.04 最大亏损: -26.43 总收益: -10.68 平均盈利: -2.14 typeA: -1.28 胜率: 60.00%
趋势多且增强-L-1 总交易次数: 16 盈利: 56.600067672583506 亏损: -140.3748167894474 最大盈利: 15.31 最大亏损: -39.89 总收益: -83.77 平均盈利: -5.24 typeA: -2.95 胜率: 56.25%
趋势空且增强-R-1 总交易次数: 16 盈利: 47.57601057578591 亏损: -221.3699793826383 最大盈利: 26.34 最大亏损: -145.44 总收益: -173.79 平均盈利: -10.86 typeA: -7.47 胜率: 68.75%
Loaded 3000 15m candles

      ========== 回测结果 ==========
      总交易次数:     71
      盈利次数:       47
      亏损次数:       24
      胜率:          66.20%
      总收益:        94.48 USDT
      期末余额:      1080.08 USDT
      盈亏比:        1.34
      最大单笔盈利:  57.77
      最大单笔亏损:  -42.79
      手续费:       28.575615012525592
      最大连续盈利:  94.41421589818816
      最大连续亏损:  -58.66816396921115
      最大连盈次数:  8
      最大连亏次数:  5
      =============================
    
profit: 80.08067878859129
maxDrawdown 9.9%
startTime: 2024-08-13 00:00:00
趋势空且增强-R-1 总交易次数: 17 盈利: 131.72179571203978 亏损: -27.56989204587893 最大盈利: 40.85 最大亏损: -20.05 总收益: 104.15 平均盈利: 6.13 typeA: 5.05 胜率: 82.35%
趋势多且增强-L-1 总交易次数: 14 盈利: 79.16079782178122 亏损: -30.244601502931854 最大盈利: 57.77 最大亏损: -12.49 总收益: 48.92 平均盈利: 3.49 typeA: 2.00 胜率: 57.14%
趋势多且增强-L-3-1 总交易次数: 15 盈利: 71.60859926911478 亏损: -34.314915351686224 最大盈利: 9.69 最大亏损: -18.81 总收益: 37.29 平均盈利: 2.49 typeA: 1.99 胜率: 80.00%
趋势空且增强-R-2 总交易次数: 5 盈利: 51.92701617056335 亏损: -14.249559348876463 最大盈利: 51.93 最大亏损: -9.96 总收益: 37.68 平均盈利: 7.54 typeA: 1.51 胜率: 20.00%
趋势空且增强-R-3-1 总交易次数: 13 盈利: 32.98984495668629 亏损: -66.50553173491238 最大盈利: 8.04 最大亏损: -27.21 总收益: -33.52 平均盈利: -2.58 typeA: -1.78 胜率: 69.23%
趋势多且增强-L-2 总交易次数: 7 盈利: 6.831928954867526 亏损: -106.87480411217241 最大盈利: 2.87 最大亏损: -42.79 总收益: -100.04 平均盈利: -14.29 typeA: -6.13 胜率: 42.86%
Loaded 3000 15m candles

      ========== 回测结果 ==========
      总交易次数:     73
      盈利次数:       47
      亏损次数:       26
      胜率:          64.38%
      总收益:        64.05 USDT
      期末余额:      1049.45 USDT
      盈亏比:        1.32
      最大单笔盈利:  24.12
      最大单笔亏损:  -39.95
      手续费:       29.21153464862766
      最大连续盈利:  35.564167275819344
      最大连续亏损:  -43.060719924555066
      最大连盈次数:  7
      最大连亏次数:  2
      =============================
    
profit: 49.451588702673234
maxDrawdown 4.1%
startTime: 2024-09-12 00:00:00
趋势多且增强-L-3-1 总交易次数: 13 盈利: 63.56599855425964 亏损: -33.394091951931195 最大盈利: 23.72 最大亏损: -11.23 总收益: 30.17 平均盈利: 2.32 typeA: 1.43 胜率: 61.54%
趋势多且增强-L-1 总交易次数: 18 盈利: 79.41929314194955 亏损: -46.82481063720666 最大盈利: 24.12 最大亏损: -14.06 总收益: 32.59 平均盈利: 1.81 typeA: 1.11 胜率: 61.11%
趋势空且增强-R-1 总交易次数: 16 盈利: 60.22840719671666 亏损: -45.44534930397974 最大盈利: 11.42 最大亏损: -39.95 总收益: 14.78 平均盈利: 0.92 typeA: 0.81 胜率: 87.50%
趋势空且增强-R-3-1 总交易次数: 14 盈利: 48.2103336239496 亏损: -39.773931974867324 最大盈利: 8.11 最大亏损: -13.24 总收益: 8.44 平均盈利: 0.60 typeA: 0.39 胜率: 64.29%
趋势多且增强-L-2 总交易次数: 6 盈利: 3.3770877471478573 亏损: -5.38892724597346 最大盈利: 1.22 最大亏损: -2.37 总收益: -2.01 平均盈利: -0.34 typeA: -0.17 胜率: 50.00%
趋势空且增强-R-2 总交易次数: 6 盈利: 8.63201036631225 亏损: -28.55443081370073 最大盈利: 5.30 最大亏损: -19.94 总收益: -19.92 平均盈利: -3.32 typeA: -1.11 胜率: 33.33%
Loaded 3000 15m candles

      ========== 回测结果 ==========
      总交易次数:     62
      盈利次数:       41
      亏损次数:       21
      胜率:          66.13%
      总收益:        293.50 USDT
      期末余额:      1281.10 USDT
      盈亏比:        1.82
      最大单笔盈利:  202.51
      最大单笔亏损:  -59.74
      手续费:       24.893216038438982
      最大连续盈利:  202.51361140630522
      最大连续亏损:  -88.1248352214227
      最大连盈次数:  7
      最大连亏次数:  3
      =============================
    
profit: 281.10469578820744
maxDrawdown 14.3%
startTime: 2024-10-12 00:00:00
趋势多且增强-L-2 总交易次数: 6 盈利: 318.70622047671725 亏损: -7.919627651897931 最大盈利: 202.51 最大亏损: -7.92 总收益: 310.79 平均盈利: 51.80 typeA: 43.16 胜率: 83.33%
趋势多且增强-L-1 总交易次数: 19 盈利: 143.23153738282096 亏损: -90.72161167825097 最大盈利: 23.66 最大亏损: -45.21 总收益: 52.51 平均盈利: 2.76 typeA: 2.04 胜率: 73.68%
趋势多且增强-L-3-1 总交易次数: 9 盈利: 82.61160006995772 亏损: -66.7462743989055 最大盈利: 35.69 最大亏损: -27.03 总收益: 15.87 平均盈利: 1.76 typeA: 1.18 胜率: 66.67%
趋势空且增强-R-2 总交易次数: 3 盈利: 3.432714479240201 亏损: -0.5955965721819676 最大盈利: 3.16 最大亏损: -0.60 总收益: 2.84 平均盈利: 0.95 typeA: 0.63 胜率: 66.67%
趋势空且增强-R-1 总交易次数: 15 盈利: 44.736269625298654 亏损: -87.14134257957106 最大盈利: 11.02 最大亏损: -45.53 总收益: -42.41 平均盈利: -2.83 typeA: -1.51 胜率: 53.33%
趋势空且增强-R-3-1 总交易次数: 10 盈利: 60.39340947573158 亏损: -106.48260284074875 最大盈利: 17.82 最大亏损: -59.74 总收益: -46.09 平均盈利: -4.61 typeA: -2.77 胜率: 60.00%
Loaded 3000 15m candles

      ========== 回测结果 ==========
      总交易次数:     63
      盈利次数:       43
      亏损次数:       20
      胜率:          68.25%
      总收益:        138.89 USDT
      期末余额:      1126.09 USDT
      盈亏比:        1.35
      最大单笔盈利:  45.31
      最大单笔亏损:  -86.44
      手续费:       25.398974525158756
      最大连续盈利:  93.32074546602499
      最大连续亏损:  -137.54212447315138
      最大连盈次数:  7
      最大连亏次数:  3
      =============================
    
profit: 126.09472136649606
maxDrawdown 12.4%
startTime: 2024-11-11 00:00:00
趋势多且增强-L-3-1 总交易次数: 21 盈利: 297.15275904074554 亏损: -69.65273203411067 最大盈利: 45.31 最大亏损: -37.53 总收益: 227.50 平均盈利: 10.83 typeA: 8.77 胜率: 80.95%
趋势空且增强-R-2 总交易次数: 2 盈利: 32.16405510116226 亏损: -0.25204902037316895 最大盈利: 32.16 最大亏损: -0.25 总收益: 31.91 平均盈利: 15.96 typeA: 7.98 胜率: 50.00%
趋势空且增强-R-1 总交易次数: 13 盈利: 59.92959129182285 亏损: -20.46186179669757 最大盈利: 14.59 最大亏损: -13.57 总收益: 39.47 平均盈利: 3.04 typeA: 1.87 胜率: 61.54%
趋势空且增强-R-3-1 总交易次数: 10 盈利: 71.91445868331586 亏损: -69.96799710332974 最大盈利: 15.93 最大亏损: -24.69 总收益: 1.95 平均盈利: 0.19 typeA: 0.12 胜率: 60.00%
趋势多且增强-L-1 总交易次数: 12 盈利: 59.36982968314042 亏损: -148.60376879747548 最大盈利: 29.41 最大亏损: -74.05 总收益: -89.23 平均盈利: -7.44 typeA: -4.34 胜率: 58.33%
趋势多且增强-L-2 总交易次数: 5 盈利: 13.73843990329276 亏损: -86.43600358499414 最大盈利: 10.93 最大亏损: -86.44 总收益: -72.70 平均盈利: -14.54 typeA: -11.63 胜率: 80.00%
Loaded 3000 15m candles

      ========== 回测结果 ==========
      总交易次数:     57
      盈利次数:       38
      亏损次数:       19
      胜率:          66.67%
      总收益:        67.21 USDT
      期末余额:      1055.81 USDT
      盈亏比:        1.20
      最大单笔盈利:  42.52
      最大单笔亏损:  -52.29
      手续费:       22.80200886011919
      最大连续盈利:  129.51550927256906
      最大连续亏损:  -91.81078966103328
      最大连盈次数:  9
      最大连亏次数:  5
      =============================
    
profit: 55.809613124479256
maxDrawdown 11.3%
startTime: 2024-12-11 00:00:00
趋势空且增强-R-2 总交易次数: 4 盈利: 31.630563605296096 亏损: -8.572405232502517 最大盈利: 22.08 最大亏损: -8.57 总收益: 23.06 平均盈利: 5.76 typeA: 4.32 胜率: 75.00%
趋势空且增强-R-3-1 总交易次数: 14 盈利: 126.9782282660228 亏损: -50.58931267560244 最大盈利: 24.15 最大亏损: -20.73 总收益: 76.39 平均盈利: 5.46 typeA: 4.29 胜率: 78.57%
趋势多且增强-L-3-1 总交易次数: 12 盈利: 93.90772555458375 亏损: -42.11016556497023 最大盈利: 30.67 最大亏损: -12.04 总收益: 51.80 平均盈利: 4.32 typeA: 2.88 胜率: 66.67%
趋势多且增强-L-2 总交易次数: 6 盈利: 61.89967954393578 亏损: -53.69307498912777 最大盈利: 42.52 最大亏损: -28.04 总收益: 8.21 平均盈利: 1.37 typeA: 0.91 胜率: 66.67%
趋势多且增强-L-1 总交易次数: 8 盈利: 51.053973351448285 亏损: -71.93904219776962 最大盈利: 29.23 最大亏损: -52.29 总收益: -20.89 平均盈利: -2.61 typeA: -1.96 胜率: 75.00%
趋势空且增强-R-1 总交易次数: 13 盈利: 29.99259644074793 亏损: -101.3491529775805 最大盈利: 13.00 最大亏损: -34.88 总收益: -71.36 平均盈利: -5.49 typeA: -2.53 胜率: 46.15%
Loaded 3000 15m candles

      ========== 回测结果 ==========
      总交易次数:     58
      盈利次数:       29
      亏损次数:       29
      胜率:          50.00%
      总收益:        -39.24 USDT
      期末余额:      949.16 USDT
      盈亏比:        0.93
      最大单笔盈利:  170.47
      最大单笔亏损:  -65.69
      手续费:       23.13629931884132
      最大连续盈利:  252.6585381489636
      最大连续亏损:  -98.7570409184472
      最大连盈次数:  4
      最大连亏次数:  3
      =============================
    
profit: -50.836702935482094
maxDrawdown 17.4%
startTime: 2025-01-10 00:00:00
趋势空且增强-R-1 总交易次数: 16 盈利: 277.1546556520617 亏损: -120.95219984275742 最大盈利: 170.47 最大亏损: -45.08 总收益: 156.20 平均盈利: 9.76 typeA: 5.49 胜率: 56.25%
趋势空且增强-R-3-1 总交易次数: 10 盈利: 99.96408089580129 亏损: -49.55358747059667 最大盈利: 31.56 最大亏损: -26.16 总收益: 50.41 平均盈利: 5.04 typeA: 3.53 胜率: 70.00%
趋势多且增强-L-2 总交易次数: 10 盈利: 61.19251939804254 亏损: -124.7764156077666 最大盈利: 37.03 最大亏损: -41.05 总收益: -63.58 平均盈利: -6.36 typeA: -1.91 胜率: 30.00%
趋势多且增强-L-1 总交易次数: 13 盈利: 48.47685575255264 亏损: -114.79207622672396 最大盈利: 24.64 最大亏损: -65.69 总收益: -66.32 平均盈利: -5.10 typeA: -2.75 胜率: 53.85%
趋势多且增强-L-3-1 总交易次数: 4 盈利: 1.721822704658408 亏损: -50.28999034477984 最大盈利: 1.72 最大亏损: -20.34 总收益: -48.57 平均盈利: -12.14 typeA: -3.04 胜率: 25.00%
趋势空且增强-R-2 总交易次数: 5 盈利: 3.0796392112253055 亏损: -70.4620070571964 最大盈利: 2.56 最大亏损: -55.75 总收益: -67.38 平均盈利: -13.48 typeA: -5.39 胜率: 40.00%
Loaded 3000 15m candles

      ========== 回测结果 ==========
      总交易次数:     63
      盈利次数:       43
      亏损次数:       20
      胜率:          68.25%
      总收益:        -18.62 USDT
      期末余额:      968.78 USDT
      盈亏比:        0.95
      最大单笔盈利:  110.21
      最大单笔亏损:  -72.00
      手续费:       25.163853105597788
      最大连续盈利:  112.3671209118039
      最大连续亏损:  -71.99561454738522
      最大连盈次数:  7
      最大连亏次数:  4
      =============================
    
profit: -31.2232416246801
maxDrawdown 14.8%
startTime: 2025-02-09 00:00:00
趋势空且增强-R-1 总交易次数: 18 盈利: 155.82994157216217 亏损: -96.7285832100957 最大盈利: 110.21 最大亏损: -72.00 总收益: 59.10 平均盈利: 3.28 typeA: 2.37 胜率: 72.22%
趋势多且增强-L-3-1 总交易次数: 7 盈利: 44.466656521195326 亏损: -26.580776945641226 最大盈利: 17.13 最大亏损: -16.88 总收益: 17.89 平均盈利: 2.56 typeA: 1.83 胜率: 71.43%
趋势空且增强-R-3-1 总交易次数: 11 盈利: 58.16875423177789 亏损: -46.13093491716273 最大盈利: 21.26 最大亏损: -23.74 总收益: 12.04 平均盈利: 1.09 typeA: 0.70 胜率: 63.64%
趋势空且增强-R-2 总交易次数: 8 盈利: 15.221144595142515 亏损: -6.405313017564609 最大盈利: 7.43 最大亏损: -4.05 总收益: 8.82 平均盈利: 1.10 typeA: 0.69 胜率: 62.50%
趋势多且增强-L-1 总交易次数: 14 盈利: 58.97858871665853 亏损: -138.9807746316808 最大盈利: 24.83 最大亏损: -69.04 总收益: -80.00 平均盈利: -5.71 typeA: -4.08 胜率: 71.43%
趋势多且增强-L-2 总交易次数: 5 盈利: 10.817298636737906 亏损: -47.27924317620647 最大盈利: 7.75 最大亏损: -45.19 总收益: -36.46 平均盈利: -7.29 typeA: -4.38 胜率: 60.00%
Loaded 3000 15m candles

      ========== 回测结果 ==========
      总交易次数:     60
      盈利次数:       38
      亏损次数:       22
      胜率:          63.33%
      总收益:        22.24 USDT
      期末余额:      1010.04 USDT
      盈亏比:        1.06
      最大单笔盈利:  83.99
      最大单笔亏损:  -47.70
      手续费:       24.18281721965068
      最大连续盈利:  85.46070229325103
      最大连续亏损:  -85.43908951652526
      最大连盈次数:  8
      最大连亏次数:  6
      =============================
    
profit: 10.03899366907649
maxDrawdown 10.1%
startTime: 2025-03-11 00:00:00
趋势空且增强-R-1 总交易次数: 13 盈利: 145.53092357271484 亏损: -35.573309441113494 最大盈利: 83.99 最大亏损: -21.82 总收益: 109.96 平均盈利: 8.46 typeA: 5.86 胜率: 69.23%
趋势多且增强-L-1 总交易次数: 6 盈利: 41.98462038556127 亏损: -0.5512177985948741 最大盈利: 24.26 最大亏损: -0.55 总收益: 41.43 平均盈利: 6.91 typeA: 5.75 胜率: 83.33%
趋势空且增强-R-3-1 总交易次数: 10 盈利: 39.441533649326 亏损: -36.183395740511195 最大盈利: 16.41 最大亏损: -21.52 总收益: 3.26 平均盈利: 0.33 typeA: 0.23 胜率: 70.00%
趋势多且增强-L-3-1 总交易次数: 18 盈利: 122.33145502819411 亏损: -163.02477817084468 最大盈利: 37.45 最大亏损: -47.70 总收益: -40.69 平均盈利: -2.26 typeA: -1.38 胜率: 61.11%
趋势多且增强-L-2 总交易次数: 10 盈利: 19.896828124770245 亏损: -53.27778378887992 最大盈利: 7.05 最大亏损: -30.04 总收益: -33.38 平均盈利: -3.34 typeA: -1.67 胜率: 50.00%
趋势空且增强-R-2 总交易次数: 3 盈利: 9.047859108420402 亏损: -67.38374125996418 最大盈利: 9.05 最大亏损: -37.74 总收益: -58.34 平均盈利: -19.45 typeA: -6.48 胜率: 33.33%
Loaded 3000 15m candles

      ========== 回测结果 ==========
      总交易次数:     58
      盈利次数:       44
      亏损次数:       14
      胜率:          75.86%
      总收益:        148.67 USDT
      期末余额:      1137.07 USDT
      盈亏比:        2.01
      最大单笔盈利:  28.16
      最大单笔亏损:  -25.56
      手续费:       23.220286814065414
      最大连续盈利:  54.96962039380766
      最大连续亏损:  -25.564434122151706
      最大连盈次数:  13
      最大连亏次数:  2
      =============================
    
profit: 137.07036979666896
maxDrawdown 3.7%
startTime: 2025-04-10 00:00:00
趋势空且增强-R-2 总交易次数: 3 盈利: 20.498494437518172 亏损: 0 最大盈利: 12.25 最大亏损: 3.33 总收益: 20.50 平均盈利: 6.83 typeA: 6.83 胜率: 100.00%
趋势多且增强-L-1 总交易次数: 16 盈利: 119.60109757766658 亏损: -23.587493458996878 最大盈利: 28.16 最大亏损: -12.27 总收益: 96.01 平均盈利: 6.00 typeA: 4.88 胜率: 81.25%
趋势多且增强-L-3-1 总交易次数: 10 盈利: 51.88451661358657 亏损: -32.10805126727382 最大盈利: 15.66 最大亏损: -20.06 总收益: 19.78 平均盈利: 1.98 typeA: 1.38 胜率: 70.00%
趋势空且增强-R-1 总交易次数: 14 盈利: 60.156356196720125 亏损: -41.50874528806847 最大盈利: 10.00 最大亏损: -19.04 总收益: 18.65 平均盈利: 1.33 typeA: 1.05 胜率: 78.57%
趋势多且增强-L-2 总交易次数: 6 盈利: 12.106050217571386 亏损: -3.4599286862821232 最大盈利: 6.03 最大亏损: -2.16 总收益: 8.65 平均盈利: 1.44 typeA: 0.96 胜率: 66.67%
趋势空且增强-R-3-1 总交易次数: 9 盈利: 31.726968997353715 亏损: -46.63889554312408 最大盈利: 8.46 最大亏损: -25.56 总收益: -14.91 平均盈利: -1.66 typeA: -1.10 胜率: 66.67%
Loaded 3000 15m candles

      ========== 回测结果 ==========
      总交易次数:     59
      盈利次数:       40
      亏损次数:       19
      胜率:          67.80%
      总收益:        66.42 USDT
      期末余额:      1054.62 USDT
      盈亏比:        1.24
      最大单笔盈利:  30.96
      最大单笔亏损:  -53.52
      手续费:       23.604808557259336
      最大连续盈利:  97.49931778878695
      最大连续亏损:  -79.61509641167572
      最大连盈次数:  6
      最大连亏次数:  3
      =============================
    
profit: 54.624871886748224
maxDrawdown 11.0%
startTime: 2025-05-10 00:00:00
趋势空且增强-R-2 总交易次数: 3 盈利: 33.29336456152079 亏损: 0 最大盈利: 20.23 最大亏损: 2.89 总收益: 33.29 平均盈利: 11.10 typeA: 11.10 胜率: 100.00%
趋势多且增强-L-2 总交易次数: 5 盈利: 36.02171336164979 亏损: -12.23949919575717 最大盈利: 30.96 最大亏损: -12.24 总收益: 23.78 平均盈利: 4.76 typeA: 3.81 胜率: 80.00%
趋势多且增强-L-1 总交易次数: 14 盈利: 69.3308964163158 亏损: -26.381301600238558 最大盈利: 28.16 最大亏损: -11.13 总收益: 42.95 平均盈利: 3.07 typeA: 2.19 胜率: 71.43%
趋势空且增强-R-3-1 总交易次数: 13 盈利: 62.26017021232915 亏损: -66.31951343347406 最大盈利: 13.72 最大亏损: -18.68 总收益: -4.06 平均盈利: -0.31 typeA: -0.22 胜率: 69.23%
趋势空且增强-R-1 总交易次数: 17 盈利: 118.49985989779955 亏损: -127.23501547515247 最大盈利: 25.61 最大亏损: -53.52 总收益: -8.74 平均盈利: -0.51 typeA: -0.33 胜率: 64.71%
趋势多且增强-L-3-1 总交易次数: 7 盈利: 20.591756290854523 亏损: -41.397559149095585 最大盈利: 10.26 最大亏损: -21.19 总收益: -20.81 平均盈利: -2.97 typeA: -1.27 胜率: 42.86%

          ========== 回测结果 ==========
          总交易次数:     3185
    盈利次数:       2088
    亏损次数:       1097
          胜率:          65.56%
          总收益:        10910.19 USDT
          盈亏比:        1.74
    rw:        0.0122
    rl:        0.0134
    carry:        20.79
    最大连续盈利:  4157.953166580367
    最大连续亏损:  -158.5109098058152
    最大连盈次数:  16
    最大连亏次数:  6
          =============================

tradeNumTotal 3185
profitTotal 10269.98857709892
maxLossTotal -145.6
winRateTotal 3539.9100000000008
period month 54
avgRate 65.55
maxDrawdownTotal 21.2
趋势多且增强-L-1 总交易次数: 696 盈利: 9134.82882729793 亏损: -3018.2219776474217 最大盈利: 3372.64 最大亏损: -78.44 总收益: 6116.61 平均盈利: 8.79 typeA: 6.12 胜率: 69.68%
趋势多且增强-L-3-1 总交易次数: 556 盈利: 4166.469110997533 亏损: -2874.5245042600122 最大盈利: 381.24 最大亏损: -120.25 总收益: 1291.94 平均盈利: 2.32 typeA: 1.57 胜率: 67.45%
趋势空且增强-R-1 总交易次数: 929 盈利: 6264.227197385971 亏损: -4240.563027545125 最大盈利: 272.43 最大亏损: -145.44 总收益: 2023.66 平均盈利: 2.18 typeA: 1.41 胜率: 64.69%
趋势空且增强-R-3-1 总交易次数: 523 盈利: 3405.524000923566 亏损: -2579.291609374235 最大盈利: 199.97 最大亏损: -145.60 总收益: 826.23 平均盈利: 1.58 typeA: 1.11 胜率: 70.55%
趋势多且增强-L-2 总交易次数: 302 盈利: 1848.0140164522827 亏损: -1294.7263639597634 最大盈利: 202.51 最大亏损: -88.80 总收益: 553.29 平均盈利: 1.83 typeA: 1.03 胜率: 55.96%
趋势空且增强-R-2 总交易次数: 179 盈利: 796.1644064968273 亏损: -697.7114996684966 最大盈利: 73.01 最大亏损: -55.75 总收益: 98.45 平均盈利: 0.55 typeA: 0.27 胜率: 49.72%





################################################################



Loaded 3000 15m candles
┌─────────┬───────────┬──────────────────────┬─────────────────────┬──────────────────────┬──────────────────────┬──────────────────────┬───────────────────────┬───────────────────────┬─────────┬──────────────────────┬──────────────────────┬──────────────────────┬───────────────────────┬───────────────────────┬───────────────────────┬───────────────────────┐
│ (index) │ direction │   entryMarketType    │       profit        │       entryAdx       │    entryAdxPlusDI    │   entryAdxMinusDI    │     entryEmaFast      │     entryEmaSlow      │  entry  │       exitAdx        │    exitAdxPlusDI     │    exitAdxMinusDI    │      exitEmaFast      │      exitEmaSlow      │       entryTime       │       exitTime        │
├─────────┼───────────┼──────────────────────┼─────────────────────┼──────────────────────┼──────────────────────┼──────────────────────┼───────────────────────┼───────────────────────┼─────────┼──────────────────────┼──────────────────────┼──────────────────────┼───────────────────────┼───────────────────────┼───────────────────────┼───────────────────────┤
│    0    │  'short'  │  '趋势空且增强-R-1'  │ 2.5327868852458453  │ '71.22330692122432'  │ '12.818244539712497' │ '24.928317517908408' │ '0.31808678074753627' │ '0.3233413980870848'  │ 0.31842 │ '24.77322421512623'  │ '14.805880078565984' │ '19.789818154991607' │ '0.31814963692793186' │  '0.321895029619417'  │ '2025-01-01 08:15:00' │ '2025-01-01 13:45:00' │
│    1    │  'short'  │  '趋势空且增强-R-2'  │ -21.309144412099766 │ '32.75191464622651'  │ '19.761690520254895' │ '22.446016548413983' │  '0.315457576567822'  │ '0.3198606882276111'  │ 0.31604 │ '30.882710684783213' │ '34.45749991474591'  │ '15.060243296004245' │ '0.3197462095421025'  │ '0.3195775530421545'  │ '2025-01-01 19:30:00' │ '2025-01-02 03:15:00' │
│    2    │  'long'   │  '趋势多且增强-L-2'  │ 23.876643703166646  │ '39.310474366386316' │ '22.97998598505972'  │ '18.476424881244842' │ '0.33115170425128176' │ '0.32470409704888487' │ 0.33096 │ '18.820186882085746' │ '22.194579198357175' │ '21.434646939834266' │ '0.3387000263501976'  │ '0.3316221708734877'  │ '2025-01-02 14:00:00' │ '2025-01-03 00:45:00' │
│    3    │  'long'   │  '趋势多且增强-L-2'  │ 2.7980163001690217  │ '27.33667269884559'  │ '21.228085442040882' │ '20.239349609162492' │ '0.3910051411320252'  │ '0.38225949912588086' │ 0.39018 │ '24.40605638114023'  │ '22.326112655016736' │ '18.460354044000937' │ '0.39104621492906294' │ '0.3825436091307347'  │ '2025-01-05 09:30:00' │ '2025-01-05 10:00:00' │
│    4    │  'long'   │ '趋势多且增强-L-3-1' │  7.455996654731694  │ '20.724608396546326' │ '17.806836220042996' │ '24.06456897981999'  │ '0.3850421594643346'  │ '0.3837335774156192'  │ 0.38263 │ '16.738188267451875' │ '23.200519785943964' │ '19.70095963798726'  │ '0.38414947740169775' │ '0.3836716324757918'  │ '2025-01-06 15:00:00' │ '2025-01-06 18:00:00' │
│    5    │  'short'  │  '趋势空且增强-R-1'  │ 12.995625035464982  │ '45.16587365032721'  │  '17.2586906703593'  │ '29.508079272043496' │ '0.3516273640294986'  │ '0.36904075141423304' │ 0.35246 │ '24.765363721854026' │ '17.81030252116147'  │ '27.34283707494317'  │ '0.34858826054354636' │ '0.36203532851768966' │ '2025-01-08 11:30:00' │ '2025-01-08 18:00:00' │
│    6    │  'short'  │  '趋势空且增强-R-1'  │  4.519648075986349  │ '36.62383101798801'  │ '19.378575395659077' │ '25.016778585319408' │ '0.3273292026866476'  │ '0.3388949672075848'  │ 0.32848 │ '23.51705520288011'  │ '21.93226969028642'  │ '28.827946894254307' │ '0.3286639741140539'  │ '0.33787610086217734' │ '2025-01-09 23:15:00' │ '2025-01-10 01:15:00' │
│    7    │  'short'  │  '趋势空且增强-R-1'  │  6.043290581037892  │ '27.77518480547191'  │ '21.095979419837903' │ '20.78410498581973'  │ '0.3209697941742395'  │ '0.33263079914307714' │ 0.32201 │ '22.990089449285808' │ '18.507250891824455' │ '21.045535055931705' │ '0.3209324189044542'  │ '0.33207727674465715' │ '2025-01-10 06:30:00' │ '2025-01-10 07:15:00' │
│    8    │  'short'  │  '趋势空且增强-R-1'  │ -23.999811584513473 │ '25.98643060756125'  │ '24.226953148068812' │ '10.426219065698342' │ '0.32584560942033436' │ '0.3298570386189894'  │ 0.32906 │ '40.62271318791077'  │ '28.696729305887793' │ '5.8064200128713965' │  '0.330583127775247'  │ '0.33046318960744686' │ '2025-01-10 13:45:00' │ '2025-01-10 16:15:00' │
│    9    │  'long'   │  '趋势多且增强-L-1'  │ -22.403089220783148 │ '34.34416282135546'  │ '16.65216779101987'  │ '20.529099509501005' │ '0.33418121397439626' │ '0.3316520561192054'  │ 0.33277 │ '34.48663934696316'  │ '12.580375736588577' │ '35.02231447496613'  │ '0.33094747398621194' │ '0.3312935256517933'  │ '2025-01-10 20:15:00' │ '2025-01-10 23:15:00' │
│   10    │  'long'   │  '趋势多且增强-L-2'  │  4.131759643828103  │ '25.73831978238432'  │ '21.749385737525273' │ '21.144257728292544' │ '0.33525002337937704' │  '0.332978370519237'  │ 0.33467 │ '20.66236298752183'  │  '24.7496008662537'  │ '21.05643401747432'  │ '0.3352660006580569'  │ '0.3331214031307981'  │ '2025-01-11 21:30:00' │ '2025-01-11 22:30:00' │
│   11    │  'long'   │  '趋势多且增强-L-1'  │  2.448242980752123  │ '27.565467589395933' │ '22.307086133422814' │ '22.834737494993036' │ '0.34069990788435595' │ '0.33590045560027837' │ 0.33978 │  '20.0857054618791'  │ '23.538335091791286' │ '21.04697647564824'  │  '0.340000149253088'  │ '0.33623104743046583' │ '2025-01-12 08:00:00' │ '2025-01-12 09:45:00' │
│   12    │  'long'   │  '趋势多且增强-L-1'  │ -4.111951624377483  │ '31.90748787413052'  │ '14.617378228511136' │ '23.541302985969168' │ '0.33749842794183893' │ '0.3373082227344788'  │ 0.33736 │ '28.509015468254383' │ '15.624353876150893' │ '22.867464609846575' │ '0.33717323316524594' │ '0.3372470398412816'  │ '2025-01-12 19:30:00' │ '2025-01-12 20:45:00' │
│   13    │  'short'  │  '趋势空且增强-R-1'  │ -45.08156619018027  │  '43.3375267178778'  │ '14.938724239433933' │ '32.311482807686886' │ '0.3209621809451774'  │ '0.3301525795820952'  │ 0.3218  │ '33.959591910399034' │ '30.663373909999667' │ '11.985019932483311' │ '0.3290488181616007'  │ '0.32896414123529194' │ '2025-01-13 22:45:00' │ '2025-01-14 06:30:00' │
│   14    │  'long'   │  '趋势多且增强-L-2'  │ 21.548559409934313  │ '36.63581460641865'  │ '20.762975977515627' │ '16.52752175129679'  │ '0.34743732428550606' │ '0.3382057566633005'  │ 0.34708 │ '24.85779041937409'  │   '22.75470227325'   │ '21.75628827742411'  │ '0.35411404004240926' │ '0.3444994747854811'  │ '2025-01-14 20:00:00' │ '2025-01-15 04:30:00' │
│   15    │  'long'   │  '趋势多且增强-L-2'  │  3.419034359859575  │ '35.16523770497365'  │ '21.165445132265038' │ '19.113469394984897' │ '0.3600678661091399'  │ '0.35071051963914296' │ 0.35914 │ '23.49990616085499'  │ '20.997701422315487' │ '17.035627156252776' │ '0.3599959634263931'  │ '0.3516858701132564'  │ '2025-01-15 13:00:00' │ '2025-01-15 14:45:00' │
│   16    │  'long'   │  '趋势多且增强-L-2'  │ 1.1521559268098924  │ '37.34922382379566'  │ '24.48509171494681'  │ '24.082151630721075' │ '0.3777089285726912'  │ '0.36509237802185346' │ 0.3771  │ '24.786214014528362' │ '24.77925536386762'  │ '21.150786633732118' │ '0.37756070113007434' │ '0.36639626025164895' │ '2025-01-16 09:15:00' │ '2025-01-16 11:00:00' │
│   17    │  'long'   │  '趋势多且增强-L-1'  │  24.63859900307559  │  '25.3000140179757'  │ '10.023758389037873' │ '22.888728115916297' │ '0.3796786576431045'  │ '0.3762327696213216'  │ 0.37716 │ '24.734959231732642' │ '21.936220232331795' │ '15.885391432124594' │ '0.38466361744289945' │ '0.37890364692976003' │ '2025-01-17 08:00:00' │ '2025-01-17 14:00:00' │
│   18    │  'long'   │  '趋势多且增强-L-1'  │  36.2003655584646   │ '34.230150769253726' │ '18.707113389980265' │ '23.52582180344236'  │ '0.4074795230388063'  │ '0.39004170191205795' │ 0.40486 │ '21.714720567752746' │ '25.49494941895307'  │ '18.858394048786238' │ '0.41041102802878177' │ '0.3933559784356836'  │ '2025-01-17 21:45:00' │ '2025-01-18 00:15:00' │
│   19    │  'short'  │  '趋势空且增强-R-2'  │ 11.044631264768123  │ '32.53943470255457'  │ '19.64855895473382'  │ '24.617428592914962' │ '0.3994069703051906'  │ '0.40296789461372956' │ 0.40205 │ '28.680982189783762' │ '16.89923262549346'  │ '23.173155563873156' │ '0.39928632439115586' │ '0.40277670276988303' │ '2025-01-18 19:30:00' │ '2025-01-18 20:15:00' │
│   20    │  'long'   │  '趋势多且增强-L-1'  │ -18.17589897474362  │ '28.67402835886643'  │ '21.143752674955245' │ '15.516201061020913' │ '0.4003514033461965'  │ '0.39942366439933036' │ 0.3999  │ '26.101371039589015' │ '15.817499153001139' │ '26.645135361720744' │ '0.3987400178490505'  │ '0.3991249586960663'  │ '2025-01-19 11:45:00' │ '2025-01-19 12:45:00' │
│   21    │  'short'  │  '趋势空且增强-R-2'  │ 0.1579124115720746  │ '37.17063011405273'  │ '17.757848792708526' │ '19.631257537001083' │ '0.36256226931809454' │ '0.38011315515716326' │ 0.36329 │ '23.409135157292422' │ '16.87188320333522'  │ '18.54368187950145'  │ '0.3631752741116184'  │ '0.3781497561552144'  │ '2025-01-20 11:30:00' │ '2025-01-20 13:30:00' │
│   22    │  'short'  │ '趋势空且增强-R-3-1' │ 20.678295147891447  │ '28.32363168134079'  │ '24.530358834817594' │ '14.227962434956698' │ '0.37405816085306054' │ '0.37770516171804425' │ 0.37798 │ '24.346525082489595' │ '16.960055541925694' │ '28.382127059908264' │  '0.375620805689948'  │ '0.3776660328787501'  │ '2025-01-20 18:00:00' │ '2025-01-20 20:15:00' │
│   23    │  'short'  │  '趋势空且增强-R-1'  │ 0.1198035055082376  │ '35.93980828363533'  │ '17.16044313875118'  │ '25.470100054699564' │ '0.34375288544653215' │ '0.35825171372868403' │ 0.34403 │ '29.287312170207358' │ '17.90794920430544'  │ '22.269559369923428' │ '0.34395082210569716' │ '0.3569614703898917'  │ '2025-01-21 17:00:00' │ '2025-01-21 18:30:00' │
│   24    │  'long'   │  '趋势多且增强-L-1'  │ -13.731924248443923 │ '36.740212312843404' │ '20.672733766439467' │ '23.795999460004175' │ '0.37971277756559046' │ '0.36777592793750924' │ 0.37755 │ '13.390152592099216' │ '21.766998102483456' │ '17.32130314255042'  │ '0.3722136499314696'  │ '0.36889576620564424' │ '2025-01-22 05:15:00' │ '2025-01-22 11:00:00' │
│   25    │  'long'   │ '趋势多且增强-L-3-1' │ -14.792838275739932 │ '15.17993329925699'  │ '13.220488805884989' │ '23.699898478232342' │ '0.3699029139826339'  │ '0.3690102723051999'  │ 0.36723 │ '26.633016133638847' │ '7.778379510866659'  │ '30.13768346811168'  │ '0.3672543251024762'  │ '0.3684744148875525'  │ '2025-01-22 14:45:00' │ '2025-01-22 16:30:00' │
│   26    │  'short'  │  '趋势空且增强-R-2'  │ 1.3042246588827076  │ '26.76912960864292'  │ '18.525977476862963' │ '21.313053782103516' │ '0.3655735310999244'  │ '0.3678269856155093'  │ 0.36571 │ '19.329085439708606' │ '18.60923162481921'  │ '18.99270311772501'  │ '0.3657082619693211'  │ '0.3676517941628548'  │ '2025-01-22 19:00:00' │ '2025-01-22 20:30:00' │
│   27    │  'short'  │  '趋势空且增强-R-2'  │ -2.6879174290941843 │ '31.218879762514977' │ '22.23291206720523'  │ '25.235753955117833' │ '0.34921584838238395' │ '0.3567435520168185'  │ 0.34976 │ '20.949522878596184' │ '24.68095146987493'  │ '25.07283398263022'  │ '0.35213022313231546' │ '0.3560421258271835'  │ '2025-01-23 21:30:00' │ '2025-01-24 01:00:00' │
│   28    │  'short'  │ '趋势空且增强-R-3-1' │ -11.770473115260302 │ '17.709373553933208' │ '24.68040826445895'  │ '15.387315296735077' │ '0.35196226864580643' │ '0.35279681524983436' │ 0.35615 │ '25.902501084797983' │ '30.223398690180666' │ '12.517633669758409' │ '0.3556544698823732'  │ '0.3536276683098175'  │ '2025-01-24 14:30:00' │ '2025-01-24 17:00:00' │
│   29    │  'long'   │  '趋势多且增强-L-1'  │ -24.48248258250751  │ '28.022390451631296' │ '14.409254400748454' │ '15.16755414797616'  │ '0.3605813063877083'  │  '0.356119892338761'  │ 0.36027 │ '31.81201699551503'  │ '10.622783871855692' │ '29.45970278039401'  │ '0.3561760229518367'  │ '0.35638707313096474' │ '2025-01-24 23:15:00' │ '2025-01-25 06:00:00' │
│   30    │  'short'  │  '趋势空且增强-R-2'  │  6.054092769440598  │ '36.90392317615883'  │ '18.956108684739505' │ '20.209886144892828' │ '0.3508089152640517'  │ '0.3544335576339768'  │ 0.35184 │ '24.180591488958587' │ '15.937071146815185' │ '19.934928979956357' │ '0.34979359466178483' │ '0.35323244653252145' │ '2025-01-25 11:15:00' │ '2025-01-25 16:00:00' │
│   31    │  'long'   │  '趋势多且增强-L-1'  │  8.113696219775196  │  '37.5781653219318'  │ '30.619242251251993' │ '17.22432076335335'  │ '0.35251983156207733' │ '0.3522404516987199'  │ 0.35236 │ '18.326612838609535' │ '21.538248205284045' │ '18.414076769189965' │ '0.3546571908955309'  │ '0.3537671122159988'  │ '2025-01-26 01:30:00' │ '2025-01-26 12:00:00' │
│   32    │  'short'  │ '趋势空且增强-R-3-1' │  7.57826480402685   │ '15.31558304455313'  │ '24.021375149318533' │ '13.428706143498905' │ '0.3516557325174908'  │ '0.35269301554067983' │ 0.35362 │ '14.269090133147005' │ '15.950086251142476' │ '25.42709639116251'  │ '0.3522670500070947'  │ '0.3527119845741227'  │ '2025-01-27 02:00:00' │ '2025-01-27 04:45:00' │
│   33    │  'short'  │  '趋势空且增强-R-1'  │ -5.332440550688455  │ '41.007257253530504' │ '24.105535704847465' │ '21.336354735415043' │ '0.31696159075140723' │ '0.3320120860460458'  │ 0.3196  │ '27.15960752065699'  │ '22.518472387234286' │ '23.23218956296911'  │ '0.32192380448291624' │ '0.3307557353951734'  │ '2025-01-27 21:45:00' │ '2025-01-28 00:45:00' │
│   34    │  'long'   │  '趋势多且增强-L-2'  │ 0.6376039734306818  │ '33.590924324377546' │ '22.59993096932884'  │ '17.629325109955744' │ '0.33452572671931613' │  '0.33122641600733'   │ 0.33422 │  '20.0225977148225'  │ '19.656026419774687' │ '18.759035850758632' │ '0.3344715125628844'  │ '0.3316579350660121'  │ '2025-01-28 14:30:00' │ '2025-01-28 16:45:00' │
│   35    │  'short'  │  '趋势空且增强-R-1'  │ -15.35361777668955  │ '26.637708304114426' │ '24.907824425276427' │ '15.18946982713916'  │  '0.325451985417192'  │ '0.3277566550390329'  │ 0.32672 │ '34.21891189964821'  │ '28.121128231156177' │ '10.45466298075515'  │ '0.32815884136897217' │  '0.328070357572753'  │ '2025-01-29 12:45:00' │ '2025-01-29 15:30:00' │
│   36    │  'long'   │  '趋势多且增强-L-2'  │ -1.0817114706240496 │ '33.80639391251322'  │ '23.33009610975396'  │ '21.880533321254674' │ '0.3291816374474915'  │ '0.32833563958334133' │ 0.32884 │ '22.015991253054953' │ '20.46738465831559'  │ '20.147953734277134' │ '0.32853148906155955' │ '0.3282629816974059'  │ '2025-01-29 17:00:00' │ '2025-01-29 19:15:00' │
│   37    │  'long'   │ '趋势多且增强-L-3-1' │ -15.15564306865696  │ '20.43144497822547'  │ '17.275403844001918' │ '23.880061146923214' │ '0.32849221553174307' │ '0.32826380741870204' │ 0.32757 │ '25.64123598986658'  │ '10.028603808347617' │ '31.003089932758158' │  '0.327303828589931'  │ '0.3280168441763936'  │ '2025-01-29 19:45:00' │ '2025-01-29 21:15:00' │
│   38    │  'long'   │  '趋势多且增强-L-1'  │  4.059446161231383  │ '36.707119072273265' │ '22.32654223037921'  │ '14.419569263023394' │ '0.33380811710829245' │ '0.3305705480167242'  │ 0.33331 │ '22.06642385299465'  │ '19.043222236405107' │ '17.608086136250975' │ '0.33390380479344545' │ '0.33106559603597663' │ '2025-01-31 01:15:00' │ '2025-01-31 03:45:00' │
│   39    │  'long'   │  '趋势多且增强-L-1'  │ -11.998563365828703 │ '25.16445309539307'  │ '10.721022579743284' │ '24.67372603347151'  │ '0.3322608924400443'  │ '0.3312965153025424'  │ 0.33133 │ '33.26633072697314'  │ '9.664536711576417'  │ '36.891665402105886' │ '0.3309201353157447'  │ '0.33111575661754117' │ '2025-01-31 08:30:00' │ '2025-01-31 11:00:00' │
│   40    │  'short'  │  '趋势空且增强-R-1'  │ 3.9626891062639973  │ '39.41179897941077'  │ '16.35806509823329'  │ '24.93386771876753'  │ '0.3287715868087479'  │ '0.33040708415085585' │ 0.32918 │ '24.134942409777626' │ '18.56644695522752'  │ '22.15581350973204'  │ '0.3278726761156303'  │ '0.3297589858724802'  │ '2025-01-31 14:30:00' │ '2025-01-31 18:45:00' │
│   41    │  'long'   │  '趋势多且增强-L-2'  │ -27.745418648478857 │ '30.030527520765368' │ '23.830657889536525' │ '22.105007147906175' │ '0.3349697387643135'  │ '0.33163460546454115' │ 0.33429 │ '29.11154362513288'  │ '14.63201434565836'  │ '34.74108594199345'  │ '0.33081214286941785' │ '0.3310898061171586'  │ '2025-02-01 01:30:00' │ '2025-02-01 04:15:00' │
└─────────┴───────────┴──────────────────────┴─────────────────────┴──────────────────────┴──────────────────────┴──────────────────────┴───────────────────────┴───────────────────────┴─────────┴──────────────────────┴──────────────────────┴──────────────────────┴───────────────────────┴───────────────────────┴───────────────────────┴───────────────────────┘

      ========== 回测结果 ==========
      总交易次数:     42
      盈利次数:       25
      亏损次数:       17
      胜率:          59.52%
      总收益:        -61.74 USDT
      期末余额:      929.86 USDT
      盈亏比:        0.78
      最大单笔盈利:  36.20
      最大单笔亏损:  -45.08
      手续费:       16.807226727610217
      最大连续盈利:  98.0033455229121
      最大连续亏损:  -49.19351781455775
      最大连盈次数:  6
      最大连亏次数:  3
      =============================
    
profit: -70.14310839739403
maxDrawdown 11.1%
startTime: 2025-01-01 00:00:00
趋势空且增强-R-3-1 总交易次数: 3 盈利: 28.256559951918298 亏损: -11.770473115260302 最大盈利: 20.68 最大亏损: -11.77 总收益: 16.49 平均盈利: 5.50 typeA: 3.66 胜率: 66.67%
趋势多且增强-L-2 总交易次数: 9 盈利: 57.563773317198226 亏损: -28.827130119102907 最大盈利: 23.88 最大亏损: -27.75 总收益: 28.74 平均盈利: 3.19 typeA: 2.48 胜率: 77.78%
趋势空且增强-R-2 总交易次数: 6 盈利: 18.560861104663502 亏损: -23.99706184119395 最大盈利: 11.04 最大亏损: -21.31 总收益: -5.44 平均盈利: -0.91 typeA: -0.60 胜率: 66.67%
趋势多且增强-L-1 总交易次数: 11 盈利: 75.46034992329888 亏损: -94.90391001668439 最大盈利: 36.20 最大亏损: -24.48 总收益: -19.44 平均盈利: -1.77 typeA: -0.80 胜率: 45.45%
趋势多且增强-L-3-1 总交易次数: 3 盈利: 7.455996654731694 亏损: -29.948481344396892 最大盈利: 7.46 最大亏损: -15.16 总收益: -22.49 平均盈利: -7.50 typeA: -2.50 胜率: 33.33%
趋势空且增强-R-1 总交易次数: 10 盈利: 30.173843189507306 亏损: -89.76743610207176 最大盈利: 13.00 最大亏损: -45.08 总收益: -59.59 平均盈利: -5.96 typeA: -3.58 胜率: 60.00%
Loaded 3000 15m candles
┌─────────┬───────────┬──────────────────────┬──────────────────────┬──────────────────────┬──────────────────────┬──────────────────────┬───────────────────────┬───────────────────────┬─────────┬──────────────────────┬──────────────────────┬──────────────────────┬───────────────────────┬───────────────────────┬───────────────────────┬───────────────────────┐
│ (index) │ direction │   entryMarketType    │        profit        │       entryAdx       │    entryAdxPlusDI    │   entryAdxMinusDI    │     entryEmaFast      │     entryEmaSlow      │  entry  │       exitAdx        │    exitAdxPlusDI     │    exitAdxMinusDI    │      exitEmaFast      │      exitEmaSlow      │       entryTime       │       exitTime        │
├─────────┼───────────┼──────────────────────┼──────────────────────┼──────────────────────┼──────────────────────┼──────────────────────┼───────────────────────┼───────────────────────┼─────────┼──────────────────────┼──────────────────────┼──────────────────────┼───────────────────────┼───────────────────────┼───────────────────────┼───────────────────────┤
│    0    │  'short'  │  '趋势空且增强-R-1'  │ -21.773060331733554  │ '46.01884414555319'  │ '15.934080865327738' │ '25.215891008681194' │ '0.3287832539274405'  │ '0.33220210824131624' │ 0.32918 │ '40.219946148115014' │ '32.98745643301583'  │ '7.706393400751818'  │ '0.33173127853821643' │ '0.3315447592671533'  │ '2025-01-31 14:30:00' │ '2025-01-31 22:00:00' │
│    1    │  'long'   │  '趋势多且增强-L-2'  │ -19.251500194441917  │  '30.3102326285862'  │ '23.824026341785967' │ '22.109803369351003' │ '0.3349700834561046'  │ '0.33252241630469714' │ 0.33429 │ '28.11796533996069'  │ '18.04060167476472'  │ '29.18771836539939'  │ '0.33208344435569853' │ '0.33211222214068165' │ '2025-02-01 01:30:00' │ '2025-02-01 03:30:00' │
│    2    │  'short'  │  '趋势空且增强-R-2'  │  6.102572025811053   │ '28.071531160886202' │ '22.086203130643323' │ '23.532868758185607' │ '0.3288304722970622'  │  '0.331151313221792'  │ 0.33009 │ '23.122649541403554' │ '18.533711065607925' │ '23.205255502290512' │ '0.3287156123228137'  │ '0.3309811429061774'  │ '2025-02-01 06:30:00' │ '2025-02-01 07:30:00' │
│    3    │  'short'  │ '趋势空且增强-R-3-1' │   8.27448213478058   │ '16.006564263069908' │ '22.634797728210337' │ '15.210933855938437' │ '0.3291869307102042'  │ '0.3308134519078707'  │ 0.33165 │ '14.596424283661642' │ '17.86048764757261'  │ '21.00685813912095'  │ '0.3296032136241103'  │ '0.3307711181003183'  │ '2025-02-01 09:30:00' │ '2025-02-01 11:00:00' │
│    4    │  'short'  │  '趋势空且增强-R-1'  │   71.2604279390065   │ '36.46655883038903'  │ '19.29703021311059'  │ '25.899629347531654' │ '0.3249431835291849'  │ '0.32859739875069016' │ 0.32528 │ '24.00847024877746'  │ '18.22644571313671'  │ '22.632808565171263' │ '0.30298248229122526' │  '0.313820523148505'  │ '2025-02-01 19:45:00' │ '2025-02-02 17:30:00' │
│    5    │  'short'  │  '趋势空且增强-R-2'  │  170.47184075600688  │ '31.383288586084028' │ '21.72619900177968'  │ '26.670328529317644' │ '0.2971742969116174'  │ '0.3093025274231068'  │ 0.29841 │ '21.607910979319612' │ '21.736324918062675' │ '22.669758943690997' │ '0.2512475438988515'  │ '0.26598594182134594' │ '2025-02-02 22:00:00' │ '2025-02-03 21:15:00' │
│    6    │  'short'  │ '趋势空且增强-R-3-1' │ -26.157068179290217  │ '27.458147347698862' │ '24.22720876711516'  │ '12.509031130521636' │ '0.2602498997530617'  │ '0.2651231070159689'  │ 0.26973 │ '33.97814779988543'  │ '27.404423855990448' │ '8.422227936071925'  │ '0.26637087185558994' │ '0.26602462190865844' │ '2025-02-04 01:00:00' │ '2025-02-04 03:15:00' │
│    7    │  'long'   │  '趋势多且增强-L-2'  │  -65.69202654270619  │ '33.51258841198367'  │ '22.68970705506109'  │ '17.726959678443503' │ '0.2829971977206055'  │ '0.27294336358489263' │ 0.28181 │ '34.34100609852451'  │ '12.86003165034686'  │ '33.111609001651566' │ '0.27226019206133506' │  '0.27242670004598'   │ '2025-02-04 10:45:00' │ '2025-02-04 15:00:00' │
│    8    │  'short'  │ '趋势空且增强-R-3-1' │  12.659555916799196  │ '25.028981469206133' │ '23.60641579843575'  │ '14.921926689575855' │ '0.2672431729557056'  │ '0.27054878390186965' │ 0.27067 │ '19.890817273103046' │ '19.312690317655797' │ '22.892414072845497' │  '0.269404038322508'  │ '0.2706185652585754'  │ '2025-02-04 19:15:00' │ '2025-02-04 22:00:00' │
│    9    │  'short'  │ '趋势空且增强-R-3-1' │  31.558175182481897  │ '16.916560734329735' │ '24.611264349435903' │ '14.515318951468823' │ '0.27035863367234275' │ '0.27044459025009493' │  0.274  │  '16.3701572084465'  │ '20.12257074489738'  │ '24.232958311080807' │ '0.26996950800523944' │ '0.27036293008739504' │ '2025-02-05 03:30:00' │ '2025-02-05 03:45:00' │
│   10    │  'short'  │ '趋势空且增强-R-3-1' │  11.114394875828623  │ '17.91734673667565'  │ '24.978231193343866' │ '18.793164988738923' │ '0.2662417095478172'  │ '0.2665384752137985'  │ 0.26697 │ '17.228313698297796' │ '18.482723261134858' │ '28.619251048666445' │ '0.26621255534757765' │ '0.2665221019678467'  │ '2025-02-05 22:00:00' │ '2025-02-05 22:45:00' │
│   11    │  'short'  │  '趋势空且增强-R-1'  │  -14.10461323392347  │ '37.27559761718574'  │ '16.49587327023673'  │ '23.706700703017397' │  '0.257251111395977'  │  '0.262553202291403'  │ 0.25752 │ '17.973067024640613' │  '15.9035946772864'  │ '24.314794539424508' │ '0.2625832943500482'  │ '0.2621277888325618'  │ '2025-02-06 08:00:00' │ '2025-02-06 19:15:00' │
│   12    │  'long'   │ '趋势多且增强-L-3-1' │ -20.341509000382942  │ '17.973067024640613' │  '15.9035946772864'  │ '24.314794539424508' │ '0.2625832943500482'  │ '0.2621277888325618'  │ 0.2611  │ '25.139742518589152' │ '10.328912746131028' │ '28.12544712657278'  │ '0.2601771598146648'  │ '0.2615948588086582'  │ '2025-02-06 19:15:00' │ '2025-02-06 23:00:00' │
│   13    │  'short'  │  '趋势空且增强-R-1'  │  6.834373626373562   │ '39.318559401096934' │ '21.340561256044463' │ '27.31389276661152'  │ '0.24935069438703716' │ '0.25729717502122496' │ 0.25025 │ '22.828865246164607' │ '21.815326572690164' │ '26.990013056009065' │ '0.24884115354452843' │ '0.2553208135271388'  │ '2025-02-07 04:45:00' │ '2025-02-07 08:45:00' │
│   14    │  'long'   │ '趋势多且增强-L-3-1' │  -33.17128751974711  │ '25.418032382693593' │ '19.12770722434046'  │ '24.80605193509102'  │ '0.2549069181958343'  │ '0.2539804084061883'  │ 0.2532  │ '26.825604362759567' │ '11.088591206010081' │ '36.43237065725878'  │ '0.2505220889561984'  │ '0.2529726370761634'  │ '2025-02-08 00:00:00' │ '2025-02-08 05:00:00' │
│   15    │  'short'  │  '趋势空且增强-R-2'  │  -3.447798027357207  │ '35.27059837135451'  │ '21.69836686311487'  │ '26.116398733007298' │ '0.24630019120673005' │ '0.25136671909788794' │ 0.24637 │ '21.90326137218156'  │ '22.052289761461914' │  '24.6679944495475'  │ '0.24720050481806494' │ '0.2509928256352114'  │ '2025-02-08 07:45:00' │ '2025-02-08 09:45:00' │
│   16    │  'short'  │ '趋势空且增强-R-3-1' │ -11.626046176046142  │ '20.30943435333533'  │ '23.63778472338778'  │ '13.681642759113844' │ '0.24818156911201097' │ '0.24899990160107402' │ 0.24948 │ '25.096563458784075' │ '22.905850364318976' │ '12.564741145559454' │ '0.25121504903111486' │ '0.24971861215443594' │ '2025-02-08 22:30:00' │ '2025-02-09 04:15:00' │
│   17    │  'long'   │  '趋势多且增强-L-2'  │  2.871520906479606   │ '27.51830963734396'  │ '20.525125808919263' │ '18.69059349655073'  │ '0.2506975784483554'  │ '0.25052740634920817' │ 0.25064 │ '23.502437955404307' │ '19.564265669350398' │ '17.580042669491377' │ '0.25072796793753216' │ '0.2505413027566581'  │ '2025-02-10 18:30:00' │ '2025-02-10 19:15:00' │
│   18    │  'long'   │ '趋势多且增强-L-3-1' │  18.314072708325035  │ '18.514408776151637' │ '16.233970468449748' │ '23.835108121368034' │ '0.25061419963043574' │ '0.25053830139471606' │ 0.24949 │ '17.049256457724695' │ '31.378643031893148' │ '17.12859946357877'  │ '0.25089272481834374' │ '0.25060038740320584' │ '2025-02-10 20:45:00' │ '2025-02-10 21:45:00' │
│   19    │  'long'   │  '趋势多且增强-L-2'  │  -42.74387480580487  │ '43.67589763129219'  │ '21.485468478195834' │ '16.506614977997646' │ '0.26452264975016343' │ '0.2573090291448371'  │ 0.26391 │ '42.37713639475876'  │ '6.789878876681116'  │ '29.054837969804115' │ '0.25800864549788277' │ '0.2580844697738818'  │ '2025-02-11 18:15:00' │ '2025-02-12 02:15:00' │
│   20    │  'short'  │  '趋势空且增强-R-2'  │  5.457728719016368   │ '42.421949404132775' │ '18.020311246531914' │ '21.506950341556703' │ '0.2539745478504769'  │ '0.2568602598711857'  │ 0.25457 │ '24.604604244959432' │ '17.943721802489343' │ '19.209063143940497' │  '0.253373539660069'  │ '0.2559686623964878'  │ '2025-02-12 05:30:00' │ '2025-02-12 10:00:00' │
│   21    │  'short'  │  '趋势空且增强-R-2'  │  4.498874048765292   │ '30.371743787172385' │ '19.800027716332284' │ '23.000437855903755' │ '0.25689237863552217' │ '0.2583723252232523'  │ 0.25756 │ '24.808501281805682' │ '16.08600341865525'  │ '20.638474427842826' │ '0.2564183539706816'  │ '0.2581005735135827'  │ '2025-02-13 23:30:00' │ '2025-02-14 01:15:00' │
│   22    │  'short'  │ '趋势空且增强-R-3-1' │ -17.827394295431525  │ '20.720564005531855' │ '24.489175956778656' │ '17.198471167200694' │ '0.2564196751520598'  │ '0.25791219444224645' │ 0.25874 │ '28.86676457229281'  │ '36.56270817149559'  │ '8.415633176246022'  │ '0.2583945556007785'  │ '0.25811161068467897' │ '2025-02-14 03:00:00' │ '2025-02-14 06:15:00' │
│   23    │  'long'   │  '趋势多且增强-L-2'  │  4.1254871932310575  │ '25.28255704604114'  │ '22.559896829518085' │ '20.64729173255196'  │ '0.26198167767889635' │  '0.259698163353714'  │ 0.26119 │ '18.869030172585585' │ '21.255502196571346' │ '18.35427628581791'  │ '0.26191665498728806' │ '0.2598575489346895'  │ '2025-02-14 13:30:00' │ '2025-02-14 14:45:00' │
│   24    │  'long'   │  '趋势多且增强-L-1'  │  24.83137196373267   │ '43.45237526574768'  │ '23.658166630523358' │ '15.507785159391458' │ '0.2684911874922476'  │ '0.2626780399691862'  │ 0.26801 │ '24.510275976589018' │ '21.780328960660167' │ '21.585968408607332' │ '0.2746428825602327'  │ '0.2678165982525304'  │ '2025-02-14 20:30:00' │ '2025-02-15 05:45:00' │
│   25    │  'long'   │  '趋势多且增强-L-2'  │  5.078851439317289   │ '25.270977240867897' │ '21.386105305855814' │ '19.284072944776028' │ '0.27746875130895715' │ '0.2713004033064141'  │ 0.27652 │  '23.7944111107033'  │ '19.787041836732218' │ '18.04703326888685'  │ '0.27750807813134504' │ '0.2714064286507567'  │ '2025-02-15 14:00:00' │ '2025-02-15 14:15:00' │
│   26    │  'long'   │ '趋势多且增强-L-3-1' │  -16.87735303800713  │ '21.09026902280343'  │ '12.504719292663042' │ '24.221843687532754' │ '0.27560065211487544' │ '0.27392588102868104' │ 0.27337 │ '25.280003469484605' │ '11.882988464084924' │  '30.346661477915'   │ '0.27309317126140153' │ '0.2735677209487513'  │ '2025-02-16 01:00:00' │ '2025-02-16 04:30:00' │
│   27    │  'short'  │  '趋势空且增强-R-2'  │  1.3809660344066532  │ '25.158810163369658' │ '19.385781304690312' │ '23.944244427399422' │ '0.27186672544319646' │  '0.273147598736709'  │ 0.27204 │ '23.999843733027113' │ '19.116609196969403' │ '22.867134647233364' │ '0.2718469773321813'  │ '0.2731231924075549'  │ '2025-02-16 07:15:00' │ '2025-02-16 07:30:00' │
│   28    │  'short'  │  '趋势空且增强-R-2'  │  4.4357479255439145  │ '26.611295526891258' │ '19.926391945803704' │ '21.07520091908917'  │ '0.2662581873759433'  │ '0.26939284107817085' │ 0.26754 │ '23.462110113948103' │ '16.37289452661927'  │ '24.295955329299275' │ '0.2664078141946427'  │ '0.26927993876542533' │ '2025-02-17 05:30:00' │ '2025-02-17 06:15:00' │
│   29    │  'short'  │  '趋势空且增强-R-2'  │ 0.40888026480992834  │ '33.087209187221845' │ '17.19745357291589'  │ '21.918924920082432' │ '0.2624918831305083'  │ '0.2665303672318622'  │ 0.26283 │  '22.4809311182734'  │ '18.841316601535027' │ '21.371384854862992' │ '0.2630025358999451'  │ '0.26623310605312167' │ '2025-02-17 17:00:00' │ '2025-02-17 18:45:00' │
│   30    │  'short'  │  '趋势空且增强-R-1'  │  14.055257220216665  │ '25.44006577726857'  │ '24.052697608962596' │ '11.67418074161028'  │ '0.2648981052990035'  │ '0.26594965351266664' │ 0.26592 │ '24.19732599530009'  │ '20.118498593318705' │ '23.637204861550607' │ '0.2646851741221571'  │ '0.2658890240918307'  │ '2025-02-17 23:15:00' │ '2025-02-17 23:30:00' │
│   31    │  'short'  │  '趋势空且增强-R-2'  │  6.876234140943099   │ '30.859684690185894' │ '19.300649977538434' │ '21.010452312402837' │ '0.2521304470427471'  │ '0.25831356703498587' │ 0.25301 │ '22.393627695492683' │ '18.861227232364975' │ '19.776036016076226' │ '0.25210374991863793' │ '0.25783410147514435' │ '2025-02-18 17:45:00' │ '2025-02-18 19:00:00' │
│   32    │  'short'  │  '趋势空且增强-R-2'  │  4.319765987492363   │ '27.219858900800716' │ '19.62463650945101'  │  '22.6059721230619'  │ '0.24763773829555055' │ '0.25378972550525125' │ 0.24785 │ '24.876832452942942' │  '16.6931108913422'  │ '24.639078170601277' │ '0.24743107044820725' │ '0.2534565351722497'  │ '2025-02-19 04:00:00' │ '2025-02-19 04:45:00' │
│   33    │  'short'  │ '趋势空且增强-R-3-1' │  5.568485087892402   │ '18.34708180157041'  │ '24.778000877653835' │  '14.3151406533189'  │ '0.2514385118079357'  │ '0.2522370478318305'  │ 0.25315 │ '16.954803582448385' │  '14.1328776475578'  │ '24.295040184928745' │ '0.2534089050343984'  │ '0.2527412077415667'  │ '2025-02-19 15:30:00' │ '2025-02-19 22:30:00' │
│   34    │  'long'   │ '趋势多且增强-L-3-1' │  9.174738765942124   │ '16.954803582448385' │  '14.1328776475578'  │ '24.295040184928745' │ '0.2534089050343984'  │ '0.2527412077415667'  │ 0.25169 │ '16.99262250891724'  │ '21.299459128364447' │ '18.224886596416646' │ '0.25296703609780974' │ '0.25268538753572345' │ '2025-02-19 22:30:00' │ '2025-02-20 00:00:00' │
│   35    │  'long'   │ '趋势多且增强-L-3-1' │  5.518325970337453   │ '16.07155204399098'  │ '15.665327560912301' │ '24.62188883168576'  │ '0.25441847263842454' │ '0.25372118403565097' │ 0.25352 │ '15.991538956063312' │ '24.179839832889314' │ '20.534165474685008' │ '0.25421623675524296' │ '0.2537217791669771'  │ '2025-02-20 17:30:00' │ '2025-02-20 18:45:00' │
│   36    │  'short'  │ '趋势空且增强-R-3-1' │  8.789944265641001   │ '16.23364817548727'  │ '24.43733706049744'  │ '15.380576837192809' │ '0.2535327763506432'  │ '0.25365467371238004' │ 0.25478 │ '14.881530260360432' │ '19.301921661756666' │ '21.016089870368074' │ '0.25347448970298436' │ '0.2536375168766364'  │ '2025-02-21 04:15:00' │ '2025-02-21 05:15:00' │
│   37    │  'short'  │ '趋势空且增强-R-3-1' │  5.5109273479031575  │ '16.969301864759018' │ '24.30408862316586'  │ '15.563582855929779' │ '0.2534838587502427'  │ '0.25357173290643736' │ 0.25395 │ '14.174912319180716' │ '17.847165184711464' │ '22.21684527384252'  │ '0.25334452417790104' │ '0.25353635616109094' │ '2025-02-21 08:15:00' │ '2025-02-21 09:15:00' │
│   38    │  'short'  │  '趋势空且增强-R-1'  │ -1.4039598206874169  │ '48.01188740818792'  │ '17.232443635288227' │ '25.969494671836305' │ '0.24085380538215034' │ '0.24910187202651096' │ 0.24092 │ '24.924096009116205' │ '17.98593496334709'  │ '22.176059166661396' │ '0.24146445581699047' │ '0.2478425556893411'  │ '2025-02-22 08:30:00' │ '2025-02-22 11:30:00' │
│   39    │  'short'  │ '趋势空且增强-R-3-1' │ -0.44412985111047404 │ '24.593464720839577' │ '24.326911025566915' │ '15.168575983242183' │ '0.24457948050979625' │ '0.24564423191096327' │ 0.24582 │ '14.10827210407171'  │ '17.018995300836167' │ '27.942311552025508' │ '0.24636348851636442' │ '0.2459756079241732'  │ '2025-02-23 01:00:00' │ '2025-02-23 08:00:00' │
│   40    │  'short'  │  '趋势空且增强-R-1'  │ -0.9352909944863619  │ '29.69355930079346'  │ '20.786083695555707' │ '18.57658771250985'  │ '0.24458282233054515' │ '0.24547100342506745' │ 0.24485 │ '20.297858488511576' │ '20.727112269935983' │ '25.384208867641032' │ '0.24538724688919844' │ '0.24552768172902104' │ '2025-02-23 14:15:00' │ '2025-02-23 18:30:00' │
│   41    │  'short'  │  '趋势空且增强-R-2'  │  1.4939937210839134  │ '25.66781629074192'  │ '19.48756782444132'  │ '21.578753880713933' │ '0.2419482990385796'  │ '0.24398506308100557' │ 0.24208 │ '23.593149858464823' │ '23.254570483068402' │ '24.777876103181715' │ '0.2418056804335978'  │ '0.2438256354266435'  │ '2025-02-24 05:45:00' │ '2025-02-24 06:45:00' │
│   42    │  'short'  │  '趋势空且增强-R-1'  │  110.20747437172894  │ '36.39704239778529'  │ '18.71868599609502'  │ '25.726694630179324' │ '0.2310424281914185'  │ '0.23768765251867338' │ 0.23119 │ '20.982246174714362' │ '21.337851025628833' │ '21.992202351077562' │ '0.2057059131321018'  │ '0.2156175708467995'  │ '2025-02-24 19:45:00' │ '2025-02-25 22:15:00' │
│   43    │  'short'  │  '趋势空且增强-R-1'  │  -1.532077625570788  │ '28.317818100579363' │ '24.92427932727556'  │ '17.170605849186543' │ '0.2097228658426413'  │ '0.21192562376559718' │ 0.21024 │ '18.53170411017195'  │ '19.13211079089705'  │ '23.494994008175073' │ '0.2111563977157155'  │ '0.21171044485323726' │ '2025-02-26 08:15:00' │ '2025-02-26 13:30:00' │
│   44    │  'short'  │ '趋势空且增强-R-3-1' │   8.45159834524248   │ '16.662673056579777' │ '23.73382622119615'  │ '17.711609383456324' │ '0.2110903034937593'  │ '0.2114873181400991'  │ 0.21272 │ '14.935286354629557' │ '18.34213432081546'  │ '22.631149355425375' │ '0.2115261712463678'  │ '0.21155945379179786' │ '2025-02-26 18:00:00' │ '2025-02-26 19:30:00' │
│   45    │  'short'  │  '趋势空且增强-R-1'  │  2.109363332678317   │ '37.35141150206255'  │ '17.025099430701353' │ '23.754537948026023' │ '0.2026406931869544'  │ '0.20823264031874444' │ 0.20356 │ '19.00597146005973'  │ '21.114730356077377' │ '22.854808797279485' │ '0.20341663378500735' │ '0.2072951534889106'  │ '2025-02-27 04:45:00' │ '2025-02-27 08:30:00' │
│   46    │  'short'  │ '趋势空且增强-R-3-1' │  -4.117042982159152  │ '17.932407511615917' │ '24.62643394497132'  │ '14.238249207859946' │ '0.20486322291561498' │ '0.20665492860219534' │ 0.20683 │ '33.535927586410935' │ '25.38342314157217'  │ '12.961169300241142' │ '0.20698669205307413' │ '0.20694774275747146' │ '2025-02-27 13:30:00' │ '2025-02-27 16:15:00' │
│   47    │  'long'   │  '趋势多且增强-L-2'  │   2.62998464786033   │ '34.34439441401184'  │ '20.134501430537167' │ '16.60709661813577'  │ '0.20872534034950974' │ '0.20747562919171628' │ 0.20844 │ '19.29014693140073'  │ '20.441148754739434' │ '15.946200158134102' │ '0.20853227787590192' │ '0.20771552369467536' │ '2025-02-27 20:00:00' │ '2025-02-27 23:45:00' │
│   48    │  'short'  │  '趋势空且增强-R-1'  │  -71.99561454738522  │ '46.064191353179694' │  '15.4308406253136'  │  '21.9573264794891'  │ '0.18811122817458903' │ '0.1990503216161134'  │ 0.18835 │ '42.76192615153479'  │ '27.53704542240465'  │  '8.73988303827597'  │ '0.19709096610657922' │ '0.19680386437991798' │ '2025-02-28 17:45:00' │ '2025-03-01 03:30:00' │
│   49    │  'long'   │  '趋势多且增强-L-1'  │  9.600519531441465   │ '33.68824914230684'  │ '22.32404551467487'  │ '23.04107456166749'  │ '0.2050292316752267'  │ '0.2002740137494607'  │ 0.20403 │ '17.885915117142183' │ '23.61906874453397'  │ '19.07025345896308'  │ '0.20490097959133616' │ '0.2010587618770724'  │ '2025-03-01 14:15:00' │ '2025-03-01 17:15:00' │
│   50    │  'long'   │  '趋势多且增强-L-1'  │   4.89824248725186   │ '30.916772617868716' │ '14.36381801125926'  │ '18.705163522461095' │ '0.20211076842446546' │ '0.20144514390974697' │ 0.20199 │ '17.133475237650288' │  '19.5449864265653'  │ '18.102341245791408' │ '0.20239137087081452' │ '0.2016439078315299'  │ '2025-03-01 23:45:00' │ '2025-03-02 02:45:00' │
└─────────┴───────────┴──────────────────────┴──────────────────────┴──────────────────────┴──────────────────────┴──────────────────────┴───────────────────────┴───────────────────────┴─────────┴──────────────────────┴──────────────────────┴──────────────────────┴───────────────────────┴───────────────────────┴───────────────────────┴───────────────────────┘

      ========== 回测结果 ==========
      总交易次数:     51
      盈利次数:       33
      亏损次数:       18
      胜率:          64.71%
      总收益:        215.44 USDT
      期末余额:      1205.24 USDT
      盈亏比:        1.58
      最大单笔盈利:  170.47
      最大单笔亏损:  -72.00
      手续费:       20.311746741632632
      最大连续盈利:  256.109322855605
      最大连续亏损:  -91.84909472199641
      最大连盈次数:  11
      最大连亏次数:  3
      =============================
    
profit: 205.24253171809755
maxDrawdown 12.0%
startTime: 2025-01-31 00:00:00
趋势空且增强-R-2 总交易次数: 11 盈利: 205.44660362387944 亏损: -3.447798027357207 最大盈利: 170.47 最大亏损: -3.45 总收益: 202.00 平均盈利: 18.36 typeA: 16.69 胜率: 90.91%
趋势多且增强-L-1 总交易次数: 3 盈利: 39.33013398242599 亏损: 0 最大盈利: 24.83 最大亏损: 4.90 总收益: 39.33 平均盈利: 13.11 typeA: 13.11 胜率: 100.00%
趋势空且增强-R-1 总交易次数: 11 盈利: 204.466896490004 亏损: -111.74461655378681 最大盈利: 110.21 最大亏损: -72.00 总收益: 92.72 平均盈利: 8.43 typeA: 3.83 胜率: 45.45%
趋势空且增强-R-3-1 总交易次数: 13 盈利: 91.92756315656933 亏损: -60.17168148403751 最大盈利: 31.56 最大亏损: -26.16 总收益: 31.76 平均盈利: 2.44 typeA: 1.50 胜率: 61.54%
趋势多且增强-L-3-1 总交易次数: 6 盈利: 33.00713744460461 亏损: -70.39014955813718 最大盈利: 18.31 最大亏损: -33.17 总收益: -37.38 平均盈利: -6.23 typeA: -3.12 胜率: 50.00%
趋势多且增强-L-2 总交易次数: 7 盈利: 14.705844186888282 亏损: -127.68740154295298 最大盈利: 5.08 最大亏损: -65.69 总收益: -112.98 平均盈利: -16.14 typeA: -9.22 胜率: 57.14%
Loaded 3000 15m candles
┌─────────┬───────────┬──────────────────────┬──────────────────────┬──────────────────────┬──────────────────────┬──────────────────────┬───────────────────────┬───────────────────────┬─────────┬──────────────────────┬──────────────────────┬──────────────────────┬───────────────────────┬───────────────────────┬───────────────────────┬───────────────────────┐
│ (index) │ direction │   entryMarketType    │        profit        │       entryAdx       │    entryAdxPlusDI    │   entryAdxMinusDI    │     entryEmaFast      │     entryEmaSlow      │  entry  │       exitAdx        │    exitAdxPlusDI     │    exitAdxMinusDI    │      exitEmaFast      │      exitEmaSlow      │       entryTime       │       exitTime        │
├─────────┼───────────┼──────────────────────┼──────────────────────┼──────────────────────┼──────────────────────┼──────────────────────┼───────────────────────┼───────────────────────┼─────────┼──────────────────────┼──────────────────────┼──────────────────────┼───────────────────────┼───────────────────────┼───────────────────────┼───────────────────────┤
│    0    │  'long'   │  '趋势多且增强-L-2'  │  -69.04179593243718  │ '44.03997545422204'  │ '22.906800468130413' │ '18.931889586904738' │ '0.23337170593945267' │ '0.2180719206154515'  │ 0.23208 │ '32.36879429655228'  │ '11.517118721215429' │ '31.39245820344686'  │ '0.2202402124802274'  │  '0.220369554012315'  │ '2025-03-03 09:15:00' │ '2025-03-03 23:00:00' │
│    1    │  'short'  │  '趋势空且增强-R-1'  │  6.172020510695505   │ '27.419559204372234' │ '14.543932684510402' │ '20.042456545368548' │ '0.19306402740084416' │ '0.2042847255259029'  │ 0.19307 │ '27.315469886241548' │ '13.48543927607663'  │ '22.943139326245635' │ '0.19296987144693306' │ '0.20408719020009491' │ '2025-03-04 17:00:00' │ '2025-03-04 17:15:00' │
│    2    │  'short'  │  '趋势空且增强-R-1'  │  2.6501632039790426  │ '26.151486021520633' │ '12.431491487295736' │ '20.021574080610954' │ '0.19292704044619952' │ '0.20355714580062237' │ 0.19301 │ '18.50865559705974'  │  '14.9949013645724'  │ '19.45027661147749'  │ '0.19310435114768404' │ '0.20232475204539058' │ '2025-03-04 18:00:00' │ '2025-03-04 20:00:00' │
│    3    │  'long'   │ '趋势多且增强-L-3-1' │   7.67244094488192   │ '19.849842049887815' │ '15.727429488425754' │ '23.647758499811697' │ '0.19943612861272672' │ '0.19923423111441202' │ 0.19812 │ '16.796055728465316' │ '24.101334127607632' │ '19.943472561965226' │ '0.19878632794594045' │ '0.19908037886660052' │ '2025-03-05 12:30:00' │ '2025-03-05 15:00:00' │
│    4    │  'long'   │  '趋势多且增强-L-2'  │  4.810409844199717   │ '31.089906141020666' │ '22.80230015937327'  │ '18.322701588298997' │ '0.2023783797437908'  │ '0.20020521171445563' │ 0.20154 │ '17.209794328954224' │ '23.12962928534137'  │ '13.830845079370324' │ '0.20064609728482338' │ '0.2001667360565036'  │ '2025-03-05 21:00:00' │ '2025-03-06 01:15:00' │
│    5    │  'long'   │  '趋势多且增强-L-2'  │ 0.09475235849058808  │ '29.850458067572283' │ '21.65227799067061'  │ '16.85528417033173'  │ '0.20366284077178756' │ '0.20146478625470904' │ 0.20352 │ '24.880170779027743' │ '20.362631020526116' │ '17.582227001988954' │ '0.20351745509952157' │ '0.2015350635620995'  │ '2025-03-06 08:15:00' │ '2025-03-06 09:00:00' │
│    6    │  'long'   │  '趋势多且增强-L-2'  │ 0.037448344653942395 │ '45.34736179827942'  │ '24.656601633408666' │ '22.333062755285514' │ '0.21106401609680642' │ '0.20473233091058843' │ 0.21053 │ '24.15853322596968'  │ '23.07963775000824'  │ '18.97789490728582'  │ '0.21029339914550765' │ '0.20560722453085858' │ '2025-03-06 15:30:00' │ '2025-03-06 18:30:00' │
│    7    │  'long'   │  '趋势多且增强-L-1'  │  -26.16066921328749  │ '29.277107342466802' │ '17.014700598994427' │ '23.630265420500077' │ '0.20760323389969423' │ '0.20610314529145415' │ 0.20681 │ '33.012820047907134' │ '10.787856957207378' │ '28.46934497475786'  │ '0.20558148264906906' │ '0.20582222948183135' │ '2025-03-06 23:15:00' │ '2025-03-07 01:30:00' │
│    8    │  'short'  │  '趋势空且增强-R-1'  │  11.287523314027727  │ '29.230750057014333' │ '23.983170093221997' │ '18.669864641818982' │ '0.2022351960955565'  │ '0.20463062615817654' │ 0.20374 │ '20.087084336952753' │ '17.255642185338342' │ '19.195671598375945' │ '0.2022252375969034'  │ '0.20437689702705156' │ '2025-03-07 06:00:00' │ '2025-03-07 07:45:00' │
│    9    │  'long'   │  '趋势多且增强-L-1'  │ -1.0344346801512272  │ '36.075423314231536' │ '25.140472216864897' │  '18.2774628946285'  │ '0.20398473893280858' │ '0.2026021975489356'  │ 0.20369 │ '26.84504625726939'  │ '23.407829921092272' │ '21.670584361699404' │ '0.20292048043698094' │ '0.20246654664309593' │ '2025-03-08 00:00:00' │ '2025-03-08 01:30:00' │
│   10    │  'long'   │ '趋势多且增强-L-3-1' │  -9.703423907634095  │ '18.89189625735641'  │ '17.20312434287974'  │ '24.032433842899202' │ '0.20381996826703996' │ '0.20291924683651666' │ 0.20094 │ '25.060560803404616' │ '16.808351757600065' │ '26.281351559011117' │  '0.200509655401156'  │ '0.20215580077820072' │ '2025-03-08 05:30:00' │ '2025-03-08 08:30:00' │
│   11    │  'short'  │  '趋势空且增强-R-1'  │  2.214969818913522   │  '25.4944499975263'  │ '22.125626769601908' │ '28.25062699753355'  │ '0.19850346601468236' │ '0.2011762718728328'  │ 0.1988  │ '23.660991643489737' │ '21.04369092611841'  │ '27.945318744493953' │ '0.19854449175215538' │ '0.2011013124412117'  │ '2025-03-08 12:30:00' │ '2025-03-08 13:00:00' │
│   12    │  'short'  │  '趋势空且增强-R-1'  │   2.25636224098239   │ '31.449641652688477' │ '13.750598828417116' │ '20.335517018567288' │ '0.19540236859124493' │ '0.19882721574117804' │ 0.19545 │ '24.737221910782697' │ '15.46327374540295'  │ '20.118590908569846' │ '0.19547739222472996' │ '0.1985817902383008'  │ '2025-03-08 21:30:00' │ '2025-03-08 22:45:00' │
│   13    │  'short'  │  '趋势空且增强-R-2'  │  2.9870142081069755  │ '27.725315110839052' │ '18.728048332572882' │ '21.618897180407437' │ '0.19090636979990408' │ '0.19429684562903354' │ 0.19144 │  '23.0416164575978'  │ '18.895052278927064' │ '22.797193744449157' │ '0.19097538325636515' │ '0.19415385841492325' │ '2025-03-09 15:15:00' │ '2025-03-09 16:00:00' │
│   14    │  'short'  │  '趋势空且增强-R-1'  │ -3.4893587033122206  │ '55.759415478254105' │ '13.068078524367078' │  '26.3296830226179'  │ '0.16969460090058336' │ '0.18115980378718435' │ 0.17028 │ '19.81901222889181'  │ '18.62517330456418'  │ '23.17820478544806'  │ '0.1724414882095242'  │ '0.17778247915365264' │ '2025-03-10 08:45:00' │ '2025-03-10 16:30:00' │
│   15    │  'short'  │  '趋势空且增强-R-1'  │  -18.30757251314006  │ '37.93969210445408'  │ '20.143559295094366' │ '25.421125595529507' │ '0.15374744233703364' │ '0.16570255302559833' │ 0.15411 │ '27.311103219495873' │ '16.462787732374288' │ '28.286599517932665' │ '0.1595794247836557'  │ '0.16236195498152725' │ '2025-03-11 10:15:00' │ '2025-03-11 21:00:00' │
│   16    │  'short'  │ '趋势空且增强-R-3-1' │  21.26351931330474   │ '18.172752792381985' │ '23.43048440625576'  │ '15.354798021901617' │ '0.15926818614039362' │ '0.16169712423410051' │ 0.1631  │ '16.77230948759291'  │ '17.935095797097187' │ '20.396398982282314' │ '0.16010728578740885' │ '0.16169094242910925' │ '2025-03-12 00:15:00' │ '2025-03-12 01:45:00' │
│   17    │  'long'   │ '趋势多且增强-L-3-1' │  13.468907462686486  │ '21.11553251908055'  │ '13.284075110554827' │ '24.455005876430636' │ '0.16934357196979088' │ '0.16777234533691335' │ 0.1675  │ '18.965903712265543' │ '23.708929741483214' │ '19.265342096321323' │ '0.16922432515420965' │ '0.16781836282561233' │ '2025-03-13 14:30:00' │ '2025-03-13 15:15:00' │
│   18    │  'long'   │ '趋势多且增强-L-3-1' │  4.250505293551435   │ '18.19555010756202'  │ '15.574912504736886' │ '21.56828404485652'  │ '0.1696652105801789'  │ '0.16855395683915522' │ 0.16624 │ '20.776584888041445' │ '30.007119418999153' │ '14.510739773390636' │ '0.16486275795507035' │ '0.16665321623133184' │ '2025-03-13 21:45:00' │ '2025-03-14 08:30:00' │
│   19    │  'long'   │  '趋势多且增强-L-2'  │  5.746235280123711   │ '25.456256753554477' │ '17.969112969548945' │ '17.36044868245524'  │ '0.16864505248093792' │ '0.16751514534249834' │ 0.16814 │ '23.812941765983958' │ '16.640459518124562' │ '15.844624680955766' │ '0.16868312536701963' │ '0.1675409366862682'  │ '2025-03-14 18:00:00' │ '2025-03-14 18:15:00' │
│   20    │  'long'   │  '趋势多且增强-L-2'  │  4.589880813274055   │ '26.836951788664155' │ '22.873266709164863' │ '20.31673885519865'  │ '0.17158714403015657' │ '0.16895225903138078' │ 0.17116 │ '20.187296917412223' │ '25.665865628265653' │ '17.88715084491278'  │ '0.17148715636764228' │ '0.16916771381714873' │ '2025-03-15 01:30:00' │ '2025-03-15 03:00:00' │
│   21    │  'short'  │  '趋势空且增强-R-1'  │  2.628586578683677   │ '35.407995285979545' │ '24.373964093984036' │ '20.716028156958735' │ '0.1694046471226006'  │ '0.17230325872691188' │ 0.16973 │ '23.578409755889233' │ '21.10468623752843'  │ '22.997720692245792' │ '0.1699139820015809'  │ '0.17204513685968373' │ '2025-03-17 00:45:00' │ '2025-03-17 03:00:00' │
│   22    │  'long'   │  '趋势多且增强-L-2'  │  3.6615668415286566  │ '26.901731995424036' │ '20.48159281590944'  │ '17.936171228161225' │ '0.17385132247291948' │ '0.17236007288110244' │ 0.17347 │ '24.921670562863305' │ '23.025511760922086' │ '14.847516459669524' │ '0.17385614257314738' │ '0.17243062428106468' │ '2025-03-18 04:45:00' │ '2025-03-18 05:30:00' │
│   23    │  'long'   │ '趋势多且增强-L-3-1' │ -27.138458858370626  │ '20.280858172685846' │ '15.207836101151702' │ '24.218925280046054' │ '0.1736177066919459'  │ '0.1726174895063246'  │ 0.17221 │ '30.166050379073017' │ '8.782309582419543'  │ '43.63982783862974'  │ '0.17232396948385856' │ '0.17240332010232057' │ '2025-03-18 08:15:00' │ '2025-03-18 09:30:00' │
│   24    │  'short'  │  '趋势空且增强-R-2'  │  4.248760526627925   │ '29.918456359679006' │ '22.32328987709051'  │ '22.811621190217604' │ '0.16826226090408147' │  '0.170794357529742'  │ 0.16862 │ '24.02816168358283'  │ '21.68490687836385'  │ '23.38457120188012'  │ '0.16826541339963702' │ '0.17063926962642753' │ '2025-03-18 16:15:00' │ '2025-03-18 17:15:00' │
│   25    │  'short'  │  '趋势空且增强-R-1'  │ -3.4899348125111835  │ '29.562949490792466' │ '22.168885120533076' │ '19.72062332699193'  │ '0.16716116965570843' │ '0.1677009994985595'  │ 0.16721 │ '18.91684056670079'  │ '18.354952257155066' │ '18.676698078695736' │ '0.16790959575563313' │ '0.16780448275387774' │ '2025-03-19 10:00:00' │ '2025-03-19 14:30:00' │
│   26    │  'long'   │  '趋势多且增强-L-1'  │  24.26101258413807   │ '39.089505370500916' │ '24.957696435226545' │ '17.736193744700714' │ '0.17121591821093168' │ '0.16902956649064627' │ 0.17085 │ '12.777701560808632' │ '20.746670382984203' │ '20.005155830937685' │ '0.17476463555662974' │ '0.1727792742912065'  │ '2025-03-20 01:00:00' │ '2025-03-20 16:30:00' │
│   27    │  'long'   │ '趋势多且增强-L-3-1' │  5.731460478101513   │ '21.31704468500777'  │ '18.376876638189497' │ '24.26141009141284'  │ '0.17295439197383963' │ '0.1727479427899116'  │ 0.17193 │ '17.843220687111685' │ '20.761407277339117' │ '18.32086742066888'  │ '0.1727421834658989'  │ '0.17271062225714331' │ '2025-03-20 21:00:00' │ '2025-03-20 22:00:00' │
│   28    │  'long'   │ '趋势多且增强-L-3-1' │ -30.952364923684055  │ '17.999572613571065' │ '17.962134267038177' │ '23.59352747094196'  │ '0.17283731054055806' │ '0.17273599860055697' │ 0.17231 │ '26.409110835655703' │  '9.94082667072651'  │ '35.20465498890098'  │ '0.17115096279989617' │ '0.17234961795474285' │ '2025-03-20 23:00:00' │ '2025-03-21 00:45:00' │
│   29    │  'short'  │  '趋势空且增强-R-2'  │  -6.930497476568026  │ '30.404987448940755' │ '16.04329209979643'  │ '17.960315115770914' │ '0.1664334866649059'  │ '0.16883370309381016' │ 0.16644 │ '23.264018912097768' │ '19.64667653502371'  │ '22.28995484037776'  │ '0.16804683874659632' │ '0.16862997554150475' │ '2025-03-22 00:30:00' │ '2025-03-22 06:30:00' │
│   30    │  'short'  │ '趋势空且增强-R-3-1' │  2.467200000000035   │  '16.2601302255905'  │ '22.465909206431977' │ '15.992662917716595' │ '0.16827465307654746' │ '0.16847797638160736' │ 0.16875 │ '16.25611193898489'  │ '17.663561594179285' │ '21.58114639912818'  │ '0.1686583219248211'  │ '0.16855536074073227' │ '2025-03-23 01:45:00' │ '2025-03-23 04:45:00' │
│   31    │  'short'  │ '趋势空且增强-R-3-1' │  3.9531617036422237  │ '20.863107129897617' │ '23.882717249588016' │ '16.484734834162893' │ '0.1679887096894149'  │ '0.16827850877988879' │ 0.16858 │ '17.479676919932515' │ '18.29500984444811'  │ '21.506685847534747' │ '0.16807765483018652' │ '0.16827623436203049' │ '2025-03-23 11:15:00' │ '2025-03-23 12:45:00' │
│   32    │  'long'   │  '趋势多且增强-L-1'  │ -0.5512177985948741  │ '27.879747532174246' │ '17.98618940612925'  │ '21.374338777279462' │ '0.17109211852660314' │ '0.16952769063455456' │ 0.1708  │ '20.68450034982663'  │ '21.43652037450555'  │ '18.97439480774028'  │ '0.17067778869499597' │ '0.16964713601889672' │ '2025-03-24 00:45:00' │ '2025-03-24 03:15:00' │
│   33    │  'long'   │  '趋势多且增强-L-1'  │ -1.8816125006782307  │ '29.594259487085864' │ '23.81980467271668'  │ '24.611301710561943' │ '0.18445123002368183' │ '0.17791795612804256' │ 0.18431 │ '21.984700185519785' │ '25.44776467553646'  │ '23.05984370435138'  │ '0.18383181263283724' │  '0.178454311674053'  │ '2025-03-25 06:30:00' │ '2025-03-25 08:15:00' │
│   34    │  'long'   │  '趋势多且增强-L-1'  │ -24.363900744416938  │ '32.355573342094836' │ '19.62019986573191'  │ '24.654580449728524' │ '0.20169814344055215' │ '0.1934830541110096'  │ 0.2015  │ '19.27761090876217'  │ '20.995797871068195' │ '20.279444301690233' │ '0.19533489247931998' │ '0.19443126837767644' │ '2025-03-26 21:30:00' │ '2025-03-27 10:00:00' │
│   35    │  'long'   │ '趋势多且增强-L-3-1' │ -16.159732234809574  │ '17.983920707738232' │ '14.33123221231351'  │ '24.23744774621082'  │ '0.19539191603718242' │ '0.19535082033657825' │ 0.1942  │ '26.22889708904259'  │ '10.88977343510031'  │ '28.287304921511662' │  '0.193937454377391'  │ '0.1950133839886784'  │ '2025-03-27 20:15:00' │ '2025-03-27 22:00:00' │
│   36    │  'short'  │  '趋势空且增强-R-2'  │  4.435801833350418   │ '25.605487211512077' │  '21.944800468957'   │ '23.359597187792893' │ '0.19382848183635681' │ '0.19495527035839752' │ 0.19418 │ '21.26048529602603'  │ '19.00876117713047'  │ '20.36546639965903'  │ '0.19384936577752598' │ '0.19490818571698984' │ '2025-03-27 22:30:00' │ '2025-03-27 23:15:00' │
│   37    │  'short'  │  '趋势空且增强-R-2'  │  3.141483530824251   │ '25.712940719541496' │ '17.916159649348497' │ '22.752578372925445' │ '0.19147317219651755' │ '0.19397947952473274' │ 0.19157 │ '21.863119403174874' │ '18.26059378358218'  │ '23.712594497065545' │ '0.1914975382592546'  │ '0.19386834413598444' │ '2025-03-28 03:00:00' │ '2025-03-28 03:45:00' │
│   38    │  'short'  │  '趋势空且增强-R-1'  │  2.404543187988244   │ '25.656583245514533' │ '14.092643776276075' │ '21.42634412018452'  │ '0.18048604523972311' │ '0.18614281624722168' │ 0.18049 │ '24.708208388251684' │ '15.685466806190785' │ '20.11765532222719'  │ '0.18045019560589826' │ '0.18604562868774197' │ '2025-03-29 01:00:00' │ '2025-03-29 01:15:00' │
│   39    │  'short'  │  '趋势空且增强-R-2'  │  26.468907952701095  │ '45.195256571242254' │ '20.961550779572498' │  '25.7030837491809'  │ '0.17237727617077175' │ '0.1784673063121903'  │ 0.17252 │ '24.79754932808395'  │ '16.333526214980118' │ '21.877178682170456' │ '0.16853606304210134' │ '0.1742771832114589'  │ '2025-03-29 21:45:00' │ '2025-03-30 06:30:00' │
│   40    │  'short'  │  '趋势空且增强-R-1'  │  10.86093940981308   │ '25.202076097307163' │ '24.211514445732718' │ '12.736638450464996' │ '0.17062727955644194' │ '0.17294305930336165' │ 0.17181 │ '21.96150970012778'  │ '18.937071473914997' │ '22.63812897583116'  │ '0.1706498056399419'  │ '0.17280733844033497' │ '2025-03-30 13:15:00' │ '2025-03-30 14:15:00' │
│   41    │  'short'  │  '趋势空且增强-R-2'  │  7.507020547945273   │  '26.6240521576451'  │ '19.793802384620562' │ '24.292730057472816' │ '0.16350206651069052' │ '0.16721484711042772' │ 0.16352 │ '24.780988522876218' │ '17.236066013816565' │ '23.188270043098992' │ '0.16336448270733395' │ '0.16706895245464454' │ '2025-03-31 18:45:00' │ '2025-03-31 19:15:00' │
│   42    │  'short'  │ '趋势空且增强-R-3-1' │  16.41223563149722   │ '17.891458432925592' │ '24.666803877053223' │ '15.39688420352589'  │ '0.16454620001048964' │ '0.16647780513373647' │ 0.16738 │ '18.074198339901738' │ '16.631406060033438' │ '20.534259978105098' │ '0.16554694366827158' │  '0.16650927926538'   │ '2025-03-31 23:30:00' │ '2025-04-01 01:30:00' │
│   43    │  'short'  │ '趋势空且增强-R-3-1' │ -16.390072870624717  │ '16.741742335845878' │ '23.54816685783817'  │ '16.04205132789291'  │ '0.16609255733521583' │ '0.1663865172605291'  │ 0.16742 │ '26.28241330081146'  │ '34.670022225755154' │ '10.234027619274787' │ '0.16790663871101547' │ '0.16684044964719233' │ '2025-04-01 08:15:00' │ '2025-04-01 13:15:00' │
│   44    │  'long'   │  '趋势多且增强-L-2'  │  1.3206083650190712  │ '37.01574816516233'  │ '22.944720320582885' │ '22.55644337895258'  │ '0.1712366610166071'  │ '0.1682739284496227'  │ 0.17095 │ '21.456859915133236' │ '21.115634970064853' │ '19.217806939791558' │ '0.17101946224251086' │ '0.16861115549923403' │ '2025-04-01 19:00:00' │ '2025-04-01 21:15:00' │
└─────────┴───────────┴──────────────────────┴──────────────────────┴──────────────────────┴──────────────────────┴──────────────────────┴───────────────────────┴───────────────────────┴─────────┴──────────────────────┴──────────────────────┴──────────────────────┴───────────────────────┴───────────────────────┴───────────────────────┴───────────────────────┘

      ========== 回测结果 ==========
      总交易次数:     45
      盈利次数:       30
      亏损次数:       15
      胜率:          66.67%
      总收益:        -46.59 USDT
      期末余额:      944.41 USDT
      盈亏比:        0.82
      最大单笔盈利:  26.47
      最大单笔亏损:  -69.04
      手续费:       17.956739462821297
      最大连续盈利:  71.23093209411958
      最大连续亏损:  -69.04179593243718
      最大连盈次数:  7
      最大连亏次数:  4
      =============================
    
profit: -55.58960504648985
maxDrawdown 11.0%
startTime: 2025-03-02 00:00:00
趋势空且增强-R-2 总交易次数: 7 盈利: 48.788988599555935 亏损: -6.930497476568026 最大盈利: 26.47 最大亏损: -6.93 总收益: 41.86 平均盈利: 5.98 typeA: 5.13 胜率: 85.71%
趋势空且增强-R-3-1 总交易次数: 5 盈利: 44.09611664844422 亏损: -16.390072870624717 最大盈利: 21.26 最大亏损: -16.39 总收益: 27.71 平均盈利: 5.54 typeA: 4.43 胜率: 80.00%
趋势空且增强-R-1 总交易次数: 11 盈利: 40.475108265083186 亏损: -25.286866028963463 最大盈利: 11.29 最大亏损: -18.31 总收益: 15.19 平均盈利: 1.38 typeA: 1.00 胜率: 72.73%
趋势多且增强-L-1 总交易次数: 6 盈利: 24.26101258413807 亏损: -53.99183493712876 最大盈利: 24.26 最大亏损: -26.16 总收益: -29.73 平均盈利: -4.96 typeA: -0.83 胜率: 16.67%
趋势多且增强-L-3-1 总交易次数: 8 盈利: 31.123314179221357 亏损: -83.95397992449836 最大盈利: 13.47 最大亏损: -30.95 总收益: -52.83 平均盈利: -6.60 typeA: -3.30 胜率: 50.00%
趋势多且增强-L-2 总交易次数: 8 盈利: 20.26090184728974 亏损: -69.04179593243718 最大盈利: 5.75 最大亏损: -69.04 总收益: -48.78 平均盈利: -6.10 typeA: -5.34 胜率: 87.50%
Loaded 3000 15m candles
┌─────────┬───────────┬──────────────────────┬──────────────────────┬──────────────────────┬──────────────────────┬──────────────────────┬───────────────────────┬───────────────────────┬─────────┬──────────────────────┬──────────────────────┬──────────────────────┬───────────────────────┬───────────────────────┬───────────────────────┬───────────────────────┐
│ (index) │ direction │   entryMarketType    │        profit        │       entryAdx       │    entryAdxPlusDI    │   entryAdxMinusDI    │     entryEmaFast      │     entryEmaSlow      │  entry  │       exitAdx        │    exitAdxPlusDI     │    exitAdxMinusDI    │      exitEmaFast      │      exitEmaSlow      │       entryTime       │       exitTime        │
├─────────┼───────────┼──────────────────────┼──────────────────────┼──────────────────────┼──────────────────────┼──────────────────────┼───────────────────────┼───────────────────────┼─────────┼──────────────────────┼──────────────────────┼──────────────────────┼───────────────────────┼───────────────────────┼───────────────────────┼───────────────────────┤
│    0    │  'short'  │  '趋势空且增强-R-2'  │  1.0622716346153123  │ '36.52213263205977'  │ '17.667175345361077' │ '21.902145250903626' │ '0.16601053156671514' │ '0.1664761988218685'  │ 0.1664  │  '23.1823288753764'  │ '15.026354847966976' │ '16.369111503909227' │ '0.16640169040105052' │ '0.16652208116571404' │ '2025-04-01 07:30:00' │ '2025-04-01 09:30:00' │
│    1    │  'short'  │ '趋势空且增强-R-3-1' │  -4.021887873902929  │ '20.10049993571648'  │ '18.662910880885075' │ '13.650334828731445' │  '0.166524556674108'  │ '0.16654226761393776' │ 0.16749 │ '25.024448113490344' │ '21.765429285234656' │ '11.991392038901896' │ '0.16734537815454278' │ '0.1667441987795735'  │ '2025-04-01 10:15:00' │ '2025-04-01 12:00:00' │
│    2    │  'long'   │  '趋势多且增强-L-2'  │  1.3206083650190712  │ '37.20260078516092'  │ '22.883401592211428' │ '22.58907264042368'  │  '0.171240767294675'  │ '0.16833081513550108' │ 0.17095 │ '21.54783783487109'  │ '21.08034103629093'  │ '19.23261836253853'  │ '0.17102146021451775' │ '0.1686604128322393'  │ '2025-04-01 19:00:00' │ '2025-04-01 21:15:00' │
│    3    │  'long'   │  '趋势多且增强-L-1'  │  7.815718632958697   │ '26.19814382028185'  │ '19.40485253310191'  │ '12.817439233173662' │ '0.17123251528495634' │ '0.1707935983234758'  │ 0.17088 │ '24.19183808361938'  │ '23.267717056450024' │ '15.03209468274182'  │ '0.17121403669250718' │ '0.17080228822258528' │ '2025-04-02 21:00:00' │ '2025-04-02 21:30:00' │
│    4    │  'long'   │  '趋势多且增强-L-2'  │  6.066883343006371   │ '31.593406199196693' │ '22.988610859996978' │ '18.810460886738646' │ '0.1731561795857641'  │ '0.1714413790066916'  │ 0.1723  │ '23.441593808204154' │ '23.31658120443111'  │ '19.085016491906465' │ '0.1728422550887974'  │ '0.1714952181772147'  │ '2025-04-03 01:15:00' │ '2025-04-03 02:30:00' │
│    5    │  'short'  │  '趋势空且增强-R-2'  │  2.2533207547169902  │  '35.8140315805926'  │ '19.90576326827522'  │ '22.16638091984732'  │ '0.15848793263458097' │ '0.16397952679215272' │  0.159  │ '23.796370450207284' │ '17.384689713121187' │ '18.051182603692283' │ '0.15861251259992606' │ '0.16350799691455595' │ '2025-04-04 02:30:00' │ '2025-04-04 04:00:00' │
│    6    │  'short'  │  '趋势空且增强-R-1'  │ -18.398914451366238  │ '28.827891774639255' │ '24.48982923978889'  │ '21.363952077894954' │ '0.16092015519968608' │ '0.1626875238184465'  │ 0.16213 │ '25.760019223566065' │  '27.9491164103312'  │ '12.734657192167074' │ '0.16299162847616266' │ '0.16281026914333457' │ '2025-04-04 10:00:00' │ '2025-04-04 15:00:00' │
│    7    │  'long'   │  '趋势多且增强-L-2'  │  17.771460014673504  │ '28.30235648596472'  │ '26.059846711612064' │ '22.335467548232273' │ '0.16381034695155317' │ '0.16335398324248215' │ 0.16356 │ '27.961372720442842' │ '30.476226522487632' │ '18.866566202413708' │ '0.16401724333989523' │ '0.16340392001641102' │ '2025-04-04 21:30:00' │ '2025-04-04 21:45:00' │
│    8    │  'long'   │  '趋势多且增强-L-2'  │   2.96800844971255   │ '29.83380274448704'  │ '22.925432695183513' │ '18.935630398447728' │ '0.1704731552515789'  │ '0.16662579634546626' │ 0.17042 │ '24.58925654493122'  │ '25.245051336872436' │ '18.323123938940356' │ '0.17048158913542033' │ '0.16686478623848439' │ '2025-04-05 08:00:00' │ '2025-04-05 09:00:00' │
│    9    │  'long'   │ '趋势多且增强-L-3-1' │  1.1070834323746015  │ '15.178783652628743' │ '16.247506036926104' │ '21.254089420103416' │ '0.16946415550624194' │ '0.16828643660492515' │ 0.16828 │ '16.142840356924093' │ '21.171679595741796' │ '20.69293318243892'  │ '0.16797727900805443' │  '0.168074798921701'  │ '2025-04-05 21:00:00' │ '2025-04-06 02:00:00' │
│   10    │  'short'  │ '趋势空且增强-R-3-1' │ -3.1073856558105857  │ '15.160619434697693' │ '22.40318628530345'  │ '14.617222560481967' │ '0.16800865067525556' │ '0.16805442741816184' │ 0.16857 │ '25.633043465553023' │ '23.26702629904445'  │ '10.949605323763977' │ '0.1685394752740199'  │ '0.16818023473337426' │ '2025-04-06 07:30:00' │ '2025-04-06 09:30:00' │
│   11    │  'long'   │ '趋势多且增强-L-3-1' │  -9.10490764540613   │ '21.63514841702008'  │ '14.707601702164872' │ '23.961709324756804' │ '0.16824848761365033' │ '0.16815212344541616' │ 0.16729 │ '25.573401103549713' │ '9.346677807143765'  │ '30.575683039009203' │ '0.16735369591141439' │ '0.16792208794875652' │ '2025-04-06 11:15:00' │ '2025-04-06 15:00:00' │
│   12    │  'short'  │  '趋势空且增强-R-1'  │  83.98610243805214   │ '61.78402980145925'  │ '17.14082865758479'  │ '25.311944207052882' │ '0.15050870686849513' │ '0.15947383608564242' │ 0.15053 │ '25.159566054462793' │ '18.158407954059594' │ '21.058531655647972' │ '0.13879262813111676' │ '0.14982722769408008' │ '2025-04-07 09:15:00' │ '2025-04-07 19:30:00' │
│   13    │  'short'  │  '趋势空且增强-R-1'  │ -3.3311555737036613  │ '30.044451145474703' │ '23.742131932876926' │ '10.691299300977866' │ '0.14341848357636838' │ '0.1484492118143536'  │ 0.14694 │ '21.90971902078853'  │  '20.7583192799737'  │ '24.472157346489848' │ '0.1488746144701151'  │ '0.14856866399662944' │ '2025-04-07 23:45:00' │ '2025-04-08 08:45:00' │
│   14    │  'long'   │ '趋势多且增强-L-3-1' │  15.653778677462828  │ '21.194140018667277' │ '19.243320356841682' │ '24.437698011809005' │ '0.14882272104933703' │ '0.14856281218715914' │ 0.1482  │  '20.5942415925278'  │ '27.389821503923056' │ '21.17560253487471'  │ '0.14895558866092648' │ '0.14859435485085504' │ '2025-04-08 09:00:00' │ '2025-04-08 09:15:00' │
│   15    │  'long'   │ '趋势多且增强-L-3-1' │  11.683997045195229  │ '18.492258894309682' │ '15.966250266726522' │ '22.509470399581303' │ '0.15038434527979946' │ '0.14936088644268924' │ 0.14891 │ '16.002167446689402' │ '21.418804081774322' │ '18.02750216844978'  │ '0.15032014048406622' │ '0.14939349819879158' │ '2025-04-08 15:00:00' │ '2025-04-08 15:45:00' │
│   16    │  'long'   │ '趋势多且增强-L-3-1' │ -47.695009019843695  │ '22.52177957469755'  │ '13.418620211442153' │ '22.776831838994585' │ '0.15206593313649489' │  '0.150588959374496'  │ 0.14967 │ '32.28189630358089'  │ '8.262166615856755'  │ '39.56422544175719'  │ '0.14990212105862566' │ '0.15021399819832107' │ '2025-04-09 00:00:00' │ '2025-04-09 01:15:00' │
│   17    │  'short'  │ '趋势空且增强-R-3-1' │  1.2403209216209834  │  '20.0544040603613'  │ '23.987763938722086' │ '17.759767558415437' │ '0.14547728218273204' │ '0.1457202497831764'  │ 0.14583 │ '15.060531326846077' │ '19.34055007219083'  │ '19.639048008248835' │ '0.14570158958042945' │ '0.14575435737683926' │ '2025-04-09 22:00:00' │ '2025-04-09 23:30:00' │
│   18    │  'long'   │  '趋势多且增强-L-2'  │  -8.23354676710611   │ '40.387144358400306' │ '23.34033469609254'  │ '22.80790606826483'  │ '0.1595542320447288'  │ '0.15133891762137588' │ 0.1593  │ '24.575137147394095' │ '26.93480501486961'  │  '23.0317406245851'  │ '0.15704953280241282' │ '0.15329650411957957' │ '2025-04-10 08:00:00' │ '2025-04-10 15:00:00' │
│   19    │  'short'  │ '趋势空且增强-R-3-1' │  1.7522446324007461  │ '16.677240308979844' │ '21.785217560997648' │ '13.522901978520663' │ '0.1529654754065142'  │ '0.15364380955374213' │ 0.1537  │ '12.986421034658653' │ '15.388998217928224' │ '18.337589959991544' │ '0.15372145913090793' │ '0.1537546128206581'  │ '2025-04-11 03:45:00' │ '2025-04-11 07:00:00' │
│   20    │  'long'   │  '趋势多且增强-L-2'  │  3.7564211958200326  │ '33.79111480268452'  │ '22.92746970646165'  │ '20.32356028859568'  │ '0.16208000826179272' │ '0.1594711717172819'  │ 0.16173 │ '22.21032932289251'  │ '20.523263602811287' │ '20.169680214542606' │ '0.16210221326003563' │ '0.15975243025942487' │ '2025-04-12 18:30:00' │ '2025-04-12 20:15:00' │
│   21    │  'long'   │  '趋势多且增强-L-2'  │  5.801709919961137   │ '35.87765254017573'  │ '21.826154586692137' │ '18.350457571523467' │ '0.16502477116776135' │ '0.16126863248071405' │ 0.16492 │ '24.197269452856407' │ '22.696917976408766' │ '19.108022254394815' │ '0.16510829777424796' │ '0.1643306551535286'  │ '2025-04-13 01:00:00' │ '2025-04-13 17:15:00' │
│   22    │  'short'  │  '趋势空且增强-R-2'  │  -19.04053574704911  │ '29.96746290869703'  │ '18.60999099107119'  │ '23.499253391969333' │ '0.16342402896928845' │ '0.16417714518551216' │ 0.16351 │ '31.791512133879426' │  '33.4992314459272'  │ '12.661286559513949' │ '0.16448415348273193' │ '0.16435486426908982' │ '2025-04-14 00:45:00' │ '2025-04-14 02:15:00' │
│   23    │  'short'  │ '趋势空且增强-R-3-1' │  6.810888875460719   │ '20.420757623901018' │ '23.449485764660366' │ '17.743847412118484' │ '0.1640613756069596'  │ '0.16415181464960157' │ 0.16549 │ '17.85438759237397'  │ '21.544677955159695' │ '23.822706299866066' │ '0.16542740386520124' │ '0.1646089888914914'  │ '2025-04-14 09:30:00' │ '2025-04-14 14:15:00' │
│   24    │  'long'   │ '趋势多且增强-L-3-1' │  5.851244115669247   │ '16.812634404431407' │ '17.386641739347503' │ '24.880639499223346' │ '0.16482154145963876' │ '0.16454993268247586' │ 0.16357 │ '13.168489668985083' │ '20.525198850932263' │ '18.646612794930356' │ '0.16433354755753238' │ '0.16445892331429793' │ '2025-04-14 16:00:00' │ '2025-04-14 18:15:00' │
│   25    │  'long'   │ '趋势多且增强-L-3-1' │  5.640024338302503   │ '20.058467045756753' │ '13.115567327446904' │ '24.81639650935676'  │ '0.1648185563831161'  │ '0.16462585913335612' │ 0.16435 │ '18.42538459697045'  │ '23.185033524421677' │ '19.83020810549498'  │ '0.16486143265780306' │ '0.16464084467337387' │ '2025-04-14 22:15:00' │ '2025-04-14 22:45:00' │
│   26    │  'short'  │  '趋势空且增强-R-1'  │  2.867330078858544   │ '28.451651298052983' │ '17.592778244280264' │ '24.73587895351905'  │ '0.15916855183742482' │ '0.16202761340124808' │ 0.15978 │ '15.792483919496117' │ '19.706593052597935' │ '22.469698048797117' │ '0.15976384867826057' │ '0.16149650431340856' │ '2025-04-15 09:45:00' │ '2025-04-15 14:15:00' │
│   27    │  'short'  │  '趋势空且增强-R-1'  │  10.001539547116609  │ '31.52289706383933'  │ '16.326665095651965' │ '23.75556681618786'  │ '0.15578037478694334' │ '0.15874612891793105' │ 0.15589 │ '22.279459898499148' │ '15.532890627675293' │ '24.684052867799227' │ '0.15482698912799514' │ '0.15727539820120748' │ '2025-04-16 05:30:00' │ '2025-04-16 12:15:00' │
│   28    │  'short'  │  '趋势空且增强-R-1'  │  5.584508415101708   │ '28.722369379100186' │ '16.766523693272564' │ '23.56839948101084'  │ '0.15377045633622655' │ '0.15631611268382872' │ 0.15389 │ '24.61103922870834'  │ '15.852660773292056' │ '23.250796929185213' │ '0.15336320215132554' │ '0.15576025760692402' │ '2025-04-16 17:00:00' │ '2025-04-16 20:00:00' │
│   29    │  'short'  │  '趋势空且增强-R-1'  │  7.888045025229663   │ '26.149788998444546' │ '21.84288798377336'  │ '13.346853109087595' │ '0.15412959559967754' │ '0.15536859041051446' │ 0.15458 │ '23.865000861345127' │ '20.536826330080725' │ '25.06746585221597'  │ '0.15437429680133738' │ '0.15533156581718358' │ '2025-04-17 00:15:00' │ '2025-04-17 01:30:00' │
│   30    │  'short'  │ '趋势空且增强-R-3-1' │  5.779211930320846   │ '21.63682751682306'  │ '23.544989757374186' │ '18.38557138207664'  │ '0.15388425234508682' │ '0.15505802845384495' │ 0.15557 │ '15.170171724679374' │ '20.555889204764334' │ '22.47594216868394'  │ '0.15509935048016654' │ '0.1552007701198362'  │ '2025-04-17 03:45:00' │ '2025-04-17 07:15:00' │
│   31    │  'long'   │  '趋势多且增强-L-2'  │  2.1085626322878532  │ '25.01408573559914'  │ '20.217071196688522' │ '16.851859438297435' │ '0.15632159730907888' │ '0.15556606978320928' │ 0.15591 │ '20.854729186631072' │ '20.181123224902908' │ '17.280974239891627' │ '0.15624853443335834' │ '0.15558496238424255' │ '2025-04-17 16:45:00' │ '2025-04-17 17:30:00' │
│   32    │  'short'  │  '趋势空且增强-R-1'  │ 0.05818275684037488  │ '27.289126595456004' │ '16.114328931617603' │ '21.819538530653883' │ '0.15492635533388488' │ '0.15571980577263467' │ 0.15496 │ '24.658658905228826' │ '17.345038969583214' │ '19.909845597366683' │ '0.15492683531407941' │  '0.155694929047621'  │ '2025-04-18 12:15:00' │ '2025-04-18 12:45:00' │
│   33    │  'long'   │  '趋势多且增强-L-1'  │  3.1639791772473513  │ '27.551711055910435' │ '18.46388660279593'  │ '21.184295470140068' │ '0.15776376064122022' │ '0.15644583396939005' │ 0.15752 │ '20.41887132515242'  │ '20.86968892768846'  │ '17.618956732968766' │ '0.15766048742315286' │ '0.15657543763966064' │ '2025-04-19 07:15:00' │ '2025-04-19 09:15:00' │
│   34    │  'long'   │  '趋势多且增强-L-2'  │ -0.13703237183535555 │ '29.786200780696095' │ '22.203599219168215' │ '17.42340975721917'  │ '0.15881547824659903' │ '0.15721270466260126' │ 0.15878 │ '23.385492876093764' │ '20.89849074983524'  │ '19.294556110199963' │ '0.15876278095730112' │ '0.15730010929966515' │ '2025-04-19 14:00:00' │ '2025-04-19 15:00:00' │
│   35    │  'long'   │  '趋势多且增强-L-1'  │ -12.267096366508657  │ '27.318612479970305' │ '25.288191800728185' │ '15.695183970714488' │ '0.15836773776863525' │ '0.15785637545771772' │ 0.15825 │ '25.184810744826713' │ '13.28951041356628'  │ '27.38866574585645'  │ '0.15760143057719736' │ '0.15773157064672164' │ '2025-04-20 14:30:00' │ '2025-04-20 16:45:00' │
│   36    │  'long'   │  '趋势多且增强-L-1'  │  7.047171798525521   │ '40.94548556941442'  │ '25.163433508114135' │ '15.952704621946069' │ '0.16144213926391926' │ '0.15847758941855478' │ 0.16141 │ '21.391224544892996' │ '26.724486058537067' │  '21.2414768750246'  │ '0.1613508080040417'  │ '0.15900698286259676' │ '2025-04-21 19:00:00' │ '2025-04-21 22:15:00' │
│   37    │  'short'  │ '趋势空且增强-R-3-1' │ -23.316234498308898  │ '15.679000612659102' │ '23.274262921719966' │  '16.9931464774507'  │ '0.15862821216135217' │ '0.15879175335659923' │ 0.15966 │ '25.190289485216493' │ '29.782235684987604' │ '14.443411359151758' │ '0.1617235783869193'  │ '0.15982911731011373' │ '2025-04-22 08:15:00' │ '2025-04-22 16:30:00' │
│   38    │  'long'   │  '趋势多且增强-L-2'  │  9.948846239183483   │ '43.50143123707104'  │ '22.151892332640262' │ '19.23858132780371'  │ '0.18105889766955766' │ '0.17244229926784055' │ 0.18028 │ '24.975300141738707' │ '23.46287530622011'  │ '18.928623468272523' │ '0.18204924511865092' │ '0.17491265486507776' │ '2025-04-23 15:00:00' │ '2025-04-23 19:30:00' │
│   39    │  'long'   │  '趋势多且增强-L-1'  │  5.257909982174581   │ '30.626280698322887' │ '16.60215460771882'  │ '23.21804350817602'  │ '0.17976629451064827' │ '0.17643092631476268' │ 0.17952 │ '24.85294579804537'  │ '23.18338197178372'  │ '18.47973633938425'  │ '0.17977005441975374' │ '0.1766829777527114'  │ '2025-04-24 01:00:00' │ '2025-04-24 02:15:00' │
│   40    │  'long'   │ '趋势多且增强-L-3-1' │  -5.354484165203072  │ '15.45213068851166'  │ '14.019698465522534' │ '24.781474253764173' │ '0.17852486397077083' │ '0.17731783046407512' │ 0.17651 │ '25.59134372674729'  │ '11.18761038856491'  │ '26.655036716113802' │ '0.17697921403718223' │ '0.17709199657890806' │ '2025-04-24 08:45:00' │ '2025-04-24 11:15:00' │
│   41    │  'short'  │  '趋势空且增强-R-2'  │  5.785430692214818   │ '32.46414483543406'  │  '19.3042143443072'  │  '19.9108963619465'  │ '0.17314244590815556' │ '0.17556861753625425' │ 0.17379 │ '24.64337941365819'  │ '16.38860596635973'  │ '23.23259042993691'  │ '0.17319395725267692' │ '0.1753970005286106'  │ '2025-04-24 18:15:00' │ '2025-04-24 19:30:00' │
│   42    │  'long'   │  '趋势多且增强-L-2'  │  8.499247029951508   │ '27.35148221235221'  │ '22.001227247498726' │ '18.989117069693258' │ '0.17945949665906277' │ '0.1769201199852546'  │ 0.17929 │ '24.727941638488904' │ '24.885531220058738' │ '16.20233897268855'  │ '0.17967199828259467' │ '0.17708497692772063' │ '2025-04-25 05:30:00' │ '2025-04-25 06:15:00' │
│   43    │  'long'   │ '趋势多且增强-L-3-1' │  9.600332281109784   │ '15.20282312833597'  │ '14.829113347686473' │ '22.65502422606641'  │ '0.18156151446826285' │ '0.1806711210343356'  │ 0.18057 │ '12.996184194423806' │ '18.93022734691859'  │ '18.621330853648562' │ '0.1817224363297468'  │ '0.18076130946683674' │ '2025-04-26 05:45:00' │ '2025-04-26 06:45:00' │
│   44    │  'long'   │  '趋势多且增强-L-1'  │  3.843625970664369   │ '40.22502830402351'  │ '33.956847382961726' │ '19.610988936904718' │ '0.18567655131061542' │ '0.18212275001892544' │ 0.18544 │ '24.876736421652154' │ '27.566896200763757' │ '21.03153608827882'  │ '0.1857103620151866'  │ '0.18271196356223052' │ '2025-04-26 11:15:00' │ '2025-04-26 14:00:00' │
│   45    │  'short'  │  '趋势空且增强-R-2'  │   8.11893142385009   │ '28.682107676242953' │ '16.263442579886593' │ '17.698838920411493' │ '0.18107333611028123' │ '0.18222607919650227' │ 0.18155 │ '19.400029873198733' │ '17.918127661755666' │  '19.332091546489'   │ '0.18055247750370046' │ '0.18105460365598128' │ '2025-04-27 06:00:00' │ '2025-04-27 20:00:00' │
│   46    │  'short'  │ '趋势空且增强-R-3-1' │  5.6922755051479115  │ '19.08041594312827'  │ '24.678630337143524' │ '16.444722251804713' │  '0.180645570747964'  │ '0.1810255066220357'  │ 0.18163 │ '20.273294590160617' │ '21.682761956836337' │ '21.695638550406002' │ '0.18103497056632833' │ '0.18108814696380854' │ '2025-04-27 21:30:00' │ '2025-04-27 23:00:00' │
│   47    │  'short'  │ '趋势空且增强-R-3-1' │  8.015987650917864   │ '17.339716717594996' │ '22.81782314824228'  │ '17.176262344558044' │ '0.18043466170262024' │ '0.18082486082580382' │ 0.18139 │ '16.859744294632833' │ '18.451483166263493' │ '29.68586750296053'  │ '0.18092792041243264' │ '0.18091084662695728' │ '2025-04-28 03:30:00' │ '2025-04-28 06:00:00' │
│   48    │  'short'  │  '趋势空且增强-R-2'  │  -18.03867638811002  │ '37.60218588748089'  │ '22.406376559045185' │ '27.164135965914085' │ '0.1778065066831476'  │ '0.17993926129950222' │ 0.1783  │ '31.170362950591162' │  '28.1998441667473'  │ '10.47738224254091'  │ '0.18004577241597636' │ '0.18001451494473664' │ '2025-04-28 11:15:00' │ '2025-04-28 16:30:00' │
│   49    │  'long'   │ '趋势多且增强-L-3-1' │ -20.061739082181898  │ '16.746528295182248' │ '17.363186646849332' │ '23.452826004590428' │ '0.1808323893162495'  │ '0.18029399403731855' │ 0.18021 │ '25.911536785274368' │ '12.593057599917719' │ '31.06405648711072'  │ '0.1795254181722589'  │ '0.18003828609202993' │ '2025-04-28 21:00:00' │ '2025-04-28 23:00:00' │
│   50    │  'short'  │  '趋势空且增强-R-1'  │  -4.429533152909341  │ '29.821034303822888' │ '24.143718505480667' │ '20.05586674344909'  │ '0.17678320730648903' │ '0.17903107105335703' │ 0.17736 │ '16.81643151533677'  │ '18.980155465287726' │  '19.9793706209194'  │ '0.1785234916995278'  │ '0.17886369193051413' │ '2025-04-29 03:00:00' │ '2025-04-29 10:00:00' │
│   51    │  'short'  │  '趋势空且增强-R-2'  │  5.630370154473919   │ '32.77843151930758'  │ '17.716106902704535' │ '21.188347266149176' │ '0.17104205243281984' │ '0.17456424598282927' │ 0.17155 │ '21.74925791784747'  │ '16.018817230424464' │ '21.687342160574737' │ '0.17118335278726565' │ '0.1742292602004934'  │ '2025-05-01 01:30:00' │ '2025-05-01 03:15:00' │
│   52    │  'short'  │ '趋势空且增强-R-3-1' │  -3.809382518043256  │ '23.89024758196705'  │ '23.481962642909437' │ '12.015301397056367' │ '0.17348113272136584' │ '0.17387219298806164' │ 0.17458 │ '28.509159828496124' │ '26.442940406688948' │  '9.44511206261108'  │ '0.1740017533781374'  │ '0.1739466036931529'  │ '2025-05-01 11:00:00' │ '2025-05-01 13:30:00' │
│   53    │  'long'   │  '趋势多且增强-L-1'  │  21.465053188495485  │ '41.91010408892183'  │ '21.108988002104635' │ '22.606162030914348' │ '0.1777116566217901'  │  '0.175269184331441'  │ 0.17767 │ '19.703315701391755' │ '23.66718579319852'  │ '19.873069689243238' │ '0.1808106661340215'  │ '0.17747499022660718' │ '2025-05-01 21:30:00' │ '2025-05-02 05:00:00' │
└─────────┴───────────┴──────────────────────┴──────────────────────┴──────────────────────┴──────────────────────┴──────────────────────┴───────────────────────┴───────────────────────┴─────────┴──────────────────────┴──────────────────────┴──────────────────────┴───────────────────────┴───────────────────────┴───────────────────────┴───────────────────────┘

      ========== 回测结果 ==========
      总交易次数:     54
      盈利次数:       38
      亏损次数:       16
      胜率:          70.37%
      总收益:        118.55 USDT
      期末余额:      1107.75 USDT
      盈亏比:        1.59
      最大单笔盈利:  83.99
      最大单笔亏损:  -47.70
      手续费:       21.597782092722333
      最大连续盈利:  83.98610243805214
      最大连续亏损:  -47.695009019843695
      最大连盈次数:  11
      最大连亏次数:  3
      =============================
    
profit: 107.75110698944354
maxDrawdown 5.7%
startTime: 2025-04-01 00:00:00
趋势空且增强-R-1 总交易次数: 9 盈利: 110.38570826119904 亏损: -26.159603177979243 最大盈利: 83.99 最大亏损: -18.40 总收益: 84.23 平均盈利: 9.36 typeA: 6.24 胜率: 66.67%
趋势多且增强-L-1 总交易次数: 7 盈利: 48.593458750066006 亏损: -12.267096366508657 最大盈利: 21.47 最大亏损: -12.27 总收益: 36.33 平均盈利: 5.19 typeA: 4.45 胜率: 85.71%
趋势多且增强-L-2 总交易次数: 11 盈利: 58.24174718961551 亏损: -8.370579138941466 最大盈利: 17.77 最大亏损: -8.23 总收益: 49.87 平均盈利: 4.53 typeA: 3.71 胜率: 81.82%
趋势空且增强-R-3-1 总交易次数: 10 盈利: 29.290929515869074 亏损: -34.25489054606567 最大盈利: 8.02 最大亏损: -23.32 总收益: -4.96 平均盈利: -0.50 typeA: -0.30 胜率: 60.00%
趋势空且增强-R-2 总交易次数: 7 盈利: 22.85032465987113 亏损: -37.079212135159125 最大盈利: 8.12 最大亏损: -19.04 总收益: -14.23 平均盈利: -2.03 typeA: -1.45 胜率: 71.43%
趋势多且增强-L-3-1 总交易次数: 10 盈利: 49.536459890114195 亏损: -82.2161399126348 最大盈利: 15.65 最大亏损: -47.70 总收益: -32.68 平均盈利: -3.27 typeA: -1.96 胜率: 60.00%
Loaded 3000 15m candles
┌─────────┬───────────┬──────────────────────┬─────────────────────┬──────────────────────┬──────────────────────┬──────────────────────┬───────────────────────┬───────────────────────┬─────────┬──────────────────────┬──────────────────────┬──────────────────────┬───────────────────────┬───────────────────────┬───────────────────────┬───────────────────────┐
│ (index) │ direction │   entryMarketType    │       profit        │       entryAdx       │    entryAdxPlusDI    │   entryAdxMinusDI    │     entryEmaFast      │     entryEmaSlow      │  entry  │       exitAdx        │    exitAdxPlusDI     │    exitAdxMinusDI    │      exitEmaFast      │      exitEmaSlow      │       entryTime       │       exitTime        │
├─────────┼───────────┼──────────────────────┼─────────────────────┼──────────────────────┼──────────────────────┼──────────────────────┼───────────────────────┼───────────────────────┼─────────┼──────────────────────┼──────────────────────┼──────────────────────┼───────────────────────┼───────────────────────┼───────────────────────┼───────────────────────┤
│    0    │  'long'   │  '趋势多且增强-L-1'  │ 21.465053188495485  │ '43.36933128551773'  │ '21.152687514703295' │ '22.571435271271426' │ '0.17770914362236406' │ '0.17376617329219737' │ 0.17767 │ '19.884407705870686' │ '23.671797612961235' │ '19.86932896236493'  │ '0.18081043845175732' │ '0.1765449614817309'  │ '2025-05-01 21:30:00' │ '2025-05-02 05:00:00' │
│    1    │  'long'   │  '趋势多且增强-L-2'  │  5.50997504851679   │ '27.65812563150536'  │ '15.602362390891502' │ '15.444979758404212' │ '0.18111587999573447' │ '0.17965992649087817' │ 0.18035 │ '24.31008869744263'  │ '15.297406615191214' │ '13.566319098833144' │ '0.18115495100228263' │ '0.17971409862205487' │ '2025-05-02 23:15:00' │ '2025-05-02 23:45:00' │
│    2    │  'long'   │ '趋势多且增强-L-3-1' │  7.356983271272162  │ '19.474347751256587' │ '13.83733841081319'  │ '23.463629683245383' │ '0.18116481411779436' │ '0.18010941987501583' │ 0.17993 │ '16.140467205426035' │ '20.324111269461905' │ '19.181309810669145' │ '0.18109231313842597' │ '0.18015694949719688' │ '2025-05-03 03:45:00' │ '2025-05-03 04:45:00' │
│    3    │  'short'  │  '趋势空且增强-R-1'  │ 6.3357427860983755  │ '26.329752957211785' │ '19.072979532786775' │ '18.348571637034123' │ '0.17256652447231396' │ '0.1749535943556037'  │ 0.17293 │ '22.78099703754631'  │ '15.887924292753217' │ '24.20830084575578'  │ '0.17253021132824695' │ '0.17483463371119157' │ '2025-05-05 04:15:00' │ '2025-05-05 05:00:00' │
│    4    │  'short'  │  '趋势空且增强-R-2'  │ 1.8993003731343234  │ '26.27371660815169'  │ '19.80001482021269'  │ '22.119952447001136' │ '0.17151564359247742' │ '0.1741273665167439'  │ 0.17152 │ '24.75750378561123'  │ '19.084959654116208' │ '21.113679275701756' │ '0.17148828639305608' │ '0.17408026546092256' │ '2025-05-05 08:15:00' │ '2025-05-05 08:30:00' │
│    5    │  'short'  │  '趋势空且增强-R-1'  │  9.096843212907638  │ '29.121290430941524' │ '18.219809109536083' │ '33.204286816393754' │ '0.17097078907513646' │ '0.1736384826982432'  │ 0.17106 │ '24.292332310188122' │ '17.704076221229023' │ '22.87703777588504'  │ '0.1702753972082178'  │ '0.1721933285097421'  │ '2025-05-05 10:30:00' │ '2025-05-06 01:00:00' │
│    6    │  'short'  │  '趋势空且增强-R-1'  │  5.009063154744147  │ '40.08717158365855'  │ '22.062895811364054' │ '19.857303276335166' │ '0.16636610168538832' │ '0.16921294641327594' │ 0.16705 │ '24.627105462351466' │ '17.542259860136898' │ '22.429189730219893' │ '0.16650825758082305' │ '0.16886971909555384' │ '2025-05-06 22:15:00' │ '2025-05-07 00:30:00' │
│    7    │  'long'   │  '趋势多且增强-L-2'  │ 1.9585132454195895  │  '33.7314029025161'  │ '26.98656029725061'  │ '22.101827565225115' │ '0.17145402502168658' │ '0.16961500774625998' │ 0.17138 │ '24.39571002250688'  │ '25.68216149380686'  │ '24.437099901452196' │ '0.1714009528437011'  │ '0.16974210504138307' │ '2025-05-07 10:30:00' │ '2025-05-07 11:45:00' │
│    8    │  'long'   │ '趋势多且增强-L-3-1' │ -4.303787967632263  │ '22.89049949340637'  │ '16.057260296920543' │ '22.55355977657026'  │ '0.17141725986008552' │ '0.1711659376323919'  │ 0.17054 │ '25.187266931354237' │ '10.15551400528956'  │ '24.24900425286601'  │ '0.17102023128471217' │ '0.17110134992061568' │ '2025-05-08 02:00:00' │ '2025-05-08 03:45:00' │
│    9    │  'long'   │  '趋势多且增强-L-2'  │  6.827018087855298  │ '36.591506733186314' │ '21.452361499423876' │  '20.9182075095432'  │ '0.19485003561423522' │ '0.1866256326407497'  │ 0.1935  │ '24.773240375817277' │ '20.074696984445282' │ '16.688708558125562' │ '0.19464302711864848' │ '0.1873260358517717'  │ '2025-05-09 11:45:00' │ '2025-05-09 13:15:00' │
│   10    │  'long'   │  '趋势多且增强-L-1'  │  17.91731337403973  │ '30.192511749529316' │ '18.90870536417088'  │  '23.0066254018978'  │ '0.2058845642255105'  │ '0.19520857770674338' │ 0.20308 │ '13.650139057125692' │ '25.30348957484112'  │  '16.2928585573371'  │ '0.2049408582234889'  │ '0.1995611148735645'  │ '2025-05-09 22:15:00' │ '2025-05-10 08:00:00' │
│   11    │  'long'   │  '趋势多且增强-L-1'  │ 28.158976894722695  │ '45.55882138282538'  │ '23.137155193278918' │  '17.7111144928245'  │ '0.22259617032170603' │ '0.20934216641233663' │ 0.22246 │ '28.18981058310397'  │ '26.84094753260336'  │ '11.102985938909798' │ '0.22617747702581745' │ '0.2139219854984214'  │ '2025-05-10 19:45:00' │ '2025-05-11 00:30:00' │
│   12    │  'long'   │  '趋势多且增强-L-1'  │  6.446225435207189  │ '41.18804007754253'  │ '25.785417681939485' │ '20.406691285384625' │ '0.2429351653816386'  │ '0.22596143024535612' │ 0.24069 │ '18.53749568851062'  │ '21.63000984696029'  │ '20.73287294156594'  │ '0.24157107255567603' │ '0.22873427151305809' │ '2025-05-11 09:45:00' │ '2025-05-11 13:00:00' │
│   13    │  'short'  │  '趋势空且增强-R-1'  │  7.879791530944627  │ '39.58591545151588'  │  '17.0616750168843'  │ '23.85737207382508'  │ '0.23024507408938305' │ '0.2347466574820206'  │ 0.23025 │ '24.21803327200483'  │ '18.010815789620633' │ '24.92149180886535'  │ '0.2305176865693321'  │ '0.2342162324318615'  │ '2025-05-13 05:45:00' │ '2025-05-13 08:00:00' │
│   14    │  'short'  │  '趋势空且增强-R-2'  │  -8.53648600463533  │ '34.20910218568104'  │ '18.93741127465843'  │ '23.02175186045813'  │ '0.2233548564305703'  │ '0.23042209889520868' │ 0.22436 │ '20.96602450732423'  │ '17.914224855244964' │ '19.065156727127913' │ '0.2270356557671663'  │ '0.22879978150623234' │ '2025-05-13 14:00:00' │ '2025-05-13 22:30:00' │
│   15    │  'short'  │  '趋势空且增强-R-1'  │ 2.9200153833006084  │ '40.55951325930632'  │ '16.308002738119736' │ '21.62908637202828'  │ '0.23319385594705072' │ '0.23487689192214012' │ 0.23402 │ '24.831415225083408' │  '15.784407277052'   │ '17.284783397844514' │ '0.23348622279261022' │ '0.23475167408362504' │ '2025-05-15 02:30:00' │ '2025-05-15 04:30:00' │
│   16    │  'short'  │  '趋势空且增强-R-1'  │ 11.894210061782843  │ '28.12821079122773'  │ '17.323592660981564' │ '22.405547368708984' │ '0.22656663420839834' │ '0.2312459698606873'  │ 0.2266  │ '21.742848289335893' │ '14.83109908006262'  │ '25.252761396534776' │ '0.22657450545997065' │ '0.23075808082710408' │ '2025-05-15 19:45:00' │ '2025-05-15 21:30:00' │
│   17    │  'short'  │ '趋势空且增强-R-3-1' │ 12.072664451827219  │ '19.935921354208872' │ '24.92181008074461'  │ '14.865908876644426' │ '0.22332778615228363' │ '0.22565834791943581' │ 0.22575 │ '18.756962610049477' │ '17.18654264006164'  │ '22.68093343425657'  │ '0.2250283612537794'  │ '0.22566921507058857' │ '2025-05-16 12:00:00' │ '2025-05-16 16:15:00' │
│   18    │  'short'  │  '趋势空且增强-R-1'  │  19.41713191023535  │ '44.161979156679095' │ '17.108084651924194' │ '25.40796947423199'  │ '0.21899510981846787' │ '0.22359828322669945' │ 0.21924 │  '19.9099395054208'  │ '20.653546832977202' │ '22.26337730569556'  │ '0.21547110798014577' │ '0.21958779604351408' │ '2025-05-17 12:15:00' │ '2025-05-17 23:45:00' │
│   19    │  'long'   │  '趋势多且增强-L-1'  │ -5.801728630993804  │  '47.2779896474565'  │ '25.025179104410597' │ '19.735962080296233' │ '0.23031393875232575' │ '0.22245706896763076' │ 0.23024 │ '27.914513050109637' │ '28.238285185662214' │ '25.17723139907326'  │ '0.22597896828622413' │ '0.22316520949784052' │ '2025-05-19 01:45:00' │ '2025-05-19 06:45:00' │
│   20    │  'short'  │  '趋势空且增强-R-2'  │ -25.975513573000796 │ '28.919156529481757' │ '21.794736522302575' │ '23.286492827981622' │ '0.21695265697918473' │ '0.22061573312688598' │ 0.21808 │ '31.79270181201122'  │ '28.097872247171104' │ '10.00928624012713'  │ '0.22090353817431269' │ '0.22084921551492323' │ '2025-05-19 21:30:00' │ '2025-05-20 02:00:00' │
│   21    │  'long'   │  '趋势多且增强-L-1'  │  2.862514427772459  │ '31.75270959671812'  │ '23.742259036949477' │  '17.9356865258236'  │ '0.2256518644994678'  │ '0.22274448794084692' │ 0.22526 │ '24.63512087270842'  │ '24.77786056726946'  │ '19.08210910419703'  │ '0.22592591005085916' │ '0.22319316305819037' │ '2025-05-20 11:30:00' │ '2025-05-20 13:45:00' │
│   22    │  'long'   │ '趋势多且增强-L-3-1' │ -4.212545093795102  │ '24.089052463648024' │ '15.517402983454783' │ '24.718723578392353' │ '0.2234542208617059'  │ '0.2230865252546648'  │ 0.22176 │ '25.093970401418268' │ '12.676724892215859' │ '26.511202324598475' │ '0.22295242769641685' │ '0.22299408103634016' │ '2025-05-20 17:30:00' │ '2025-05-20 18:15:00' │
│   23    │  'short'  │  '趋势空且增强-R-2'  │ 5.7451971505059465  │ '29.140965426119738' │ '15.549492651456633' │ '16.113214977059926' │ '0.2200273867373054'  │ '0.2220098957687687'  │ 0.22039 │ '24.644114544375928' │ '15.32364387018974'  │ '17.209278508539406' │ '0.21999605110699305' │ '0.2219112084479282'  │ '2025-05-20 23:15:00' │ '2025-05-21 00:00:00' │
│   24    │  'short'  │ '趋势空且增强-R-3-1' │  7.772771898221094  │ '20.73869799689863'  │ '18.22202134228291'  │ '13.040643009991744' │  '0.220259683065699'  │ '0.22178801801149345' │ 0.22205 │ '19.695421779832067' │ '17.665886164380165' │  '18.2660670202722'  │ '0.22058133917055897' │ '0.22177045856660718' │ '2025-05-21 01:30:00' │ '2025-05-21 02:30:00' │
│   25    │  'short'  │ '趋势空且增强-R-3-1' │ -9.395394296425252  │ '20.24019880775468'  │  '23.6044171808911'  │ '14.12051470726865'  │ '0.22141417576470135' │  '0.221825042705618'  │ 0.22407 │ '25.828691400861505' │ '24.30852968997235'  │ '10.008864644306238' │ '0.22268045364141573' │ '0.22208742912433121' │ '2025-05-21 04:15:00' │ '2025-05-21 05:30:00' │
│   26    │  'long'   │  '趋势多且增强-L-1'  │ -1.1669245647968964 │ '29.663772946817488' │ '15.834990909692367' │ '23.780484019895074' │ '0.22897019972330135' │ '0.22519844212560391' │ 0.22748 │ '23.647807451163985' │ '20.382687683914813' │ '16.22637060613981'  │ '0.2269114936744124'  │ '0.22529211943938515' │ '2025-05-21 16:00:00' │ '2025-05-21 19:15:00' │
│   27    │  'long'   │  '趋势多且增强-L-2'  │ 11.347459050818992  │ '40.66334087432828'  │ '21.709888576950423' │ '18.65849100033883'  │  '0.238698539251475'  │ '0.23158851345044681' │ 0.2381  │ '17.66895761839131'  │ '20.465534898716204' │ '17.793931144256202' │ '0.24035400956140457' │ '0.23465487889044553' │ '2025-05-22 13:45:00' │ '2025-05-22 20:15:00' │
│   28    │  'long'   │  '趋势多且增强-L-1'  │ -3.555576223210665  │ '39.59152029028533'  │ '25.85865922903012'  │ '19.272644914789286' │ '0.24733404097323503' │ '0.24067947133720277' │ 0.2473  │ '20.201434815768824' │ '21.24460429902142'  │ '21.120093518434977' │ '0.24568390265983214' │ '0.24192255133631096' │ '2025-05-23 12:15:00' │ '2025-05-23 17:00:00' │
│   29    │  'short'  │  '趋势空且增强-R-2'  │  4.687965791081168  │ '39.310026915755145' │ '17.34695044308707'  │ '22.039302331607875' │ '0.22851503021886407' │ '0.23520054289607129' │ 0.22918 │ '24.580348416279136' │ '17.03855484583104'  │ '24.88639716528023'  │ '0.2287992589664788'  │ '0.2342996907438396'  │ '2025-05-24 11:00:00' │ '2025-05-24 13:30:00' │
│   30    │  'short'  │  '趋势空且增强-R-1'  │ 22.170544642857205  │ '36.824115587726354' │ '16.076422441917106' │ '24.24363779163926'  │ '0.22368418471151072' │ '0.22793663276613912' │  0.224  │ '15.685502486643287' │ '18.03983344924908'  │ '22.594646417360153' │ '0.21926688866254698' │ '0.2222060583253297'  │ '2025-05-25 11:30:00' │ '2025-05-26 05:30:00' │
│   31    │  'long'   │  '趋势多且增强-L-2'  │ -1.5624846140319015 │  '36.6458158864664'  │ '19.030730535005905' │ '16.965060842706013' │ '0.22755415195996923' │ '0.22447658158951103' │ 0.22748 │ '23.890328467339405' │ '20.398024477791523' │ '19.88509034691894'  │ '0.2266751346388857'  │ '0.22495035252452503' │ '2025-05-26 16:30:00' │ '2025-05-26 20:45:00' │
│   32    │  'long'   │  '趋势多且增强-L-1'  │  0.687330818726451  │ '26.632245368426837' │ '13.184875153770722' │ '20.979543325612976' │ '0.22575279905649095' │ '0.22497375773959127' │ 0.22535 │ '16.19045323868034'  │ '22.604223500268066' │ '18.237606397602548' │ '0.22469156297203507' │ '0.22485440487427413' │ '2025-05-26 23:15:00' │ '2025-05-27 04:30:00' │
│   33    │  'short'  │ '趋势空且增强-R-3-1' │  6.02943592914879   │ '16.207048128446353' │ '23.422946625476587' │ '16.814790842019693' │ '0.22482221197418623' │ '0.2248787794000793'  │ 0.22639 │ '14.197978632111662' │ '18.561151544870555' │ '20.23517090014447'  │ '0.22536084465269046' │ '0.22502428690366927' │ '2025-05-27 04:45:00' │ '2025-05-27 07:15:00' │
│   34    │  'long'   │  '趋势多且增强-L-2'  │  7.799103217865379  │ '25.869263218307132' │ '22.189301988815767' │ '19.506226717823647' │ '0.22828217577373247' │ '0.22611944963578043' │ 0.22748 │ '15.217701657036542' │ '18.907275385283338' │ '18.307205607816947' │ '0.22829245067488566' │ '0.22645239954365282' │ '2025-05-27 22:15:00' │ '2025-05-28 01:00:00' │
│   35    │  'long'   │ '趋势多且增强-L-3-1' │ -7.699382280268297  │ '15.919790083470291' │  '13.2992671422749'  │ '20.932727809110734' │ '0.22791583959138628' │ '0.22680157851489868' │ 0.22664 │ '26.424224160007814' │ '11.838879470602905' │ '26.234899926470245' │  '0.226550567452383'  │ '0.2266110707828294'  │ '2025-05-28 05:15:00' │ '2025-05-28 08:00:00' │
│   36    │  'short'  │  '趋势空且增强-R-1'  │ 16.763190954773894  │ '39.192102247585545' │ '15.498173935483905' │ '23.434071843714104' │  '0.22284640532808'   │ '0.22498049993853209' │ 0.22288 │ '23.89044145983435'  │ '18.805636723914173' │ '22.376920703128665' │ '0.21911700930725317' │ '0.22216599511779206' │ '2025-05-28 19:00:00' │ '2025-05-29 06:45:00' │
│   37    │  'long'   │  '趋势多且增强-L-2'  │ 3.3734262610016312  │ '33.12257681314789'  │ '24.640504472794742' │ '20.376120188578884' │ '0.22391206755436086' │ '0.22277633866231392' │ 0.22383 │ '24.45042468633611'  │ '23.699651507285694' │ '21.57791298251805'  │ '0.22413507495074433' │ '0.22291318505599078' │ '2025-05-29 12:30:00' │ '2025-05-29 13:45:00' │
│   38    │  'long'   │ '趋势多且增强-L-3-1' │ -21.191413734443547 │ '17.369144199972663' │ '12.731562556959934' │ '22.795179018499507' │ '0.22439419942187405' │ '0.22356675754389183' │ 0.22338 │ '27.12815883308238'  │ '7.372381635892485'  │ '37.50855426401047'  │ '0.22329158955260603' │ '0.22337292115235227' │ '2025-05-29 21:15:00' │ '2025-05-29 22:15:00' │
│   39    │  'short'  │  '趋势空且增强-R-2'  │ 15.225970149253715  │ '33.86467602743244'  │ '15.465170368404234' │ '17.98149790803186'  │ '0.22081196920133261' │ '0.22261625937138504' │ 0.2211  │ '24.55552695758971'  │ '17.925123070440087' │ '23.148966716895945' │ '0.21842031595609637' │ '0.2213496847235409'  │ '2025-05-30 02:00:00' │ '2025-05-30 06:30:00' │
│   40    │  'short'  │  '趋势空且增强-R-1'  │  25.60878005950924  │ '39.743174282302974' │ '15.718997600317813' │ '23.040124666821303' │ '0.2049238949343726'  │ '0.21261095816340336' │ 0.20501 │ '24.347383534176775' │ '15.84536384743037'  │ '21.72809321580106'  │ '0.20017941329935285' │ '0.20746475574188897' │ '2025-05-30 20:30:00' │ '2025-05-31 05:00:00' │
└─────────┴───────────┴──────────────────────┴─────────────────────┴──────────────────────┴──────────────────────┴──────────────────────┴───────────────────────┴───────────────────────┴─────────┴──────────────────────┴──────────────────────┴──────────────────────┴───────────────────────┴───────────────────────┴───────────────────────┴───────────────────────┘

      ========== 回测结果 ==========
      总交易次数:     41
      盈利次数:       30
      亏损次数:       11
      胜率:          73.17%
      总收益:        208.84 USDT
      期末余额:      1200.44 USDT
      盈亏比:        3.24
      最大单笔盈利:  28.16
      最大单笔亏损:  -25.98
      手续费:       16.587167645706938
      最大连续盈利:  67.22932532276954
      最大连续亏损:  -31.7772422039946
      最大连盈次数:  8
      最大连亏次数:  2
      =============================
    
profit: 200.43727477880384
maxDrawdown 2.9%
startTime: 2025-05-01 00:00:00
趋势空且增强-R-1 总交易次数: 10 盈利: 127.09531369715393 亏损: 0 最大盈利: 25.61 最大亏损: 2.92 总收益: 127.10 平均盈利: 12.71 typeA: 12.71 胜率: 100.00%
趋势多且增强-L-1 总交易次数: 9 盈利: 77.537414138964 亏损: -10.524229419001365 最大盈利: 28.16 最大亏损: -5.80 总收益: 67.01 平均盈利: 7.45 typeA: 4.96 胜率: 66.67%
趋势多且增强-L-2 总交易次数: 7 盈利: 36.815494911477685 亏损: -1.5624846140319015 最大盈利: 11.35 最大亏损: -1.56 总收益: 35.25 平均盈利: 5.04 typeA: 4.32 胜率: 85.71%
趋势空且增强-R-3-1 总交易次数: 4 盈利: 25.874872279197103 亏损: -9.395394296425252 最大盈利: 12.07 最大亏损: -9.40 总收益: 16.48 平均盈利: 4.12 typeA: 3.09 胜率: 75.00%
趋势空且增强-R-2 总交易次数: 6 盈利: 27.558433463975152 亏损: -34.511999577636125 最大盈利: 15.23 最大亏损: -25.98 总收益: -6.95 平均盈利: -1.16 typeA: -0.77 胜率: 66.67%
趋势多且增强-L-3-1 总交易次数: 5 盈利: 7.356983271272162 亏损: -37.40712907613921 最大盈利: 7.36 最大亏损: -21.19 总收益: -30.05 平均盈利: -6.01 typeA: -1.20 胜率: 20.00%
Loaded 3000 15m candles
┌─────────┬───────────┬──────────────────────┬─────────────────────┬──────────────────────┬──────────────────────┬──────────────────────┬───────────────────────┬───────────────────────┬─────────┬──────────────────────┬──────────────────────┬──────────────────────┬───────────────────────┬───────────────────────┬───────────────────────┬───────────────────────┐
│ (index) │ direction │   entryMarketType    │       profit        │       entryAdx       │    entryAdxPlusDI    │   entryAdxMinusDI    │     entryEmaFast      │     entryEmaSlow      │  entry  │       exitAdx        │    exitAdxPlusDI     │    exitAdxMinusDI    │      exitEmaFast      │      exitEmaSlow      │       entryTime       │       exitTime        │
├─────────┼───────────┼──────────────────────┼─────────────────────┼──────────────────────┼──────────────────────┼──────────────────────┼───────────────────────┼───────────────────────┼─────────┼──────────────────────┼──────────────────────┼──────────────────────┼───────────────────────┼───────────────────────┼───────────────────────┼───────────────────────┤
│    0    │  'short'  │  '趋势空且增强-R-1'  │ -10.58728342075976  │ '33.43162877823283'  │ '19.426980218666188' │ '19.32070479907186'  │ '0.18807080272760732' │ '0.19397557332157578' │ 0.18873 │ '19.760460054220605' │ '20.31291729726674'  │ '23.003144077443544' │ '0.19089490989038474' │ '0.19249233981848407' │ '2025-05-31 20:00:00' │ '2025-06-01 13:45:00' │
│    1    │  'short'  │  '趋势空且增强-R-2'  │ -18.34613153314698  │ '32.538020081695926' │ '17.425712691943303' │ '22.39843700707787'  │ '0.18909480413529753' │ '0.19140493446541454' │ 0.18961 │ '32.714443526834174' │ '24.938730603284068' │ '11.997012124548428' │ '0.1913650949806169'  │ '0.19130700973511058' │ '2025-06-01 19:30:00' │ '2025-06-02 01:15:00' │
│    2    │  'long'   │ '趋势多且增强-L-3-1' │  5.306372934697211  │ '19.066933207931307' │ '19.099930726594167' │  '24.9702206242667'  │ '0.19187176870082076' │ '0.19170940559415978' │ 0.19065 │ '15.037303882268656' │ '18.53626876389784'  │ '18.00938616783206'  │ '0.19126038781718382' │ '0.19154771384954458' │ '2025-06-02 11:30:00' │ '2025-06-02 14:45:00' │
│    3    │  'short'  │ '趋势空且增强-R-3-1' │ 12.026111833550019  │ '15.09057742324416'  │ '22.001044828042836' │ '15.167096671428672' │ '0.19144228311049985' │ '0.19157764223674711' │ 0.19225 │ '13.263719908061098' │ '16.387033230320544' │ '23.647896563962487' │ '0.19145000925260233' │ '0.19157516844868264' │ '2025-06-02 15:15:00' │ '2025-06-02 17:00:00' │
│    4    │  'short'  │ '趋势空且增强-R-3-1' │  13.72280902976907  │ '15.096530689238595' │ '24.417182084649244' │  '15.1974049177227'  │ '0.19075219568763296' │ '0.19114042190308198' │ 0.19181 │ '17.824576715021674' │ '17.133244116599126' │ '22.165940820876717' │ '0.1910298526112682'  │ '0.19116320134515574' │ '2025-06-02 23:45:00' │ '2025-06-03 03:30:00' │
│    5    │  'short'  │ '趋势空且增强-R-3-1' │ -14.207382340691368 │ '17.556826528105006' │ '24.985993220416095' │ '17.181310593916212' │ '0.19115385767513493' │ '0.19118228129187023' │ 0.19208 │ '25.484711405893577' │ '31.262836758035803' │ '12.496583181320213' │ '0.19261034259250392' │ '0.19154086815641314' │ '2025-06-03 04:15:00' │ '2025-06-03 06:45:00' │
│    6    │  'long'   │  '趋势多且增强-L-2'  │ 0.4135310662235182  │ '42.40137279549782'  │ '25.885648560887656' │ '22.64329379147349'  │ '0.19599096103996191' │ '0.19282956743505208' │ 0.19555 │ '23.660069754525068' │ '21.806380794555768' │ '21.497457608389368' │ '0.19556993567644398' │ '0.19318316857451406' │ '2025-06-03 11:00:00' │ '2025-06-03 13:30:00' │
│    7    │  'short'  │  '趋势空且增强-R-1'  │ 1.1204309024660728  │ '37.692990970720984' │ '17.875732785007646' │ '25.96866496994502'  │ '0.1890396965311666'  │ '0.19212510516297648' │ 0.18937 │ '17.52416778270321'  │ '18.07079752808316'  │ '23.16039951353252'  │ '0.18956562311840056' │ '0.19153818653815521' │ '2025-06-05 09:00:00' │ '2025-06-05 13:15:00' │
│    8    │  'short'  │  '趋势空且增强-R-1'  │ -53.522361940082206 │  '53.4534641018472'  │ '14.811640920787339' │ '26.920364832758466' │ '0.17243288078650307' │ '0.18189755766445265' │ 0.17257 │ '59.37791818154117'  │ '30.938295567443696' │ '7.325013286801658'  │ '0.17955723431971887' │ '0.17948414994903725' │ '2025-06-06 10:45:00' │ '2025-06-06 23:45:00' │
│    9    │  'short'  │ '趋势空且增强-R-3-1' │ -16.015199599131503 │ '18.050540879757953' │ '24.37209172156034'  │ '17.673189324339855' │ '0.17946129677386197' │ '0.17948535011417877' │ 0.17961 │ '26.50510719853667'  │ '31.826846953185786' │ '11.369805627935062' │ '0.1802929950959963'  │ '0.1796773537333222'  │ '2025-06-07 10:00:00' │ '2025-06-07 11:45:00' │
│   10    │  'long'   │  '趋势多且增强-L-1'  │ -10.134099575702189 │ '35.24942473321702'  │ '19.89114748669896'  │ '12.317691898088079' │ '0.18631311434985612' │ '0.18288172162806696' │ 0.18619 │ '23.74337920042808'  │ '22.254351217717403' │ '17.399160418152224' │ '0.18405650120722145' │ '0.18303186009263175' │ '2025-06-08 00:00:00' │ '2025-06-08 05:00:00' │
│   11    │  'long'   │  '趋势多且增强-L-2'  │ 0.3960867208672032  │ '25.117030737983303' │ '24.817851515773516' │ '20.663356953667027' │ '0.18456869833787543' │ '0.18330183248269954' │ 0.1845  │ '23.975423531435677' │ '23.82464081738997'  │ '19.836409174651735' │ '0.1845718753888081'  │ '0.18332259704646622' │ '2025-06-08 07:15:00' │ '2025-06-08 07:30:00' │
│   12    │  'long'   │ '趋势多且增强-L-3-1' │ -8.294218040588639  │ '15.034874228074145' │ '12.640733976274515' │ '19.504243918026187' │ '0.1835818048606256'  │ '0.18347599682332436' │ 0.18281 │  '26.382149183201'   │ '10.458792737152487' │ '30.77477487119643'  │ '0.18286878114340746' │ '0.18331913335789488' │ '2025-06-08 16:45:00' │ '2025-06-08 18:00:00' │
│   13    │  'short'  │  '趋势空且增强-R-2'  │ 0.29260151034260007 │ '26.42313970177043'  │ '20.227291074640522' │ '23.24017674003645'  │ '0.18266229003850346' │ '0.18324225400196592' │ 0.18274 │ '20.749569569481572' │ '20.37787036510839'  │ '23.388139115295616' │ '0.1829253589251886'  │ '0.1832553598231476'  │ '2025-06-08 19:00:00' │ '2025-06-08 20:30:00' │
│   14    │  'long'   │  '趋势多且增强-L-2'  │ -11.129141187293802 │ '36.877780516319106' │ '24.04664549815832'  │ '19.054933036782057' │ '0.1853525594621665'  │ '0.18406159396636815' │ 0.18479 │ '25.120424447383332' │ '12.283036679458075' │ '22.370391652006834' │ '0.18387293110357578' │ '0.18393841183523624' │ '2025-06-09 06:00:00' │ '2025-06-09 10:15:00' │
│   15    │  'short'  │  '趋势空且增强-R-1'  │ -20.02605974083023  │ '25.918884224174768' │ '24.876707561885922' │ '23.80860063595363'  │ '0.1816697606839623'  │ '0.18308186828417847' │ 0.18212 │ '30.410868271719647' │ '31.43099204610357'  │ '16.649769223336186' │ '0.18333546089306565' │ '0.1833029485098864'  │ '2025-06-09 16:45:00' │ '2025-06-09 19:00:00' │
│   16    │  'long'   │  '趋势多且增强-L-1'  │  7.846242523110284  │ '28.044132622249247' │ '21.452685741474674' │ '24.928681372926977' │ '0.1843655695376009'  │ '0.18360234512978826' │ 0.1839  │ '21.405046958480153' │ '23.466490347894922' │ '17.260335279382797' │ '0.1842509911724627'  │ '0.18363810307440306' │ '2025-06-09 21:30:00' │ '2025-06-09 23:00:00' │
│   17    │  'long'   │  '趋势多且增强-L-1'  │ 2.4404536274661215  │ '32.77178365479614'  │ '19.92575856684357'  │ '20.622914490147295' │ '0.19334235591428794' │ '0.1879581892185465'  │ 0.19311 │ '24.00433517536976'  │ '27.106090751240092' │ '21.996616178918885' │ '0.19274334664468679' │ '0.19079195735180846' │ '2025-06-10 11:30:00' │ '2025-06-11 04:00:00' │
│   18    │  'long'   │  '趋势多且增强-L-2'  │  12.59671736184308  │ '32.337986276155824' │ '28.443719318984076' │ '23.977591465928146' │ '0.19987108644801785' │ '0.19513981761676033' │ 0.19923 │ '19.730522780465073' │ '30.381874983446547' │ '17.679494702572686' │ '0.19982420415671054' │  '0.195888822857509'  │ '2025-06-11 17:45:00' │ '2025-06-11 20:30:00' │
│   19    │  'short'  │  '趋势空且增强-R-1'  │  79.89847764034252  │ '46.25748129933785'  │ '16.25319347533815'  │ '21.392390828707846' │ '0.18855206772959612' │ '0.1923435584588147'  │ 0.18918 │ '22.43920429688016'  │ '18.97007337552094'  │ '19.751565632490856' │ '0.17418353864233796' │ '0.1817527426857372'  │ '2025-06-12 22:00:00' │ '2025-06-13 17:15:00' │
│   20    │  'short'  │  '趋势空且增强-R-1'  │ 11.871475666312765  │ '26.83652217528716'  │ '24.678545845158595' │ '14.491232699716985' │ '0.17643900200649726' │ '0.17951902144293752' │ 0.17897 │ '21.246571861378058' │ '17.230879048336405' │ '19.300783462750815' │ '0.17683899087313557' │ '0.17933583039758458' │ '2025-06-14 00:45:00' │ '2025-06-14 02:15:00' │
│   21    │  'short'  │  '趋势空且增强-R-1'  │  6.293351242444562  │ '32.41415861748228'  │ '19.750809270397813' │ '12.566495627915502' │ '0.1785596803225098'  │ '0.17900802256426337' │ 0.17868 │ '23.98107881845749'  │ '14.998991328758384' │ '17.915235876593833' │ '0.17830364066656457' │ '0.17891513947285045' │ '2025-06-14 08:45:00' │ '2025-06-14 10:00:00' │
│   22    │  'short'  │ '趋势空且增强-R-3-1' │  4.294523394933411  │ '16.49050354636192'  │ '24.447653346867025' │ '15.289440779602769' │ '0.17718968221650336' │ '0.17801868906482649' │ 0.17803 │ '12.555312733626241' │ '18.031782192694664' │ '19.213060532592955' │ '0.17739435431970593' │ '0.1779734138365124'  │ '2025-06-14 21:00:00' │ '2025-06-14 23:00:00' │
│   23    │  'short'  │  '趋势空且增强-R-1'  │ -1.3419763658160972 │  '33.8162839491822'  │ '21.027923755262556' │ '18.639480689500015' │ '0.17484683597366793' │ '0.1765760519830537'  │ 0.17517 │ '22.12054767086691'  │ '16.734491776317697' │ '19.48266488884204'  │ '0.17566605422014447' │ '0.17641797458223707' │ '2025-06-15 20:45:00' │ '2025-06-16 01:00:00' │
│   24    │  'short'  │  '趋势空且增强-R-2'  │ 7.2436684222578185  │ '31.04775599295383'  │ '21.467050471994984' │ '22.97462052052197'  │ '0.1740589219417411'  │ '0.1757477800865898'  │ 0.17468 │ '18.34907190871311'  │ '15.267870815403597' │ '24.285430634412833' │ '0.17457195143205181' │ '0.17560872786526444' │ '2025-06-16 06:00:00' │ '2025-06-16 09:00:00' │
│   25    │  'short'  │ '趋势空且增强-R-3-1' │ -11.174961623742197 │ '17.356342534619902' │ '24.493548187149973' │ '19.18886843675212'  │ '0.17461053348865976' │ '0.17556600920895968' │ 0.17589 │ '26.045539019374658' │ '31.98867351066227'  │ '11.220216073936545' │ '0.1759751636891977'  │ '0.17576174694927527' │ '2025-06-16 09:45:00' │ '2025-06-16 13:15:00' │
│   26    │  'long'   │  '趋势多且增强-L-2'  │  4.204405286343629  │ '32.73874403567789'  │ '22.459233970891134' │ '18.462206627123294' │ '0.17720003497626022' │ '0.1762237498107393'  │ 0.17706 │ '17.448180860472444' │ '21.03697935939325'  │ '16.231118135921424' │ '0.17691256899756283' │ '0.17634537859401733' │ '2025-06-16 17:45:00' │ '2025-06-16 21:45:00' │
│   27    │  'short'  │  '趋势空且增强-R-1'  │  34.71856246434691  │ '40.535201641677766' │ '17.344693135817188' │ '27.524622924778132' │ '0.17507642418421976' │ '0.1765707355674816'  │ 0.1753  │ '18.841722259354214' │ '19.672664073803197' │ '22.47784112248415'  │ '0.16932080526174975' │ '0.17209355883501276' │ '2025-06-17 10:45:00' │ '2025-06-18 06:30:00' │
│   28    │  'short'  │  '趋势空且增强-R-1'  │ -6.489819648789782  │ '36.726436153264004' │ '20.855332260784376' │ '30.644416058357482' │ '0.1681074182953367'  │ '0.17036535614840154' │ 0.16856 │ '21.514380922330645' │ '20.257981410599626' │ '22.075678971617613' │ '0.16982865200151678' │ '0.16966898549695458' │ '2025-06-18 22:00:00' │ '2025-06-19 09:00:00' │
│   29    │  'long'   │ '趋势多且增强-L-3-1' │  5.066465435606072  │ '18.00266664266557'  │ '14.724081121088595' │ '23.63032067128386'  │  '0.17007727762336'   │ '0.1699311713713045'  │ 0.16896 │ '15.038945327524907' │ '28.44958410861093'  │ '18.182482938870873' │ '0.1689587547233996'  │ '0.1695532303128632'  │ '2025-06-19 19:00:00' │ '2025-06-20 01:30:00' │
│   30    │  'short'  │ '趋势空且增强-R-3-1' │ -6.7930433759047855 │ '17.871144898628685' │ '23.987726018666915' │ '17.511669406913107' │ '0.16930859597496578' │ '0.16958973222929943' │ 0.16991 │ '25.284637753071227' │ '24.12244654925937'  │ '12.531616107099676' │ '0.1702271236730708'  │  '0.169780412970486'  │ '2025-06-20 02:45:00' │ '2025-06-20 07:30:00' │
│   31    │  'long'   │  '趋势多且增强-L-2'  │ -13.145441704431802 │ '25.071649838078105' │ '19.68091104546776'  │ '19.353713376632285' │ '0.17042108850342594' │ '0.16987986611742267' │ 0.16991 │ '26.419345542859446' │ '9.867318999297533'  │ '32.206625271279606' │ '0.16931827838338745' │ '0.16970791704193328' │ '2025-06-20 09:15:00' │ '2025-06-20 13:00:00' │
│   32    │  'short'  │  '趋势空且增强-R-1'  │ -14.14830703775927  │ '30.50979889620513'  │ '24.64407800272013'  │ '21.38190182793263'  │ '0.16872937244846392' │ '0.16949428960321167' │ 0.16923 │ '25.581127916906667' │ '29.250885818468127' │ '11.524819089252716' │ '0.17049490076411272' │ '0.16985437810006312' │ '2025-06-20 15:15:00' │ '2025-06-20 21:15:00' │
│   33    │  'short'  │  '趋势空且增强-R-1'  │  6.995683453237328  │ '43.45792946507561'  │ '21.968991066896237' │ '30.750033844546653' │ '0.16397854311008228' │ '0.16770952584343243' │ 0.16402 │ '23.270088091818806' │ '19.436247823107138' │ '23.49071528912115'  │ '0.1628687567323038'  │ '0.16611771275190138' │ '2025-06-21 04:30:00' │ '2025-06-21 10:15:00' │
│   34    │  'short'  │  '趋势空且增强-R-2'  │  9.365799540933443  │  '43.1572304136903'  │ '23.297636341064855' │ '25.033473659766294' │ '0.1557301612955911'  │ '0.16077265526438972' │ 0.15684 │ '12.978697393317463' │ '15.802131858360157' │ '23.78567791132808'  │ '0.1561606501256815'  │ '0.1586867637380842'  │ '2025-06-22 08:30:00' │ '2025-06-22 17:15:00' │
│   35    │  'short'  │  '趋势空且增强-R-1'  │ -11.753898661065973 │ '26.098111113280435' │ '24.68693083666877'  │ '11.575281795713728' │ '0.15110545426695723' │ '0.15286715451071173' │ 0.15236 │ '36.38010029278583'  │ '30.640292603517672' │ '12.700492025514794' │ '0.15306497125135174' │ '0.15301439279587248' │ '2025-06-23 11:15:00' │ '2025-06-23 16:00:00' │
│   36    │  'long'   │  '趋势多且增强-L-1'  │ -5.684796238244561  │ '33.314085815697226' │ '24.295231837034734' │ '17.73370561420086'  │ '0.15312673099219318' │ '0.15303210232081393' │ 0.15312 │ '25.67386198196744'  │ '20.154842568029906' │ '22.491274358081366' │ '0.15295659024033184' │ '0.15299968561203992' │ '2025-06-23 17:00:00' │ '2025-06-23 18:00:00' │
│   37    │  'long'   │  '趋势多且增强-L-1'  │  5.14582681272832   │ '25.96289366836686'  │ '23.62375101675243'  │ '14.261269237288452' │ '0.15341240992374608' │ '0.1530385576871247'  │ 0.15336 │ '21.782401692992796' │ '27.477944791068754' │  '21.0188260050141'  │ '0.15256103084959033' │ '0.15286286885750952' │ '2025-06-23 23:15:00' │ '2025-06-24 01:15:00' │
│   38    │  'long'   │  '趋势多且增强-L-1'  │  4.948237601912631  │ '29.35354501557104'  │ '21.454129677624643' │ '24.514219629112695' │ '0.16384048586414868' │ '0.1590776597651728'  │ 0.16313 │ '16.190585533613948' │ '19.269957438124393' │ '17.663379849640357' │ '0.1633387830277871'  │ '0.16028234961712423' │ '2025-06-24 17:00:00' │ '2025-06-24 22:15:00' │
│   39    │  'long'   │ '趋势多且增强-L-3-1' │  6.877366204918668  │ '17.983417767514116' │ '16.966356956783645' │ '24.14435328934726'  │ '0.16495979292750695' │ '0.16449141631083677' │ 0.16387 │ '15.751060924948893' │ '23.04802355209521'  │ '20.02976252777289'  │ '0.16490115256200819' │ '0.16449992631996826' │ '2025-06-26 07:15:00' │ '2025-06-26 08:00:00' │
│   40    │  'long'   │  '趋势多且增强-L-1'  │ 0.6481609404350799  │ '26.66709507193903'  │ '29.72359713355394'  │ '19.590771411858274' │ '0.1653675157774525'  │ '0.16472434161589258' │ 0.16503 │ '17.824769908793712' │ '27.84438287917596'  │ '19.408347132116965' │ '0.16493679836190464' │ '0.16471318700135576' │ '2025-06-26 12:15:00' │ '2025-06-26 15:15:00' │
│   41    │  'short'  │  '趋势空且增强-R-2'  │ 0.6102822957561614  │ '36.44819028763311'  │ '16.60614740756115'  │ '20.481763857226415' │ '0.16029326167268626' │ '0.16282594266915812' │ 0.16047 │ '24.981824057305722' │ '19.335165685268336' │ '24.472778460096958' │ '0.16080673962565886' │ '0.16242913450094967' │ '2025-06-27 02:00:00' │ '2025-06-27 05:45:00' │
│   42    │  'short'  │ '趋势空且增强-R-3-1' │ 2.5339752748959183  │ '21.129978076739178' │ '23.14853030831563'  │ '17.00175917664228'  │ '0.16041545343747074' │ '0.16073446936693783' │ 0.16097 │ '17.383619859421767' │ '19.018109111686964' │ '19.425973387842276' │ '0.16056736296941368' │ '0.1607431796791684'  │ '2025-06-28 07:45:00' │ '2025-06-28 09:15:00' │
│   43    │  'long'   │  '趋势多且增强-L-2'  │ -0.6924516685137099 │ '27.93410940241061'  │ '20.337824415397474' │ '16.934593348303295' │ '0.16246493839721732' │ '0.16149443155931986' │ 0.16242 │ '21.311751413771386' │ '27.982731091137072' │ '20.700556710429957' │ '0.16204592098693865' │  '0.16155639987715'   │ '2025-06-28 19:15:00' │ '2025-06-28 22:30:00' │
│   44    │  'long'   │  '趋势多且增强-L-1'  │  1.637755039519605  │ '36.997730827943215' │ '28.277896021099448' │ '16.95227421706564'  │ '0.16323671734335324' │ '0.16210912488028018' │ 0.16321 │ '19.685352221332355' │ '26.647505640490337' │ '21.506261861333158' │ '0.1631300880071306'  │ '0.1626563293532068'  │ '2025-06-29 04:30:00' │ '2025-06-29 13:45:00' │
│   45    │  'long'   │ '趋势多且增强-L-3-1' │  4.699179223324899  │  '21.9217127812884'  │ '13.532114151475783' │ '23.815555485010854' │ '0.16400890644232055' │ '0.16333794675135702' │ 0.16326 │ '19.915132223994476' │ '18.78669749578676'  │ '18.084514499856493' │ '0.1639298954514183'  │ '0.16336052201920387' │ '2025-06-29 23:45:00' │ '2025-06-30 00:45:00' │
│   46    │  'short'  │  '趋势空且增强-R-1'  │ 0.3460600545951273  │ '37.294739214498726' │ '16.38993876037409'  │ '23.29499058544747'  │ '0.1645435830369337'  │ '0.16509795928775764' │ 0.16485 │ '23.27246663804516'  │ '14.015964424482169' │ '16.672246347392207' │ '0.16481979926514073' │ '0.16509364942582272' │ '2025-06-30 23:45:00' │ '2025-07-01 02:00:00' │
│   47    │  'short'  │ '趋势空且增强-R-3-1' │ -3.8661579137122906 │ '20.946674697274076' │ '24.640283837184775' │  '13.9086229510047'  │ '0.16493530368400025' │ '0.16509567599992553' │ 0.16642 │ '25.97960708791905'  │ '26.625689539072077' │ '10.108180657531056' │ '0.16551986160118445' │ '0.1652179441079068'  │ '2025-07-01 03:15:00' │ '2025-07-01 04:15:00' │
└─────────┴───────────┴──────────────────────┴─────────────────────┴──────────────────────┴──────────────────────┴──────────────────────┴───────────────────────┴───────────────────────┴─────────┴──────────────────────┴──────────────────────┴──────────────────────┴───────────────────────┴───────────────────────┴───────────────────────┴───────────────────────┘

      ========== 回测结果 ==========
      总交易次数:     48
      盈利次数:       29
      亏损次数:       19
      胜率:          60.42%
      总收益:        16.21 USDT
      期末余额:      1006.61 USDT
      盈亏比:        1.07
      最大单笔盈利:  79.90
      最大单笔亏损:  -53.52
      手续费:       19.20169811695108
      最大连续盈利:  125.24124145645273
      最大连续亏损:  -79.6716611149159
      最大连盈次数:  7
      最大连亏次数:  3
      =============================
    
profit: 6.607881888971178
maxDrawdown 13.3%
startTime: 2025-05-31 00:00:00
趋势多且增强-L-3-1 总交易次数: 5 盈利: 21.949383798546847 亏损: -8.294218040588639 最大盈利: 6.88 最大亏损: -8.29 总收益: 13.66 平均盈利: 2.73 typeA: 2.18 胜率: 80.00%
趋势空且增强-R-1 总交易次数: 14 盈利: 141.24404142374524 亏损: -117.86970681510331 最大盈利: 79.90 最大亏损: -53.52 总收益: 23.37 平均盈利: 1.67 typeA: 0.83 胜率: 50.00%
趋势多且增强-L-1 总交易次数: 8 盈利: 22.66667654517204 亏损: -15.81889581394675 最大盈利: 7.85 最大亏损: -10.13 总收益: 6.85 平均盈利: 0.86 typeA: 0.64 胜率: 75.00%
趋势空且增强-R-2 总交易次数: 5 盈利: 17.512351769290024 亏损: -18.34613153314698 最大盈利: 9.37 最大亏损: -18.35 总收益: -0.83 平均盈利: -0.17 typeA: -0.13 胜率: 80.00%
趋势多且增强-L-2 总交易次数: 7 盈利: 17.610740435277428 亏损: -24.967034560239313 最大盈利: 12.60 最大亏损: -13.15 总收益: -7.36 平均盈利: -1.05 typeA: -0.60 胜率: 57.14%
趋势空且增强-R-3-1 总交易次数: 9 盈利: 32.577419533148415 亏损: -52.056744853182146 最大盈利: 13.72 最大亏损: -16.02 总收益: -19.48 平均盈利: -2.16 typeA: -0.96 胜率: 44.44%
Loaded 134 15m candles
┌─────────┬───────────┬──────────────────────┬─────────────────────┬──────────────────────┬──────────────────────┬──────────────────────┬───────────────────────┬───────────────────────┬─────────┬──────────────────────┬──────────────────────┬──────────────────────┬───────────────────────┬───────────────────────┬───────────────────────┬───────────────────────┐
│ (index) │ direction │   entryMarketType    │       profit        │       entryAdx       │    entryAdxPlusDI    │   entryAdxMinusDI    │     entryEmaFast      │     entryEmaSlow      │  entry  │       exitAdx        │    exitAdxPlusDI     │    exitAdxMinusDI    │      exitEmaFast      │      exitEmaSlow      │       entryTime       │       exitTime        │
├─────────┼───────────┼──────────────────────┼─────────────────────┼──────────────────────┼──────────────────────┼──────────────────────┼───────────────────────┼───────────────────────┼─────────┼──────────────────────┼──────────────────────┼──────────────────────┼───────────────────────┼───────────────────────┼───────────────────────┼───────────────────────┤
│    0    │  'long'   │  '趋势多且增强-L-1'  │ -17.33294721757812  │ '28.516965243541094' │ '18.731917027630583' │ '21.722542781543712' │ '0.16778294317900103' │ '0.16505615166690946' │ 0.16748 │ '38.00688026037378'  │ '10.589954956135895' │ '23.769922752968366' │ '0.16534206238440943' │ '0.16535661578708644' │ '2025-06-30 10:45:00' │ '2025-06-30 20:15:00' │
│    1    │  'short'  │  '趋势空且增强-R-1'  │ 0.3460600545951273  │ '37.19389034385599'  │ '16.39871788729754'  │ '23.290747395549353' │ '0.16454331669093203' │ '0.16511777221131993' │ 0.16485 │ '23.210171234980116' │ '14.020592333496541' │ '16.669629254410918' │ '0.1648196696704453'  │ '0.1651108051408841'  │ '2025-06-30 23:45:00' │ '2025-07-01 02:00:00' │
│    2    │  'short'  │ '趋势空且增强-R-3-1' │ -3.8661579137122906 │ '20.901965592854882' │ '24.643779179277356' │ '13.906754146574308' │ '0.1649352168326261'  │ '0.1651115126939036'  │ 0.16642 │ '25.949035605837892' │ '26.62827772832821'  │ '10.106730718711963' │ '0.1655197985449156'  │ '0.1652327989857516'  │ '2025-07-01 03:15:00' │ '2025-07-01 04:15:00' │
│    3    │  'long'   │ '趋势多且增强-L-3-1' │  5.312712069801225  │  '20.0009544587083'  │ '16.438625868607705' │ '22.28820111593588'  │ '0.16572470055524785' │ '0.1653449875588156'  │ 0.16504 │ '16.37011436120412'  │ '20.73219556691515'  │ '16.983414516018943' │ '0.16549710896152092' │ '0.16533395092876216' │ '2025-07-01 06:45:00' │ '2025-07-01 09:00:00' │
└─────────┴───────────┴──────────────────────┴─────────────────────┴──────────────────────┴──────────────────────┴──────────────────────┴───────────────────────┴───────────────────────┴─────────┴──────────────────────┴──────────────────────┴──────────────────────┴───────────────────────┴───────────────────────┴───────────────────────┴───────────────────────┘

      ========== 回测结果 ==========
      总交易次数:     4
      盈利次数:       2
      亏损次数:       2
      胜率:          50.00%
      总收益:        -15.54 USDT
      期末余额:      983.66 USDT
      盈亏比:        0.27
      最大单笔盈利:  5.31
      最大单笔亏损:  -17.33
      手续费:       1.598299382860923
      最大连续盈利:  5.312712069801225
      最大连续亏损:  -17.33294721757812
      最大连盈次数:  1
      最大连亏次数:  1
      =============================
    
profit: -16.340333006894184
maxDrawdown 2.1%
startTime: 2025-06-30 00:00:00
趋势多且增强-L-3-1 总交易次数: 1 盈利: 5.312712069801225 亏损: 0 最大盈利: 5.31 最大亏损: 5.31 总收益: 5.31 平均盈利: 5.31 typeA: 5.31 胜率: 100.00%
趋势空且增强-R-1 总交易次数: 1 盈利: 0.3460600545951273 亏损: 0 最大盈利: 0.35 最大亏损: 0.35 总收益: 0.35 平均盈利: 0.35 typeA: 0.35 胜率: 100.00%
趋势多且增强-L-1 总交易次数: 1 盈利: 0 亏损: -17.33294721757812 最大盈利: -17.33 最大亏损: -17.33 总收益: -17.33 平均盈利: -17.33 typeA: 0.00 胜率: 0.00%
趋势空且增强-R-3-1 总交易次数: 1 盈利: 0 亏损: -3.8661579137122906 最大盈利: -3.87 最大亏损: -3.87 总收益: -3.87 平均盈利: -3.87 typeA: 0.00 胜率: 0.00%

          ========== 回测结果 ==========
          总交易次数:     285
    盈利次数:       187
    亏损次数:       98
          胜率:          65.61%
          总收益:        435.17 USDT
          盈亏比:        1.30
    rw:        0.0102
    rl:        0.0149
    carry:        10.17
    最大连续盈利:  256.109322855605
    最大连续亏损:  -91.84909472199641
    最大连盈次数:  11
    最大连亏次数:  4
          =============================

tradeNumTotal 285
profitTotal 377.96574892453805
maxLossTotal -72
winRateTotal 444.86
period month 7
avgRate 63.55
maxDrawdownTotal 13.3
趋势空且增强-R-2 总交易次数: 42 盈利: 340.7175632212352 亏损: -124.31270059106143 最大盈利: 170.47 最大亏损: -25.98 总收益: 216.40 平均盈利: 5.15 typeA: 4.05 胜率: 78.57%
趋势空且增强-R-1 总交易次数: 66 盈利: 654.1869713812879 亏损: -370.8282286779046 最大盈利: 110.21 最大亏损: -72.00 总收益: 283.36 平均盈利: 4.29 typeA: 2.80 胜率: 65.15%
趋势多且增强-L-1 总交易次数: 45 盈利: 287.84904592406497 亏损: -204.83891377084805 最大盈利: 36.20 最大亏损: -26.16 总收益: 83.01 平均盈利: 1.84 typeA: 1.11 胜率: 60.00%
趋势空且增强-R-3-1 总交易次数: 45 盈利: 252.02346108514644 亏损: -187.90541507930791 最大盈利: 31.56 最大亏损: -26.16 总收益: 64.12 平均盈利: 1.42 typeA: 0.85 胜率: 60.00%
趋势多且增强-L-2 总交易次数: 49 盈利: 205.1985018877469 亏损: -260.4564259077057 最大盈利: 23.88 最大亏损: -69.04 总收益: -55.26 平均盈利: -1.13 typeA: -0.85 胜率: 75.51%
趋势多且增强-L-3-1 总交易次数: 38 盈利: 155.74198730829207 亏损: -312.21009785639507 最大盈利: 18.31 最大亏损: -47.70 总收益: -156.47 平均盈利: -4.12 typeA: -2.17 胜率: 52.63%






   ========== 回测结果 ==========
          总交易次数:     230
    盈利次数:       159
    亏损次数:       71
          胜率:          69.13%
          总收益:        1114.07 USDT
          盈亏比:        2.29
    rw:        0.0124
    rl:        0.0121
    carry:        32.13
    最大连续盈利:  407.10321571851154
    最大连续亏损:  -68.76997917465432
    最大连盈次数:  15
    最大连亏次数:  4
          =============================

tradeNumTotal 230
profitTotal 1067.870689568339
maxLossTotal -54.13
winRateTotal 464.97
period month 7
avgRate 66.42
maxDrawdownTotal 12.4
趋势空且增强-L-2 总交易次数: 4 盈利: 82.7036918835319 亏损: 0 最大盈利: 45.41 最大亏损: 6.59 总收益: 82.70 平均盈利: 20.68 typeA: 20.68 胜率: 100.00%
趋势多且增强-R-1 总交易次数: 24 盈利: 365.58573785105824 亏损: -83.49819683935664 最大盈利: 74.06 最大亏损: -18.97 总收益: 282.09 平均盈利: 11.75 typeA: 6.37 胜率: 54.17%
趋势空且增强-R-1 总交易次数: 58 盈利: 599.4651954032768 亏损: -223.9013644343297 最大盈利: 82.78 最大亏损: -54.13 总收益: 375.56 平均盈利: 6.48 typeA: 4.58 胜率: 70.69%
趋势空且增强-L-1 总交易次数: 12 盈利: 114.59415294053801 亏损: -41.98079028310561 最大盈利: 46.97 最大亏损: -27.34 总收益: 72.61 平均盈利: 6.05 typeA: 4.54 胜率: 75.00%
趋势空且增强-R-2 总交易次数: 40 盈利: 338.66533622329047 亏损: -126.61046073339946 最大盈利: 179.62 最大亏损: -25.98 总收益: 212.05 平均盈利: 5.30 typeA: 4.11 胜率: 77.50%
趋势多且增强-R-2 总交易次数: 6 盈利: 41.778512285102124 亏损: -20.286100961552314 最大盈利: 26.99 最大亏损: -7.99 总收益: 21.49 平均盈利: 3.58 typeA: 1.79 胜率: 50.00%
趋势多且增强-L-2 总交易次数: 45 盈利: 199.09417020008658 亏损: -125.72260343256238 最大盈利: 23.88 最大亏损: -42.74 总收益: 73.37 平均盈利: 1.63 typeA: 1.27 胜率: 77.78%
趋势多且增强-L-1 总交易次数: 41 盈利: 233.4380291884382 亏损: -239.25461972266731 最大盈利: 36.20 最大亏损: -51.47 总收益: -5.82 平均盈利: -0.14 typeA: -0.08 胜率: 56.10%










#####################################################################



*/
