/*


      ========== 回测结果 ==========
      总交易次数:     53
      盈利次数:       34
      亏损次数:       19
      胜率:          64.15%
      总收益:        4278.20 USDT
      期末余额:      5267.40 USDT
      盈亏比:        15.69
      最大单笔盈利:  3372.64
      最大单笔亏损:  -59.92
      手续费:       22.131562218685737
      最大连续盈利:  3870.4544751038693
      最大连续亏损:  -93.14766903153588
      最大连盈次数:  5
      最大连亏次数:  2
      =============================
    
profit: 4267.400359639917
maxDrawdown 7.0%
startTime: 2021-01-01 00:00:00
趋势多且增强-L-1 总交易次数: 7 盈利: 3687.9012466724416 亏损: -59.919029254068306 最大盈利: 3372.64 最大亏损: -59.92 总收益: 3627.98 平均盈利: 518.28 typeA: 444.22 胜率: 85.71%
趋势空且增强-R-3-1 总交易次数: 6 盈利: 116.18782897554846 亏损: 0 最大盈利: 30.97 最大亏损: 5.34 总收益: 116.19 平均盈利: 19.36 typeA: 19.36 胜率: 100.00%
趋势多且增强-L-3-1 总交易次数: 14 盈利: 479.5031792243109 亏损: -115.65235544039751 最大盈利: 381.24 最大亏损: -34.80 总收益: 363.85 平均盈利: 25.99 typeA: 16.71 胜率: 64.29%
趋势空且增强-R-2 总交易次数: 2 盈利: 35.29585753978277 亏损: -7.90199249205876 最大盈利: 35.30 最大亏损: -7.90 总收益: 27.39 平均盈利: 13.70 typeA: 6.85 胜率: 50.00%
趋势空且增强-R-1 总交易次数: 19 盈利: 248.82497317555544 亏损: -81.88308090108558 最大盈利: 75.63 最大亏损: -58.35 总收益: 166.94 平均盈利: 8.79 typeA: 5.09 胜率: 57.89%
趋势多且增强-L-2 总交易次数: 5 盈利: 1.6835276109735844 亏损: -25.83979547108439 最大盈利: 1.68 最大亏损: -17.27 总收益: -24.16 平均盈利: -4.83 typeA: -0.97 胜率: 20.00%
Loaded 3000 15m candles

      ========== 回测结果 ==========
      总交易次数:     54
      盈利次数:       42
      亏损次数:       12
      胜率:          77.78%
      总收益:        747.18 USDT
      期末余额:      1736.18 USDT
      盈亏比:        3.01
      最大单笔盈利:  100.97
      最大单笔亏损:  -145.60
      手续费:       21.810998109033658
      最大连续盈利:  341.44772668720407
      最大连续亏损:  -145.60487759928722
      最大连盈次数:  9
      最大连亏次数:  2
      =============================
    
profit: 736.1754010287373
maxDrawdown 11.3%
startTime: 2021-01-31 00:00:00
趋势多且增强-L-1 总交易次数: 9 盈利: 251.71234479073553 亏损: -21.560086307480987 最大盈利: 94.08 最大亏损: -12.07 总收益: 230.15 平均盈利: 25.57 typeA: 19.89 胜率: 77.78%
趋势多且增强-L-2 总交易次数: 3 盈利: 62.67182670489376 亏损: -3.0177759624221228 最大盈利: 56.00 最大亏损: -3.02 总收益: 59.65 平均盈利: 19.88 typeA: 13.26 胜率: 66.67%
趋势空且增强-R-1 总交易次数: 12 盈利: 195.9963520179442 亏损: -26.84698636666463 最大盈利: 100.97 最大亏损: -16.93 总收益: 169.15 平均盈利: 14.10 typeA: 10.57 胜率: 75.00%
趋势空且增强-R-3-1 总交易次数: 16 盈利: 323.7297749305566 亏损: -145.60487759928722 最大盈利: 59.91 最大亏损: -145.60 总收益: 178.12 平均盈利: 11.13 typeA: 10.44 胜率: 93.75%
趋势多且增强-L-3-1 总交易次数: 13 盈利: 284.15952073776435 亏损: -172.5586555048244 最大盈利: 76.52 最大亏损: -67.55 总收益: 111.60 平均盈利: 8.58 typeA: 5.94 胜率: 69.23%
趋势空且增强-R-2 总交易次数: 1 盈利: 0 亏损: -1.5060364124756318 最大盈利: -1.51 最大亏损: -1.51 总收益: -1.51 平均盈利: -1.51 typeA: 0.00 胜率: 0.00%
Loaded 3000 15m candles

      ========== 回测结果 ==========
      总交易次数:     64
      盈利次数:       41
      亏损次数:       23
      胜率:          64.06%
      总收益:        178.19 USDT
      期末余额:      1165.39 USDT
      盈亏比:        1.95
      最大单笔盈利:  50.61
      最大单笔亏损:  -24.10
      手续费:       25.612558225234242
      最大连续盈利:  145.3270808301762
      最大连续亏损:  -38.24791948763921
      最大连盈次数:  16
      最大连亏次数:  5
      =============================
    
profit: 165.3890860148415
maxDrawdown 7.7%
startTime: 2021-03-02 00:00:00
趋势多且增强-L-1 总交易次数: 13 盈利: 125.39451371175883 亏损: -33.355495007008386 最大盈利: 50.61 最大亏损: -24.10 总收益: 92.04 平均盈利: 7.08 typeA: 4.90 胜率: 69.23%
趋势空且增强-R-1 总交易次数: 16 盈利: 72.65193970401846 亏损: -25.288718423944623 最大盈利: 13.35 最大亏损: -20.46 总收益: 47.36 平均盈利: 2.96 typeA: 2.04 胜率: 68.75%
趋势多且增强-L-3-1 总交易次数: 14 盈利: 86.83630087666538 亏损: -55.47166850096929 最大盈利: 17.50 最大亏损: -14.82 总收益: 31.36 平均盈利: 2.24 typeA: 1.44 胜率: 64.29%
趋势空且增强-R-3-1 总交易次数: 16 盈利: 78.37276587474187 亏损: -68.15586971416629 最大盈利: 12.04 最大亏损: -24.05 总收益: 10.22 平均盈利: 0.64 typeA: 0.40 胜率: 62.50%
趋势空且增强-R-2 总交易次数: 2 盈利: 1.905911569400188 亏损: -2.167948923867669 最大盈利: 1.91 最大亏损: -2.17 总收益: -0.26 平均盈利: -0.13 typeA: -0.07 胜率: 50.00%
趋势多且增强-L-2 总交易次数: 3 盈利: 0.5246139265206801 亏损: -3.057259078304717 最大盈利: 0.52 最大亏损: -2.75 总收益: -2.53 平均盈利: -0.84 typeA: -0.28 胜率: 33.33%
Loaded 3000 15m candles

      ========== 回测结果 ==========
      总交易次数:     48
      盈利次数:       38
      亏损次数:       10
      胜率:          79.17%
      总收益:        1258.66 USDT
      期末余额:      2249.06 USDT
      盈亏比:        6.42
      最大单笔盈利:  460.73
      最大单笔亏损:  -120.25
      手续费:       19.33812328779138
      最大连续盈利:  695.1799062979342
      最大连续亏损:  -120.24676356154006
      最大连盈次数:  9
      最大连亏次数:  2
      =============================
    
profit: 1249.064169302124
maxDrawdown 6.6%
startTime: 2021-04-01 00:00:00
趋势多且增强-L-1 总交易次数: 20 盈利: 985.0957576937773 亏损: -3.9435550429077315 最大盈利: 460.73 最大亏损: -2.02 总收益: 981.15 平均盈利: 49.06 typeA: 44.15 胜率: 90.00%
趋势空且增强-R-1 总交易次数: 7 盈利: 209.525621928868 亏损: -25.39560030811014 最大盈利: 89.68 最大亏损: -15.08 总收益: 184.13 平均盈利: 26.30 typeA: 11.27 胜率: 42.86%
趋势空且增强-R-3-1 总交易次数: 8 盈利: 169.08985401132028 亏损: -67.26917023025189 最大盈利: 71.08 最大亏损: -67.27 总收益: 101.82 平均盈利: 12.73 typeA: 11.14 胜率: 87.50%
趋势多且增强-L-2 总交易次数: 1 盈利: 1.8452443115520483 亏损: 0 最大盈利: 1.85 最大亏损: 1.85 总收益: 1.85 平均盈利: 1.85 typeA: 1.85 胜率: 100.00%
趋势多且增强-L-3-1 总交易次数: 12 盈利: 125.48323298567442 亏损: -135.76721604779866 最大盈利: 51.06 最大亏损: -120.25 总收益: -10.28 平均盈利: -0.86 typeA: -0.64 胜率: 75.00%
Loaded 3000 15m candles

      ========== 回测结果 ==========
      总交易次数:     59
      盈利次数:       49
      亏损次数:       10
      胜率:          83.05%
      总收益:        987.25 USDT
      期末余额:      1975.45 USDT
      盈亏比:        4.84
      最大单笔盈利:  199.97
      最大单笔亏损:  -96.70
      手续费:       23.565771270712766
      最大连续盈利:  380.97571099652885
      最大连续亏损:  -96.70253690052873
      最大连盈次数:  12
      最大连亏次数:  2
      =============================
    
profit: 975.4497330744609
maxDrawdown 7.1%
startTime: 2021-05-01 00:00:00
趋势多且增强-L-1 总交易次数: 12 盈利: 285.58740895242744 亏损: -11.012910494001042 最大盈利: 97.73 最大亏损: -11.01 总收益: 274.57 平均盈利: 22.88 typeA: 20.98 胜率: 91.67%
趋势空且增强-R-3-1 总交易次数: 14 盈利: 366.6800166863248 亏损: -28.55206213027267 最大盈利: 199.97 最大亏损: -14.88 总收益: 338.13 平均盈利: 24.15 typeA: 20.70 胜率: 85.71%
趋势空且增强-R-1 总交易次数: 15 盈利: 357.8443464268047 亏损: -116.57570967718968 最大盈利: 112.56 最大亏损: -96.70 总收益: 241.27 平均盈利: 16.08 typeA: 12.87 胜率: 80.00%
趋势多且增强-L-2 总交易次数: 4 盈利: 51.952513230715226 亏损: -0.6215281831744794 最大盈利: 48.09 最大亏损: -0.62 总收益: 51.33 平均盈利: 12.83 typeA: 9.62 胜率: 75.00%
趋势多且增强-L-3-1 总交易次数: 14 盈利: 182.03751717562477 亏损: -100.08985891279548 最大盈利: 30.10 最大亏损: -59.15 总收益: 81.95 平均盈利: 5.85 typeA: 4.60 胜率: 78.57%
Loaded 3000 15m candles

      ========== 回测结果 ==========
      总交易次数:     50
      盈利次数:       33
      亏损次数:       17
      胜率:          66.00%
      总收益:        456.18 USDT
      期末余额:      1445.98 USDT
      盈亏比:        2.87
      最大单笔盈利:  272.43
      最大单笔亏损:  -47.91
      手续费:       20.153066457282833
      最大连续盈利:  272.4296414757512
      最大连续亏损:  -47.90752533466779
      最大连盈次数:  9
      最大连亏次数:  2
      =============================
    
profit: 445.9823363689309
maxDrawdown 5.5%
startTime: 2021-05-31 00:00:00
趋势空且增强-R-1 总交易次数: 12 盈利: 352.43865718422205 亏损: -49.77615857880929 最大盈利: 272.43 最大亏损: -26.36 总收益: 302.66 平均盈利: 25.22 typeA: 21.02 胜率: 83.33%
趋势多且增强-L-2 总交易次数: 6 盈利: 135.62419769596647 亏损: -7.435136077037373 最大盈利: 131.47 最大亏损: -4.19 总收益: 128.19 平均盈利: 21.36 typeA: 10.68 胜率: 50.00%
趋势空且增强-R-3-1 总交易次数: 11 盈利: 124.92706054987801 亏损: -86.31903807568568 最大盈利: 36.06 最大亏损: -47.91 总收益: 38.61 平均盈利: 3.51 typeA: 2.23 胜率: 63.64%
趋势多且增强-L-1 总交易次数: 6 盈利: 38.25643828610864 亏损: -30.140344867345735 最大盈利: 18.74 最大亏损: -30.10 总收益: 8.12 平均盈利: 1.35 typeA: 0.90 胜率: 66.67%
趋势空且增强-R-2 总交易次数: 7 盈利: 5.3939151031024775 亏损: -2.1927976650763163 最大盈利: 2.53 最大亏损: -1.37 总收益: 3.20 平均盈利: 0.46 typeA: 0.26 胜率: 57.14%
趋势多且增强-L-3-1 总交易次数: 8 盈利: 43.66642299647897 亏损: -68.26088018286912 最大盈利: 17.49 最大亏损: -44.81 总收益: -24.59 平均盈利: -3.07 typeA: -1.92 胜率: 62.50%
Loaded 3000 15m candles

      ========== 回测结果 ==========
      总交易次数:     58
      盈利次数:       44
      亏损次数:       14
      胜率:          75.86%
      总收益:        244.05 USDT
      期末余额:      1232.45 USDT
      盈亏比:        2.10
      最大单笔盈利:  76.85
      最大单笔亏损:  -53.41
      手续费:       23.20623776600648
      最大连续盈利:  100.12082189381005
      最大连续亏损:  -68.52769179603946
      最大连盈次数:  8
      最大连亏次数:  3
      =============================
    
profit: 232.451002322583
maxDrawdown 5.5%
startTime: 2021-06-30 00:00:00
趋势多且增强-L-1 总交易次数: 15 盈利: 164.24242714788534 亏损: -18.749193908712563 最大盈利: 76.85 最大亏损: -12.70 总收益: 145.49 平均盈利: 9.70 typeA: 7.76 胜率: 80.00%
趋势空且增强-R-1 总交易次数: 17 盈利: 172.92744647954052 亏损: -61.5333156545134 最大盈利: 45.02 最大亏损: -30.24 总收益: 111.39 平均盈利: 6.55 typeA: 5.40 胜率: 82.35%
趋势多且增强-L-2 总交易次数: 2 盈利: 7.245263760870628 亏损: -1.801842487357868 最大盈利: 7.25 最大亏损: -1.80 总收益: 5.44 平均盈利: 2.72 typeA: 1.36 胜率: 50.00%
趋势空且增强-R-2 总交易次数: 7 盈利: 17.96457714513535 亏损: -16.45025066074334 最大盈利: 7.24 最大亏损: -11.33 总收益: 1.51 平均盈利: 0.22 typeA: 0.12 胜率: 57.14%
趋势空且增强-R-3-1 总交易次数: 8 盈利: 46.360286330648094 亏损: -53.41209177104054 最大盈利: 17.80 最大亏损: -53.41 总收益: -7.05 平均盈利: -0.88 typeA: -0.77 胜率: 87.50%
趋势多且增强-L-3-1 总交易次数: 9 盈利: 58.14736861148317 亏损: -70.88967267060923 最大盈利: 27.45 最大亏损: -40.39 总收益: -12.74 平均盈利: -1.42 typeA: -0.94 胜率: 66.67%
Loaded 3000 15m candles

      ========== 回测结果 ==========
      总交易次数:     56
      盈利次数:       36
      亏损次数:       20
      胜率:          64.29%
      总收益:        293.41 USDT
      期末余额:      1282.01 USDT
      盈亏比:        1.98
      最大单笔盈利:  149.25
      最大单笔亏损:  -53.04
      手续费:       22.647413331671345
      最大连续盈利:  252.40497955629252
      最大连续亏损:  -90.30940062965462
      最大连盈次数:  7
      最大连亏次数:  3
      =============================
    
profit: 282.0098579619546
maxDrawdown 10.5%
startTime: 2021-07-30 00:00:00
趋势多且增强-L-1 总交易次数: 11 盈利: 218.32466521880522 亏损: -20.405700461622033 最大盈利: 149.25 最大亏损: -16.45 总收益: 197.92 平均盈利: 17.99 typeA: 14.72 胜率: 81.82%
趋势空且增强-R-2 总交易次数: 3 盈利: 11.542043171134864 亏损: 0 最大盈利: 9.98 最大亏损: 0.50 总收益: 11.54 平均盈利: 3.85 typeA: 3.85 胜率: 100.00%
趋势多且增强-L-3-1 总交易次数: 12 盈利: 135.28567098887976 亏损: -69.65892612354921 最大盈利: 34.80 最大亏损: -53.04 总收益: 65.63 平均盈利: 5.47 typeA: 3.65 胜率: 66.67%
趋势空且增强-R-1 总交易次数: 15 盈利: 148.29656110165075 亏损: -121.25229174043386 最大盈利: 79.97 最大亏损: -43.19 总收益: 27.04 平均盈利: 1.80 typeA: 0.96 胜率: 53.33%
趋势多且增强-L-2 总交易次数: 5 盈利: 9.82075643300433 亏损: -8.158673623272412 最大盈利: 9.12 最大亏损: -3.07 总收益: 1.66 平均盈利: 0.33 typeA: 0.13 胜率: 40.00%
趋势空且增强-R-3-1 总交易次数: 10 盈利: 69.90976387168413 亏损: -80.2940108743244 最大盈利: 20.98 最大亏损: -39.18 总收益: -10.38 平均盈利: -1.04 typeA: -0.62 胜率: 60.00%
Loaded 3000 15m candles

      ========== 回测结果 ==========
      总交易次数:     56
      盈利次数:       40
      亏损次数:       16
      胜率:          71.43%
      总收益:        116.72 USDT
      期末余额:      1105.52 USDT
      盈亏比:        1.64
      最大单笔盈利:  30.94
      最大单笔亏损:  -33.26
      手续费:       22.400576732649313
      最大连续盈利:  71.66503472331273
      最大连续亏损:  -54.98188263964312
      最大连盈次数:  11
      最大连亏次数:  3
      =============================
    
profit: 105.51874174453519
maxDrawdown 5.5%
startTime: 2021-08-29 00:00:00
趋势多且增强-L-3-1 总交易次数: 13 盈利: 93.7331852083577 亏损: -34.1867825927508 最大盈利: 20.01 最大亏损: -21.23 总收益: 59.55 平均盈利: 4.58 typeA: 3.88 胜率: 84.62%
趋势空且增强-R-1 总交易次数: 23 盈利: 106.45685911589439 亏损: -37.610982759302075 最大盈利: 30.94 最大亏损: -32.53 总收益: 68.85 平均盈利: 2.99 typeA: 2.47 胜率: 82.61%
趋势多且增强-L-1 总交易次数: 13 盈利: 82.45746714307937 亏损: -80.73899877425765 最大盈利: 30.36 最大亏损: -33.26 总收益: 1.72 平均盈利: 0.13 typeA: 0.07 胜率: 53.85%
趋势多且增强-L-2 总交易次数: 2 盈利: 0.6067131964336375 亏损: -2.083173617077572 最大盈利: 0.61 最大亏损: -2.08 总收益: -1.48 平均盈利: -0.74 typeA: -0.37 胜率: 50.00%
趋势空且增强-R-3-1 总交易次数: 5 盈利: 16.370899115571774 亏损: -28.286444291410888 最大盈利: 11.10 最大亏损: -11.16 总收益: -11.92 平均盈利: -2.38 typeA: -0.95 胜率: 40.00%
Loaded 3000 15m candles

      ========== 回测结果 ==========
      总交易次数:     64
      盈利次数:       40
      亏损次数:       24
      胜率:          62.50%
      总收益:        95.01 USDT
      期末余额:      1082.01 USDT
      盈亏比:        1.29
      最大单笔盈利:  72.39
      最大单笔亏损:  -51.65
      手续费:       25.83646238060429
      最大连续盈利:  76.41982695140322
      最大连续亏损:  -70.95031308129361
      最大连盈次数:  8
      最大连亏次数:  4
      =============================
    
profit: 82.01071560313653
maxDrawdown 14.5%
startTime: 2021-09-28 00:00:00
趋势多且增强-L-2 总交易次数: 3 盈利: 21.384359492449484 亏损: -1.3862955455580066 最大盈利: 21.18 最大亏损: -1.39 总收益: 20.00 平均盈利: 6.67 typeA: 4.44 胜率: 66.67%
趋势多且增强-L-3-1 总交易次数: 18 盈利: 142.1656314064681 亏损: -67.72432676134915 最大盈利: 22.41 最大亏损: -25.72 总收益: 74.44 平均盈利: 4.14 typeA: 3.22 胜率: 77.78%
趋势空且增强-R-1 总交易次数: 14 盈利: 113.98565617083412 亏损: -70.9287183320017 最大盈利: 72.39 最大亏损: -24.45 总收益: 43.06 平均盈利: 3.08 typeA: 1.76 胜率: 57.14%
趋势多且增强-L-1 总交易次数: 17 盈利: 91.27189823700733 亏损: -48.26074223443914 最大盈利: 33.35 最大亏损: -20.50 总收益: 43.01 平均盈利: 2.53 typeA: 1.64 胜率: 64.71%
趋势空且增强-R-2 总交易次数: 2 盈利: 0 亏损: -26.066949286406764 最大盈利: -0.69 最大亏损: -25.38 总收益: -26.07 平均盈利: -13.03 typeA: 0.00 胜率: 0.00%
趋势空且增强-R-3-1 总交易次数: 10 盈利: 51.68138595977394 亏损: -111.11118350363878 最大盈利: 17.32 最大亏损: -51.65 总收益: -59.43 平均盈利: -5.94 typeA: -2.97 胜率: 50.00%
Loaded 3000 15m candles

      ========== 回测结果 ==========
      总交易次数:     69
      盈利次数:       50
      亏损次数:       19
      胜率:          72.46%
      总收益:        219.28 USDT
      期末余额:      1205.48 USDT
      盈亏比:        1.98
      最大单笔盈利:  66.78
      最大单笔亏损:  -40.49
      手续费:       27.53783746036998
      最大连续盈利:  126.06743886767566
      最大连续亏损:  -44.52109181203687
      最大连盈次数:  9
      最大连亏次数:  3
      =============================
    
profit: 205.47560407378342
maxDrawdown 7.3%
startTime: 2021-10-28 00:00:00
趋势空且增强-R-2 总交易次数: 3 盈利: 38.09856557993429 亏损: 0 最大盈利: 19.38 最大亏损: 4.20 总收益: 38.10 平均盈利: 12.70 typeA: 12.70 胜率: 100.00%
趋势多且增强-L-2 总交易次数: 1 盈利: 6.918193301435515 亏损: 0 最大盈利: 6.92 最大亏损: 6.92 总收益: 6.92 平均盈利: 6.92 typeA: 6.92 胜率: 100.00%
趋势空且增强-R-3-1 总交易次数: 21 盈利: 163.40719436845924 亏损: -23.005486609608262 最大盈利: 17.32 最大亏损: -16.71 总收益: 140.40 平均盈利: 6.69 typeA: 5.73 胜率: 85.71%
趋势空且增强-R-1 总交易次数: 20 盈利: 132.44059481470035 亏损: -47.773415697450105 最大盈利: 66.78 最大亏损: -19.40 总收益: 84.67 平均盈利: 4.23 typeA: 2.75 胜率: 65.00%
趋势多且增强-L-3-1 总交易次数: 9 盈利: 69.40324095514896 亏损: -69.00142352163968 最大盈利: 37.41 最大亏损: -40.49 总收益: 0.40 平均盈利: 0.04 typeA: 0.03 胜率: 66.67%
趋势多且增强-L-1 总交易次数: 15 盈利: 33.81690746095935 亏损: -85.02876657815291 最大盈利: 12.48 最大亏损: -24.67 总收益: -51.21 平均盈利: -3.41 typeA: -2.05 胜率: 60.00%
Loaded 3000 15m candles

      ========== 回测结果 ==========
      总交易次数:     58
      盈利次数:       38
      亏损次数:       20
      胜率:          65.52%
      总收益:        81.76 USDT
      期末余额:      1069.96 USDT
      盈亏比:        1.29
      最大单笔盈利:  53.11
      最大单笔亏损:  -63.64
      手续费:       23.412879935196536
      最大连续盈利:  105.64274552565166
      最大连续亏损:  -63.63558460421199
      最大连盈次数:  7
      最大连亏次数:  3
      =============================
    
profit: 69.95839493254016
maxDrawdown 10.8%
startTime: 2021-11-27 00:00:00
趋势多且增强-L-2 总交易次数: 3 盈利: 37.76607105062986 亏损: 0 最大盈利: 25.40 最大亏损: 1.90 总收益: 37.77 平均盈利: 12.59 typeA: 12.59 胜率: 100.00%
趋势空且增强-R-2 总交易次数: 4 盈利: 61.54594998768164 亏损: -3.130531195505237 最大盈利: 53.11 最大亏损: -3.08 总收益: 58.42 平均盈利: 14.60 typeA: 7.30 胜率: 50.00%
趋势空且增强-R-3-1 总交易次数: 9 盈利: 63.00506821537109 亏损: -9.74289371109432 最大盈利: 16.67 最大亏损: -9.74 总收益: 53.26 平均盈利: 5.92 typeA: 5.26 胜率: 88.89%
趋势多且增强-L-1 总交易次数: 15 盈利: 103.81864556196363 亏损: -53.55163651919407 最大盈利: 28.78 最大亏损: -31.78 总收益: 50.27 平均盈利: 3.35 typeA: 2.01 胜率: 60.00%
趋势多且增强-L-3-1 总交易次数: 12 盈利: 41.58790784113951 亏损: -56.751289604364665 最大盈利: 11.26 最大亏损: -19.74 总收益: -15.16 平均盈利: -1.26 typeA: -0.74 胜率: 58.33%
趋势空且增强-R-1 总交易次数: 15 盈利: 60.78317817365232 亏损: -163.5720748677368 最大盈利: 19.43 最大亏损: -63.64 总收益: -102.79 平均盈利: -6.85 typeA: -4.11 胜率: 60.00%
Loaded 3000 15m candles

      ========== 回测结果 ==========
      总交易次数:     52
      盈利次数:       35
      亏损次数:       17
      胜率:          67.31%
      总收益:        228.73 USDT
      期末余额:      1218.33 USDT
      盈亏比:        2.60
      最大单笔盈利:  77.94
      最大单笔亏损:  -37.54
      手续费:       20.790542124453694
      最大连续盈利:  119.94582635704481
      最大连续亏损:  -37.54366654637311
      最大连盈次数:  8
      最大连亏次数:  4
      =============================
    
profit: 218.33065460398916
maxDrawdown 3.1%
startTime: 2021-12-27 00:00:00
趋势多且增强-L-1 总交易次数: 5 盈利: 82.2137273652488 亏损: -5.012364835077437 最大盈利: 77.94 最大亏损: -3.88 总收益: 77.20 平均盈利: 15.44 typeA: 9.26 胜率: 60.00%
趋势空且增强-R-2 总交易次数: 2 盈利: 10.683555073468007 亏损: 0 最大盈利: 10.32 最大亏损: 0.36 总收益: 10.68 平均盈利: 5.34 typeA: 5.34 胜率: 100.00%
趋势空且增强-R-1 总交易次数: 19 盈利: 168.88336358441387 亏损: -31.55685236370435 最大盈利: 33.71 最大亏损: -14.78 总收益: 137.33 平均盈利: 7.23 typeA: 4.95 胜率: 68.42%
趋势多且增强-L-3-1 总交易次数: 14 盈利: 88.98710376819051 亏损: -39.47421492180729 最大盈利: 25.92 最大亏损: -15.62 总收益: 49.51 平均盈利: 3.54 typeA: 2.27 胜率: 64.29%
趋势空且增强-R-3-1 总交易次数: 8 盈利: 17.85031102361046 亏损: -28.426449030407518 最大盈利: 5.56 最大亏损: -22.17 总收益: -10.58 平均盈利: -1.32 typeA: -0.99 胜率: 75.00%
趋势多且增强-L-2 总交易次数: 4 盈利: 3.029186279341298 亏损: -38.446711339285116 最大盈利: 2.54 最大亏损: -37.54 总收益: -35.42 平均盈利: -8.85 typeA: -4.43 胜率: 50.00%
Loaded 3000 15m candles

      ========== 回测结果 ==========
      总交易次数:     53
      盈利次数:       39
      亏损次数:       14
      胜率:          73.58%
      总收益:        -70.00 USDT
      期末余额:      919.40 USDT
      盈亏比:        0.79
      最大单笔盈利:  49.85
      最大单笔亏损:  -104.37
      手续费:       21.190406088329517
      最大连续盈利:  87.64933791480091
      最大连续亏损:  -132.60352929527895
      最大连盈次数:  11
      最大连亏次数:  3
      =============================
    
profit: -80.60164779953311
maxDrawdown 16.3%
startTime: 2022-01-26 00:00:00
趋势多且增强-L-2 总交易次数: 7 盈利: 16.970760248898696 亏损: -3.370541798798989 最大盈利: 8.63 最大亏损: -3.37 总收益: 13.60 平均盈利: 1.94 typeA: 1.67 胜率: 85.71%
趋势空且增强-R-2 总交易次数: 4 盈利: 23.45582697378101 亏损: -20.51063527180775 最大盈利: 21.21 最大亏损: -20.51 总收益: 2.95 平均盈利: 0.74 typeA: 0.55 胜率: 75.00%
趋势空且增强-R-3-1 总交易次数: 8 盈利: 31.847896693569655 亏损: -34.72320886605083 最大盈利: 9.12 最大亏损: -24.94 总收益: -2.88 平均盈利: -0.36 typeA: -0.27 胜率: 75.00%
趋势空且增强-R-1 总交易次数: 15 盈利: 111.25332035381973 亏损: -122.44518573108681 最大盈利: 49.85 最大亏损: -104.37 总收益: -11.19 平均盈利: -0.75 typeA: -0.55 胜率: 73.33%
趋势多且增强-L-1 总交易次数: 13 盈利: 49.73044959717961 亏损: -87.73925009789387 最大盈利: 15.68 最大亏损: -32.67 总收益: -38.01 平均盈利: -2.92 typeA: -2.02 胜率: 69.23%
趋势多且增强-L-3-1 总交易次数: 6 盈利: 22.879403208234425 亏损: -57.35048310937559 最大盈利: 7.87 最大亏损: -36.25 总收益: -34.47 平均盈利: -5.75 typeA: -3.83 胜率: 66.67%
Loaded 3000 15m candles

      ========== 回测结果 ==========
      总交易次数:     62
      盈利次数:       42
      亏损次数:       20
      胜率:          67.74%
      总收益:        100.40 USDT
      期末余额:      1088.00 USDT
      盈亏比:        1.59
      最大单笔盈利:  49.31
      最大单笔亏损:  -34.01
      手续费:       24.79464487643922
      最大连续盈利:  72.42992924135203
      最大连续亏损:  -58.67186303287295
      最大连盈次数:  7
      最大连亏次数:  5
      =============================
    
profit: 88.00040040346289
maxDrawdown 5.8%
startTime: 2022-02-25 00:00:00
趋势空且增强-R-2 总交易次数: 3 盈利: 17.306310080547036 亏损: -1.3331570996979702 最大盈利: 15.21 最大亏损: -1.33 总收益: 15.97 平均盈利: 5.32 typeA: 3.55 胜率: 66.67%
趋势多且增强-L-2 总交易次数: 9 盈利: 65.44590195423513 亏损: -18.65858099211932 最大盈利: 49.31 最大亏损: -9.98 总收益: 46.79 平均盈利: 5.20 typeA: 3.47 胜率: 66.67%
趋势空且增强-R-3-1 总交易次数: 11 盈利: 44.09315744712343 亏损: -16.279396989993558 最大盈利: 9.20 最大亏损: -9.02 总收益: 27.81 平均盈利: 2.53 typeA: 1.84 胜率: 72.73%
趋势空且增强-R-1 总交易次数: 19 盈利: 47.808309692308754 亏损: -28.395934522159582 最大盈利: 14.11 最大亏损: -15.86 总收益: 19.41 平均盈利: 1.02 typeA: 0.70 胜率: 68.42%
趋势多且增强-L-1 总交易次数: 10 盈利: 51.156934797968674 亏损: -41.580544102253214 最大盈利: 13.35 最大亏损: -21.03 总收益: 9.58 平均盈利: 0.96 typeA: 0.67 胜率: 70.00%
趋势多且增强-L-3-1 总交易次数: 10 盈利: 45.89262223926078 亏损: -65.05522210175522 最大盈利: 12.97 最大亏损: -34.01 总收益: -19.16 平均盈利: -1.92 typeA: -1.15 胜率: 60.00%
Loaded 3000 15m candles

      ========== 回测结果 ==========
      总交易次数:     61
      盈利次数:       39
      亏损次数:       22
      胜率:          63.93%
      总收益:        29.27 USDT
      期末余额:      1017.07 USDT
      盈亏比:        1.08
      最大单笔盈利:  50.87
      最大单笔亏损:  -61.46
      手续费:       24.428830226732483
      最大连续盈利:  140.6334622056824
      最大连续亏损:  -132.30348510634317
      最大连盈次数:  7
      最大连亏次数:  4
      =============================
    
profit: 17.073798955831194
maxDrawdown 18.1%
startTime: 2022-03-27 00:00:00
趋势多且增强-L-1 总交易次数: 17 盈利: 155.88183680436993 亏损: -98.01902374619645 最大盈利: 32.47 最大亏损: -57.42 总收益: 57.86 平均盈利: 3.40 typeA: 2.60 胜率: 76.47%
趋势多且增强-L-2 总交易次数: 6 盈利: 18.127636718082794 亏损: -5.550129538540245 最大盈利: 7.95 最大亏损: -4.28 总收益: 12.58 平均盈利: 2.10 typeA: 1.40 胜率: 66.67%
趋势多且增强-L-3-1 总交易次数: 5 盈利: 55.20742773307305 亏损: -38.43943192450459 最大盈利: 49.58 最大亏损: -18.28 总收益: 16.77 平均盈利: 3.35 typeA: 1.34 胜率: 40.00%
趋势空且增强-R-2 总交易次数: 3 盈利: 0 亏损: -6.66873849976177 最大盈利: -0.91 最大亏损: -4.27 总收益: -6.67 平均盈利: -2.22 typeA: 0.00 胜率: 0.00%
趋势空且增强-R-1 总交易次数: 18 盈利: 123.71281624976835 亏损: -149.78791326692152 最大盈利: 50.87 最大亏损: -61.46 总收益: -26.08 平均盈利: -1.45 typeA: -0.97 胜率: 66.67%
趋势空且增强-R-3-1 总交易次数: 12 盈利: 50.70256984676038 亏损: -75.89325142029529 最大盈利: 12.07 最大亏损: -30.74 总收益: -25.19 平均盈利: -2.10 typeA: -1.40 胜率: 66.67%
Loaded 3000 15m candles

      ========== 回测结果 ==========
      总交易次数:     62
      盈利次数:       48
      亏损次数:       14
      胜率:          77.42%
      总收益:        232.15 USDT
      期末余额:      1219.75 USDT
      盈亏比:        2.13
      最大单笔盈利:  102.85
      最大单笔亏损:  -54.95
      手续费:       24.768611923040925
      最大连续盈利:  186.87702171834627
      最大连续亏损:  -54.94729267429522
      最大连盈次数:  12
      最大连亏次数:  3
      =============================
    
profit: 219.74759695863213
maxDrawdown 4.6%
startTime: 2022-04-26 00:00:00
趋势空且增强-R-1 总交易次数: 24 盈利: 253.77293707200397 亏损: -66.99244312750496 最大盈利: 102.85 最大亏损: -32.13 总收益: 186.78 平均盈利: 7.78 typeA: 6.49 胜率: 83.33%
趋势多且增强-L-1 总交易次数: 7 盈利: 46.48154635057713 亏损: -6.248729512704969 最大盈利: 19.89 最大亏损: -6.25 总收益: 40.23 平均盈利: 5.75 typeA: 4.93 胜率: 85.71%
趋势空且增强-R-2 总交易次数: 2 盈利: 15.376498348277508 亏损: -0.08061589878257194 最大盈利: 15.38 最大亏损: -0.08 总收益: 15.30 平均盈利: 7.65 typeA: 3.82 胜率: 50.00%
趋势多且增强-L-2 总交易次数: 5 盈利: 4.747691548446156 亏损: -1.6923448717038576 最大盈利: 1.75 最大亏损: -1.69 总收益: 3.06 平均盈利: 0.61 typeA: 0.49 胜率: 80.00%
趋势多且增强-L-3-1 总交易次数: 11 盈利: 58.21230470295849 亏损: -62.32131375676031 最大盈利: 19.94 最大亏损: -25.88 总收益: -4.11 平均盈利: -0.37 typeA: -0.24 胜率: 63.64%
趋势空且增强-R-3-1 总交易次数: 13 盈利: 58.71144866276762 亏损: -67.81938255893954 最大盈利: 16.78 最大亏损: -54.95 总收益: -9.11 平均盈利: -0.70 typeA: -0.54 胜率: 76.92%
Loaded 3000 15m candles

      ========== 回测结果 ==========
      总交易次数:     63
      盈利次数:       43
      亏损次数:       20
      胜率:          68.25%
      总收益:        70.10 USDT
      期末余额:      1057.50 USDT
      盈亏比:        1.24
      最大单笔盈利:  47.35
      最大单笔亏损:  -55.08
      手续费:       25.18148928402251
      最大连续盈利:  148.20719973000502
      最大连续亏损:  -80.19250662606044
      最大连盈次数:  10
      最大连亏次数:  3
      =============================
    
profit: 57.50366541491576
maxDrawdown 12.3%
startTime: 2022-05-26 00:00:00
趋势空且增强-R-3-1 总交易次数: 10 盈利: 103.14626669117322 亏损: -12.887526427061406 最大盈利: 47.19 最大亏损: -12.89 总收益: 90.26 平均盈利: 9.03 typeA: 8.12 胜率: 90.00%
趋势多且增强-L-2 总交易次数: 2 盈利: 15.904816140579204 亏损: -1.401863260706187 最大盈利: 15.90 最大亏损: -1.40 总收益: 14.50 平均盈利: 7.25 typeA: 3.63 胜率: 50.00%
趋势多且增强-L-1 总交易次数: 16 盈利: 116.77841793123231 亏损: -94.00653672549313 最大盈利: 47.35 最大亏损: -55.08 总收益: 22.77 平均盈利: 1.42 typeA: 1.16 胜率: 81.25%
趋势空且增强-R-1 总交易次数: 17 盈利: 69.23653995978509 亏损: -51.887350542793506 最大盈利: 42.14 最大亏损: -12.09 总收益: 17.35 平均盈利: 1.02 typeA: 0.54 胜率: 52.94%
趋势多且增强-L-3-1 总交易次数: 14 盈利: 55.76901842558253 亏损: -104.37707826288623 最大盈利: 9.94 最大亏损: -35.91 总收益: -48.61 平均盈利: -3.47 typeA: -2.23 胜率: 64.29%
趋势空且增强-R-2 总交易次数: 4 盈利: 6.278463920924349 亏损: -32.44950243541812 最大盈利: 5.25 最大亏损: -25.11 总收益: -26.17 平均盈利: -6.54 typeA: -3.27 胜率: 50.00%
Loaded 3000 15m candles

      ========== 回测结果 ==========
      总交易次数:     66
      盈利次数:       45
      亏损次数:       21
      胜率:          68.18%
      总收益:        -19.93 USDT
      期末余额:      966.87 USDT
      盈亏比:        0.95
      最大单笔盈利:  45.12
      最大单笔亏损:  -78.44
      手续费:       26.401514903408994
      最大连续盈利:  113.04062916473426
      最大连续亏损:  -78.43730664240216
      最大连盈次数:  11
      最大连亏次数:  3
      =============================
    
profit: -33.13106751468047
maxDrawdown 12.5%
startTime: 2022-06-25 00:00:00
趋势空且增强-R-2 总交易次数: 1 盈利: 12.17835659807166 亏损: 0 最大盈利: 12.18 最大亏损: 12.18 总收益: 12.18 平均盈利: 12.18 typeA: 12.18 胜率: 100.00%
趋势多且增强-L-3-1 总交易次数: 12 盈利: 88.38687568870287 亏损: -15.190612947972397 最大盈利: 24.18 最大亏损: -10.89 总收益: 73.20 平均盈利: 6.10 typeA: 4.57 胜率: 75.00%
趋势空且增强-R-1 总交易次数: 23 盈利: 135.62204708028463 亏损: -143.70557431087852 最大盈利: 45.12 最大亏损: -27.62 总收益: -8.08 平均盈利: -0.35 typeA: -0.21 胜率: 60.87%
趋势空且增强-R-3-1 总交易次数: 9 盈利: 48.16748530183239 亏损: -66.0157799044378 最大盈利: 9.83 最大亏损: -47.26 总收益: -17.85 平均盈利: -1.98 typeA: -1.54 胜率: 77.78%
趋势多且增强-L-2 总交易次数: 4 盈利: 5.1889504416828744 亏损: -36.638724722013905 最大盈利: 5.19 最大亏损: -24.69 总收益: -31.45 平均盈利: -7.86 typeA: -1.97 胜率: 25.00%
趋势多且增强-L-1 总交易次数: 17 盈利: 84.6636065694983 亏损: -132.587697309448 最大盈利: 25.28 最大亏损: -78.44 总收益: -47.92 平均盈利: -2.82 typeA: -2.16 胜率: 76.47%
Loaded 3000 15m candles

      ========== 回测结果 ==========
      总交易次数:     57
      盈利次数:       43
      亏损次数:       14
      胜率:          75.44%
      总收益:        163.89 USDT
      期末余额:      1152.49 USDT
      盈亏比:        2.06
      最大单笔盈利:  38.12
      最大单笔亏损:  -25.42
      手续费:       22.79648401919473
      最大连续盈利:  47.33314008379728
      最大连续亏损:  -25.41750741839773
      最大连盈次数:  7
      最大连亏次数:  2
      =============================
    
profit: 152.4884574544492
maxDrawdown 3.1%
startTime: 2022-07-25 00:00:00
趋势多且增强-L-1 总交易次数: 12 盈利: 98.04385696225077 亏损: -21.498824180384563 最大盈利: 38.12 最大亏损: -21.50 总收益: 76.55 平均盈利: 6.38 typeA: 5.85 胜率: 91.67%
趋势空且增强-R-2 总交易次数: 6 盈利: 17.170047874326567 亏损: -0.03752436647179788 最大盈利: 6.98 最大亏损: -0.04 总收益: 17.13 平均盈利: 2.86 typeA: 2.38 胜率: 83.33%
趋势空且增强-R-1 总交易次数: 17 盈利: 91.24927290758545 亏损: -38.59006797229571 最大盈利: 26.33 最大亏损: -11.88 总收益: 52.66 平均盈利: 3.10 typeA: 2.19 胜率: 70.59%
趋势空且增强-R-3-1 总交易次数: 8 盈利: 42.74054492197858 亏损: -22.2805641306315 最大盈利: 13.35 最大亏损: -13.65 总收益: 20.46 平均盈利: 2.56 typeA: 1.92 胜率: 75.00%
趋势多且增强-L-2 总交易次数: 5 盈利: 14.270484904151967 亏损: -2.986523657530675 最大盈利: 11.39 最大亏损: -2.93 总收益: 11.28 平均盈利: 2.26 typeA: 1.35 胜率: 60.00%
趋势多且增强-L-3-1 总交易次数: 9 盈利: 55.30802931833944 亏损: -69.50027512686617 最大盈利: 26.05 最大亏损: -25.42 总收益: -14.19 平均盈利: -1.58 typeA: -1.05 胜率: 66.67%
Loaded 3000 15m candles

      ========== 回测结果 ==========
      总交易次数:     65
      盈利次数:       44
      亏损次数:       21
      胜率:          67.69%
      总收益:        49.27 USDT
      期末余额:      1036.27 USDT
      盈亏比:        1.20
      最大单笔盈利:  59.93
      最大单笔亏损:  -32.89
      手续费:       25.985590166689427
      最大连续盈利:  101.22269712285254
      最大连续亏损:  -42.64097081890941
      最大连盈次数:  12
      最大连亏次数:  3
      =============================
    
profit: 36.27094048991603
maxDrawdown 12.4%
startTime: 2022-08-24 00:00:00
趋势空且增强-R-2 总交易次数: 6 盈利: 69.87715688135852 亏损: -9.73208493562951 最大盈利: 59.93 最大亏损: -9.73 总收益: 60.15 平均盈利: 10.02 typeA: 8.35 胜率: 83.33%
趋势空且增强-R-3-1 总交易次数: 14 盈利: 85.71908349926018 亏损: -62.60843588736422 最大盈利: 41.66 最大亏损: -30.22 总收益: 23.11 平均盈利: 1.65 typeA: 1.18 胜率: 71.43%
趋势多且增强-L-3-1 总交易次数: 9 盈利: 40.600880908575235 亏损: -32.83405737045311 最大盈利: 13.24 最大亏损: -15.87 总收益: 7.77 平均盈利: 0.86 typeA: 0.58 胜率: 66.67%
趋势多且增强-L-1 总交易次数: 16 盈利: 44.651937723997165 亏损: -51.63148628614875 最大盈利: 12.46 最大亏损: -16.99 总收益: -6.98 平均盈利: -0.44 typeA: -0.30 胜率: 68.75%
趋势空且增强-R-1 总交易次数: 16 盈利: 57.219419723067396 亏损: -80.50886010629519 最大盈利: 32.63 最大亏损: -32.89 总收益: -23.29 平均盈利: -1.46 typeA: -0.91 胜率: 62.50%
趋势多且增强-L-2 总交易次数: 4 盈利: 3.7970922292237113 亏损: -15.279705889672458 最大盈利: 3.49 最大亏损: -14.26 总收益: -11.48 平均盈利: -2.87 typeA: -1.44 胜率: 50.00%
Loaded 3000 15m candles

      ========== 回测结果 ==========
      总交易次数:     70
      盈利次数:       43
      亏损次数:       27
      胜率:          61.43%
      总收益:        -31.56 USDT
      期末余额:      954.44 USDT
      盈亏比:        0.86
      最大单笔盈利:  24.02
      最大单笔亏损:  -43.87
      手续费:       28.03093088504288
      最大连续盈利:  40.087677999789385
      最大连续亏损:  -44.23560267363036
      最大连盈次数:  5
      最大连亏次数:  3
      =============================
    
profit: -45.56207986447339
maxDrawdown 9.8%
startTime: 2022-09-23 00:00:00
趋势多且增强-L-2 总交易次数: 4 盈利: 27.627819423897268 亏损: -8.628542722161631 最大盈利: 24.02 最大亏损: -8.26 总收益: 19.00 平均盈利: 4.75 typeA: 2.37 胜率: 50.00%
趋势多且增强-L-1 总交易次数: 16 盈利: 46.95015926940203 亏损: -16.185348973373408 最大盈利: 12.67 最大亏损: -12.66 总收益: 30.76 平均盈利: 1.92 typeA: 1.56 胜率: 81.25%
趋势多且增强-L-3-1 总交易次数: 15 盈利: 70.04045655371314 亏损: -58.25661776154842 最大盈利: 20.02 最大亏损: -26.21 总收益: 11.78 平均盈利: 0.79 typeA: 0.47 胜率: 60.00%
趋势空且增强-R-1 总交易次数: 22 盈利: 39.71752595405856 亏损: -41.40858739794185 最大盈利: 7.41 最大亏损: -15.30 总收益: -1.69 平均盈利: -0.08 typeA: -0.05 胜率: 68.18%
趋势空且增强-R-3-1 总交易次数: 6 盈利: 4.832733354883136 亏损: -28.852573103147947 最大盈利: 3.34 最大亏损: -9.66 总收益: -24.02 平均盈利: -4.00 typeA: -1.33 胜率: 33.33%
趋势空且增强-R-2 总交易次数: 7 盈利: 6.156036258780406 亏损: -73.55514072103163 最大盈利: 5.25 最大亏损: -43.87 总收益: -67.40 平均盈利: -9.63 typeA: -2.75 胜率: 28.57%
Loaded 3000 15m candles

      ========== 回测结果 ==========
      总交易次数:     60
      盈利次数:       46
      亏损次数:       14
      胜率:          76.67%
      总收益:        572.56 USDT
      期末余额:      1560.56 USDT
      盈亏比:        2.88
      最大单笔盈利:  160.75
      最大单笔亏损:  -93.81
      手续费:       23.98699582741432
      最大连续盈利:  385.3155569363739
      最大连续亏损:  -93.81183361224006
      最大连盈次数:  14
      最大连亏次数:  3
      =============================
    
profit: 560.559913431325
maxDrawdown 7.2%
startTime: 2022-10-23 00:00:00
趋势多且增强-L-2 总交易次数: 4 盈利: 173.9387420875884 亏损: -16.146303372653307 最大盈利: 90.18 最大亏损: -16.15 总收益: 157.79 平均盈利: 39.45 typeA: 29.59 胜率: 75.00%
趋势空且增强-R-1 总交易次数: 19 盈利: 357.49200298693404 亏损: -29.915441411961538 最大盈利: 160.75 最大亏损: -28.07 总收益: 327.58 平均盈利: 17.24 typeA: 15.43 胜率: 89.47%
趋势多且增强-L-3-1 总交易次数: 10 盈利: 166.90106738998898 亏损: -66.63653900854584 最大盈利: 55.35 最大亏损: -57.37 总收益: 100.26 平均盈利: 10.03 typeA: 8.02 胜率: 80.00%
趋势空且增强-R-2 总交易次数: 3 盈利: 9.258156028368774 亏损: -3.68461604273294 最大盈利: 9.26 最大亏损: -3.65 总收益: 5.57 平均盈利: 1.86 typeA: 0.62 胜率: 33.33%
趋势多且增强-L-1 总交易次数: 14 盈利: 80.11298137880812 亏损: -84.05887791459568 最大盈利: 19.53 最大亏损: -31.64 总收益: -3.95 平均盈利: -0.28 typeA: -0.18 胜率: 64.29%
趋势空且增强-R-3-1 总交易次数: 10 盈利: 89.47972298827978 亏损: -104.18098167815113 最大盈利: 49.18 最大亏损: -93.81 总收益: -14.70 平均盈利: -1.47 typeA: -1.18 胜率: 80.00%
Loaded 3000 15m candles

      ========== 回测结果 ==========
      总交易次数:     54
      盈利次数:       35
      亏损次数:       19
      胜率:          64.81%
      总收益:        39.55 USDT
      期末余额:      1028.75 USDT
      盈亏比:        1.12
      最大单笔盈利:  71.42
      最大单笔亏损:  -60.50
      手续费:       21.593322306593805
      最大连续盈利:  76.28223146728223
      最大连续亏损:  -124.05408004531103
      最大连盈次数:  7
      最大连亏次数:  3
      =============================
    
profit: 28.75494138076033
maxDrawdown 13.2%
startTime: 2022-11-22 00:00:00
趋势多且增强-L-3-1 总交易次数: 6 盈利: 34.281459399117594 亏损: -1.7357910906298708 最大盈利: 12.76 最大亏损: -1.74 总收益: 32.55 平均盈利: 5.42 typeA: 4.52 胜率: 83.33%
趋势空且增强-R-3-1 总交易次数: 9 盈利: 64.53336088064889 亏损: -31.60381042632321 最大盈利: 20.00 最大亏损: -29.96 总收益: 32.93 平均盈利: 3.66 typeA: 2.85 胜率: 77.78%
趋势空且增强-R-2 总交易次数: 3 盈利: 7.592147086319733 亏损: -0.42929901848891816 最大盈利: 7.59 最大亏损: -0.33 总收益: 7.16 平均盈利: 2.39 typeA: 0.80 胜率: 33.33%
趋势空且增强-R-1 总交易次数: 17 盈利: 161.67260417350613 亏损: -165.68826366347804 最大盈利: 71.42 最大亏损: -48.85 总收益: -4.02 平均盈利: -0.24 typeA: -0.14 胜率: 58.82%
趋势多且增强-L-1 总交易次数: 13 盈利: 91.97524756594215 亏损: -105.87073566056229 最大盈利: 40.36 最大亏损: -60.50 总收益: -13.90 平均盈利: -1.07 typeA: -0.74 胜率: 69.23%
趋势多且增强-L-2 总交易次数: 6 盈利: 15.003328413629752 亏损: -30.17530627891955 最大盈利: 11.44 最大亏损: -17.88 总收益: -15.17 平均盈利: -2.53 typeA: -1.26 胜率: 50.00%
Loaded 3000 15m candles

      ========== 回测结果 ==========
      总交易次数:     52
      盈利次数:       31
      亏损次数:       21
      胜率:          59.62%
      总收益:        113.86 USDT
      期末余额:      1103.46 USDT
      盈亏比:        1.73
      最大单笔盈利:  42.69
      最大单笔亏损:  -26.67
      手续费:       20.824946464987008
      最大连续盈利:  75.34302700569549
      最大连续亏损:  -34.71832253267952
      最大连盈次数:  10
      最大连亏次数:  3
      =============================
    
profit: 103.45913564840976
maxDrawdown 7.6%
startTime: 2022-12-22 00:00:00
趋势多且增强-L-2 总交易次数: 4 盈利: 47.35559934563906 亏损: -10.892631546273712 最大盈利: 42.69 最大亏损: -8.28 总收益: 36.46 平均盈利: 9.12 typeA: 4.56 胜率: 50.00%
趋势多且增强-L-3-1 总交易次数: 9 盈利: 49.483858925960085 亏损: -11.161002349255986 最大盈利: 14.74 最大亏损: -11.16 总收益: 38.32 平均盈利: 4.26 typeA: 3.79 胜率: 88.89%
趋势多且增强-L-1 总交易次数: 18 盈利: 90.35987116793962 亏损: -46.86239366044959 最大盈利: 29.82 最大亏损: -10.75 总收益: 43.50 平均盈利: 2.42 typeA: 1.61 胜率: 66.67%
趋势空且增强-R-3-1 总交易次数: 4 盈利: 17.296039553100883 亏损: -9.043718531253818 最大盈利: 9.27 最大亏损: -9.04 总收益: 8.25 平均盈利: 2.06 typeA: 1.55 胜率: 75.00%
趋势空且增强-R-2 总交易次数: 5 盈利: 15.391582229150513 亏损: -20.13646745257345 最大盈利: 15.39 最大亏损: -15.18 总收益: -4.74 平均盈利: -0.95 typeA: -0.19 胜率: 20.00%
趋势空且增强-R-1 总交易次数: 12 盈利: 49.84899189455141 亏损: -57.78059392812254 最大盈利: 35.15 最大亏损: -26.67 总收益: -7.93 平均盈利: -0.66 typeA: -0.28 胜率: 41.67%
Loaded 3000 15m candles

      ========== 回测结果 ==========
      总交易次数:     61
      盈利次数:       42
      亏损次数:       19
      胜率:          68.85%
      总收益:        81.22 USDT
      期末余额:      1068.82 USDT
      盈亏比:        1.45
      最大单笔盈利:  48.65
      最大单笔亏损:  -32.20
      手续费:       24.596309477776515
      最大连续盈利:  70.35939976134698
      最大连续亏损:  -41.00752658843487
      最大连盈次数:  6
      最大连亏次数:  3
      =============================
    
profit: 68.8159102153545
maxDrawdown 6.9%
startTime: 2023-01-21 00:00:00
趋势空且增强-R-3-1 总交易次数: 6 盈利: 34.19274677854403 亏损: 0 最大盈利: 13.59 最大亏损: 2.42 总收益: 34.19 平均盈利: 5.70 typeA: 5.70 胜率: 100.00%
趋势多且增强-L-2 总交易次数: 4 盈利: 19.44092443291047 亏损: 0 最大盈利: 14.82 最大亏损: 1.07 总收益: 19.44 平均盈利: 4.86 typeA: 4.86 胜率: 100.00%
趋势多且增强-L-1 总交易次数: 17 盈利: 90.86890852015146 亏损: -44.865134867724805 最大盈利: 22.45 最大亏损: -22.11 总收益: 46.00 平均盈利: 2.71 typeA: 2.07 胜率: 76.47%
趋势空且增强-R-1 总交易次数: 22 盈利: 83.12459676733498 亏损: -63.780399302450306 最大盈利: 48.65 最大亏损: -24.01 总收益: 19.34 平均盈利: 0.88 typeA: 0.52 胜率: 59.09%
趋势空且增强-R-2 总交易次数: 2 盈利: 0.37167352537732473 亏损: -3.9650158804846587 最大盈利: 0.37 最大亏损: -3.97 总收益: -3.59 平均盈利: -1.80 typeA: -0.90 胜率: 50.00%
趋势多且增强-L-3-1 总交易次数: 10 盈利: 33.08181814679494 亏损: -67.25420790509573 最大盈利: 10.10 最大亏损: -32.20 总收益: -34.17 平均盈利: -3.42 typeA: -1.71 胜率: 50.00%
Loaded 3000 15m candles

      ========== 回测结果 ==========
      总交易次数:     63
      盈利次数:       40
      亏损次数:       23
      胜率:          63.49%
      总收益:        82.55 USDT
      期末余额:      1069.95 USDT
      盈亏比:        1.41
      最大单笔盈利:  44.92
      最大单笔亏损:  -42.73
      手续费:       25.230734702932427
      最大连续盈利:  88.22634390614374
      最大连续亏损:  -42.72906733584271
      最大连盈次数:  5
      最大连亏次数:  3
      =============================
    
profit: 69.94672512918874
maxDrawdown 6.1%
startTime: 2023-02-20 00:00:00
趋势多且增强-L-1 总交易次数: 8 盈利: 81.93322865587558 亏损: -11.275662083966482 最大盈利: 43.91 最大亏损: -10.71 总收益: 70.66 平均盈利: 8.83 typeA: 6.62 胜率: 75.00%
趋势空且增强-R-2 总交易次数: 6 盈利: 58.8817267346029 亏损: -8.8165074962605 最大盈利: 44.92 最大亏损: -5.67 总收益: 50.07 平均盈利: 8.34 typeA: 5.56 胜率: 66.67%
趋势多且增强-L-2 总交易次数: 7 盈利: 37.69631288998541 亏损: -9.622029540756236 最大盈利: 19.92 最大亏损: -5.74 总收益: 28.07 平均盈利: 4.01 typeA: 2.29 胜率: 57.14%
趋势多且增强-L-3-1 总交易次数: 11 盈利: 34.73789637233529 亏损: -14.269144143721514 最大盈利: 11.88 最大亏损: -11.34 总收益: 20.47 平均盈利: 1.86 typeA: 1.35 胜率: 72.73%
趋势空且增强-R-1 总交易次数: 24 盈利: 55.72247682706505 亏损: -106.3201570811143 最大盈利: 21.19 最大亏损: -42.73 总收益: -50.60 平均盈利: -2.11 typeA: -1.32 胜率: 62.50%
趋势空且增强-R-3-1 总交易次数: 7 盈利: 12.80366881155535 亏损: -48.92508481640872 最大盈利: 7.75 最大亏损: -15.57 总收益: -36.12 平均盈利: -5.16 typeA: -2.21 胜率: 42.86%
Loaded 3000 15m candles

      ========== 回测结果 ==========
      总交易次数:     55
      盈利次数:       39
      亏损次数:       16
      胜率:          70.91%
      总收益:        152.59 USDT
      期末余额:      1141.59 USDT
      盈亏比:        2.19
      最大单笔盈利:  41.67
      最大单笔亏损:  -21.35
      手续费:       21.989648285485696
      最大连续盈利:  73.80469996874734
      最大连续亏损:  -23.298301357722977
      最大连盈次数:  6
      最大连亏次数:  3
      =============================
    
profit: 141.59090420366192
maxDrawdown 3.8%
startTime: 2023-03-22 00:00:00
趋势空且增强-R-1 总交易次数: 17 盈利: 90.52169999403287 亏损: -3.0515438979918743 最大盈利: 28.59 最大亏损: -2.48 总收益: 87.47 平均盈利: 5.15 typeA: 4.54 胜率: 88.24%
趋势多且增强-L-3-1 总交易次数: 6 盈利: 31.408624798936657 亏损: -9.820313613685022 最大盈利: 9.71 最大亏损: -9.82 总收益: 21.59 平均盈利: 3.60 typeA: 3.00 胜率: 83.33%
趋势空且增强-R-3-1 总交易次数: 6 盈利: 25.337731093125164 亏损: -9.181136709691296 最大盈利: 9.70 最大亏损: -8.18 总收益: 16.16 平均盈利: 2.69 typeA: 1.80 胜率: 66.67%
趋势多且增强-L-1 总交易次数: 16 盈利: 111.99568473997458 亏损: -83.410184651919 最大盈利: 41.67 最大亏损: -21.35 总收益: 28.59 平均盈利: 1.79 typeA: 1.12 胜率: 62.50%
趋势空且增强-R-2 总交易次数: 1 盈利: 0 亏损: -0.7356540366849428 最大盈利: -0.74 最大亏损: -0.74 总收益: -0.74 平均盈利: -0.74 typeA: 0.00 胜率: 0.00%
趋势多且增强-L-2 总交易次数: 9 盈利: 21.624300511678936 亏损: -22.09830402411105 最大盈利: 11.24 最大亏损: -16.12 总收益: -0.47 平均盈利: -0.05 typeA: -0.03 胜率: 55.56%
Loaded 3000 15m candles

      ========== 回测结果 ==========
      总交易次数:     67
      盈利次数:       37
      亏损次数:       30
      胜率:          55.22%
      总收益:        -156.94 USDT
      期末余额:      829.66 USDT
      盈亏比:        0.44
      最大单笔盈利:  11.60
      最大单笔亏损:  -58.58
      手续费:       26.78324352970517
      最大连续盈利:  19.917635301762335
      最大连续亏损:  -58.57538012407247
      最大连盈次数:  5
      最大连亏次数:  4
      =============================
    
profit: -170.34396391125654
maxDrawdown 19.4%
startTime: 2023-04-21 00:00:00
趋势空且增强-R-2 总交易次数: 5 盈利: 0 亏损: -10.55594569849848 最大盈利: -0.33 最大亏损: -6.46 总收益: -10.56 平均盈利: -2.11 typeA: 0.00 胜率: 0.00%
趋势空且增强-R-3-1 总交易次数: 19 盈利: 53.277000545027846 亏损: -65.63312755902774 最大盈利: 8.73 最大亏损: -19.62 总收益: -12.36 平均盈利: -0.65 typeA: -0.41 胜率: 63.16%
趋势空且增强-R-1 总交易次数: 22 盈利: 37.32630774647635 亏损: -53.50939732464795 最大盈利: 10.34 最大亏损: -15.34 总收益: -16.18 平均盈利: -0.74 typeA: -0.47 胜率: 63.64%
趋势多且增强-L-3-1 总交易次数: 11 盈利: 25.2133922200811 亏损: -60.65866760180842 最大盈利: 11.60 最大亏损: -23.72 总收益: -35.45 平均盈利: -3.22 typeA: -2.05 胜率: 63.64%
趋势多且增强-L-2 总交易次数: 6 盈利: 2.7751902943970856 亏损: -59.539195343578484 最大盈利: 2.43 最大亏损: -58.58 总收益: -56.76 平均盈利: -9.46 typeA: -3.15 胜率: 33.33%
趋势多且增强-L-1 总交易次数: 4 盈利: 3.046729392422393 亏损: -28.686250582097276 最大盈利: 2.23 最大亏损: -20.65 总收益: -25.64 平均盈利: -6.41 typeA: -3.20 胜率: 50.00%
Loaded 3000 15m candles

      ========== 回测结果 ==========
      总交易次数:     46
      盈利次数:       30
      亏损次数:       16
      胜率:          65.22%
      总收益:        35.61 USDT
      期末余额:      1026.41 USDT
      盈亏比:        1.27
      最大单笔盈利:  73.46
      最大单笔亏损:  -47.20
      手续费:       18.394122284266235
      最大连续盈利:  73.46083808993461
      最大连续亏损:  -48.82946388423862
      最大连盈次数:  5
      最大连亏次数:  3
      =============================
    
profit: 26.41460410580362
maxDrawdown 6.1%
startTime: 2023-05-21 00:00:00
趋势空且增强-R-3-1 总交易次数: 8 盈利: 17.27552373829426 亏损: 0 最大盈利: 4.35 最大亏损: 0.54 总收益: 17.28 平均盈利: 2.16 typeA: 2.16 胜率: 100.00%
趋势多且增强-L-3-1 总交易次数: 5 盈利: 11.851612481173486 亏损: -4.47382790954226 最大盈利: 4.19 最大亏损: -4.47 总收益: 7.38 平均盈利: 1.48 typeA: 1.18 胜率: 80.00%
趋势多且增强-L-1 总交易次数: 10 盈利: 21.12095516972304 亏损: -14.707679358315874 最大盈利: 7.28 最大亏损: -13.01 总收益: 6.41 平均盈利: 0.64 typeA: 0.45 胜率: 70.00%
趋势空且增强-R-2 总交易次数: 2 盈利: 2.0574238271804166 亏损: -0.609526409171588 最大盈利: 2.06 最大亏损: -0.61 总收益: 1.45 平均盈利: 0.72 typeA: 0.36 胜率: 50.00%
趋势空且增强-R-1 总交易次数: 17 盈利: 112.14732909620228 亏损: -99.16467799258753 最大盈利: 73.46 最大亏损: -47.20 总收益: 12.98 平均盈利: 0.76 typeA: 0.31 胜率: 41.18%
趋势多且增强-L-2 总交易次数: 4 盈利: 2.714501030909883 亏损: -12.597029568060965 最大盈利: 1.05 最大亏损: -12.60 总收益: -9.88 平均盈利: -2.47 typeA: -1.85 胜率: 75.00%
Loaded 3000 15m candles

      ========== 回测结果 ==========
      总交易次数:     52
      盈利次数:       34
      亏损次数:       18
      胜率:          65.38%
      总收益:        -37.81 USDT
      期末余额:      951.59 USDT
      盈亏比:        0.83
      最大单笔盈利:  24.65
      最大单笔亏损:  -66.53
      手续费:       21.0229125743369
      最大连续盈利:  35.0585967008473
      最大连续亏损:  -66.53012680367291
      最大连盈次数:  6
      最大连亏次数:  3
      =============================
    
profit: -48.40756553124811
maxDrawdown 10.5%
startTime: 2023-06-20 00:00:00
趋势空且增强-R-2 总交易次数: 1 盈利: 4.530569131325788 亏损: 0 最大盈利: 4.53 最大亏损: 4.53 总收益: 4.53 平均盈利: 4.53 typeA: 4.53 胜率: 100.00%
趋势多且增强-L-1 总交易次数: 10 盈利: 34.871978896021254 亏损: -12.326295393698384 最大盈利: 16.00 最大亏损: -5.67 总收益: 22.55 平均盈利: 2.25 typeA: 1.58 胜率: 70.00%
趋势多且增强-L-2 总交易次数: 8 盈利: 19.822589056458455 亏损: -5.562707178181233 最大盈利: 7.46 最大亏损: -4.13 总收益: 14.26 平均盈利: 1.78 typeA: 1.11 胜率: 62.50%
趋势多且增强-L-3-1 总交易次数: 3 盈利: 14.59497048811707 亏损: -12.020144326731044 最大盈利: 10.36 最大亏损: -12.02 总收益: 2.57 平均盈利: 0.86 typeA: 0.57 胜率: 66.67%
趋势空且增强-R-3-1 总交易次数: 7 盈利: 22.20415574108737 亏损: -38.00787831811742 最大盈利: 13.09 最大亏损: -23.92 总收益: -15.80 平均盈利: -2.26 typeA: -1.61 胜率: 71.43%
趋势空且增强-R-1 总交易次数: 23 盈利: 83.73095479563796 亏损: -149.6457584231659 最大盈利: 24.65 最大亏损: -66.53 总收益: -65.91 平均盈利: -2.87 typeA: -1.74 胜率: 60.87%
Loaded 3000 15m candles

      ========== 回测结果 ==========
      总交易次数:     58
      盈利次数:       32
      亏损次数:       26
      胜率:          55.17%
      总收益:        -42.32 USDT
      期末余额:      945.88 USDT
      盈亏比:        0.85
      最大单笔盈利:  73.01
      最大单笔亏损:  -76.26
      手续费:       23.377586477649274
      最大连续盈利:  140.43327450446412
      最大连续亏损:  -83.15259565601474
      最大连盈次数:  5
      最大连亏次数:  3
      =============================
    
profit: -54.11576962538243
maxDrawdown 20.3%
startTime: 2023-07-20 00:00:00
趋势空且增强-R-2 总交易次数: 4 盈利: 78.14464602718971 亏损: 0 最大盈利: 73.01 最大亏损: 0.33 总收益: 78.14 平均盈利: 19.54 typeA: 19.54 胜率: 100.00%
趋势空且增强-R-3-1 总交易次数: 8 盈利: 29.520895111422014 亏损: -29.70825116539178 最大盈利: 22.95 最大亏损: -8.85 总收益: -0.19 平均盈利: -0.02 typeA: -0.01 胜率: 37.50%
趋势多且增强-L-3-1 总交易次数: 9 盈利: 16.244760812598788 亏损: -30.153166438782556 最大盈利: 5.00 最大亏损: -12.72 总收益: -13.91 平均盈利: -1.55 typeA: -0.69 胜率: 44.44%
趋势多且增强-L-2 总交易次数: 6 盈利: 9.725242319650139 亏损: -23.81281647643125 最大盈利: 7.46 最大亏损: -14.96 总收益: -14.09 平均盈利: -2.35 typeA: -1.17 胜率: 50.00%
趋势空且增强-R-1 总交易次数: 18 盈利: 88.36936967314296 亏损: -131.6538124006233 最大盈利: 49.40 最大亏损: -76.26 总收益: -43.28 平均盈利: -2.40 typeA: -1.34 胜率: 55.56%
趋势多且增强-L-1 总交易次数: 13 盈利: 24.541331214412665 亏损: -73.5339683025671 最大盈利: 5.09 最大亏损: -28.35 总收益: -48.99 平均盈利: -3.77 typeA: -2.32 胜率: 61.54%
Loaded 3000 15m candles

      ========== 回测结果 ==========
      总交易次数:     56
      盈利次数:       29
      亏损次数:       27
      胜率:          51.79%
      总收益:        -173.94 USDT
      期末余额:      814.66 USDT
      盈亏比:        0.32
      最大单笔盈利:  12.96
      最大单笔亏损:  -42.92
      手续费:       22.610998028557926
      最大连续盈利:  20.035316753701835
      最大连续亏损:  -72.98697415292433
      最大连盈次数:  7
      最大连亏次数:  4
      =============================
    
profit: -185.33891159308303
maxDrawdown 18.9%
startTime: 2023-08-19 00:00:00
趋势空且增强-R-3-1 总交易次数: 6 盈利: 14.626850361858171 亏损: -5.213128536782502 最大盈利: 6.58 最大亏损: -5.21 总收益: 9.41 平均盈利: 1.57 typeA: 1.31 胜率: 83.33%
趋势多且增强-L-3-1 总交易次数: 12 盈利: 14.008191257181748 亏损: -19.755516673716365 最大盈利: 4.09 最大亏损: -8.56 总收益: -5.75 平均盈利: -0.48 typeA: -0.28 胜率: 58.33%
趋势多且增强-L-1 总交易次数: 12 盈利: 24.964018362283873 亏损: -57.43137042492883 最大盈利: 12.96 最大亏损: -37.93 总收益: -32.47 平均盈利: -2.71 typeA: -1.35 胜率: 50.00%
趋势空且增强-R-2 总交易次数: 6 盈利: 0.5894238358328077 亏损: -63.858523374763564 最大盈利: 0.59 最大亏损: -42.92 总收益: -63.27 平均盈利: -10.54 typeA: -1.76 胜率: 16.67%
趋势多且增强-L-2 总交易次数: 7 盈利: 11.40781179272417 亏损: -33.2512459238446 最大盈利: 6.61 最大亏损: -22.44 总收益: -21.84 平均盈利: -3.12 typeA: -1.78 胜率: 57.14%
趋势空且增强-R-1 总交易次数: 13 盈利: 16.455548203397278 亏损: -76.4809704723225 最大盈利: 5.78 最大亏损: -20.51 总收益: -60.03 平均盈利: -4.62 typeA: -2.13 胜率: 46.15%
Loaded 3000 15m candles

      ========== 回测结果 ==========
      总交易次数:     58
      盈利次数:       35
      亏损次数:       23
      胜率:          60.34%
      总收益:        -26.35 USDT
      期末余额:      962.05 USDT
      盈亏比:        0.77
      最大单笔盈利:  8.88
      最大单笔亏损:  -21.13
      手续费:       23.201562506207527
      最大连续盈利:  28.65795266252493
      最大连续亏损:  -29.659789105797522
      最大连盈次数:  8
      最大连亏次数:  4
      =============================
    
profit: -37.94916118363062
maxDrawdown 5.1%
startTime: 2023-09-18 00:00:00
趋势空且增强-R-3-1 总交易次数: 7 盈利: 11.218757558899524 亏损: -7.567654280569635 最大盈利: 2.61 最大亏损: -7.57 总收益: 3.65 平均盈利: 0.52 typeA: 0.45 胜率: 85.71%
趋势多且增强-L-1 总交易次数: 18 盈利: 40.14563990759742 亏损: -33.00379858359113 最大盈利: 8.88 最大亏损: -13.29 总收益: 7.14 平均盈利: 0.40 typeA: 0.29 胜率: 72.22%
趋势空且增强-R-2 总交易次数: 3 盈利: 0 亏损: -8.579807955152893 最大盈利: -0.03 最大亏损: -5.90 总收益: -8.58 平均盈利: -2.86 typeA: 0.00 胜率: 0.00%
趋势多且增强-L-2 总交易次数: 5 盈利: 5.842048346055844 亏损: -14.401330725679843 最大盈利: 5.84 最大亏损: -10.29 总收益: -8.56 平均盈利: -1.71 typeA: -0.34 胜率: 20.00%
趋势空且增强-R-1 总交易次数: 20 盈利: 25.85068737385119 亏损: -38.2043035675975 最大盈利: 6.47 最大亏损: -21.13 总收益: -12.35 平均盈利: -0.62 typeA: -0.37 胜率: 60.00%
趋势多且增强-L-3-1 总交易次数: 5 盈利: 5.061469986878162 亏损: -12.710869244319106 最大盈利: 1.74 最大亏损: -8.10 总收益: -7.65 平均盈利: -1.53 typeA: -0.92 胜率: 60.00%
Loaded 3000 15m candles

      ========== 回测结果 ==========
      总交易次数:     60
      盈利次数:       39
      亏损次数:       21
      胜率:          65.00%
      总收益:        182.33 USDT
      期末余额:      1170.33 USDT
      盈亏比:        1.82
      最大单笔盈利:  85.08
      最大单笔亏损:  -26.51
      手续费:       24.04546945681421
      最大连续盈利:  85.07528631705844
      最大连续亏损:  -57.29211603004729
      最大连盈次数:  9
      最大连亏次数:  5
      =============================
    
profit: 170.33445282348634
maxDrawdown 7.3%
startTime: 2023-10-18 00:00:00
趋势多且增强-L-1 总交易次数: 9 盈利: 153.04588995489618 亏损: 0 最大盈利: 85.08 最大亏损: 1.28 总收益: 153.05 平均盈利: 17.01 typeA: 17.01 胜率: 100.00%
趋势多且增强-L-3-1 总交易次数: 12 盈利: 64.30459575919154 亏损: -37.81252595500968 最大盈利: 15.38 最大亏损: -25.88 总收益: 26.49 平均盈利: 2.21 typeA: 1.84 胜率: 83.33%
趋势多且增强-L-2 总交易次数: 13 盈利: 88.180112931813 亏损: -63.696642235779784 最大盈利: 37.89 最大亏损: -25.40 总收益: 24.48 平均盈利: 1.88 typeA: 1.16 胜率: 61.54%
趋势空且增强-R-2 总交易次数: 1 盈利: 0 亏损: -1.5594291539245115 最大盈利: -1.56 最大亏损: -1.56 总收益: -1.56 平均盈利: -1.56 typeA: 0.00 胜率: 0.00%
趋势空且增强-R-1 总交易次数: 17 盈利: 67.48088779912983 亏损: -72.46693017770902 最大盈利: 25.32 最大亏损: -22.49 总收益: -4.99 平均盈利: -0.29 typeA: -0.14 胜率: 47.06%
趋势空且增强-R-3-1 总交易次数: 8 盈利: 31.102424928959273 亏损: -46.24393102807795 最大盈利: 18.68 最大亏损: -26.51 总收益: -15.14 平均盈利: -1.89 typeA: -0.95 胜率: 50.00%
Loaded 3000 15m candles

      ========== 回测结果 ==========
      总交易次数:     62
      盈利次数:       41
      亏损次数:       21
      胜率:          66.13%
      总收益:        102.92 USDT
      期末余额:      1090.32 USDT
      盈亏比:        1.44
      最大单笔盈利:  92.33
      最大单笔亏损:  -34.32
      手续费:       25.00945071843738
      最大连续盈利:  101.61254516369223
      最大连续亏损:  -38.70114360744009
      最大连盈次数:  9
      最大连亏次数:  3
      =============================
    
profit: 90.31820377215467
maxDrawdown 6.4%
startTime: 2023-11-17 00:00:00
趋势空且增强-R-2 总交易次数: 1 盈利: 10.710105871029763 亏损: 0 最大盈利: 10.71 最大亏损: 10.71 总收益: 10.71 平均盈利: 10.71 typeA: 10.71 胜率: 100.00%
趋势空且增强-R-1 总交易次数: 18 盈利: 94.99564917425596 亏损: -52.22084967044926 最大盈利: 19.38 最大亏损: -23.53 总收益: 42.77 平均盈利: 2.38 typeA: 1.72 胜率: 72.22%
趋势多且增强-L-3-1 总交易次数: 6 盈利: 32.240914050671705 亏损: -18.953546855902182 最大盈利: 13.01 最大亏损: -15.31 总收益: 13.29 平均盈利: 2.21 typeA: 1.48 胜率: 66.67%
趋势多且增强-L-1 总交易次数: 17 盈利: 69.96331739162753 亏损: -40.40438148264265 最大盈利: 13.53 最大亏损: -18.46 总收益: 29.56 平均盈利: 1.74 typeA: 1.43 胜率: 82.35%
趋势多且增强-L-2 总交易次数: 12 盈利: 101.11755260661492 亏损: -69.68949049622037 最大盈利: 92.33 最大亏损: -34.32 总收益: 31.43 平均盈利: 2.62 typeA: 1.09 胜率: 41.67%
趋势空且增强-R-3-1 总交易次数: 8 盈利: 27.127110866212057 亏损: -51.96817768304071 最大盈利: 14.77 最大亏损: -20.64 总收益: -24.84 平均盈利: -3.11 typeA: -1.55 胜率: 50.00%
Loaded 3000 15m candles

      ========== 回测结果 ==========
      总交易次数:     61
      盈利次数:       37
      亏损次数:       24
      胜率:          60.66%
      总收益:        -71.25 USDT
      期末余额:      916.55 USDT
      盈亏比:        0.72
      最大单笔盈利:  17.58
      最大单笔亏损:  -51.29
      手续费:       24.42512928897979
      最大连续盈利:  40.04001200607198
      最大连续亏损:  -76.46732799457735
      最大连盈次数:  5
      最大连亏次数:  4
      =============================
    
profit: -83.44953991525767
maxDrawdown 10.5%
startTime: 2023-12-17 00:00:00
趋势多且增强-L-1 总交易次数: 10 盈利: 48.342984872857 亏损: -24.708605931201696 最大盈利: 15.21 最大亏损: -16.25 总收益: 23.63 平均盈利: 2.36 typeA: 1.65 胜率: 70.00%
趋势多且增强-L-2 总交易次数: 5 盈利: 8.981524628537237 亏损: -0.7479897615791943 最大盈利: 4.25 最大亏损: -0.44 总收益: 8.23 平均盈利: 1.65 typeA: 0.99 胜率: 60.00%
趋势空且增强-R-2 总交易次数: 2 盈利: 0 亏损: -5.465882608804604 最大盈利: -1.61 最大亏损: -3.85 总收益: -5.47 平均盈利: -2.73 typeA: 0.00 胜率: 0.00%
趋势多且增强-L-3-1 总交易次数: 9 盈利: 48.361299120298824 亏损: -51.72485799596142 最大盈利: 17.58 最大亏损: -19.71 总收益: -3.36 平均盈利: -0.37 typeA: -0.21 胜率: 55.56%
趋势空且增强-R-1 总交易次数: 23 盈利: 37.80431422058058 亏损: -98.38430674688254 最大盈利: 12.30 最大亏损: -36.65 总收益: -60.58 平均盈利: -2.63 typeA: -1.37 胜率: 52.17%
趋势空且增强-R-3-1 总交易次数: 12 盈利: 37.332262617515696 亏损: -71.04028233061467 最大盈利: 8.03 最大亏损: -51.29 总收益: -33.71 平均盈利: -2.81 typeA: -2.34 胜率: 83.33%
Loaded 3000 15m candles

      ========== 回测结果 ==========
      总交易次数:     62
      盈利次数:       39
      亏损次数:       23
      胜率:          62.90%
      总收益:        56.79 USDT
      期末余额:      1044.19 USDT
      盈亏比:        1.29
      最大单笔盈利:  58.45
      最大单笔亏损:  -31.87
      手续费:       24.996504877969787
      最大连续盈利:  69.60586207731366
      最大连续亏损:  -42.413117857442344
      最大连盈次数:  13
      最大连亏次数:  4
      =============================
    
profit: 44.186924815093334
maxDrawdown 7.0%
startTime: 2024-01-16 00:00:00
趋势多且增强-L-3-1 总交易次数: 7 盈利: 20.92968173216088 亏损: -6.446532441545464 最大盈利: 5.35 最大亏损: -5.86 总收益: 14.48 平均盈利: 2.07 typeA: 1.48 胜率: 71.43%
趋势空且增强-R-3-1 总交易次数: 10 盈利: 32.12374444522516 亏损: -17.533281458039582 最大盈利: 7.89 最大亏损: -9.73 总收益: 14.59 平均盈利: 1.46 typeA: 1.17 胜率: 80.00%
趋势多且增强-L-1 总交易次数: 16 盈利: 93.90274859892568 亏损: -74.05193559786721 最大盈利: 48.54 最大亏损: -31.87 总收益: 19.85 平均盈利: 1.24 typeA: 0.85 胜率: 68.75%
趋势空且增强-R-1 总交易次数: 22 盈利: 104.03843891384221 亏损: -80.79631137395948 最大盈利: 58.45 最大亏损: -25.34 总收益: 23.24 平均盈利: 1.06 typeA: 0.53 胜率: 50.00%
趋势空且增强-R-2 总交易次数: 1 盈利: 0 亏损: -1.0944047010730789 最大盈利: -1.09 最大亏损: -1.09 总收益: -1.09 平均盈利: -1.09 typeA: 0.00 胜率: 0.00%
趋势多且增强-L-2 总交易次数: 6 盈利: 3.653495543022334 亏损: -17.938718845595954 最大盈利: 1.65 最大亏损: -14.99 总收益: -14.29 平均盈利: -2.38 typeA: -1.59 胜率: 66.67%
Loaded 3000 15m candles

      ========== 回测结果 ==========
      总交易次数:     57
      盈利次数:       32
      亏损次数:       25
      胜率:          56.14%
      总收益:        36.02 USDT
      期末余额:      1024.62 USDT
      盈亏比:        1.10
      最大单笔盈利:  79.78
      最大单笔亏损:  -54.83
      手续费:       22.83682052548881
      最大连续盈利:  146.468972876531
      最大连续亏损:  -64.18107724480193
      最大连盈次数:  5
      最大连亏次数:  3
      =============================
    
profit: 24.624125385833395
maxDrawdown 13.6%
startTime: 2024-02-15 00:00:00
趋势空且增强-R-2 总交易次数: 1 盈利: 3.3602614226527368 亏损: 0 最大盈利: 3.36 最大亏损: 3.36 总收益: 3.36 平均盈利: 3.36 typeA: 3.36 胜率: 100.00%
趋势多且增强-L-1 总交易次数: 12 盈利: 142.3014085251521 亏损: -79.4434477278203 最大盈利: 79.78 最大亏损: -29.54 总收益: 62.86 平均盈利: 5.24 typeA: 3.06 胜率: 58.33%
趋势多且增强-L-2 总交易次数: 6 盈利: 26.929707747066352 亏损: -2.5215419163643222 最大盈利: 15.72 最大亏损: -1.37 总收益: 24.41 平均盈利: 4.07 typeA: 2.71 胜率: 66.67%
趋势多且增强-L-3-1 总交易次数: 13 盈利: 123.92583998848505 亏损: -101.6333362961346 最大盈利: 28.00 最大亏损: -50.23 总收益: 22.29 平均盈利: 1.71 typeA: 1.06 胜率: 61.54%
趋势空且增强-R-3-1 总交易次数: 7 盈利: 45.095779940127315 亏损: -53.55649839559651 最大盈利: 18.92 最大亏损: -33.60 总收益: -8.46 平均盈利: -1.21 typeA: -0.69 胜率: 57.14%
趋势空且增强-R-1 总交易次数: 18 盈利: 70.37745612781504 亏损: -138.8115040295467 最大盈利: 25.70 最大亏损: -54.83 总收益: -68.43 平均盈利: -3.80 typeA: -1.69 胜率: 44.44%
Loaded 3000 15m candles

      ========== 回测结果 ==========
      总交易次数:     51
      盈利次数:       25
      亏损次数:       26
      胜率:          49.02%
      总收益:        -133.44 USDT
      期末余额:      856.16 USDT
      盈亏比:        0.71
      最大单笔盈利:  79.34
      最大单笔亏损:  -88.80
      手续费:       20.59919850848843
      最大连续盈利:  79.37936946012739
      最大连续亏损:  -88.7977768063449
      最大连盈次数:  5
      最大连亏次数:  5
      =============================
    
profit: -143.83605845703676
maxDrawdown 18.1%
startTime: 2024-03-16 00:00:00
趋势多且增强-L-3-1 总交易次数: 12 盈利: 117.91709731722544 亏损: -29.040885057901193 最大盈利: 22.72 最大亏损: -16.98 总收益: 88.88 平均盈利: 7.41 typeA: 5.55 胜率: 75.00%
趋势空且增强-R-1 总交易次数: 15 盈利: 80.75966084376715 亏损: -49.130591691669295 最大盈利: 37.03 最大亏损: -21.30 总收益: 31.63 平均盈利: 2.11 typeA: 1.12 胜率: 53.33%
趋势多且增强-L-1 总交易次数: 13 盈利: 114.0537442105084 亏损: -177.89232652299685 最大盈利: 79.34 最大亏损: -44.92 总收益: -63.84 平均盈利: -4.91 typeA: -1.51 胜率: 30.77%
趋势空且增强-R-2 总交易次数: 3 盈利: 4.46604465178278 亏损: -29.48515880624056 最大盈利: 4.47 最大亏损: -28.40 总收益: -25.02 平均盈利: -8.34 typeA: -2.78 胜率: 33.33%
趋势多且增强-L-2 总交易次数: 5 盈利: 0.9870872592311187 亏损: -95.63415152747466 最大盈利: 0.93 最大亏损: -88.80 总收益: -94.65 平均盈利: -18.93 typeA: -7.57 胜率: 40.00%
趋势空且增强-R-3-1 总交易次数: 3 盈利: 7.410622901902223 亏损: -77.84720203516878 最大盈利: 7.41 最大亏损: -44.66 总收益: -70.44 平均盈利: -23.48 typeA: -7.83 胜率: 33.33%
Loaded 3000 15m candles

      ========== 回测结果 ==========
      总交易次数:     49
      盈利次数:       27
      亏损次数:       22
      胜率:          55.10%
      总收益:        -58.49 USDT
      期末余额:      931.71 USDT
      盈亏比:        0.83
      最大单笔盈利:  52.85
      最大单笔亏损:  -47.40
      手续费:       19.59803454304454
      最大连续盈利:  79.03809181972116
      最大连续亏损:  -47.39569403583853
      最大连盈次数:  6
      最大连亏次数:  4
      =============================
    
profit: -68.28686265871715
maxDrawdown 15.1%
startTime: 2024-04-15 00:00:00
趋势多且增强-L-2 总交易次数: 5 盈利: 89.34260940323566 亏损: -4.900194875278885 最大盈利: 52.85 最大亏损: -3.41 总收益: 84.44 平均盈利: 16.89 typeA: 6.76 胜率: 40.00%
趋势空且增强-R-1 总交易次数: 16 盈利: 99.93319003474653 亏损: -40.4008078697754 最大盈利: 34.27 最大亏损: -23.00 总收益: 59.53 平均盈利: 3.72 typeA: 2.56 胜率: 68.75%
趋势空且增强-R-3-1 总交易次数: 7 盈利: 43.17540356073374 亏损: -44.74272317058178 最大盈利: 16.00 最大亏损: -18.65 总收益: -1.57 平均盈利: -0.22 typeA: -0.13 胜率: 57.14%
趋势多且增强-L-1 总交易次数: 8 盈利: 26.721716035433154 亏损: -69.67231585113065 最大盈利: 21.61 最大亏损: -37.66 总收益: -42.95 平均盈利: -5.37 typeA: -2.68 胜率: 50.00%
趋势多且增强-L-3-1 总交易次数: 8 盈利: 26.832844264961263 亏损: -101.77686381237618 最大盈利: 8.28 最大亏损: -47.40 总收益: -74.94 平均盈利: -9.37 typeA: -4.68 胜率: 50.00%
趋势空且增强-R-2 总交易次数: 5 盈利: 6.053312642935679 亏损: -89.05303302161808 最大盈利: 3.77 最大亏损: -44.72 总收益: -83.00 平均盈利: -16.60 typeA: -6.64 胜率: 40.00%
Loaded 3000 15m candles

      ========== 回测结果 ==========
      总交易次数:     58
      盈利次数:       36
      亏损次数:       22
      胜率:          62.07%
      总收益:        -50.70 USDT
      期末余额:      937.70 USDT
      盈亏比:        0.84
      最大单笔盈利:  42.14
      最大单笔亏损:  -32.39
      手续费:       23.20564296139579
      最大连续盈利:  67.85711247516129
      最大连续亏损:  -89.63758307604081
      最大连盈次数:  6
      最大连亏次数:  4
      =============================
    
profit: -62.29680941599395
maxDrawdown 16.6%
startTime: 2024-05-15 00:00:00
趋势多且增强-L-1 总交易次数: 12 盈利: 58.40690571405366 亏损: -29.638175627719235 最大盈利: 15.24 最大亏损: -14.72 总收益: 28.77 平均盈利: 2.40 typeA: 1.60 胜率: 66.67%
趋势空且增强-R-1 总交易次数: 16 盈利: 78.64334386232275 亏损: -45.15044251460979 最大盈利: 24.88 最大亏损: -23.16 总收益: 33.49 平均盈利: 2.09 typeA: 1.57 胜率: 75.00%
趋势多且增强-L-2 总交易次数: 7 盈利: 51.4884073140171 亏损: -62.757048681417366 最大盈利: 42.14 最大亏损: -31.36 总收益: -11.27 平均盈利: -1.61 typeA: -0.92 胜率: 57.14%
趋势多且增强-L-3-1 总交易次数: 8 盈利: 27.658835920619104 亏损: -55.99601674137349 最大盈利: 10.95 最大亏损: -23.00 总收益: -28.34 平均盈利: -3.54 typeA: -1.77 胜率: 50.00%
趋势空且增强-R-3-1 总交易次数: 11 盈利: 35.999160656117894 亏损: -81.16029493177693 最大盈利: 10.54 最大亏损: -30.77 总收益: -45.16 平均盈利: -4.11 typeA: -2.24 胜率: 54.55%
趋势空且增强-R-2 总交易次数: 4 盈利: 8.379592798862467 亏损: -36.571077185087226 最大盈利: 6.06 最大亏损: -32.39 总收益: -28.19 平均盈利: -7.05 typeA: -3.52 胜率: 50.00%
Loaded 3000 15m candles

      ========== 回测结果 ==========
      总交易次数:     64
      盈利次数:       34
      亏损次数:       30
      胜率:          53.13%
      总收益:        -148.55 USDT
      期末余额:      838.65 USDT
      盈亏比:        0.60
      最大单笔盈利:  27.16
      最大单笔亏损:  -78.20
      手续费:       25.634251846433603
      最大连续盈利:  31.625705346148173
      最大连续亏损:  -78.19913580246917
      最大连盈次数:  5
      最大连亏次数:  4
      =============================
    
profit: -161.35399715552057
maxDrawdown 20.4%
startTime: 2024-06-14 00:00:00
趋势多且增强-L-3-1 总交易次数: 10 盈利: 46.5680665280821 亏损: -31.481162650679785 最大盈利: 10.00 最大亏损: -15.36 总收益: 15.09 平均盈利: 1.51 typeA: 1.06 胜率: 70.00%
趋势多且增强-L-1 总交易次数: 14 盈利: 80.51378487216839 亏损: -72.2006568841472 最大盈利: 27.16 最大亏损: -23.19 总收益: 8.31 平均盈利: 0.59 typeA: 0.34 胜率: 57.14%
趋势空且增强-R-2 总交易次数: 5 盈利: 0.5290087463557397 亏损: -12.064856600585271 最大盈利: 0.53 最大亏损: -8.24 总收益: -11.54 平均盈利: -2.31 typeA: -0.46 胜率: 20.00%
趋势多且增强-L-2 总交易次数: 10 盈利: 20.19806140966594 亏损: -32.63190379422822 最大盈利: 7.32 最大亏损: -26.57 总收益: -12.43 平均盈利: -1.24 typeA: -0.62 胜率: 50.00%
趋势空且增强-R-3-1 总交易次数: 8 盈利: 10.878337440405183 亏损: -45.83550648317666 最大盈利: 4.58 最大亏损: -15.72 总收益: -34.96 平均盈利: -4.37 typeA: -1.64 胜率: 37.50%
趋势空且增强-R-1 总交易次数: 17 盈利: 65.92754027272517 亏损: -178.9547100121031 最大盈利: 16.78 最大亏损: -78.20 总收益: -113.03 平均盈利: -6.65 typeA: -3.91 胜率: 58.82%
Loaded 3000 15m candles

      ========== 回测结果 ==========
      总交易次数:     55
      盈利次数:       32
      亏损次数:       23
      胜率:          58.18%
      总收益:        -191.86 USDT
      期末余额:      797.14 USDT
      盈亏比:        0.56
      最大单笔盈利:  26.34
      最大单笔亏损:  -145.44
      手续费:       22.025248889834586
      最大连续盈利:  44.84132687914587
      最大连续亏损:  -158.5109098058152
      最大连盈次数:  8
      最大连亏次数:  5
      =============================
    
profit: -202.8603340978642
maxDrawdown 21.2%
startTime: 2024-07-14 00:00:00
趋势多且增强-L-3-1 总交易次数: 5 盈利: 47.72462283489775 亏损: -10.577887820207671 最大盈利: 14.64 最大亏损: -10.58 总收益: 37.15 平均盈利: 7.43 typeA: 5.94 胜率: 80.00%
趋势空且增强-R-2 总交易次数: 4 盈利: 26.692798195752236 亏损: -0.7872860392563991 最大盈利: 19.65 最大亏损: -0.68 总收益: 25.91 平均盈利: 6.48 typeA: 3.24 胜率: 50.00%
趋势多且增强-L-2 总交易次数: 9 盈利: 32.04748011873485 亏损: -18.70932497045424 最大盈利: 19.55 最大亏损: -10.65 总收益: 13.34 平均盈利: 1.48 typeA: 0.49 胜率: 33.33%
趋势空且增强-R-3-1 总交易次数: 5 盈利: 33.93152107939418 亏损: -44.613539573005795 最大盈利: 15.04 最大亏损: -26.43 总收益: -10.68 平均盈利: -2.14 typeA: -1.28 胜率: 60.00%
趋势多且增强-L-1 总交易次数: 16 盈利: 56.600067672583506 亏损: -140.3748167894474 最大盈利: 15.31 最大亏损: -39.89 总收益: -83.77 平均盈利: -5.24 typeA: -2.95 胜率: 56.25%
趋势空且增强-R-1 总交易次数: 16 盈利: 47.57601057578591 亏损: -221.3699793826383 最大盈利: 26.34 最大亏损: -145.44 总收益: -173.79 平均盈利: -10.86 typeA: -7.47 胜率: 68.75%
Loaded 3000 15m candles

      ========== 回测结果 ==========
      总交易次数:     71
      盈利次数:       47
      亏损次数:       24
      胜率:          66.20%
      总收益:        94.48 USDT
      期末余额:      1080.08 USDT
      盈亏比:        1.34
      最大单笔盈利:  57.77
      最大单笔亏损:  -42.79
      手续费:       28.575615012525592
      最大连续盈利:  94.41421589818816
      最大连续亏损:  -58.66816396921115
      最大连盈次数:  8
      最大连亏次数:  5
      =============================
    
profit: 80.08067878859129
maxDrawdown 9.9%
startTime: 2024-08-13 00:00:00
趋势空且增强-R-1 总交易次数: 17 盈利: 131.72179571203978 亏损: -27.56989204587893 最大盈利: 40.85 最大亏损: -20.05 总收益: 104.15 平均盈利: 6.13 typeA: 5.05 胜率: 82.35%
趋势多且增强-L-1 总交易次数: 14 盈利: 79.16079782178122 亏损: -30.244601502931854 最大盈利: 57.77 最大亏损: -12.49 总收益: 48.92 平均盈利: 3.49 typeA: 2.00 胜率: 57.14%
趋势多且增强-L-3-1 总交易次数: 15 盈利: 71.60859926911478 亏损: -34.314915351686224 最大盈利: 9.69 最大亏损: -18.81 总收益: 37.29 平均盈利: 2.49 typeA: 1.99 胜率: 80.00%
趋势空且增强-R-2 总交易次数: 5 盈利: 51.92701617056335 亏损: -14.249559348876463 最大盈利: 51.93 最大亏损: -9.96 总收益: 37.68 平均盈利: 7.54 typeA: 1.51 胜率: 20.00%
趋势空且增强-R-3-1 总交易次数: 13 盈利: 32.98984495668629 亏损: -66.50553173491238 最大盈利: 8.04 最大亏损: -27.21 总收益: -33.52 平均盈利: -2.58 typeA: -1.78 胜率: 69.23%
趋势多且增强-L-2 总交易次数: 7 盈利: 6.831928954867526 亏损: -106.87480411217241 最大盈利: 2.87 最大亏损: -42.79 总收益: -100.04 平均盈利: -14.29 typeA: -6.13 胜率: 42.86%
Loaded 3000 15m candles

      ========== 回测结果 ==========
      总交易次数:     73
      盈利次数:       47
      亏损次数:       26
      胜率:          64.38%
      总收益:        64.05 USDT
      期末余额:      1049.45 USDT
      盈亏比:        1.32
      最大单笔盈利:  24.12
      最大单笔亏损:  -39.95
      手续费:       29.21153464862766
      最大连续盈利:  35.564167275819344
      最大连续亏损:  -43.060719924555066
      最大连盈次数:  7
      最大连亏次数:  2
      =============================
    
profit: 49.451588702673234
maxDrawdown 4.1%
startTime: 2024-09-12 00:00:00
趋势多且增强-L-3-1 总交易次数: 13 盈利: 63.56599855425964 亏损: -33.394091951931195 最大盈利: 23.72 最大亏损: -11.23 总收益: 30.17 平均盈利: 2.32 typeA: 1.43 胜率: 61.54%
趋势多且增强-L-1 总交易次数: 18 盈利: 79.41929314194955 亏损: -46.82481063720666 最大盈利: 24.12 最大亏损: -14.06 总收益: 32.59 平均盈利: 1.81 typeA: 1.11 胜率: 61.11%
趋势空且增强-R-1 总交易次数: 16 盈利: 60.22840719671666 亏损: -45.44534930397974 最大盈利: 11.42 最大亏损: -39.95 总收益: 14.78 平均盈利: 0.92 typeA: 0.81 胜率: 87.50%
趋势空且增强-R-3-1 总交易次数: 14 盈利: 48.2103336239496 亏损: -39.773931974867324 最大盈利: 8.11 最大亏损: -13.24 总收益: 8.44 平均盈利: 0.60 typeA: 0.39 胜率: 64.29%
趋势多且增强-L-2 总交易次数: 6 盈利: 3.3770877471478573 亏损: -5.38892724597346 最大盈利: 1.22 最大亏损: -2.37 总收益: -2.01 平均盈利: -0.34 typeA: -0.17 胜率: 50.00%
趋势空且增强-R-2 总交易次数: 6 盈利: 8.63201036631225 亏损: -28.55443081370073 最大盈利: 5.30 最大亏损: -19.94 总收益: -19.92 平均盈利: -3.32 typeA: -1.11 胜率: 33.33%
Loaded 3000 15m candles

      ========== 回测结果 ==========
      总交易次数:     62
      盈利次数:       41
      亏损次数:       21
      胜率:          66.13%
      总收益:        293.50 USDT
      期末余额:      1281.10 USDT
      盈亏比:        1.82
      最大单笔盈利:  202.51
      最大单笔亏损:  -59.74
      手续费:       24.893216038438982
      最大连续盈利:  202.51361140630522
      最大连续亏损:  -88.1248352214227
      最大连盈次数:  7
      最大连亏次数:  3
      =============================
    
profit: 281.10469578820744
maxDrawdown 14.3%
startTime: 2024-10-12 00:00:00
趋势多且增强-L-2 总交易次数: 6 盈利: 318.70622047671725 亏损: -7.919627651897931 最大盈利: 202.51 最大亏损: -7.92 总收益: 310.79 平均盈利: 51.80 typeA: 43.16 胜率: 83.33%
趋势多且增强-L-1 总交易次数: 19 盈利: 143.23153738282096 亏损: -90.72161167825097 最大盈利: 23.66 最大亏损: -45.21 总收益: 52.51 平均盈利: 2.76 typeA: 2.04 胜率: 73.68%
趋势多且增强-L-3-1 总交易次数: 9 盈利: 82.61160006995772 亏损: -66.7462743989055 最大盈利: 35.69 最大亏损: -27.03 总收益: 15.87 平均盈利: 1.76 typeA: 1.18 胜率: 66.67%
趋势空且增强-R-2 总交易次数: 3 盈利: 3.432714479240201 亏损: -0.5955965721819676 最大盈利: 3.16 最大亏损: -0.60 总收益: 2.84 平均盈利: 0.95 typeA: 0.63 胜率: 66.67%
趋势空且增强-R-1 总交易次数: 15 盈利: 44.736269625298654 亏损: -87.14134257957106 最大盈利: 11.02 最大亏损: -45.53 总收益: -42.41 平均盈利: -2.83 typeA: -1.51 胜率: 53.33%
趋势空且增强-R-3-1 总交易次数: 10 盈利: 60.39340947573158 亏损: -106.48260284074875 最大盈利: 17.82 最大亏损: -59.74 总收益: -46.09 平均盈利: -4.61 typeA: -2.77 胜率: 60.00%
Loaded 3000 15m candles

      ========== 回测结果 ==========
      总交易次数:     63
      盈利次数:       43
      亏损次数:       20
      胜率:          68.25%
      总收益:        138.89 USDT
      期末余额:      1126.09 USDT
      盈亏比:        1.35
      最大单笔盈利:  45.31
      最大单笔亏损:  -86.44
      手续费:       25.398974525158756
      最大连续盈利:  93.32074546602499
      最大连续亏损:  -137.54212447315138
      最大连盈次数:  7
      最大连亏次数:  3
      =============================
    
profit: 126.09472136649606
maxDrawdown 12.4%
startTime: 2024-11-11 00:00:00
趋势多且增强-L-3-1 总交易次数: 21 盈利: 297.15275904074554 亏损: -69.65273203411067 最大盈利: 45.31 最大亏损: -37.53 总收益: 227.50 平均盈利: 10.83 typeA: 8.77 胜率: 80.95%
趋势空且增强-R-2 总交易次数: 2 盈利: 32.16405510116226 亏损: -0.25204902037316895 最大盈利: 32.16 最大亏损: -0.25 总收益: 31.91 平均盈利: 15.96 typeA: 7.98 胜率: 50.00%
趋势空且增强-R-1 总交易次数: 13 盈利: 59.92959129182285 亏损: -20.46186179669757 最大盈利: 14.59 最大亏损: -13.57 总收益: 39.47 平均盈利: 3.04 typeA: 1.87 胜率: 61.54%
趋势空且增强-R-3-1 总交易次数: 10 盈利: 71.91445868331586 亏损: -69.96799710332974 最大盈利: 15.93 最大亏损: -24.69 总收益: 1.95 平均盈利: 0.19 typeA: 0.12 胜率: 60.00%
趋势多且增强-L-1 总交易次数: 12 盈利: 59.36982968314042 亏损: -148.60376879747548 最大盈利: 29.41 最大亏损: -74.05 总收益: -89.23 平均盈利: -7.44 typeA: -4.34 胜率: 58.33%
趋势多且增强-L-2 总交易次数: 5 盈利: 13.73843990329276 亏损: -86.43600358499414 最大盈利: 10.93 最大亏损: -86.44 总收益: -72.70 平均盈利: -14.54 typeA: -11.63 胜率: 80.00%
Loaded 3000 15m candles

      ========== 回测结果 ==========
      总交易次数:     57
      盈利次数:       38
      亏损次数:       19
      胜率:          66.67%
      总收益:        67.21 USDT
      期末余额:      1055.81 USDT
      盈亏比:        1.20
      最大单笔盈利:  42.52
      最大单笔亏损:  -52.29
      手续费:       22.80200886011919
      最大连续盈利:  129.51550927256906
      最大连续亏损:  -91.81078966103328
      最大连盈次数:  9
      最大连亏次数:  5
      =============================
    
profit: 55.809613124479256
maxDrawdown 11.3%
startTime: 2024-12-11 00:00:00
趋势空且增强-R-2 总交易次数: 4 盈利: 31.630563605296096 亏损: -8.572405232502517 最大盈利: 22.08 最大亏损: -8.57 总收益: 23.06 平均盈利: 5.76 typeA: 4.32 胜率: 75.00%
趋势空且增强-R-3-1 总交易次数: 14 盈利: 126.9782282660228 亏损: -50.58931267560244 最大盈利: 24.15 最大亏损: -20.73 总收益: 76.39 平均盈利: 5.46 typeA: 4.29 胜率: 78.57%
趋势多且增强-L-3-1 总交易次数: 12 盈利: 93.90772555458375 亏损: -42.11016556497023 最大盈利: 30.67 最大亏损: -12.04 总收益: 51.80 平均盈利: 4.32 typeA: 2.88 胜率: 66.67%
趋势多且增强-L-2 总交易次数: 6 盈利: 61.89967954393578 亏损: -53.69307498912777 最大盈利: 42.52 最大亏损: -28.04 总收益: 8.21 平均盈利: 1.37 typeA: 0.91 胜率: 66.67%
趋势多且增强-L-1 总交易次数: 8 盈利: 51.053973351448285 亏损: -71.93904219776962 最大盈利: 29.23 最大亏损: -52.29 总收益: -20.89 平均盈利: -2.61 typeA: -1.96 胜率: 75.00%
趋势空且增强-R-1 总交易次数: 13 盈利: 29.99259644074793 亏损: -101.3491529775805 最大盈利: 13.00 最大亏损: -34.88 总收益: -71.36 平均盈利: -5.49 typeA: -2.53 胜率: 46.15%
Loaded 3000 15m candles

      ========== 回测结果 ==========
      总交易次数:     58
      盈利次数:       29
      亏损次数:       29
      胜率:          50.00%
      总收益:        -39.24 USDT
      期末余额:      949.16 USDT
      盈亏比:        0.93
      最大单笔盈利:  170.47
      最大单笔亏损:  -65.69
      手续费:       23.13629931884132
      最大连续盈利:  252.6585381489636
      最大连续亏损:  -98.7570409184472
      最大连盈次数:  4
      最大连亏次数:  3
      =============================
    
profit: -50.836702935482094
maxDrawdown 17.4%
startTime: 2025-01-10 00:00:00
趋势空且增强-R-1 总交易次数: 16 盈利: 277.1546556520617 亏损: -120.95219984275742 最大盈利: 170.47 最大亏损: -45.08 总收益: 156.20 平均盈利: 9.76 typeA: 5.49 胜率: 56.25%
趋势空且增强-R-3-1 总交易次数: 10 盈利: 99.96408089580129 亏损: -49.55358747059667 最大盈利: 31.56 最大亏损: -26.16 总收益: 50.41 平均盈利: 5.04 typeA: 3.53 胜率: 70.00%
趋势多且增强-L-2 总交易次数: 10 盈利: 61.19251939804254 亏损: -124.7764156077666 最大盈利: 37.03 最大亏损: -41.05 总收益: -63.58 平均盈利: -6.36 typeA: -1.91 胜率: 30.00%
趋势多且增强-L-1 总交易次数: 13 盈利: 48.47685575255264 亏损: -114.79207622672396 最大盈利: 24.64 最大亏损: -65.69 总收益: -66.32 平均盈利: -5.10 typeA: -2.75 胜率: 53.85%
趋势多且增强-L-3-1 总交易次数: 4 盈利: 1.721822704658408 亏损: -50.28999034477984 最大盈利: 1.72 最大亏损: -20.34 总收益: -48.57 平均盈利: -12.14 typeA: -3.04 胜率: 25.00%
趋势空且增强-R-2 总交易次数: 5 盈利: 3.0796392112253055 亏损: -70.4620070571964 最大盈利: 2.56 最大亏损: -55.75 总收益: -67.38 平均盈利: -13.48 typeA: -5.39 胜率: 40.00%
Loaded 3000 15m candles

      ========== 回测结果 ==========
      总交易次数:     63
      盈利次数:       43
      亏损次数:       20
      胜率:          68.25%
      总收益:        -18.62 USDT
      期末余额:      968.78 USDT
      盈亏比:        0.95
      最大单笔盈利:  110.21
      最大单笔亏损:  -72.00
      手续费:       25.163853105597788
      最大连续盈利:  112.3671209118039
      最大连续亏损:  -71.99561454738522
      最大连盈次数:  7
      最大连亏次数:  4
      =============================
    
profit: -31.2232416246801
maxDrawdown 14.8%
startTime: 2025-02-09 00:00:00
趋势空且增强-R-1 总交易次数: 18 盈利: 155.82994157216217 亏损: -96.7285832100957 最大盈利: 110.21 最大亏损: -72.00 总收益: 59.10 平均盈利: 3.28 typeA: 2.37 胜率: 72.22%
趋势多且增强-L-3-1 总交易次数: 7 盈利: 44.466656521195326 亏损: -26.580776945641226 最大盈利: 17.13 最大亏损: -16.88 总收益: 17.89 平均盈利: 2.56 typeA: 1.83 胜率: 71.43%
趋势空且增强-R-3-1 总交易次数: 11 盈利: 58.16875423177789 亏损: -46.13093491716273 最大盈利: 21.26 最大亏损: -23.74 总收益: 12.04 平均盈利: 1.09 typeA: 0.70 胜率: 63.64%
趋势空且增强-R-2 总交易次数: 8 盈利: 15.221144595142515 亏损: -6.405313017564609 最大盈利: 7.43 最大亏损: -4.05 总收益: 8.82 平均盈利: 1.10 typeA: 0.69 胜率: 62.50%
趋势多且增强-L-1 总交易次数: 14 盈利: 58.97858871665853 亏损: -138.9807746316808 最大盈利: 24.83 最大亏损: -69.04 总收益: -80.00 平均盈利: -5.71 typeA: -4.08 胜率: 71.43%
趋势多且增强-L-2 总交易次数: 5 盈利: 10.817298636737906 亏损: -47.27924317620647 最大盈利: 7.75 最大亏损: -45.19 总收益: -36.46 平均盈利: -7.29 typeA: -4.38 胜率: 60.00%
Loaded 3000 15m candles

      ========== 回测结果 ==========
      总交易次数:     60
      盈利次数:       38
      亏损次数:       22
      胜率:          63.33%
      总收益:        22.24 USDT
      期末余额:      1010.04 USDT
      盈亏比:        1.06
      最大单笔盈利:  83.99
      最大单笔亏损:  -47.70
      手续费:       24.18281721965068
      最大连续盈利:  85.46070229325103
      最大连续亏损:  -85.43908951652526
      最大连盈次数:  8
      最大连亏次数:  6
      =============================
    
profit: 10.03899366907649
maxDrawdown 10.1%
startTime: 2025-03-11 00:00:00
趋势空且增强-R-1 总交易次数: 13 盈利: 145.53092357271484 亏损: -35.573309441113494 最大盈利: 83.99 最大亏损: -21.82 总收益: 109.96 平均盈利: 8.46 typeA: 5.86 胜率: 69.23%
趋势多且增强-L-1 总交易次数: 6 盈利: 41.98462038556127 亏损: -0.5512177985948741 最大盈利: 24.26 最大亏损: -0.55 总收益: 41.43 平均盈利: 6.91 typeA: 5.75 胜率: 83.33%
趋势空且增强-R-3-1 总交易次数: 10 盈利: 39.441533649326 亏损: -36.183395740511195 最大盈利: 16.41 最大亏损: -21.52 总收益: 3.26 平均盈利: 0.33 typeA: 0.23 胜率: 70.00%
趋势多且增强-L-3-1 总交易次数: 18 盈利: 122.33145502819411 亏损: -163.02477817084468 最大盈利: 37.45 最大亏损: -47.70 总收益: -40.69 平均盈利: -2.26 typeA: -1.38 胜率: 61.11%
趋势多且增强-L-2 总交易次数: 10 盈利: 19.896828124770245 亏损: -53.27778378887992 最大盈利: 7.05 最大亏损: -30.04 总收益: -33.38 平均盈利: -3.34 typeA: -1.67 胜率: 50.00%
趋势空且增强-R-2 总交易次数: 3 盈利: 9.047859108420402 亏损: -67.38374125996418 最大盈利: 9.05 最大亏损: -37.74 总收益: -58.34 平均盈利: -19.45 typeA: -6.48 胜率: 33.33%
Loaded 3000 15m candles

      ========== 回测结果 ==========
      总交易次数:     58
      盈利次数:       44
      亏损次数:       14
      胜率:          75.86%
      总收益:        148.67 USDT
      期末余额:      1137.07 USDT
      盈亏比:        2.01
      最大单笔盈利:  28.16
      最大单笔亏损:  -25.56
      手续费:       23.220286814065414
      最大连续盈利:  54.96962039380766
      最大连续亏损:  -25.564434122151706
      最大连盈次数:  13
      最大连亏次数:  2
      =============================
    
profit: 137.07036979666896
maxDrawdown 3.7%
startTime: 2025-04-10 00:00:00
趋势空且增强-R-2 总交易次数: 3 盈利: 20.498494437518172 亏损: 0 最大盈利: 12.25 最大亏损: 3.33 总收益: 20.50 平均盈利: 6.83 typeA: 6.83 胜率: 100.00%
趋势多且增强-L-1 总交易次数: 16 盈利: 119.60109757766658 亏损: -23.587493458996878 最大盈利: 28.16 最大亏损: -12.27 总收益: 96.01 平均盈利: 6.00 typeA: 4.88 胜率: 81.25%
趋势多且增强-L-3-1 总交易次数: 10 盈利: 51.88451661358657 亏损: -32.10805126727382 最大盈利: 15.66 最大亏损: -20.06 总收益: 19.78 平均盈利: 1.98 typeA: 1.38 胜率: 70.00%
趋势空且增强-R-1 总交易次数: 14 盈利: 60.156356196720125 亏损: -41.50874528806847 最大盈利: 10.00 最大亏损: -19.04 总收益: 18.65 平均盈利: 1.33 typeA: 1.05 胜率: 78.57%
趋势多且增强-L-2 总交易次数: 6 盈利: 12.106050217571386 亏损: -3.4599286862821232 最大盈利: 6.03 最大亏损: -2.16 总收益: 8.65 平均盈利: 1.44 typeA: 0.96 胜率: 66.67%
趋势空且增强-R-3-1 总交易次数: 9 盈利: 31.726968997353715 亏损: -46.63889554312408 最大盈利: 8.46 最大亏损: -25.56 总收益: -14.91 平均盈利: -1.66 typeA: -1.10 胜率: 66.67%
Loaded 3000 15m candles

      ========== 回测结果 ==========
      总交易次数:     59
      盈利次数:       40
      亏损次数:       19
      胜率:          67.80%
      总收益:        66.42 USDT
      期末余额:      1054.62 USDT
      盈亏比:        1.24
      最大单笔盈利:  30.96
      最大单笔亏损:  -53.52
      手续费:       23.604808557259336
      最大连续盈利:  97.49931778878695
      最大连续亏损:  -79.61509641167572
      最大连盈次数:  6
      最大连亏次数:  3
      =============================
    
profit: 54.624871886748224
maxDrawdown 11.0%
startTime: 2025-05-10 00:00:00
趋势空且增强-R-2 总交易次数: 3 盈利: 33.29336456152079 亏损: 0 最大盈利: 20.23 最大亏损: 2.89 总收益: 33.29 平均盈利: 11.10 typeA: 11.10 胜率: 100.00%
趋势多且增强-L-2 总交易次数: 5 盈利: 36.02171336164979 亏损: -12.23949919575717 最大盈利: 30.96 最大亏损: -12.24 总收益: 23.78 平均盈利: 4.76 typeA: 3.81 胜率: 80.00%
趋势多且增强-L-1 总交易次数: 14 盈利: 69.3308964163158 亏损: -26.381301600238558 最大盈利: 28.16 最大亏损: -11.13 总收益: 42.95 平均盈利: 3.07 typeA: 2.19 胜率: 71.43%
趋势空且增强-R-3-1 总交易次数: 13 盈利: 62.26017021232915 亏损: -66.31951343347406 最大盈利: 13.72 最大亏损: -18.68 总收益: -4.06 平均盈利: -0.31 typeA: -0.22 胜率: 69.23%
趋势空且增强-R-1 总交易次数: 17 盈利: 118.49985989779955 亏损: -127.23501547515247 最大盈利: 25.61 最大亏损: -53.52 总收益: -8.74 平均盈利: -0.51 typeA: -0.33 胜率: 64.71%
趋势多且增强-L-3-1 总交易次数: 7 盈利: 20.591756290854523 亏损: -41.397559149095585 最大盈利: 10.26 最大亏损: -21.19 总收益: -20.81 平均盈利: -2.97 typeA: -1.27 胜率: 42.86%

          ========== 回测结果 ==========
          总交易次数:     3185
    盈利次数:       2088
    亏损次数:       1097
          胜率:          65.56%
          总收益:        10910.19 USDT
          盈亏比:        1.74
    rw:        0.0122
    rl:        0.0134
    carry:        20.79
    最大连续盈利:  4157.953166580367
    最大连续亏损:  -158.5109098058152
    最大连盈次数:  16
    最大连亏次数:  6
          =============================

tradeNumTotal 3185
profitTotal 10269.98857709892
maxLossTotal -145.6
winRateTotal 3539.9100000000008
period month 54
avgRate 65.55
maxDrawdownTotal 21.2
趋势多且增强-L-1 总交易次数: 696 盈利: 9134.82882729793 亏损: -3018.2219776474217 最大盈利: 3372.64 最大亏损: -78.44 总收益: 6116.61 平均盈利: 8.79 typeA: 6.12 胜率: 69.68%
趋势多且增强-L-3-1 总交易次数: 556 盈利: 4166.469110997533 亏损: -2874.5245042600122 最大盈利: 381.24 最大亏损: -120.25 总收益: 1291.94 平均盈利: 2.32 typeA: 1.57 胜率: 67.45%
趋势空且增强-R-1 总交易次数: 929 盈利: 6264.227197385971 亏损: -4240.563027545125 最大盈利: 272.43 最大亏损: -145.44 总收益: 2023.66 平均盈利: 2.18 typeA: 1.41 胜率: 64.69%
趋势空且增强-R-3-1 总交易次数: 523 盈利: 3405.524000923566 亏损: -2579.291609374235 最大盈利: 199.97 最大亏损: -145.60 总收益: 826.23 平均盈利: 1.58 typeA: 1.11 胜率: 70.55%
趋势多且增强-L-2 总交易次数: 302 盈利: 1848.0140164522827 亏损: -1294.7263639597634 最大盈利: 202.51 最大亏损: -88.80 总收益: 553.29 平均盈利: 1.83 typeA: 1.03 胜率: 55.96%
趋势空且增强-R-2 总交易次数: 179 盈利: 796.1644064968273 亏损: -697.7114996684966 最大盈利: 73.01 最大亏损: -55.75 总收益: 98.45 平均盈利: 0.55 typeA: 0.27 胜率: 49.72%



*/
