/*


    ========== 回测结果 ==========
      总交易次数:     72
      胜率:          55.56%
      总收益:        59490.38 USDT
      期末余额:      69344.38 USDT
      盈亏比:        10.11
      最大单笔盈利:  41166.13
      最大单笔亏损:  -907.40
      手续费:       297.6970048346817
      =============================
    
profit: 59344.37577031931
maxDrawdown 5.5%
startTime: 2021-01-01 00:00:00
趋势多且增强-R-3-1 总交易次数: 2 盈利: 1339.199095041599 亏损: 0 最大盈利: 1253.97 最大亏损: 85.23 总收益: 1339.20 平均盈利: 669.60 typeA: 669.60 胜率: 100.00%
趋势多且增强-R-2-1 总交易次数: 1 盈利: 1699.5985299708511 亏损: 0 最大盈利: 1699.60 最大亏损: 1699.60 总收益: 1699.60 平均盈利: 1699.60 typeA: 1699.60 胜率: 100.00%
趋势多且增强-L3-1-3 总交易次数: 1 盈利: 26.27955215085412 亏损: 0 最大盈利: 26.28 最大亏损: 26.28 总收益: 26.28 平均盈利: 26.28 typeA: 26.28 胜率: 100.00%
趋势多且增强-L1-3-1 总交易次数: 1 盈利: 41166.13172492735 亏损: 0 最大盈利: 41166.13 最大亏损: 41166.13 总收益: 41166.13 平均盈利: 41166.13 typeA: 41166.13 胜率: 100.00%
趋势空且增强-L2-1-3 总交易次数: 1 盈利: 859.9070408163257 亏损: 0 最大盈利: 859.91 最大亏损: 859.91 总收益: 859.91 平均盈利: 859.91 typeA: 859.91 胜率: 100.00%
趋势空且增强-2 总交易次数: 1 盈利: 4403.101297572069 亏损: 0 最大盈利: 4403.10 最大亏损: 4403.10 总收益: 4403.10 平均盈利: 4403.10 typeA: 4403.10 胜率: 100.00%
趋势多且增强-R-1-1-2 总交易次数: 1 盈利: 748.207093608299 亏损: 0 最大盈利: 748.21 最大亏损: 748.21 总收益: 748.21 平均盈利: 748.21 typeA: 748.21 胜率: 100.00%
趋势空且增强-11 总交易次数: 1 盈利: 610.3596563936394 亏损: 0 最大盈利: 610.36 最大亏损: 610.36 总收益: 610.36 平均盈利: 610.36 typeA: 610.36 胜率: 100.00%
趋势多且增强-L1-2-5 总交易次数: 1 盈利: 1027.778426791277 亏损: 0 最大盈利: 1027.78 最大亏损: 1027.78 总收益: 1027.78 平均盈利: 1027.78 typeA: 1027.78 胜率: 100.00%
趋势空且增强-L2-3-3 总交易次数: 13 盈利: 3646.739499287422 亏损: -515.4075996886476 最大盈利: 1862.45 最大亏损: -385.36 总收益: 3131.33 平均盈利: 240.87 typeA: 203.83 胜率: 84.62%
趋势多且增强-L3-1-4-3 总交易次数: 5 盈利: 342.2922090398868 亏损: -35.69520800421356 最大盈利: 185.43 最大亏损: -35.70 总收益: 306.60 平均盈利: 61.32 typeA: 49.06 胜率: 80.00%
趋势空且增强-L2-3-4 总交易次数: 6 盈利: 744.7335646832167 亏损: -601.4613034593362 最大盈利: 277.55 最大亏损: -579.49 总收益: 143.27 平均盈利: 23.88 typeA: 15.92 胜率: 66.67%
趋势空且增强-L2-3-5 总交易次数: 3 盈利: 1367.9408716382777 亏损: -95.04186046511651 最大盈利: 1298.29 最大亏损: -95.04 总收益: 1272.90 平均盈利: 424.30 typeA: 282.88 胜率: 66.67%
趋势多且增强-L3-1-5 总交易次数: 5 盈利: 761.6665706684764 亏损: -367.7120754032773 最大盈利: 603.78 最大亏损: -346.55 总收益: 393.95 平均盈利: 78.79 typeA: 47.27 胜率: 60.00%
趋势空且增强-L3-1-6 总交易次数: 2 盈利: 249.31204739960504 亏损: -143.54320844449668 最大盈利: 249.31 最大亏损: -143.54 总收益: 105.77 平均盈利: 52.88 typeA: 26.44 胜率: 50.00%
趋势多且增强-L-4-3-3 总交易次数: 9 盈利: 6783.01648295499 亏损: -741.9236128972495 最大盈利: 5340.69 最大亏损: -337.38 总收益: 6041.09 平均盈利: 671.23 typeA: 298.30 胜率: 44.44%
趋势多且增强-L-4-3-4 总交易次数: 12 盈利: 241.74749673487182 亏损: -1603.8598292064048 最大盈利: 241.75 最大亏损: -801.84 总收益: -1362.11 平均盈利: -113.51 typeA: -9.46 胜率: 8.33%
趋势多且增强-L-4-3-2 总交易次数: 2 盈利: 0 亏损: -396.1375949933546 最大盈利: -131.80 最大亏损: -264.34 总收益: -396.14 平均盈利: -198.07 typeA: 0.00 胜率: 0.00%
趋势多且增强-L-4-3-1 总交易次数: 1 盈利: 0 亏损: -47.09332716549189 最大盈利: -47.09 最大亏损: -47.09 总收益: -47.09 平均盈利: -47.09 typeA: 0.00 胜率: 0.00%
趋势多且增强-L-4-1-4 总交易次数: 1 盈利: 0 亏损: -701.0580462657963 最大盈利: -701.06 最大亏损: -701.06 总收益: -701.06 平均盈利: -701.06 typeA: 0.00 胜率: 0.00%
趋势多且增强-L3-1-4-1 总交易次数: 1 盈利: 0 亏损: -132.37763486959653 最大盈利: -132.38 最大亏损: -132.38 总收益: -132.38 平均盈利: -132.38 typeA: 0.00 胜率: 0.00%
趋势多且增强-L-4-2-4 总交易次数: 1 盈利: 0 亏损: -238.92904229065965 最大盈利: -238.93 最大亏损: -238.93 总收益: -238.93 平均盈利: -238.93 typeA: 0.00 胜率: 0.00%
趋势多且增强-11 总交易次数: 1 盈利: 0 亏损: -907.3950462060732 最大盈利: -907.40 最大亏损: -907.40 总收益: -907.40 平均盈利: -907.40 typeA: 0.00 胜率: 0.00%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     82
      胜率:          56.10%
      总收益:        6194.03 USDT
      期末余额:      16028.03 USDT
      盈亏比:        1.60
      最大单笔盈利:  3125.26
      最大单笔亏损:  -1830.26
      手续费:       330.76782996116884
      =============================
    
profit: 6028.033850444241
maxDrawdown 20.3%
startTime: 2021-01-31 00:00:00
趋势多且增强-L1-2-5 总交易次数: 1 盈利: 1027.778426791277 亏损: 0 最大盈利: 1027.78 最大亏损: 1027.78 总收益: 1027.78 平均盈利: 1027.78 typeA: 1027.78 胜率: 100.00%
趋势多且增强-L1-3-4 总交易次数: 2 盈利: 1246.8132205803188 亏损: 0 最大盈利: 868.82 最大亏损: 378.00 总收益: 1246.81 平均盈利: 623.41 typeA: 623.41 胜率: 100.00%
趋势多且增强-L1-2-2 总交易次数: 1 盈利: 3125.2588546929187 亏损: 0 最大盈利: 3125.26 最大亏损: 3125.26 总收益: 3125.26 平均盈利: 3125.26 typeA: 3125.26 胜率: 100.00%
趋势空且增强-L2-2-3 总交易次数: 2 盈利: 207.0650945684061 亏损: 0 最大盈利: 176.55 最大亏损: 30.51 总收益: 207.07 平均盈利: 103.53 typeA: 103.53 胜率: 100.00%
趋势多且增强-L1-3-9 总交易次数: 2 盈利: 1620.963021440421 亏损: 0 最大盈利: 1115.35 最大亏损: 505.61 总收益: 1620.96 平均盈利: 810.48 typeA: 810.48 胜率: 100.00%
趋势空且增强-L2-1-3 总交易次数: 3 盈利: 447.82261302013075 亏损: 0 最大盈利: 217.40 最大亏损: 49.90 总收益: 447.82 平均盈利: 149.27 typeA: 149.27 胜率: 100.00%
趋势多且增强-R-1-2-2 总交易次数: 1 盈利: 187.52745282213303 亏损: 0 最大盈利: 187.53 最大亏损: 187.53 总收益: 187.53 平均盈利: 187.53 typeA: 187.53 胜率: 100.00%
趋势多且增强-L1-3-2 总交易次数: 1 盈利: 110.59676367731632 亏损: 0 最大盈利: 110.60 最大亏损: 110.60 总收益: 110.60 平均盈利: 110.60 typeA: 110.60 胜率: 100.00%
趋势多且增强-L3-1-4-1 总交易次数: 5 盈利: 1147.5440184226889 亏损: -1830.2636752207823 最大盈利: 391.77 最大亏损: -1830.26 总收益: -682.72 平均盈利: -136.54 typeA: -109.24 胜率: 80.00%
趋势空且增强-L2-3-5 总交易次数: 4 盈利: 713.4414655902629 亏损: -511.18683258000095 最大盈利: 371.89 最大亏损: -511.19 总收益: 202.25 平均盈利: 50.56 typeA: 37.92 胜率: 75.00%
趋势多且增强-L3-1-4-3 总交易次数: 4 盈利: 214.1037450415048 亏损: -141.77322013293826 最大盈利: 105.07 最大亏损: -141.77 总收益: 72.33 平均盈利: 18.08 typeA: 13.56 胜率: 75.00%
趋势多且增强-L-4-1-3 总交易次数: 3 盈利: 125.06918010009424 亏损: -179.85205040729687 最大盈利: 71.24 最大亏损: -179.85 总收益: -54.78 平均盈利: -18.26 typeA: -12.17 胜率: 66.67%
趋势空且增强-L2-3-4 总交易次数: 8 盈利: 1087.6176955648575 亏损: -815.6076844269513 最大盈利: 688.10 最大亏损: -647.04 总收益: 272.01 平均盈利: 34.00 typeA: 21.25 胜率: 62.50%
趋势空且增强-11 总交易次数: 5 盈利: 534.269996197823 亏损: -712.1297673344837 最大盈利: 252.80 最大亏损: -572.34 总收益: -177.86 平均盈利: -35.57 typeA: -21.34 胜率: 60.00%
趋势多且增强-L3-1-3 总交易次数: 2 盈利: 314.6232981156729 亏损: -5.738168999038598 最大盈利: 314.62 最大亏损: -5.74 总收益: 308.89 平均盈利: 154.44 typeA: 77.22 胜率: 50.00%
趋势空且增强-2 总交易次数: 6 盈利: 2325.2151437059033 亏损: -975.5920109116896 最大盈利: 1750.26 最大亏损: -720.61 总收益: 1349.62 平均盈利: 224.94 typeA: 112.47 胜率: 50.00%
趋势多且增强-L-4-1-2 总交易次数: 2 盈利: 428.50810459972246 亏损: -1085.4860369065218 最大盈利: 428.51 最大亏损: -1085.49 总收益: -656.98 平均盈利: -328.49 typeA: -164.24 胜率: 50.00%
趋势多且增强-R-2-1 总交易次数: 4 盈利: 325.031645752954 亏损: -214.55557243800789 最大盈利: 175.18 最大亏损: -172.02 总收益: 110.48 平均盈利: 27.62 typeA: 13.81 胜率: 50.00%
趋势多且增强-L3-1-5 总交易次数: 2 盈利: 16.347789132072144 亏损: -2.692358297843565 最大盈利: 16.35 最大亏损: -2.69 总收益: 13.66 平均盈利: 6.83 typeA: 3.41 胜率: 50.00%
趋势多且增强-L1-3-1 总交易次数: 2 盈利: 429.99408108907915 亏损: -79.40413449360571 最大盈利: 429.99 最大亏损: -79.40 总收益: 350.59 平均盈利: 175.29 typeA: 87.65 胜率: 50.00%
趋势多且增强-L-4-3-4 总交易次数: 7 盈利: 699.2637258548785 亏损: -177.91108782048923 最大盈利: 385.60 最大亏损: -65.71 总收益: 521.35 平均盈利: 74.48 typeA: 31.92 胜率: 42.86%
趋势多且增强-R-1-1-2 总交易次数: 3 盈利: 211.99362530511922 亏损: -568.4589181007295 最大盈利: 211.99 最大亏损: -317.10 总收益: -356.47 平均盈利: -118.82 typeA: -39.60 胜率: 33.33%
趋势多且增强-11 总交易次数: 4 盈利: 0 亏损: -1267.1934720181869 最大盈利: -6.28 最大亏损: -907.40 总收益: -1267.19 平均盈利: -316.80 typeA: 0.00 胜率: 0.00%
趋势多且增强-L-4-2-4 总交易次数: 2 盈利: 0 亏损: -51.741113344900626 最大盈利: -3.36 最大亏损: -48.38 总收益: -51.74 平均盈利: -25.87 typeA: 0.00 胜率: 0.00%
趋势空且增强-L1-1-2 总交易次数: 1 盈利: 0 亏损: -808.0563264081609 最大盈利: -808.06 最大亏损: -808.06 总收益: -808.06 平均盈利: -808.06 typeA: 0.00 胜率: 0.00%
趋势多且增强-L-4-1-4 总交易次数: 2 盈利: 0 亏损: -275.3186300288322 最大盈利: -68.56 最大亏损: -206.76 总收益: -275.32 平均盈利: -137.66 typeA: 0.00 胜率: 0.00%
趋势多且增强-L-4-2-3 总交易次数: 2 盈利: 0 亏损: -357.07256723297644 最大盈利: -178.49 最大亏损: -178.58 总收益: -357.07 平均盈利: -178.54 typeA: 0.00 胜率: 0.00%
趋势空且增强-L2-3-3 总交易次数: 1 盈利: 0 亏损: -292.7814845178776 最大盈利: -292.78 最大亏损: -292.78 总收益: -292.78 平均盈利: -292.78 typeA: 0.00 胜率: 0.00%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     65
      胜率:          61.54%
      总收益:        3008.64 USDT
      期末余额:      12878.64 USDT
      盈亏比:        1.99
      最大单笔盈利:  1285.64
      最大单笔亏损:  -418.12
      手续费:       260.296209780949
      =============================
    
profit: 2878.642490778202
maxDrawdown 5.7%
startTime: 2021-03-02 00:00:00
趋势多且增强-L3-1-4-1 总交易次数: 2 盈利: 852.5930380368308 亏损: 0 最大盈利: 826.38 最大亏损: 26.21 总收益: 852.59 平均盈利: 426.30 typeA: 426.30 胜率: 100.00%
趋势空且增强-L2-3-3 总交易次数: 4 盈利: 176.49810405183823 亏损: 0 最大盈利: 57.18 最大亏损: 32.06 总收益: 176.50 平均盈利: 44.12 typeA: 44.12 胜率: 100.00%
趋势多且增强-L3-1-4-3 总交易次数: 9 盈利: 336.24734366480175 亏损: -273.6807621161669 最大盈利: 191.89 最大亏损: -273.68 总收益: 62.57 平均盈利: 6.95 typeA: 6.18 胜率: 88.89%
趋势空且增强-L2-3-5 总交易次数: 6 盈利: 115.7548344119622 亏损: -63.28332162921386 最大盈利: 50.97 最大亏损: -63.28 总收益: 52.47 平均盈利: 8.75 typeA: 7.29 胜率: 83.33%
趋势多且增强-L-4-3-4 总交易次数: 11 盈利: 1479.1149562901483 亏损: -164.32177709341093 最大盈利: 954.88 最大亏损: -75.48 总收益: 1314.79 平均盈利: 119.53 typeA: 86.93 胜率: 72.73%
趋势多且增强-R-3-1 总交易次数: 6 盈利: 681.8047413563766 亏损: -571.5914230777005 最大盈利: 325.93 最大亏损: -301.10 总收益: 110.21 平均盈利: 18.37 typeA: 12.25 胜率: 66.67%
趋势空且增强-L2-3-4 总交易次数: 5 盈利: 375.69762578017037 亏损: -152.71528971339143 最大盈利: 222.73 最大亏损: -107.32 总收益: 222.98 平均盈利: 44.60 typeA: 26.76 胜率: 60.00%
趋势空且增强-11 总交易次数: 2 盈利: 119.69335068879488 亏损: -220.95708492221934 最大盈利: 119.69 最大亏损: -220.96 总收益: -101.26 平均盈利: -50.63 typeA: -25.32 胜率: 50.00%
趋势空且增强-L3-1-6 总交易次数: 2 盈利: 475.1441725603902 亏损: -34.72170434165655 最大盈利: 475.14 最大亏损: -34.72 总收益: 440.42 平均盈利: 220.21 typeA: 110.11 胜率: 50.00%
趋势多且增强-L-4-2-3 总交易次数: 2 盈利: 8.25813071085595 亏损: -93.08301144231477 最大盈利: 8.26 最大亏损: -93.08 总收益: -84.82 平均盈利: -42.41 typeA: -21.21 胜率: 50.00%
趋势多且增强-L-4-3-3 总交易次数: 6 盈利: 132.02079362767597 亏损: -214.14700472364703 最大盈利: 75.97 最大亏损: -69.79 总收益: -82.13 平均盈利: -13.69 typeA: -4.56 胜率: 33.33%
趋势多且增强-L3-1-3 总交易次数: 3 盈利: 1285.6352296702078 亏损: -464.0550821991907 最大盈利: 1285.64 最大亏损: -418.12 总收益: 821.58 平均盈利: 273.86 typeA: 91.28 胜率: 33.33%
趋势多且增强-11 总交易次数: 2 盈利: 0 亏损: -530.1588721434038 最大盈利: -114.44 最大亏损: -415.72 总收益: -530.16 平均盈利: -265.08 typeA: 0.00 胜率: 0.00%
趋势多且增强-L-4-1-2 总交易次数: 1 盈利: 0 亏损: -134.2152427996344 最大盈利: -134.22 最大亏损: -134.22 总收益: -134.22 平均盈利: -134.22 typeA: 0.00 胜率: 0.00%
趋势多且增强-L3-1-5 总交易次数: 1 盈利: 0 亏损: -14.569430530182796 最大盈利: -14.57 最大亏损: -14.57 总收益: -14.57 平均盈利: -14.57 typeA: 0.00 胜率: 0.00%
趋势多且增强-L-4-2-4 总交易次数: 2 盈利: 0 亏损: -86.07177085918933 最大盈利: -34.00 最大亏损: -52.07 总收益: -86.07 平均盈利: -43.04 typeA: 0.00 胜率: 0.00%
趋势多且增强-L1-3-4 总交易次数: 1 盈利: 0 亏损: -12.248052480524388 最大盈利: -12.25 最大亏损: -12.25 总收益: -12.25 平均盈利: -12.25 typeA: 0.00 胜率: 0.00%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     87
      胜率:          49.43%
      总收益:        36690.41 USDT
      期末余额:      46516.41 USDT
      盈亏比:        5.14
      最大单笔盈利:  8558.15
      最大单笔亏损:  -1006.27
      手续费:       351.5842585995946
      =============================
    
profit: 36516.41299054765
maxDrawdown 17.5%
startTime: 2021-04-01 00:00:00
趋势空且增强-11 总交易次数: 1 盈利: 311.9625620915039 亏损: 0 最大盈利: 311.96 最大亏损: 311.96 总收益: 311.96 平均盈利: 311.96 typeA: 311.96 胜率: 100.00%
趋势多且增强-L1-2-2 总交易次数: 1 盈利: 7106.6643783272675 亏损: 0 最大盈利: 7106.66 最大亏损: 7106.66 总收益: 7106.66 平均盈利: 7106.66 typeA: 7106.66 胜率: 100.00%
趋势空且增强-L1-1-2 总交易次数: 3 盈利: 2529.655163571467 亏损: 0 最大盈利: 2068.45 最大亏损: 5.19 总收益: 2529.66 平均盈利: 843.22 typeA: 843.22 胜率: 100.00%
趋势多且增强-L3-1-5 总交易次数: 1 盈利: 866.1467440259388 亏损: 0 最大盈利: 866.15 最大亏损: 866.15 总收益: 866.15 平均盈利: 866.15 typeA: 866.15 胜率: 100.00%
趋势多且增强-L3-1-4-1 总交易次数: 7 盈利: 1638.7468228064702 亏损: -0.5262382075477414 最大盈利: 632.65 最大亏损: -0.53 总收益: 1638.22 平均盈利: 234.03 typeA: 200.59 胜率: 85.71%
趋势空且增强-2 总交易次数: 13 盈利: 9527.318525558878 亏损: -941.2490187093669 最大盈利: 3130.79 最大亏损: -690.41 总收益: 8586.07 平均盈利: 660.47 typeA: 508.03 胜率: 76.92%
趋势多且增强-L-4-3-4 总交易次数: 3 盈利: 367.34383993072345 亏损: -2.1751208575621916 最大盈利: 320.43 最大亏损: -2.18 总收益: 365.17 平均盈利: 121.72 typeA: 81.15 胜率: 66.67%
趋势多且增强-R-1-1-2 总交易次数: 6 盈利: 5639.386119840765 亏损: -275.6047071660821 最大盈利: 2358.53 最大亏损: -188.01 总收益: 5363.78 平均盈利: 893.96 typeA: 596.01 胜率: 66.67%
趋势多且增强-L3-1-4-3 总交易次数: 2 盈利: 1285.6352296702078 亏损: -19.239509262365814 最大盈利: 1285.64 最大亏损: -19.24 总收益: 1266.40 平均盈利: 633.20 typeA: 316.60 胜率: 50.00%
趋势多且增强-L-4-2-4 总交易次数: 2 盈利: 1284.8705604252002 亏损: -89.67423579343776 最大盈利: 1284.87 最大亏损: -89.67 总收益: 1195.20 平均盈利: 597.60 typeA: 298.80 胜率: 50.00%
趋势多且增强-L-4-3-3 总交易次数: 2 盈利: 300.21624657050774 亏损: -45.14690143276371 最大盈利: 300.22 最大亏损: -45.15 总收益: 255.07 平均盈利: 127.53 typeA: 63.77 胜率: 50.00%
趋势多且增强-L1-3-4 总交易次数: 2 盈利: 91.14953794031875 亏损: -185.87126436781588 最大盈利: 91.15 最大亏损: -185.87 总收益: -94.72 平均盈利: -47.36 typeA: -23.68 胜率: 50.00%
趋势多且增强-L3-1-3 总交易次数: 2 盈利: 2591.160619748811 亏损: -28.055393939394772 最大盈利: 2591.16 最大亏损: -28.06 总收益: 2563.11 平均盈利: 1281.55 typeA: 640.78 胜率: 50.00%
趋势多且增强-L1-1-6 总交易次数: 4 盈利: 8883.135933053944 亏损: -493.2027680470113 最大盈利: 8558.15 最大亏损: -274.27 总收益: 8389.93 平均盈利: 2097.48 typeA: 1048.74 胜率: 50.00%
趋势空且增强-L2-3-3 总交易次数: 5 盈利: 296.516514243012 亏损: -911.0060320015883 最大盈利: 231.99 最大亏损: -537.67 总收益: -614.49 平均盈利: -122.90 typeA: -49.16 胜率: 40.00%
趋势多且增强-L-4-1-4 总交易次数: 5 盈利: 1821.747037422991 亏损: -820.1493209894497 最大盈利: 1060.88 最大亏损: -339.60 总收益: 1001.60 平均盈利: 200.32 typeA: 80.13 胜率: 40.00%
趋势多且增强-L-4-1-3 总交易次数: 5 盈利: 404.46252469922973 亏损: -287.36738586831177 最大盈利: 351.56 最大亏损: -182.76 总收益: 117.10 平均盈利: 23.42 typeA: 9.37 胜率: 40.00%
趋势多且增强-L1-2-5 总交易次数: 3 盈利: 175.98051659579883 亏损: -352.3646458781369 最大盈利: 175.98 最大亏损: -300.52 总收益: -176.38 平均盈利: -58.79 typeA: -19.60 胜率: 33.33%
趋势多且增强-L1-3-9 总交易次数: 3 盈利: 429.40364993338966 亏损: -62.935266651722806 最大盈利: 429.40 最大亏损: -48.34 总收益: 366.47 平均盈利: 122.16 typeA: 40.71 胜率: 33.33%
趋势多且增强-R-3-2 总交易次数: 1 盈利: 0 亏损: -53.812430273148706 最大盈利: -53.81 最大亏损: -53.81 总收益: -53.81 平均盈利: -53.81 typeA: 0.00 胜率: 0.00%
趋势空且增强-L2-3-4 总交易次数: 1 盈利: 0 亏损: -47.22765901293223 最大盈利: -47.23 最大亏损: -47.23 总收益: -47.23 平均盈利: -47.23 typeA: 0.00 胜率: 0.00%
趋势多且增强-11 总交易次数: 3 盈利: 0 亏损: -1105.4203021036587 最大盈利: -56.90 最大亏损: -754.03 总收益: -1105.42 平均盈利: -368.47 typeA: 0.00 胜率: 0.00%
趋势多且增强-L1-3-2 总交易次数: 2 盈利: 0 亏损: -232.71219641385258 最大盈利: -40.20 最大亏损: -192.51 总收益: -232.71 平均盈利: -116.36 typeA: 0.00 胜率: 0.00%
趋势空且增强-L3-1-6 总交易次数: 2 盈利: 0 亏损: -887.7156467802707 最大盈利: -160.46 最大亏损: -727.25 总收益: -887.72 平均盈利: -443.86 typeA: 0.00 胜率: 0.00%
趋势多且增强-L-4-4-4 总交易次数: 1 盈利: 0 亏损: -1006.2706441181463 最大盈利: -1006.27 最大亏损: -1006.27 总收益: -1006.27 平均盈利: -1006.27 typeA: 0.00 胜率: 0.00%
趋势空且增强-L2-3-5 总交易次数: 1 盈利: 0 亏损: -167.31546227681866 最大盈利: -167.32 最大亏损: -167.32 总收益: -167.32 平均盈利: -167.32 typeA: 0.00 胜率: 0.00%
趋势多且增强-L-4-2-3 总交易次数: 1 盈利: 0 亏损: -35.262533024559815 最大盈利: -35.26 最大亏损: -35.26 总收益: -35.26 平均盈利: -35.26 typeA: 0.00 胜率: 0.00%
趋势空且增强-L2-2-3 总交易次数: 1 盈利: 0 亏损: -105.83588853533904 最大盈利: -105.84 最大亏损: -105.84 总收益: -105.84 平均盈利: -105.84 typeA: 0.00 胜率: 0.00%
趋势多且增强-L1-3-1 总交易次数: 2 盈利: 0 亏损: -86.06432894145084 最大盈利: -9.96 最大亏损: -76.11 总收益: -86.06 平均盈利: -43.03 typeA: 0.00 胜率: 0.00%
趋势多且增强-L-4-1-2 总交易次数: 1 盈利: 0 亏损: -433.028373119591 最大盈利: -433.03 最大亏损: -433.03 总收益: -433.03 平均盈利: -433.03 typeA: 0.00 胜率: 0.00%
趋势空且增强-L2-1-3 总交易次数: 1 盈利: 0 亏损: -185.8562621364377 最大盈利: -185.86 最大亏损: -185.86 总收益: -185.86 平均盈利: -185.86 typeA: 0.00 胜率: 0.00%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     106
      胜率:          53.77%
      总收益:        12554.93 USDT
      期末余额:      22340.93 USDT
      盈亏比:        2.21
      最大单笔盈利:  1403.49
      最大单笔亏损:  -904.79
      手续费:       426.9106842487949
      =============================
    
profit: 12340.925117771061
maxDrawdown 7.2%
startTime: 2021-05-01 00:00:00
趋势空且增强-11 总交易次数: 3 盈利: 1663.2595372969854 亏损: 0 最大盈利: 892.06 最大亏损: 298.27 总收益: 1663.26 平均盈利: 554.42 typeA: 554.42 胜率: 100.00%
趋势空且增强-L2-1-3 总交易次数: 4 盈利: 959.0699653134435 亏损: 0 最大盈利: 436.97 最大亏损: 82.72 总收益: 959.07 平均盈利: 239.77 typeA: 239.77 胜率: 100.00%
趋势空且增强-L2-2-3 总交易次数: 1 盈利: 1.7971556230476005 亏损: 0 最大盈利: 1.80 最大亏损: 1.80 总收益: 1.80 平均盈利: 1.80 typeA: 1.80 胜率: 100.00%
趋势多且增强-L3-1-4-3 总交易次数: 1 盈利: 3.8424179463025663 亏损: 0 最大盈利: 3.84 最大亏损: 3.84 总收益: 3.84 平均盈利: 3.84 typeA: 3.84 胜率: 100.00%
趋势空且增强-2 总交易次数: 14 盈利: 2487.2441978034562 亏损: -1292.2834636364814 最大盈利: 867.74 最大亏损: -659.30 总收益: 1194.96 平均盈利: 85.35 typeA: 67.06 胜率: 78.57%
趋势多且增强-L3-1-5 总交易次数: 4 盈利: 1622.6102224141011 亏损: -116.01091770922451 最大盈利: 1373.52 最大亏损: -116.01 总收益: 1506.60 平均盈利: 376.65 typeA: 282.49 胜率: 75.00%
趋势空且增强-L2-3-3 总交易次数: 6 盈利: 825.1547824526999 亏损: -353.42997568224587 最大盈利: 462.16 最大亏损: -219.22 总收益: 471.72 平均盈利: 78.62 typeA: 52.42 胜率: 66.67%
趋势多且增强-R-1-1-1 总交易次数: 3 盈利: 632.2413296191328 亏损: -1.7791717283266706 最大盈利: 563.84 最大亏损: -1.78 总收益: 630.46 平均盈利: 210.15 typeA: 140.11 胜率: 66.67%
趋势多且增强-R-1-2-2 总交易次数: 3 盈利: 2544.2751812680026 亏损: -76.3661311686997 最大盈利: 1403.49 最大亏损: -76.37 总收益: 2467.91 平均盈利: 822.64 typeA: 548.45 胜率: 66.67%
趋势多且增强-L3-1-4-1 总交易次数: 12 盈利: 2911.4451803007237 亏损: -1751.4135361041028 最大盈利: 975.29 最大亏损: -904.79 总收益: 1160.03 平均盈利: 96.67 typeA: 48.33 胜率: 50.00%
趋势空且增强-L2-3-4 总交易次数: 4 盈利: 706.0097978253963 亏损: -360.15201942987517 最大盈利: 544.81 最大亏损: -194.05 总收益: 345.86 平均盈利: 86.46 typeA: 43.23 胜率: 50.00%
趋势多且增强-R-1-1-2 总交易次数: 8 盈利: 1449.53365896394 亏损: -1610.1671086257297 最大盈利: 1006.97 最大亏损: -602.56 总收益: -160.63 平均盈利: -20.08 typeA: -10.04 胜率: 50.00%
趋势多且增强-L3-1-3 总交易次数: 2 盈利: 266.7041146287154 亏损: -71.69467625326254 最大盈利: 266.70 最大亏损: -71.69 总收益: 195.01 平均盈利: 97.50 typeA: 48.75 胜率: 50.00%
趋势空且增强-L1-1-2 总交易次数: 2 盈利: 165.66500103708924 亏损: -39.039208480564746 最大盈利: 165.67 最大亏损: -39.04 总收益: 126.63 平均盈利: 63.31 typeA: 31.66 胜率: 50.00%
趋势多且增强-L-4-1-3 总交易次数: 9 盈利: 1759.3086031195585 亏损: -911.6920178549886 最大盈利: 746.46 最大亏损: -350.87 总收益: 847.62 平均盈利: 94.18 typeA: 41.85 胜率: 44.44%
趋势多且增强-L1-1-6 总交易次数: 7 盈利: 1606.944384159614 亏损: -725.4628671099481 最大盈利: 796.81 最大亏损: -285.49 总收益: 881.48 平均盈利: 125.93 typeA: 53.97 胜率: 42.86%
趋势多且增强-11 总交易次数: 3 盈利: 747.8384603505887 亏损: -520.6358999366578 最大盈利: 747.84 最大亏损: -282.42 总收益: 227.20 平均盈利: 75.73 typeA: 25.24 胜率: 33.33%
趋势多且增强-L-4-1-4 总交易次数: 15 盈利: 2585.3638777035744 亏损: -1319.0254279858775 最大盈利: 1225.93 最大亏损: -438.12 总收益: 1266.34 平均盈利: 84.42 typeA: 22.52 胜率: 26.67%
趋势空且增强-L2-3-5 总交易次数: 1 盈利: 0 亏损: -113.28862517727524 最大盈利: -113.29 最大亏损: -113.29 总收益: -113.29 平均盈利: -113.29 typeA: 0.00 胜率: 0.00%
趋势空且增强-L3-1-6 总交易次数: 2 盈利: 0 亏损: -615.9784244666224 最大盈利: -235.62 最大亏损: -380.36 总收益: -615.98 平均盈利: -307.99 typeA: 0.00 胜率: 0.00%
趋势多且增强-L1-3-9 总交易次数: 1 盈利: 0 亏损: -426.29501719470187 最大盈利: -426.30 最大亏损: -426.30 总收益: -426.30 平均盈利: -426.30 typeA: 0.00 胜率: 0.00%
趋势多且增强-L-4-1-2 总交易次数: 1 盈利: 0 亏损: -78.6682615107309 最大盈利: -78.67 最大亏损: -78.67 总收益: -78.67 平均盈利: -78.67 typeA: 0.00 胜率: 0.00%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     102
      胜率:          53.92%
      总收益:        4151.21 USDT
      期末余额:      13945.21 USDT
      盈亏比:        1.53
      最大单笔盈利:  2423.17
      最大单笔亏损:  -1818.29
      手续费:       409.990397151127
      =============================
    
profit: 3945.208417545544
maxDrawdown 22.7%
startTime: 2021-05-31 00:00:00
趋势多且增强-L3-1-4-3 总交易次数: 1 盈利: 3.8424179463025663 亏损: 0 最大盈利: 3.84 最大亏损: 3.84 总收益: 3.84 平均盈利: 3.84 typeA: 3.84 胜率: 100.00%
趋势空且增强-L1-1-2 总交易次数: 3 盈利: 459.6346747737031 亏损: 0 最大盈利: 179.73 最大亏损: 108.57 总收益: 459.63 平均盈利: 153.21 typeA: 153.21 胜率: 100.00%
趋势多且增强-R-1-2-2 总交易次数: 2 盈利: 262.5951226750388 亏损: 0 最大盈利: 216.85 最大亏损: 45.74 总收益: 262.60 平均盈利: 131.30 typeA: 131.30 胜率: 100.00%
趋势空且增强-L2-1-3 总交易次数: 3 盈利: 309.5589907973954 亏损: 0 最大盈利: 162.14 最大亏损: 11.03 总收益: 309.56 平均盈利: 103.19 typeA: 103.19 胜率: 100.00%
趋势多且增强-L3-1-5 总交易次数: 2 盈利: 193.1171341293117 亏损: 0 最大盈利: 125.93 最大亏损: 67.18 总收益: 193.12 平均盈利: 96.56 typeA: 96.56 胜率: 100.00%
趋势空且增强-L2-3-4 总交易次数: 3 盈利: 625.4418587944054 亏损: 0 最大盈利: 563.08 最大亏损: 11.00 总收益: 625.44 平均盈利: 208.48 typeA: 208.48 胜率: 100.00%
趋势空且增强-L2-2-3 总交易次数: 1 盈利: 4.381879087574844 亏损: 0 最大盈利: 4.38 最大亏损: 4.38 总收益: 4.38 平均盈利: 4.38 typeA: 4.38 胜率: 100.00%
趋势空且增强-L2-3-3 总交易次数: 4 盈利: 879.6865310311239 亏损: -66.33927586840558 最大盈利: 552.98 最大亏损: -66.34 总收益: 813.35 平均盈利: 203.34 typeA: 152.50 胜率: 75.00%
趋势多且增强-L3-1-3 总交易次数: 3 盈利: 381.1762799744609 亏损: -113.59075205952728 最大盈利: 280.52 最大亏损: -113.59 总收益: 267.59 平均盈利: 89.20 typeA: 59.47 胜率: 66.67%
趋势空且增强-11 总交易次数: 6 盈利: 127.97841420120385 亏损: -1121.167285591799 最大盈利: 70.69 最大亏损: -633.65 总收益: -993.19 平均盈利: -165.53 typeA: -110.36 胜率: 66.67%
趋势多且增强-11 总交易次数: 5 盈利: 2841.43187031743 亏损: -161.2687885445589 最大盈利: 2423.17 最大亏损: -119.67 总收益: 2680.16 平均盈利: 536.03 typeA: 321.62 胜率: 60.00%
趋势空且增强-2 总交易次数: 17 盈利: 2470.3860727800443 亏损: -1427.4480648295416 最大盈利: 756.36 最大亏损: -818.35 总收益: 1042.94 平均盈利: 61.35 typeA: 36.09 胜率: 58.82%
趋势多且增强-L1-2-5 总交易次数: 2 盈利: 279.17092768444064 亏损: -80.65750431002999 最大盈利: 279.17 最大亏损: -80.66 总收益: 198.51 平均盈利: 99.26 typeA: 49.63 胜率: 50.00%
趋势多且增强-L1-3-9 总交易次数: 4 盈利: 540.0976045349489 亏损: -163.93388491024635 最大盈利: 352.37 最大亏损: -99.31 总收益: 376.16 平均盈利: 94.04 typeA: 47.02 胜率: 50.00%
趋势多且增强-R-1-1-2 总交易次数: 12 盈利: 695.2842044145727 亏损: -2513.7332524199232 最大盈利: 328.83 最大亏损: -1818.29 总收益: -1818.45 平均盈利: -151.54 typeA: -75.77 胜率: 50.00%
趋势多且增强-L-4-1-3 总交易次数: 12 盈利: 1245.940550165835 亏损: -383.4212490757303 最大盈利: 423.25 最大亏损: -163.63 总收益: 862.52 平均盈利: 71.88 typeA: 29.95 胜率: 41.67%
趋势多且增强-L-4-1-4 总交易次数: 5 盈利: 706.2685123572138 亏损: -153.06024328119628 最大盈利: 655.49 最大亏损: -66.02 总收益: 553.21 平均盈利: 110.64 typeA: 44.26 胜率: 40.00%
趋势多且增强-L1-1-6 总交易次数: 3 盈利: 9.385322648671128 亏损: -240.26790428392718 最大盈利: 9.39 最大亏损: -128.21 总收益: -230.88 平均盈利: -76.96 typeA: -25.65 胜率: 33.33%
趋势多且增强-L-4-2-4 总交易次数: 3 盈利: 18.93067472029841 亏损: -30.861479699534748 最大盈利: 18.93 最大亏损: -29.64 总收益: -11.93 平均盈利: -3.98 typeA: -1.33 胜率: 33.33%
趋势多且增强-R-1-1-1 总交易次数: 2 盈利: 0 亏损: -212.43861365874162 最大盈利: -4.23 最大亏损: -208.20 总收益: -212.44 平均盈利: -106.22 typeA: 0.00 胜率: 0.00%
趋势多且增强-L1-3-4 总交易次数: 2 盈利: 0 亏损: -108.5598748538 最大盈利: -14.64 最大亏损: -93.92 总收益: -108.56 平均盈利: -54.28 typeA: 0.00 胜率: 0.00%
趋势多且增强-L3-1-4-1 总交易次数: 6 盈利: 0 亏损: -990.2855077622077 最大盈利: -35.86 最大亏损: -635.08 总收益: -990.29 平均盈利: -165.05 typeA: 0.00 胜率: 0.00%
趋势空且增强-L3-1-6 总交易次数: 1 盈利: 0 亏损: -136.06694433926498 最大盈利: -136.07 最大亏损: -136.07 总收益: -136.07 平均盈利: -136.07 typeA: 0.00 胜率: 0.00%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     111
      胜率:          55.86%
      总收益:        2745.27 USDT
      期末余额:      12523.27 USDT
      盈亏比:        1.40
      最大单笔盈利:  771.86
      最大单笔亏损:  -635.91
      手续费:       443.38625514510665
      =============================
    
profit: 2523.2681820792404
maxDrawdown 6.9%
startTime: 2021-06-30 00:00:00
趋势空且增强-L2-3-5 总交易次数: 2 盈利: 482.402541552568 亏损: 0 最大盈利: 480.99 最大亏损: 1.42 总收益: 482.40 平均盈利: 241.20 typeA: 241.20 胜率: 100.00%
趋势多且增强-L3-1-4-3 总交易次数: 1 盈利: 9.930787589498912 亏损: 0 最大盈利: 9.93 最大亏损: 9.93 总收益: 9.93 平均盈利: 9.93 typeA: 9.93 胜率: 100.00%
趋势空且增强-L1-1-2 总交易次数: 1 盈利: 252.851167618059 亏损: 0 最大盈利: 252.85 最大亏损: 252.85 总收益: 252.85 平均盈利: 252.85 typeA: 252.85 胜率: 100.00%
趋势空且增强-L2-3-4 总交易次数: 7 盈利: 1110.3525781666206 亏损: -298.17830940988944 最大盈利: 451.44 最大亏损: -298.18 总收益: 812.17 平均盈利: 116.02 typeA: 99.44 胜率: 85.71%
趋势空且增强-L2-1-3 总交易次数: 6 盈利: 545.6182981218296 亏损: -8.562453866972586 最大盈利: 290.22 最大亏损: -8.56 总收益: 537.06 平均盈利: 89.51 typeA: 74.59 胜率: 83.33%
趋势空且增强-11 总交易次数: 6 盈利: 1015.5347859231383 亏损: -293.3681320932521 最大盈利: 390.00 最大亏损: -293.37 总收益: 722.17 平均盈利: 120.36 typeA: 100.30 胜率: 83.33%
趋势多且增强-L3-1-4-1 总交易次数: 11 盈利: 456.71955421637483 亏损: -206.5281381223412 最大盈利: 234.77 最大亏损: -78.02 总收益: 250.19 平均盈利: 22.74 typeA: 16.54 胜率: 72.73%
趋势多且增强-R-1-1-2 总交易次数: 15 盈利: 1016.9804829782428 亏损: -653.5450517744189 最大盈利: 328.83 最大亏损: -250.84 总收益: 363.44 平均盈利: 24.23 typeA: 16.15 胜率: 66.67%
趋势多且增强-11 总交易次数: 6 盈利: 622.0896435050814 亏损: -472.3076774876502 最大盈利: 348.99 最大亏损: -344.89 总收益: 149.78 平均盈利: 24.96 typeA: 16.64 胜率: 66.67%
趋势多且增强-L3-1-3 总交易次数: 3 盈利: 815.642843132606 亏损: -33.3431167651066 最大盈利: 654.93 最大亏损: -33.34 总收益: 782.30 平均盈利: 260.77 typeA: 173.85 胜率: 66.67%
趋势空且增强-L2-3-3 总交易次数: 4 盈利: 489.0521546850005 亏损: -239.2726862175346 最大盈利: 390.56 最大亏损: -172.06 总收益: 249.78 平均盈利: 62.44 typeA: 31.22 胜率: 50.00%
趋势空且增强-2 总交易次数: 6 盈利: 799.1062465374366 亏损: -778.8541643298632 最大盈利: 771.86 最大亏损: -542.23 总收益: 20.25 平均盈利: 3.38 typeA: 1.69 胜率: 50.00%
趋势多且增强-R-1-1-1 总交易次数: 2 盈利: 241.9654610290366 亏损: -209.27999640223075 最大盈利: 241.97 最大亏损: -209.28 总收益: 32.69 平均盈利: 16.34 typeA: 8.17 胜率: 50.00%
趋势多且增强-L-4-2-4 总交易次数: 2 盈利: 107.11057096086152 亏损: -102.89724770642268 最大盈利: 107.11 最大亏损: -102.90 总收益: 4.21 平均盈利: 2.11 typeA: 1.05 胜率: 50.00%
趋势多且增强-L1-3-4 总交易次数: 7 盈利: 571.688302350964 亏损: -292.60247353077324 最大盈利: 316.68 最大亏损: -91.98 总收益: 279.09 平均盈利: 39.87 typeA: 17.09 胜率: 42.86%
趋势多且增强-L3-1-5 总交易次数: 5 盈利: 106.02330196154 亏损: -703.1984788388248 最大盈利: 99.16 最大亏损: -333.66 总收益: -597.18 平均盈利: -119.44 typeA: -47.77 胜率: 40.00%
趋势多且增强-L-4-1-3 总交易次数: 3 盈利: 9.49289761064137 亏损: -210.03828404216551 最大盈利: 9.49 最大亏损: -172.82 总收益: -200.55 平均盈利: -66.85 typeA: -22.28 胜率: 33.33%
趋势多且增强-L-4-3-4 总交易次数: 3 盈利: 0.7358051717063212 亏损: -795.1560086631932 最大盈利: 0.74 最大亏损: -635.91 总收益: -794.42 平均盈利: -264.81 typeA: -88.26 胜率: 33.33%
趋势空且增强-L3-1-6 总交易次数: 7 盈利: 463.7470656585755 亏损: -595.4358098564626 最大盈利: 342.48 最大亏损: -213.19 总收益: -131.69 平均盈利: -18.81 typeA: -5.37 胜率: 28.57%
趋势多且增强-L-4-1-4 总交易次数: 8 盈利: 506.4595376161417 亏损: -329.39673185317804 最大盈利: 352.66 最大亏损: -98.34 总收益: 177.06 平均盈利: 22.13 typeA: 5.53 胜率: 25.00%
趋势多且增强-R-2-2 总交易次数: 1 盈利: 0 亏损: -106.89059221513212 最大盈利: -106.89 最大亏损: -106.89 总收益: -106.89 平均盈利: -106.89 typeA: 0.00 胜率: 0.00%
趋势空且增强-L2-2-3 总交易次数: 1 盈利: 0 亏损: -6.7003887725893545 最大盈利: -6.70 最大亏损: -6.70 总收益: -6.70 平均盈利: -6.70 typeA: 0.00 胜率: 0.00%
趋势多且增强-L1-3-9 总交易次数: 1 盈利: 0 亏损: -204.87663921225771 最大盈利: -204.88 最大亏损: -204.88 总收益: -204.88 平均盈利: -204.88 typeA: 0.00 胜率: 0.00%
趋势多且增强-L1-3-1 总交易次数: 1 盈利: 0 亏损: -5.238293540626248 最大盈利: -5.24 最大亏损: -5.24 总收益: -5.24 平均盈利: -5.24 typeA: 0.00 胜率: 0.00%
趋势多且增强-R-2-1 总交易次数: 1 盈利: 0 亏损: -178.6104549655951 最大盈利: -178.61 最大亏损: -178.61 总收益: -178.61 平均盈利: -178.61 typeA: 0.00 胜率: 0.00%
趋势多且增强-L1-1-6 总交易次数: 1 盈利: 0 亏损: -153.95471464019843 最大盈利: -153.95 最大亏损: -153.95 总收益: -153.95 平均盈利: -153.95 typeA: 0.00 胜率: 0.00%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     96
      胜率:          48.96%
      总收益:        2396.54 USDT
      期末余额:      12202.54 USDT
      盈亏比:        1.27
      最大单笔盈利:  1855.48
      最大单笔亏损:  -813.44
      手续费:       386.6820482031812
      =============================
    
profit: 2202.544649826792
maxDrawdown 17.3%
startTime: 2021-07-30 00:00:00
趋势多且增强-R-1-1-1 总交易次数: 1 盈利: 241.9654610290366 亏损: 0 最大盈利: 241.97 最大亏损: 241.97 总收益: 241.97 平均盈利: 241.97 typeA: 241.97 胜率: 100.00%
趋势多且增强-L3-1-4-1 总交易次数: 7 盈利: 2299.5324243725336 亏损: 0 最大盈利: 1855.48 最大亏损: 6.19 总收益: 2299.53 平均盈利: 328.50 typeA: 328.50 胜率: 100.00%
趋势空且增强-L2-3-4 总交易次数: 2 盈利: 45.60342450782831 亏损: 0 最大盈利: 31.68 最大亏损: 13.92 总收益: 45.60 平均盈利: 22.80 typeA: 22.80 胜率: 100.00%
趋势空且增强-L1-1-2 总交易次数: 2 盈利: 276.1656544695295 亏损: 0 最大盈利: 218.26 最大亏损: 57.91 总收益: 276.17 平均盈利: 138.08 typeA: 138.08 胜率: 100.00%
趋势多且增强-R-1-2-2 总交易次数: 1 盈利: 628.2127705011391 亏损: 0 最大盈利: 628.21 最大亏损: 628.21 总收益: 628.21 平均盈利: 628.21 typeA: 628.21 胜率: 100.00%
趋势多且增强-L-4-1-2 总交易次数: 1 盈利: 159.3800756620423 亏损: 0 最大盈利: 159.38 最大亏损: 159.38 总收益: 159.38 平均盈利: 159.38 typeA: 159.38 胜率: 100.00%
趋势多且增强-L3-1-3 总交易次数: 4 盈利: 1208.4743952596202 亏损: -98.81100661790333 最大盈利: 629.49 最大亏损: -98.81 总收益: 1109.66 平均盈利: 277.42 typeA: 208.06 胜率: 75.00%
趋势多且增强-L3-1-5 总交易次数: 5 盈利: 736.5064443662255 亏损: -321.5428686508322 最大盈利: 350.23 最大亏损: -290.29 总收益: 414.96 平均盈利: 82.99 typeA: 49.80 胜率: 60.00%
趋势空且增强-L2-3-5 总交易次数: 5 盈利: 634.6410171653487 亏损: -86.57850138728541 最大盈利: 437.23 最大亏损: -58.00 总收益: 548.06 平均盈利: 109.61 typeA: 65.77 胜率: 60.00%
趋势多且增强-R-1-1-2 总交易次数: 6 盈利: 626.1529724658014 亏损: -333.25972413715 最大盈利: 408.84 最大亏损: -241.27 总收益: 292.89 平均盈利: 48.82 typeA: 24.41 胜率: 50.00%
趋势多且增强-L1-1-6 总交易次数: 2 盈利: 149.63387440563946 亏损: -214.55105810675082 最大盈利: 149.63 最大亏损: -214.55 总收益: -64.92 平均盈利: -32.46 typeA: -16.23 胜率: 50.00%
趋势多且增强-L1-3-9 总交易次数: 2 盈利: 194.50473093924856 亏损: -311.5535790696261 最大盈利: 194.50 最大亏损: -311.55 总收益: -117.05 平均盈利: -58.52 typeA: -29.26 胜率: 50.00%
趋势多且增强-11 总交易次数: 9 盈利: 442.60331973478986 亏损: -1495.9685836903266 最大盈利: 165.36 最大亏损: -457.27 总收益: -1053.37 平均盈利: -117.04 typeA: -52.01 胜率: 44.44%
趋势空且增强-L2-3-3 总交易次数: 7 盈利: 173.7539185866113 亏损: -701.0393431118467 最大盈利: 104.27 最大亏损: -230.39 总收益: -527.29 平均盈利: -75.33 typeA: -32.28 胜率: 42.86%
趋势空且增强-2 总交易次数: 10 盈利: 2141.6400974917815 亏损: -1626.7585988441838 最大盈利: 1654.31 最大亏损: -675.22 总收益: 514.88 平均盈利: 51.49 typeA: 20.60 胜率: 40.00%
趋势空且增强-11 总交易次数: 6 盈利: 464.91997194528165 亏损: -1445.6960831134754 最大盈利: 278.94 最大亏损: -813.44 总收益: -980.78 平均盈利: -163.46 typeA: -54.48 胜率: 33.33%
趋势多且增强-L-4-1-4 总交易次数: 6 盈利: 304.3392021751336 亏损: -431.9939866293291 最大盈利: 303.21 最大亏损: -156.12 总收益: -127.65 平均盈利: -21.28 typeA: -7.09 胜率: 33.33%
趋势多且增强-L-4-2-4 总交易次数: 7 盈利: 220.77731277963585 亏损: -446.7619015378966 最大盈利: 192.22 最大亏损: -360.75 总收益: -225.98 平均盈利: -32.28 typeA: -9.22 胜率: 28.57%
趋势多且增强-L-4-1-3 总交易次数: 7 盈利: 424.77783491144385 亏损: -1018.115010455542 最大盈利: 268.55 最大亏损: -571.56 总收益: -593.34 平均盈利: -84.76 typeA: -24.22 胜率: 28.57%
趋势空且增强-L2-1-3 总交易次数: 1 盈利: 0 亏损: -194.7308649202391 最大盈利: -194.73 最大亏损: -194.73 总收益: -194.73 平均盈利: -194.73 typeA: 0.00 胜率: 0.00%
趋势多且增强-L3-1-4-3 总交易次数: 2 盈利: 0 亏损: -74.21575093690846 最大盈利: -0.49 最大亏损: -73.73 总收益: -74.22 平均盈利: -37.11 typeA: 0.00 胜率: 0.00%
趋势多且增强-L1-3-4 总交易次数: 1 盈利: 0 亏损: -12.953438573776108 最大盈利: -12.95 最大亏损: -12.95 总收益: -12.95 平均盈利: -12.95 typeA: 0.00 胜率: 0.00%
趋势空且增强-L3-1-6 总交易次数: 2 盈利: 0 亏损: -162.5099531588114 最大盈利: -56.99 最大亏损: -105.52 总收益: -162.51 平均盈利: -81.25 typeA: 0.00 胜率: 0.00%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     91
      胜率:          54.95%
      总收益:        2383.80 USDT
      期末余额:      12201.80 USDT
      盈亏比:        1.67
      最大单笔盈利:  603.97
      最大单笔亏损:  -293.10
      手续费:       364.09236892830995
      =============================
    
profit: 2201.8039492654425
maxDrawdown 7.1%
startTime: 2021-08-29 00:00:00
趋势空且增强-L2-1-3 总交易次数: 2 盈利: 203.54680098706046 亏损: 0 最大盈利: 133.40 最大亏损: 70.15 总收益: 203.55 平均盈利: 101.77 typeA: 101.77 胜率: 100.00%
趋势多且增强-L1-3-9 总交易次数: 1 盈利: 112.16086766142355 亏损: 0 最大盈利: 112.16 最大亏损: 112.16 总收益: 112.16 平均盈利: 112.16 typeA: 112.16 胜率: 100.00%
趋势多且增强-R-1-2-2 总交易次数: 3 盈利: 97.9187531823319 亏损: 0 最大盈利: 64.94 最大亏损: 14.77 总收益: 97.92 平均盈利: 32.64 typeA: 32.64 胜率: 100.00%
趋势多且增强-L-4-2-3 总交易次数: 1 盈利: 15.089885766698137 亏损: 0 最大盈利: 15.09 最大亏损: 15.09 总收益: 15.09 平均盈利: 15.09 typeA: 15.09 胜率: 100.00%
趋势多且增强-L3-1-4-3 总交易次数: 1 盈利: 14.872227579555895 亏损: 0 最大盈利: 14.87 最大亏损: 14.87 总收益: 14.87 平均盈利: 14.87 typeA: 14.87 胜率: 100.00%
趋势多且增强-L3-1-4-1 总交易次数: 7 盈利: 402.2446733144302 亏损: -138.73239615800426 最大盈利: 303.65 最大亏损: -138.73 总收益: 263.51 平均盈利: 37.64 typeA: 32.27 胜率: 85.71%
趋势空且增强-11 总交易次数: 4 盈利: 526.2205030193522 亏损: -221.22381248703437 最大盈利: 279.18 最大亏损: -221.22 总收益: 305.00 平均盈利: 76.25 typeA: 57.19 胜率: 75.00%
趋势多且增强-L3-1-5 总交易次数: 4 盈利: 91.18493961422871 亏损: -223.31510687695058 最大盈利: 36.33 最大亏损: -223.32 总收益: -132.13 平均盈利: -33.03 typeA: -24.77 胜率: 75.00%
趋势空且增强-2 总交易次数: 6 盈利: 211.40433728438217 亏损: -121.92203852145619 最大盈利: 94.10 最大亏损: -117.87 总收益: 89.48 平均盈利: 14.91 typeA: 9.94 胜率: 66.67%
趋势空且增强-L2-3-5 总交易次数: 5 盈利: 120.63737769564847 亏损: -176.27820804791057 最大盈利: 98.64 最大亏损: -118.28 总收益: -55.64 平均盈利: -11.13 typeA: -6.68 胜率: 60.00%
趋势多且增强-R-1-1-2 总交易次数: 12 盈利: 1366.6601680100105 亏损: -503.91423750373843 最大盈利: 457.37 最大亏损: -293.10 总收益: 862.75 平均盈利: 71.90 typeA: 41.94 胜率: 58.33%
趋势多且增强-11 总交易次数: 2 盈利: 363.86896575555636 亏损: -231.6893430256475 最大盈利: 363.87 最大亏损: -231.69 总收益: 132.18 平均盈利: 66.09 typeA: 33.04 胜率: 50.00%
趋势空且增强-L2-3-4 总交易次数: 4 盈利: 95.0971226054429 亏损: -60.408112830158174 最大盈利: 61.25 最大亏损: -45.43 总收益: 34.69 平均盈利: 8.67 typeA: 4.34 胜率: 50.00%
趋势多且增强-L1-1-6 总交易次数: 2 盈利: 105.62367237584928 亏损: -223.78950747173397 最大盈利: 105.62 最大亏损: -223.79 总收益: -118.17 平均盈利: -59.08 typeA: -29.54 胜率: 50.00%
趋势多且增强-L-4-3-4 总交易次数: 4 盈利: 97.55232042248583 亏损: -69.52645414504575 最大盈利: 96.27 最大亏损: -41.82 总收益: 28.03 平均盈利: 7.01 typeA: 3.50 胜率: 50.00%
趋势多且增强-R-1-1-1 总交易次数: 2 盈利: 49.94223572403533 亏损: -102.46828994061958 最大盈利: 49.94 最大亏损: -102.47 总收益: -52.53 平均盈利: -26.26 typeA: -13.13 胜率: 50.00%
趋势空且增强-L3-1-6 总交易次数: 2 盈利: 445.21244451683907 亏损: -12.600953895071958 最大盈利: 445.21 最大亏损: -12.60 总收益: 432.61 平均盈利: 216.31 typeA: 108.15 胜率: 50.00%
趋势多且增强-L1-3-4 总交易次数: 2 盈利: 205.97168362051013 亏损: -52.540702942437775 最大盈利: 205.97 最大亏损: -52.54 总收益: 153.43 平均盈利: 76.72 typeA: 38.36 胜率: 50.00%
趋势多且增强-L1-2-5 总交易次数: 2 盈利: 175.24436250177297 亏损: -94.75989116374497 最大盈利: 175.24 最大亏损: -94.76 总收益: 80.48 平均盈利: 40.24 typeA: 20.12 胜率: 50.00%
趋势多且增强-L-4-1-4 总交易次数: 6 盈利: 175.2786640043068 亏损: -343.52777108457906 最大盈利: 127.96 最大亏损: -198.52 总收益: -168.25 平均盈利: -28.04 typeA: -9.35 胜率: 33.33%
趋势空且增强-L2-3-3 总交易次数: 3 盈利: 89.76146788990772 亏损: -99.21068472672506 最大盈利: 89.76 最大亏损: -72.59 总收益: -9.45 平均盈利: -3.15 typeA: -1.05 胜率: 33.33%
趋势多且增强-L-4-2-4 总交易次数: 3 盈利: 603.9683115395623 亏损: -70.46317044489479 最大盈利: 603.97 最大亏损: -50.55 总收益: 533.51 平均盈利: 177.84 typeA: 59.27 胜率: 33.33%
趋势多且增强-L-4-1-3 总交易次数: 9 盈利: 354.93827344935767 亏损: -721.7250095367675 最大盈利: 285.90 最大亏损: -257.46 总收益: -366.79 平均盈利: -40.75 typeA: -9.06 胜率: 22.22%
趋势多且增强-L-4-1-2 总交易次数: 1 盈利: 0 亏损: -3.076288215873924 最大盈利: -3.08 最大亏损: -3.08 总收益: -3.08 平均盈利: -3.08 typeA: 0.00 胜率: 0.00%
趋势多且增强-L3-1-3 总交易次数: 1 盈利: 0 亏损: -1.282731903292202 最大盈利: -1.28 最大亏损: -1.28 总收益: -1.28 平均盈利: -1.28 typeA: 0.00 胜率: 0.00%
趋势多且增强-L1-2-1 总交易次数: 1 盈利: 0 亏损: -42.9372035513038 最大盈利: -42.94 最大亏损: -42.94 总收益: -42.94 平均盈利: -42.94 typeA: 0.00 胜率: 0.00%
趋势多且增强-R-2-1 总交易次数: 1 盈利: 0 亏损: -25.204194782309067 最大盈利: -25.20 最大亏损: -25.20 总收益: -25.20 平均盈利: -25.20 typeA: 0.00 胜率: 0.00%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     102
      胜率:          40.20%
      总收益:        2489.66 USDT
      期末余额:      12283.66 USDT
      盈亏比:        1.33
      最大单笔盈利:  2299.54
      最大单笔亏损:  -731.06
      手续费:       410.76906448465076
      =============================
    
profit: 2283.662126425317
maxDrawdown 30.3%
startTime: 2021-09-28 00:00:00
趋势多且增强-L3-1-4-3 总交易次数: 1 盈利: 7.563720161746075 亏损: 0 最大盈利: 7.56 最大亏损: 7.56 总收益: 7.56 平均盈利: 7.56 typeA: 7.56 胜率: 100.00%
趋势多且增强-L3-1-3 总交易次数: 2 盈利: 120.8477168727185 亏损: 0 最大盈利: 103.63 最大亏损: 17.22 总收益: 120.85 平均盈利: 60.42 typeA: 60.42 胜率: 100.00%
趋势空且增强-L2-3-3 总交易次数: 4 盈利: 166.27719184932576 亏损: -219.06167356414647 最大盈利: 71.68 最大亏损: -219.06 总收益: -52.78 平均盈利: -13.20 typeA: -9.90 胜率: 75.00%
趋势空且增强-L2-1-3 总交易次数: 7 盈利: 1760.9517235598735 亏损: -55.75624737063563 最大盈利: 1220.97 最大亏损: -53.76 总收益: 1705.20 平均盈利: 243.60 typeA: 174.00 胜率: 71.43%
趋势多且增强-L3-1-4-1 总交易次数: 9 盈利: 635.2775260855791 亏损: -160.92804361226115 最大盈利: 453.01 最大亏损: -78.23 总收益: 474.35 平均盈利: 52.71 typeA: 35.14 胜率: 66.67%
趋势多且增强-L3-1-5 总交易次数: 3 盈利: 218.10451165051492 亏损: -39.19494047619051 最大盈利: 151.29 最大亏损: -39.19 总收益: 178.91 平均盈利: 59.64 typeA: 39.76 胜率: 66.67%
趋势多且增强-L-4-2-4 总交易次数: 2 盈利: 0.8592556277327486 亏损: -28.357513393996488 最大盈利: 0.86 最大亏损: -28.36 总收益: -27.50 平均盈利: -13.75 typeA: -6.87 胜率: 50.00%
趋势空且增强-L2-3-5 总交易次数: 4 盈利: 189.7337677622809 亏损: -101.92404142263696 最大盈利: 166.14 最大亏损: -55.21 总收益: 87.81 平均盈利: 21.95 typeA: 10.98 胜率: 50.00%
趋势多且增强-L1-1-6 总交易次数: 2 盈利: 417.31773774996185 亏损: -26.48252677014939 最大盈利: 417.32 最大亏损: -26.48 总收益: 390.84 平均盈利: 195.42 typeA: 97.71 胜率: 50.00%
趋势多且增强-11 总交易次数: 9 盈利: 3027.2436237459956 亏损: -534.0467966721012 最大盈利: 2299.54 最大亏损: -174.70 总收益: 2493.20 平均盈利: 277.02 typeA: 123.11 胜率: 44.44%
趋势多且增强-R-1-1-2 总交易次数: 7 盈利: 1153.849539206455 亏损: -309.6387641305333 最大盈利: 880.68 最大亏损: -117.46 总收益: 844.21 平均盈利: 120.60 typeA: 51.69 胜率: 42.86%
趋势空且增强-L2-3-4 总交易次数: 3 盈利: 14.84422210114316 亏损: -72.10950162298 最大盈利: 14.84 最大亏损: -37.68 总收益: -57.27 平均盈利: -19.09 typeA: -6.36 胜率: 33.33%
趋势空且增强-L1-1-2 总交易次数: 6 盈利: 205.56105144527083 亏损: -1087.8180463188235 最大盈利: 153.33 最大亏损: -731.06 总收益: -882.26 平均盈利: -147.04 typeA: -49.01 胜率: 33.33%
趋势多且增强-L1-2-5 总交易次数: 3 盈利: 311.7711289076794 亏损: -235.43043460609866 最大盈利: 311.77 最大亏损: -177.16 总收益: 76.34 平均盈利: 25.45 typeA: 8.48 胜率: 33.33%
趋势空且增强-2 总交易次数: 11 盈利: 412.12164966720184 亏损: -1374.2944209657753 最大盈利: 362.58 最大亏损: -538.14 总收益: -962.17 平均盈利: -87.47 typeA: -23.85 胜率: 27.27%
趋势空且增强-L3-1-6 总交易次数: 4 盈利: 243.5077010606745 亏损: -431.41693627844757 最大盈利: 243.51 最大亏损: -215.92 总收益: -187.91 平均盈利: -46.98 typeA: -11.74 胜率: 25.00%
趋势多且增强-L-4-1-3 总交易次数: 10 盈利: 1038.6719374633615 亏损: -950.8851427554782 最大盈利: 692.63 最大亏损: -274.71 总收益: 87.79 平均盈利: 8.78 typeA: 1.76 胜率: 20.00%
趋势多且增强-L-4-1-4 总交易次数: 5 盈利: 79.25914348233927 亏损: -323.9752619824598 最大盈利: 79.26 最大亏损: -124.64 总收益: -244.72 平均盈利: -48.94 typeA: -9.79 胜率: 20.00%
趋势多且增强-L-4-3-4 总交易次数: 4 盈利: 0 亏损: -606.5542108174691 最大盈利: -12.42 最大亏损: -360.68 总收益: -606.55 平均盈利: -151.64 typeA: 0.00 胜率: 0.00%
趋势空且增强-11 总交易次数: 1 盈利: 0 亏损: -306.1771451976245 最大盈利: -306.18 最大亏损: -306.18 总收益: -306.18 平均盈利: -306.18 typeA: 0.00 胜率: 0.00%
趋势多且增强-L1-3-4 总交易次数: 1 盈利: 0 亏损: -301.55251912948466 最大盈利: -301.55 最大亏损: -301.55 总收益: -301.55 平均盈利: -301.55 typeA: 0.00 胜率: 0.00%
趋势多且增强-L1-2-2 总交易次数: 2 盈利: 0 亏损: -171.1297536743629 最大盈利: -42.74 最大亏损: -128.39 总收益: -171.13 平均盈利: -85.56 typeA: 0.00 胜率: 0.00%
趋势多且增强-L-4-1-2 总交易次数: 1 盈利: 0 亏损: -177.0503370393068 最大盈利: -177.05 最大亏损: -177.05 总收益: -177.05 平均盈利: -177.05 typeA: 0.00 胜率: 0.00%
趋势多且增强-L1-3-9 总交易次数: 1 盈利: 0 亏损: -0.31676417357581377 最大盈利: -0.32 最大亏损: -0.32 总收益: -0.32 平均盈利: -0.32 typeA: 0.00 胜率: 0.00%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     96
      胜率:          55.21%
      总收益:        1960.77 USDT
      期末余额:      11768.77 USDT
      盈亏比:        1.42
      最大单笔盈利:  2299.54
      最大单笔亏损:  -731.06
      手续费:       384.25434712919304
      =============================
    
profit: 1768.7682045385445
maxDrawdown 10.5%
startTime: 2021-10-28 00:00:00
趋势空且增强-L3-1-6 总交易次数: 1 盈利: 137.5143183651515 亏损: 0 最大盈利: 137.51 最大亏损: 137.51 总收益: 137.51 平均盈利: 137.51 typeA: 137.51 胜率: 100.00%
趋势空且增强-11 总交易次数: 4 盈利: 446.9400761016708 亏损: 0 最大盈利: 172.15 最大亏损: 31.36 总收益: 446.94 平均盈利: 111.74 typeA: 111.74 胜率: 100.00%
趋势多且增强-L3-1-5 总交易次数: 2 盈利: 265.08526188983194 亏损: 0 最大盈利: 179.45 最大亏损: 85.63 总收益: 265.09 平均盈利: 132.54 typeA: 132.54 胜率: 100.00%
趋势多且增强-L1-3-9 总交易次数: 1 盈利: 161.2326530612247 亏损: 0 最大盈利: 161.23 最大亏损: 161.23 总收益: 161.23 平均盈利: 161.23 typeA: 161.23 胜率: 100.00%
趋势多且增强-L1-3-4 总交易次数: 3 盈利: 444.71464128448656 亏损: 0 最大盈利: 245.89 最大亏损: 69.81 总收益: 444.71 平均盈利: 148.24 typeA: 148.24 胜率: 100.00%
趋势多且增强-L1-2-1 总交易次数: 1 盈利: 267.068507194902 亏损: 0 最大盈利: 267.07 最大亏损: 267.07 总收益: 267.07 平均盈利: 267.07 typeA: 267.07 胜率: 100.00%
趋势多且增强-L-4-3-4 总交易次数: 3 盈利: 113.20988840631253 亏损: 0 最大盈利: 97.79 最大亏损: 5.22 总收益: 113.21 平均盈利: 37.74 typeA: 37.74 胜率: 100.00%
趋势多且增强-L-4-2-3 总交易次数: 1 盈利: 68.86682846026459 亏损: 0 最大盈利: 68.87 最大亏损: 68.87 总收益: 68.87 平均盈利: 68.87 typeA: 68.87 胜率: 100.00%
趋势多且增强-L-4-1-2 总交易次数: 1 盈利: 307.29860588625786 亏损: 0 最大盈利: 307.30 最大亏损: 307.30 总收益: 307.30 平均盈利: 307.30 typeA: 307.30 胜率: 100.00%
趋势多且增强-L3-1-4-1 总交易次数: 7 盈利: 275.98382359215327 亏损: -180.15847302436995 最大盈利: 168.06 最大亏损: -180.16 总收益: 95.83 平均盈利: 13.69 typeA: 11.73 胜率: 85.71%
趋势空且增强-L2-3-5 总交易次数: 5 盈利: 503.6309871973208 亏损: -241.83399428202574 最大盈利: 376.08 最大亏损: -241.83 总收益: 261.80 平均盈利: 52.36 typeA: 41.89 胜率: 80.00%
趋势空且增强-L2-1-3 总交易次数: 4 盈利: 249.44640097952276 亏损: -5.802318950769397 最大盈利: 104.51 最大亏损: -5.80 总收益: 243.64 平均盈利: 60.91 typeA: 45.68 胜率: 75.00%
趋势空且增强-L2-3-3 总交易次数: 4 盈利: 125.89820820081745 亏损: -44.410695742471816 最大盈利: 54.02 最大亏损: -44.41 总收益: 81.49 平均盈利: 20.37 typeA: 15.28 胜率: 75.00%
趋势多且增强-R-1-1-2 总交易次数: 8 盈利: 312.93172609832123 亏损: -388.75392533951015 最大盈利: 224.15 最大亏损: -184.53 总收益: -75.82 平均盈利: -9.48 typeA: -5.92 胜率: 62.50%
趋势空且增强-2 总交易次数: 10 盈利: 286.7283162477914 亏损: -455.3172641424905 最大盈利: 112.65 最大亏损: -304.60 总收益: -168.59 平均盈利: -16.86 typeA: -8.43 胜率: 50.00%
趋势多且增强-11 总交易次数: 2 盈利: 2299.539285151946 亏损: -63.21741965870691 最大盈利: 2299.54 最大亏损: -63.22 总收益: 2236.32 平均盈利: 1118.16 typeA: 559.08 胜率: 50.00%
趋势空且增强-L1-1-2 总交易次数: 2 盈利: 111.3711161488197 亏损: -731.0591322155371 最大盈利: 111.37 最大亏损: -731.06 总收益: -619.69 平均盈利: -309.84 typeA: -154.92 胜率: 50.00%
趋势多且增强-R-2-1 总交易次数: 2 盈利: 7.66812362201787 亏损: -54.94337087532139 最大盈利: 7.67 最大亏损: -54.94 总收益: -47.28 平均盈利: -23.64 typeA: -11.82 胜率: 50.00%
趋势多且增强-R-1-2-2 总交易次数: 2 盈利: 25.559264271036678 亏损: -323.3284231670569 最大盈利: 25.56 最大亏损: -323.33 总收益: -297.77 平均盈利: -148.88 typeA: -74.44 胜率: 50.00%
趋势空且增强-L2-3-4 总交易次数: 7 盈利: 130.35975134022772 亏损: -146.73418770647734 最大盈利: 72.71 最大亏损: -89.88 总收益: -16.37 平均盈利: -2.34 typeA: -1.00 胜率: 42.86%
趋势多且增强-L-4-2-4 总交易次数: 6 盈利: 115.42670398667755 亏损: -155.66390699798006 最大盈利: 114.13 最大亏损: -53.97 总收益: -40.24 平均盈利: -6.71 typeA: -2.24 胜率: 33.33%
趋势多且增强-L-4-1-3 总交易次数: 5 盈利: 4.846121657093373 亏损: -261.41300261477994 最大盈利: 4.85 最大亏损: -96.85 总收益: -256.57 平均盈利: -51.31 typeA: -10.26 胜率: 20.00%
趋势多且增强-L3-1-3 总交易次数: 1 盈利: 0 亏损: -144.20310520791824 最大盈利: -144.20 最大亏损: -144.20 总收益: -144.20 平均盈利: -144.20 typeA: 0.00 胜率: 0.00%
趋势多且增强-L1-2-5 总交易次数: 4 盈利: 0 亏损: -433.1711733217861 最大盈利: -33.09 最大亏损: -271.43 总收益: -433.17 平均盈利: -108.29 typeA: 0.00 胜率: 0.00%
趋势多且增强-L-4-1-4 总交易次数: 7 盈利: 0 亏损: -556.6114759898536 最大盈利: -5.87 最大亏损: -377.10 总收益: -556.61 平均盈利: -79.52 typeA: 0.00 胜率: 0.00%
趋势多且增强-L1-1-6 总交易次数: 2 盈利: 0 亏损: -444.6188464813258 最大盈利: -62.96 最大亏损: -381.66 总收益: -444.62 平均盈利: -222.31 typeA: 0.00 胜率: 0.00%
趋势多且增强-L3-1-4-3 总交易次数: 1 盈利: 0 亏损: -69.31168888692004 最大盈利: -69.31 最大亏损: -69.31 总收益: -69.31 平均盈利: -69.31 typeA: 0.00 胜率: 0.00%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     94
      胜率:          52.13%
      总收益:        1107.85 USDT
      期末余额:      10919.85 USDT
      盈亏比:        1.16
      最大单笔盈利:  2117.62
      最大单笔亏损:  -2061.77
      手续费:       376.2795326157602
      =============================
    
profit: 919.8496431745698
maxDrawdown 33.9%
startTime: 2021-11-27 00:00:00
趋势多且增强-L3-1-3 总交易次数: 2 盈利: 60.643124787865936 亏损: 0 最大盈利: 59.23 最大亏损: 1.41 总收益: 60.64 平均盈利: 30.32 typeA: 30.32 胜率: 100.00%
趋势空且增强-2 总交易次数: 4 盈利: 36.656110268382996 亏损: 0 最大盈利: 13.74 最大亏损: 4.66 总收益: 36.66 平均盈利: 9.16 typeA: 9.16 胜率: 100.00%
趋势多且增强-R-1-1-1 总交易次数: 2 盈利: 576.9973225909112 亏损: 0 最大盈利: 471.30 最大亏损: 105.70 总收益: 577.00 平均盈利: 288.50 typeA: 288.50 胜率: 100.00%
趋势多且增强-L3-1-5 总交易次数: 1 盈利: 222.18740183068869 亏损: 0 最大盈利: 222.19 最大亏损: 222.19 总收益: 222.19 平均盈利: 222.19 typeA: 222.19 胜率: 100.00%
趋势空且增强-L2-2-3 总交易次数: 1 盈利: 1.651888170249035 亏损: 0 最大盈利: 1.65 最大亏损: 1.65 总收益: 1.65 平均盈利: 1.65 typeA: 1.65 胜率: 100.00%
趋势多且增强-R-1-1-2 总交易次数: 12 盈利: 995.6839917373096 亏损: -2144.317720330137 最大盈利: 321.57 最大亏损: -2061.77 总收益: -1148.63 平均盈利: -95.72 typeA: -71.79 胜率: 75.00%
趋势空且增强-11 总交易次数: 4 盈利: 740.5934226313506 亏损: -222.1969659595455 最大盈利: 402.53 最大亏损: -222.20 总收益: 518.40 平均盈利: 129.60 typeA: 97.20 胜率: 75.00%
趋势空且增强-L2-1-3 总交易次数: 4 盈利: 625.7545960844839 亏损: -13.320882852292346 最大盈利: 444.75 最大亏损: -13.32 总收益: 612.43 平均盈利: 153.11 typeA: 114.83 胜率: 75.00%
趋势空且增强-L2-3-3 总交易次数: 3 盈利: 152.1577801716515 亏损: -769.004461895414 最大盈利: 107.02 最大亏损: -769.00 总收益: -616.85 平均盈利: -205.62 typeA: -137.08 胜率: 66.67%
趋势空且增强-L2-3-4 总交易次数: 7 盈利: 362.1050328069996 亏损: -896.9864509101561 最大盈利: 268.85 最大亏损: -470.02 总收益: -534.88 平均盈利: -76.41 typeA: -43.66 胜率: 57.14%
趋势多且增强-L3-1-4-1 总交易次数: 6 盈利: 122.30671247604336 亏损: -287.4125637416155 最大盈利: 70.88 最大亏损: -143.35 总收益: -165.11 平均盈利: -27.52 typeA: -13.76 胜率: 50.00%
趋势空且增强-L2-3-5 总交易次数: 2 盈利: 15.753979054493504 亏损: -119.03845540130735 最大盈利: 15.75 最大亏损: -119.04 总收益: -103.28 平均盈利: -51.64 typeA: -25.82 胜率: 50.00%
趋势多且增强-L-4-2-3 总交易次数: 2 盈利: 49.36856453811517 亏损: -32.413946413947606 最大盈利: 49.37 最大亏损: -32.41 总收益: 16.95 平均盈利: 8.48 typeA: 4.24 胜率: 50.00%
趋势多且增强-L-4-2-4 总交易次数: 11 盈利: 2454.4925514093397 亏损: -365.0705989460159 最大盈利: 2117.62 最大亏损: -186.35 总收益: 2089.42 平均盈利: 189.95 typeA: 86.33 胜率: 45.45%
趋势多且增强-L-4-1-4 总交易次数: 5 盈利: 848.8573143802832 亏损: -328.02186059259907 最大盈利: 817.24 最大亏损: -313.32 总收益: 520.84 平均盈利: 104.17 typeA: 41.67 胜率: 40.00%
趋势多且增强-L-4-3-4 总交易次数: 5 盈利: 268.08911704613297 亏损: -258.6108694666555 最大盈利: 258.88 最大亏损: -196.44 总收益: 9.48 平均盈利: 1.90 typeA: 0.76 胜率: 40.00%
趋势多且增强-L3-1-4-3 总交易次数: 3 盈利: 196.93167625811037 亏损: -193.8137893150421 最大盈利: 196.93 最大亏损: -137.29 总收益: 3.12 平均盈利: 1.04 typeA: 0.35 胜率: 33.33%
趋势多且增强-L-4-1-3 总交易次数: 3 盈利: 5.582195776456597 亏损: -286.93231488222494 最大盈利: 5.58 最大亏损: -191.15 总收益: -281.35 平均盈利: -93.78 typeA: -31.26 胜率: 33.33%
趋势空且增强-L3-1-6 总交易次数: 5 盈利: 393.2648713455683 亏损: -364.0472213629863 最大盈利: 393.26 最大亏损: -138.31 总收益: 29.22 平均盈利: 5.84 typeA: 1.17 胜率: 20.00%
趋势多且增强-L1-3-4 总交易次数: 5 盈利: 11.185624793932861 亏损: -245.69427035593606 最大盈利: 11.19 最大亏损: -108.25 总收益: -234.51 平均盈利: -46.90 typeA: -9.38 胜率: 20.00%
趋势多且增强-L1-1-6 总交易次数: 1 盈利: 0 亏损: -62.95751475854112 最大盈利: -62.96 最大亏损: -62.96 总收益: -62.96 平均盈利: -62.96 typeA: 0.00 胜率: 0.00%
趋势多且增强-11 总交易次数: 4 盈利: 0 亏损: -376.0433276749557 最大盈利: -48.84 最大亏损: -209.34 总收益: -376.04 平均盈利: -94.01 typeA: 0.00 胜率: 0.00%
趋势空且增强-L1-1-2 总交易次数: 1 盈利: 0 亏损: -56.12034704730023 最大盈利: -56.12 最大亏损: -56.12 总收益: -56.12 平均盈利: -56.12 typeA: 0.00 胜率: 0.00%
趋势多且增强-L-4-1-2 总交易次数: 1 盈利: 0 亏损: -10.410073077124942 最大盈利: -10.41 最大亏损: -10.41 总收益: -10.41 平均盈利: -10.41 typeA: 0.00 胜率: 0.00%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     112
      胜率:          48.21%
      总收益:        1303.08 USDT
      期末余额:      11079.08 USDT
      盈亏比:        1.20
      最大单笔盈利:  1343.85
      最大单笔亏损:  -562.16
      手续费:       447.9820557820572
      =============================
    
profit: 1079.076423516659
maxDrawdown 23.3%
startTime: 2021-12-27 00:00:00
趋势空且增强-L2-2-3 总交易次数: 2 盈利: 217.02103999638803 亏损: 0 最大盈利: 215.37 最大亏损: 1.65 总收益: 217.02 平均盈利: 108.51 typeA: 108.51 胜率: 100.00%
趋势多且增强-R-1-1-1 总交易次数: 2 盈利: 272.0645014362815 亏损: 0 最大盈利: 239.63 最大亏损: 32.44 总收益: 272.06 平均盈利: 136.03 typeA: 136.03 胜率: 100.00%
趋势多且增强-L3-1-4-3 总交易次数: 6 盈利: 943.0133552641875 亏损: -207.5663551401867 最大盈利: 813.43 最大亏损: -207.57 总收益: 735.45 平均盈利: 122.57 typeA: 102.14 胜率: 83.33%
趋势空且增强-L2-3-3 总交易次数: 7 盈利: 496.915852653954 亏损: -53.80804554193412 最大盈利: 275.24 最大亏损: -32.57 总收益: 443.11 平均盈利: 63.30 typeA: 45.22 胜率: 71.43%
趋势空且增强-L2-3-4 总交易次数: 10 盈利: 292.8592592061385 亏损: -141.69608663844377 最大盈利: 78.32 最大亏损: -110.71 总收益: 151.16 平均盈利: 15.12 typeA: 10.58 胜率: 70.00%
趋势多且增强-L3-1-5 总交易次数: 3 盈利: 801.0272672693686 亏损: -220.76494640291696 最大盈利: 714.46 最大亏损: -220.76 总收益: 580.26 平均盈利: 193.42 typeA: 128.95 胜率: 66.67%
趋势多且增强-11 总交易次数: 3 盈利: 114.91165959166449 亏损: -149.56240290005132 最大盈利: 113.54 最大亏损: -149.56 总收益: -34.65 平均盈利: -11.55 typeA: -7.70 胜率: 66.67%
趋势空且增强-2 总交易次数: 5 盈利: 244.45509841530742 亏损: -248.86625028795 最大盈利: 168.88 最大亏损: -176.97 总收益: -4.41 平均盈利: -0.88 typeA: -0.53 胜率: 60.00%
趋势空且增强-11 总交易次数: 5 盈利: 756.2634112038082 亏损: -271.65443192538373 最大盈利: 459.86 最大亏损: -181.95 总收益: 484.61 平均盈利: 96.92 typeA: 58.15 胜率: 60.00%
趋势多且增强-R-1-1-2 总交易次数: 10 盈利: 238.6546111263028 亏损: -534.8898449611944 最大盈利: 130.94 最大亏损: -165.67 总收益: -296.24 平均盈利: -29.62 typeA: -14.81 胜率: 50.00%
趋势多且增强-L-4-3-4 总交易次数: 4 盈利: 62.34599685555774 亏损: -193.74483919139504 最大盈利: 43.17 最大亏损: -127.02 总收益: -131.40 平均盈利: -32.85 typeA: -16.42 胜率: 50.00%
趋势多且增强-R-2-1 总交易次数: 4 盈利: 39.88688583746762 亏损: -547.8513382176201 最大盈利: 22.20 最大亏损: -498.07 总收益: -507.96 平均盈利: -126.99 typeA: -63.50 胜率: 50.00%
趋势多且增强-R-1-2-2 总交易次数: 4 盈利: 391.2122828961769 亏损: -173.60148002100547 最大盈利: 361.87 最大亏损: -128.87 总收益: 217.61 平均盈利: 54.40 typeA: 27.20 胜率: 50.00%
趋势多且增强-L3-1-4-1 总交易次数: 8 盈利: 1427.1042067851602 亏损: -236.40598682491117 最大盈利: 1343.85 最大亏损: -107.62 总收益: 1190.70 平均盈利: 148.84 typeA: 74.42 胜率: 50.00%
趋势多且增强-L-4-2-3 总交易次数: 8 盈利: 446.87766479313325 亏损: -408.88839392004564 最大盈利: 372.89 最大亏损: -170.33 总收益: 37.99 平均盈利: 4.75 typeA: 1.78 胜率: 37.50%
趋势多且增强-L1-3-4 总交易次数: 8 盈利: 560.9478772125241 亏损: -1263.8918620504317 最大盈利: 428.77 最大亏损: -562.16 总收益: -702.94 平均盈利: -87.87 typeA: -21.97 胜率: 25.00%
趋势空且增强-L3-1-6 总交易次数: 4 盈利: 21.66995670995635 亏损: -376.6895748618143 最大盈利: 21.67 最大亏损: -181.67 总收益: -355.02 平均盈利: -88.75 typeA: -22.19 胜率: 25.00%
趋势空且增强-L2-3-5 总交易次数: 5 盈利: 27.27725103404492 亏损: -226.0543563420767 最大盈利: 27.28 最大亏损: -87.96 总收益: -198.78 平均盈利: -39.76 typeA: -7.95 胜率: 20.00%
趋势多且增强-L-4-1-3 总交易次数: 7 盈利: 451.1157942442786 亏损: -425.98258560773763 最大盈利: 451.12 最大亏损: -92.68 总收益: 25.13 平均盈利: 3.59 typeA: 0.51 胜率: 14.29%
趋势多且增强-L-4-2-4 总交易次数: 4 盈利: 0 亏损: -321.0039230660865 最大盈利: -47.36 最大亏损: -129.27 总收益: -321.00 平均盈利: -80.25 typeA: 0.00 胜率: 0.00%
趋势多且增强-L1-3-9 总交易次数: 2 盈利: 0 亏损: -492.48318395500536 最大盈利: -29.63 最大亏损: -462.86 总收益: -492.48 平均盈利: -246.24 typeA: 0.00 胜率: 0.00%
趋势空且增强-L2-1-3 总交易次数: 1 盈利: 0 亏损: -7.141661158844586 最大盈利: -7.14 最大亏损: -7.14 总收益: -7.14 平均盈利: -7.14 typeA: 0.00 胜率: 0.00%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     81
      胜率:          48.15%
      总收益:        -1778.45 USDT
      期末余额:      8059.55 USDT
      盈亏比:        0.69
      最大单笔盈利:  438.25
      最大单笔亏损:  -830.33
      手续费:       324.0021787318082
      =============================
    
profit: -1940.4499689982285
maxDrawdown 24.6%
startTime: 2022-01-26 00:00:00
趋势空且增强-L2-1-3 总交易次数: 1 盈利: 125.58911833110004 亏损: 0 最大盈利: 125.59 最大亏损: 125.59 总收益: 125.59 平均盈利: 125.59 typeA: 125.59 胜率: 100.00%
趋势多且增强-L-4-2-2 总交易次数: 2 盈利: 274.47495018484415 亏损: 0 最大盈利: 197.33 最大亏损: 77.15 总收益: 274.47 平均盈利: 137.24 typeA: 137.24 胜率: 100.00%
趋势多且增强-L1-3-9 总交易次数: 1 盈利: 178.84402267371385 亏损: 0 最大盈利: 178.84 最大亏损: 178.84 总收益: 178.84 平均盈利: 178.84 typeA: 178.84 胜率: 100.00%
趋势多且增强-L3-1-4-1 总交易次数: 2 盈利: 122.04753411558534 亏损: 0 最大盈利: 64.94 最大亏损: 57.11 总收益: 122.05 平均盈利: 61.02 typeA: 61.02 胜率: 100.00%
趋势多且增强-L3-1-4-3 总交易次数: 5 盈利: 90.47676716774728 亏损: -51.03614619725937 最大盈利: 47.48 最大亏损: -51.04 总收益: 39.44 平均盈利: 7.89 typeA: 6.31 胜率: 80.00%
趋势多且增强-L3-1-3 总交易次数: 5 盈利: 479.56890197549444 亏损: -22.088824222269274 最大盈利: 210.03 最大亏损: -22.09 总收益: 457.48 平均盈利: 91.50 typeA: 73.20 胜率: 80.00%
趋势多且增强-R-1-2-2 总交易次数: 5 盈利: 791.5551586988009 亏损: -830.3333605686737 最大盈利: 234.67 最大亏损: -830.33 总收益: -38.78 平均盈利: -7.76 typeA: -6.20 胜率: 80.00%
趋势多且增强-R-2-1 总交易次数: 3 盈利: 129.33470548080368 亏损: -137.62584304108074 最大盈利: 100.69 最大亏损: -137.63 总收益: -8.29 平均盈利: -2.76 typeA: -1.84 胜率: 66.67%
趋势多且增强-L3-1-5 总交易次数: 5 盈利: 69.28341491993467 亏损: -42.109157474397364 最大盈利: 24.53 最大亏损: -25.24 总收益: 27.17 平均盈利: 5.43 typeA: 3.26 胜率: 60.00%
趋势多且增强-L-4-1-3 总交易次数: 2 盈利: 69.73168253968204 亏损: -51.64866542520163 最大盈利: 69.73 最大亏损: -51.65 总收益: 18.08 平均盈利: 9.04 typeA: 4.52 胜率: 50.00%
趋势多且增强-L-4-2-4 总交易次数: 4 盈利: 178.9534862027288 亏损: -68.30765919339672 最大盈利: 102.84 最大亏损: -42.68 总收益: 110.65 平均盈利: 27.66 typeA: 13.83 胜率: 50.00%
趋势多且增强-L-4-2-3 总交易次数: 2 盈利: 202.0564133924481 亏损: -50.903640556214 最大盈利: 202.06 最大亏损: -50.90 总收益: 151.15 平均盈利: 75.58 typeA: 37.79 胜率: 50.00%
趋势多且增强-R-1-1-2 总交易次数: 2 盈利: 32.85959501139819 亏损: -98.45129411764775 最大盈利: 32.86 最大亏损: -98.45 总收益: -65.59 平均盈利: -32.80 typeA: -16.40 胜率: 50.00%
趋势多且增强-R-2-2 总交易次数: 2 盈利: 23.752870179569413 亏损: -38.80679646017647 最大盈利: 23.75 最大亏损: -38.81 总收益: -15.05 平均盈利: -7.53 typeA: -3.76 胜率: 50.00%
趋势多且增强-11 总交易次数: 7 盈利: 483.9176612535743 亏损: -1306.0215793776142 最大盈利: 438.25 最大亏损: -495.07 总收益: -822.10 平均盈利: -117.44 typeA: -50.34 胜率: 42.86%
趋势空且增强-2 总交易次数: 5 盈利: 215.35580291007258 亏损: -171.52091283162468 最大盈利: 115.21 最大亏损: -71.89 总收益: 43.83 平均盈利: 8.77 typeA: 3.51 胜率: 40.00%
趋势空且增强-L2-3-4 总交易次数: 5 盈利: 256.04572856611844 亏损: -499.10990342513554 最大盈利: 230.38 最大亏损: -388.87 总收益: -243.06 平均盈利: -48.61 typeA: -19.45 胜率: 40.00%
趋势空且增强-L2-3-3 总交易次数: 6 盈利: 85.46302098832518 亏损: -435.9091233088566 最大盈利: 62.68 最大亏损: -178.92 总收益: -350.45 平均盈利: -58.41 typeA: -19.47 胜率: 33.33%
趋势空且增强-11 总交易次数: 4 盈利: 204.88357738525272 亏损: -451.3291488698371 最大盈利: 204.88 最大亏损: -383.21 总收益: -246.45 平均盈利: -61.61 typeA: -15.40 胜率: 25.00%
趋势空且增强-L1-1-2 总交易次数: 1 盈利: 0 亏损: -9.326496637144503 最大盈利: -9.33 最大亏损: -9.33 总收益: -9.33 平均盈利: -9.33 typeA: 0.00 胜率: 0.00%
趋势多且增强-L1-3-4 总交易次数: 2 盈利: 0 亏损: -300.28280328795864 最大盈利: -15.97 最大亏损: -284.31 总收益: -300.28 平均盈利: -150.14 typeA: 0.00 胜率: 0.00%
趋势多且增强-L-4-3-4 总交易次数: 3 盈利: 0 亏损: -75.78015956605329 最大盈利: -8.44 最大亏损: -52.60 总收益: -75.78 平均盈利: -25.26 typeA: 0.00 胜率: 0.00%
趋势空且增强-L2-3-5 总交易次数: 3 盈利: 0 亏损: -183.97512190719561 最大盈利: -7.10 最大亏损: -154.49 总收益: -183.98 平均盈利: -61.33 typeA: 0.00 胜率: 0.00%
趋势多且增强-L-4-1-4 总交易次数: 1 盈利: 0 亏损: -518.2862135454322 最大盈利: -518.29 最大亏损: -518.29 总收益: -518.29 平均盈利: -518.29 typeA: 0.00 胜率: 0.00%
趋势多且增强-R-3-1 总交易次数: 1 盈利: 0 亏损: -212.2650003359534 最大盈利: -212.27 最大亏损: -212.27 总收益: -212.27 平均盈利: -212.27 typeA: 0.00 胜率: 0.00%
趋势多且增强-L1-3-2 总交易次数: 1 盈利: 0 亏损: -39.29354559381902 最大盈利: -39.29 最大亏损: -39.29 总收益: -39.29 平均盈利: -39.29 typeA: 0.00 胜率: 0.00%
趋势多且增强-L-4-3-3 总交易次数: 1 盈利: 0 亏损: -198.2329850324751 最大盈利: -198.23 最大亏损: -198.23 总收益: -198.23 平均盈利: -198.23 typeA: 0.00 胜率: 0.00%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     87
      胜率:          52.87%
      总收益:        1427.91 USDT
      期末余额:      11253.91 USDT
      盈亏比:        1.39
      最大单笔盈利:  962.15
      最大单笔亏损:  -484.32
      手续费:       348.0699329232639
      =============================
    
profit: 1253.907811236737
maxDrawdown 13.9%
startTime: 2022-02-25 00:00:00
趋势多且增强-L3-1-4-1 总交易次数: 1 盈利: 64.93829152214225 亏损: 0 最大盈利: 64.94 最大亏损: 64.94 总收益: 64.94 平均盈利: 64.94 typeA: 64.94 胜率: 100.00%
趋势多且增强-R-2-1 总交易次数: 3 盈利: 452.39476520280675 亏损: 0 最大盈利: 196.96 最大亏损: 126.80 总收益: 452.39 平均盈利: 150.80 typeA: 150.80 胜率: 100.00%
趋势多且增强-L-4-2-2 总交易次数: 1 盈利: 2.2795993493714897 亏损: 0 最大盈利: 2.28 最大亏损: 2.28 总收益: 2.28 平均盈利: 2.28 typeA: 2.28 胜率: 100.00%
趋势多且增强-L3-1-3 总交易次数: 2 盈利: 249.45207875372537 亏损: 0 最大盈利: 204.26 最大亏损: 45.19 总收益: 249.45 平均盈利: 124.73 typeA: 124.73 胜率: 100.00%
趋势多且增强-R-1-1-2 总交易次数: 1 盈利: 27.367241246037832 亏损: 0 最大盈利: 27.37 最大亏损: 27.37 总收益: 27.37 平均盈利: 27.37 typeA: 27.37 胜率: 100.00%
趋势空且增强-L2-1-3 总交易次数: 1 盈利: 24.925191272316464 亏损: 0 最大盈利: 24.93 最大亏损: 24.93 总收益: 24.93 平均盈利: 24.93 typeA: 24.93 胜率: 100.00%
趋势空且增强-L2-3-4 总交易次数: 7 盈利: 601.4788689339334 亏损: -217.59947350405938 最大盈利: 312.65 最大亏损: -207.95 总收益: 383.88 平均盈利: 54.84 typeA: 39.17 胜率: 71.43%
趋势多且增强-L3-1-5 总交易次数: 3 盈利: 31.63206485249312 亏损: -237.6117829457376 最大盈利: 17.34 最大亏损: -237.61 总收益: -205.98 平均盈利: -68.66 typeA: -45.78 胜率: 66.67%
趋势空且增强-L2-3-3 总交易次数: 12 盈利: 555.0342184990322 亏损: -271.76274727897624 最大盈利: 276.53 最大亏损: -137.10 总收益: 283.27 平均盈利: 23.61 typeA: 15.74 胜率: 66.67%
趋势多且增强-L-4-2-3 总交易次数: 3 盈利: 63.981540511702946 亏损: -56.68433016053366 最大盈利: 50.27 最大亏损: -56.68 总收益: 7.30 平均盈利: 2.43 typeA: 1.62 胜率: 66.67%
趋势多且增强-L3-1-4-3 总交易次数: 8 盈利: 36.713484637021125 亏损: -514.7354250458774 最大盈利: 16.87 最大亏损: -438.99 总收益: -478.02 平均盈利: -59.75 typeA: -29.88 胜率: 50.00%
趋势空且增强-L2-2-3 总交易次数: 2 盈利: 20.96245278826962 亏损: -6.378775939059146 最大盈利: 20.96 最大亏损: -6.38 总收益: 14.58 平均盈利: 7.29 typeA: 3.65 胜率: 50.00%
趋势空且增强-11 总交易次数: 2 盈利: 219.51065759637098 亏损: -69.7607409313094 最大盈利: 219.51 最大亏损: -69.76 总收益: 149.75 平均盈利: 74.87 typeA: 37.44 胜率: 50.00%
趋势多且增强-L1-3-4 总交易次数: 2 盈利: 295.25582427335223 亏损: -83.94423463238304 最大盈利: 295.26 最大亏损: -83.94 总收益: 211.31 平均盈利: 105.66 typeA: 52.83 胜率: 50.00%
趋势多且增强-11 总交易次数: 9 盈利: 2027.9469023512065 亏损: -1027.2658074395663 最大盈利: 962.15 最大亏损: -484.32 总收益: 1000.68 平均盈利: 111.19 typeA: 49.41 胜率: 44.44%
趋势多且增强-L-4-3-4 总交易次数: 12 盈利: 106.88146751248445 亏损: -305.58205301922044 最大盈利: 37.05 最大亏损: -190.43 总收益: -198.70 平均盈利: -16.56 typeA: -6.90 胜率: 41.67%
趋势空且增强-L2-3-5 总交易次数: 5 盈利: 29.18008449648991 亏损: -180.0923599346032 最大盈利: 15.53 最大亏损: -168.30 总收益: -150.91 平均盈利: -30.18 typeA: -12.07 胜率: 40.00%
趋势多且增强-R-3-1 总交易次数: 3 盈利: 188.63231642426382 亏损: -38.963585449848864 最大盈利: 188.63 最大亏损: -30.63 总收益: 149.67 平均盈利: 49.89 typeA: 16.63 胜率: 33.33%
趋势空且增强-2 总交易次数: 4 盈利: 115.21093749999993 亏损: -260.42651826514077 最大盈利: 115.21 最大亏损: -156.19 总收益: -145.22 平均盈利: -36.30 typeA: -9.08 胜率: 25.00%
趋势多且增强-L1-3-1 总交易次数: 2 盈利: 0 亏损: -124.33575804332973 最大盈利: -18.21 最大亏损: -106.13 总收益: -124.34 平均盈利: -62.17 typeA: 0.00 胜率: 0.00%
趋势多且增强-L1-3-9 总交易次数: 1 盈利: 0 亏损: -27.824514715092725 最大盈利: -27.82 最大亏损: -27.82 总收益: -27.82 平均盈利: -27.82 typeA: 0.00 胜率: 0.00%
趋势多且增强-L-4-2-4 总交易次数: 2 盈利: 0 亏损: -187.01222226970538 最大盈利: -62.11 最大亏损: -124.90 总收益: -187.01 平均盈利: -93.51 typeA: 0.00 胜率: 0.00%
趋势多且增强-L-4-3-3 总交易次数: 1 盈利: 0 亏损: -75.88984691184177 最大盈利: -75.89 最大亏损: -75.89 总收益: -75.89 平均盈利: -75.89 typeA: 0.00 胜率: 0.00%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     99
      胜率:          62.63%
      总收益:        1953.75 USDT
      期末余额:      11753.75 USDT
      盈亏比:        1.45
      最大单笔盈利:  1142.40
      最大单笔亏损:  -521.42
      手续费:       397.3587747100428
      =============================
    
profit: 1753.754182671757
maxDrawdown 11.0%
startTime: 2022-03-27 00:00:00
趋势多且增强-L1-3-1 总交易次数: 1 盈利: 129.6866540532678 亏损: 0 最大盈利: 129.69 最大亏损: 129.69 总收益: 129.69 平均盈利: 129.69 typeA: 129.69 胜率: 100.00%
趋势空且增强-L2-1-3 总交易次数: 2 盈利: 176.45743977353516 亏损: 0 最大盈利: 151.53 最大亏损: 24.93 总收益: 176.46 平均盈利: 88.23 typeA: 88.23 胜率: 100.00%
趋势多且增强-L1-3-2 总交易次数: 1 盈利: 20.123918728625824 亏损: 0 最大盈利: 20.12 最大亏损: 20.12 总收益: 20.12 平均盈利: 20.12 typeA: 20.12 胜率: 100.00%
趋势多且增强-L3-1-5 总交易次数: 6 盈利: 182.49282380862482 亏损: 0 最大盈利: 58.20 最大亏损: 10.52 总收益: 182.49 平均盈利: 30.42 typeA: 30.42 胜率: 100.00%
趋势空且增强-L2-3-4 总交易次数: 4 盈利: 81.22068438748502 亏损: 0 最大盈利: 30.18 最大亏损: 3.11 总收益: 81.22 平均盈利: 20.31 typeA: 20.31 胜率: 100.00%
趋势多且增强-R-1-2-2 总交易次数: 4 盈利: 114.44824879708457 亏损: 0 最大盈利: 39.43 最大亏损: 7.89 总收益: 114.45 平均盈利: 28.61 typeA: 28.61 胜率: 100.00%
趋势空且增强-2 总交易次数: 6 盈利: 576.9900437877179 亏损: 0 最大盈利: 267.07 最大亏损: 13.98 总收益: 576.99 平均盈利: 96.17 typeA: 96.17 胜率: 100.00%
趋势多且增强-L-4-1-2 总交易次数: 2 盈利: 958.2879450981548 亏损: 0 最大盈利: 943.21 最大亏损: 15.07 总收益: 958.29 平均盈利: 479.14 typeA: 479.14 胜率: 100.00%
趋势空且增强-L2-2-3 总交易次数: 1 盈利: 1142.4047127414065 亏损: 0 最大盈利: 1142.40 最大亏损: 1142.40 总收益: 1142.40 平均盈利: 1142.40 typeA: 1142.40 胜率: 100.00%
趋势多且增强-L1-3-9 总交易次数: 1 盈利: 219.91497355970125 亏损: 0 最大盈利: 219.91 最大亏损: 219.91 总收益: 219.91 平均盈利: 219.91 typeA: 219.91 胜率: 100.00%
趋势多且增强-R-2-2 总交易次数: 1 盈利: 161.1945063637013 亏损: 0 最大盈利: 161.19 最大亏损: 161.19 总收益: 161.19 平均盈利: 161.19 typeA: 161.19 胜率: 100.00%
趋势多且增强-R-3-1 总交易次数: 1 盈利: 94.65332733812842 亏损: 0 最大盈利: 94.65 最大亏损: 94.65 总收益: 94.65 平均盈利: 94.65 typeA: 94.65 胜率: 100.00%
趋势多且增强-R-2-1 总交易次数: 1 盈利: 54.69496731511368 亏损: 0 最大盈利: 54.69 最大亏损: 54.69 总收益: 54.69 平均盈利: 54.69 typeA: 54.69 胜率: 100.00%
趋势空且增强-L1-1-2 总交易次数: 1 盈利: 270.64954778318946 亏损: 0 最大盈利: 270.65 最大亏损: 270.65 总收益: 270.65 平均盈利: 270.65 typeA: 270.65 胜率: 100.00%
趋势多且增强-L-4-1-4 总交易次数: 1 盈利: 181.6652682430717 亏损: 0 最大盈利: 181.67 最大亏损: 181.67 总收益: 181.67 平均盈利: 181.67 typeA: 181.67 胜率: 100.00%
趋势多且增强-L3-1-4-3 总交易次数: 8 盈利: 106.5107838811381 亏损: -645.6522926012028 最大盈利: 35.08 最大亏损: -521.42 总收益: -539.14 平均盈利: -67.39 typeA: -50.54 胜率: 75.00%
趋势多且增强-11 总交易次数: 4 盈利: 176.21591052426476 亏损: -228.47597608160402 最大盈利: 87.26 最大亏损: -228.48 总收益: -52.26 平均盈利: -13.07 typeA: -9.80 胜率: 75.00%
趋势空且增强-L2-3-5 总交易次数: 7 盈利: 607.9127226116929 亏损: -26.773092552062508 最大盈利: 439.39 最大亏损: -17.42 总收益: 581.14 平均盈利: 83.02 typeA: 59.30 胜率: 71.43%
趋势空且增强-L2-3-3 总交易次数: 12 盈利: 140.49208787789627 亏损: -440.19168312090426 最大盈利: 47.92 最大亏损: -217.92 总收益: -299.70 平均盈利: -24.97 typeA: -14.57 胜率: 58.33%
趋势空且增强-11 总交易次数: 4 盈利: 188.96792036899032 亏损: -112.97495613472705 最大盈利: 108.20 最大亏损: -89.72 总收益: 75.99 平均盈利: 19.00 typeA: 9.50 胜率: 50.00%
趋势多且增强-R-1-1-2 总交易次数: 6 盈利: 49.00846229502137 亏损: -318.4526124388192 最大盈利: 29.49 最大亏损: -110.30 总收益: -269.44 平均盈利: -44.91 typeA: -14.97 胜率: 33.33%
趋势多且增强-L3-1-3 总交易次数: 3 盈利: 268.16355959727167 亏损: -251.26194166468792 最大盈利: 268.16 最大亏损: -237.37 总收益: 16.90 平均盈利: 5.63 typeA: 1.88 胜率: 33.33%
趋势多且增强-L1-3-4 总交易次数: 4 盈利: 256.8362298983205 亏损: -549.9179403223962 最大盈利: 256.84 最大亏损: -498.00 总收益: -293.08 平均盈利: -73.27 typeA: -18.32 胜率: 25.00%
趋势多且增强-L-4-3-4 总交易次数: 5 盈利: 18.01230632367058 亏损: -92.33271833742305 最大盈利: 18.01 最大亏损: -55.49 总收益: -74.32 平均盈利: -14.86 typeA: -2.97 胜率: 20.00%
趋势多且增强-L-4-2-4 总交易次数: 7 盈利: 143.2199484831142 亏损: -676.3777295820726 最大盈利: 143.22 最大亏损: -344.49 总收益: -533.16 平均盈利: -76.17 typeA: -10.88 胜率: 14.29%
趋势多且增强-L-4-2-3 总交易次数: 3 盈利: 0 亏损: -639.4509736652785 最大盈利: -56.68 最大亏损: -321.51 总收益: -639.45 平均盈利: -213.15 typeA: 0.00 胜率: 0.00%
趋势多且增强-L-4-1-3 总交易次数: 1 盈利: 0 亏损: -188.47438843086985 最大盈利: -188.47 最大亏损: -188.47 总收益: -188.47 平均盈利: -188.47 typeA: 0.00 胜率: 0.00%
趋势多且增强-L3-1-4-1 总交易次数: 1 盈利: 0 亏损: -192.0246298405471 最大盈利: -192.02 最大亏损: -192.02 总收益: -192.02 平均盈利: -192.02 typeA: 0.00 胜率: 0.00%
趋势多且增强-R-3-2 总交易次数: 1 盈利: 0 亏损: -4.109876195835836 最大盈利: -4.11 最大亏损: -4.11 总收益: -4.11 平均盈利: -4.11 typeA: 0.00 胜率: 0.00%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     116
      胜率:          61.21%
      总收益:        2292.73 USDT
      期末余额:      12058.73 USDT
      盈亏比:        1.36
      最大单笔盈利:  1020.85
      最大单笔亏损:  -1562.82
      手续费:       465.3614438786711
      =============================
    
profit: 2058.7293564706342
maxDrawdown 13.8%
startTime: 2022-04-26 00:00:00
趋势多且增强-L-4-2-4 总交易次数: 1 盈利: 134.6761124955504 亏损: 0 最大盈利: 134.68 最大亏损: 134.68 总收益: 134.68 平均盈利: 134.68 typeA: 134.68 胜率: 100.00%
趋势空且增强-11 总交易次数: 4 盈利: 406.12597489097254 亏损: 0 最大盈利: 260.86 最大亏损: 19.29 总收益: 406.13 平均盈利: 101.53 typeA: 101.53 胜率: 100.00%
趋势空且增强-L2-3-5 总交易次数: 4 盈利: 535.9323297058963 亏损: 0 最大盈利: 305.54 最大亏损: 5.17 总收益: 535.93 平均盈利: 133.98 typeA: 133.98 胜率: 100.00%
趋势多且增强-L3-1-5 总交易次数: 3 盈利: 200.3616086180155 亏损: 0 最大盈利: 132.64 最大亏损: 33.77 总收益: 200.36 平均盈利: 66.79 typeA: 66.79 胜率: 100.00%
趋势空且增强-L2-3-3 总交易次数: 9 盈利: 612.4253099007648 亏损: 0 最大盈利: 341.58 最大亏损: 6.43 总收益: 612.43 平均盈利: 68.05 typeA: 68.05 胜率: 100.00%
趋势空且增强-L2-2-3 总交易次数: 1 盈利: 58.850383055430754 亏损: 0 最大盈利: 58.85 最大亏损: 58.85 总收益: 58.85 平均盈利: 58.85 typeA: 58.85 胜率: 100.00%
趋势多且增强-L3-1-3 总交易次数: 1 盈利: 15.805877114870155 亏损: 0 最大盈利: 15.81 最大亏损: 15.81 总收益: 15.81 平均盈利: 15.81 typeA: 15.81 胜率: 100.00%
趋势多且增强-R-2-2 总交易次数: 1 盈利: 369.71712093146425 亏损: 0 最大盈利: 369.72 最大亏损: 369.72 总收益: 369.72 平均盈利: 369.72 typeA: 369.72 胜率: 100.00%
趋势空且增强-L2-3-4 总交易次数: 10 盈利: 1300.337619711121 亏损: -477.01487942276117 最大盈利: 1020.85 最大亏损: -409.81 总收益: 823.32 平均盈利: 82.33 typeA: 65.87 胜率: 80.00%
趋势多且增强-L3-1-4-3 总交易次数: 8 盈利: 143.01985618355076 亏损: -38.14133174750459 最大盈利: 68.19 最大亏损: -30.70 总收益: 104.88 平均盈利: 13.11 typeA: 9.83 胜率: 75.00%
趋势多且增强-R-2-1 总交易次数: 6 盈利: 363.35059722417174 亏损: -172.87753859387476 最大盈利: 164.22 最大亏损: -119.85 总收益: 190.47 平均盈利: 31.75 typeA: 21.16 胜率: 66.67%
趋势空且增强-L3-1-6 总交易次数: 3 盈利: 582.3498242767894 亏损: -145.78635408603446 最大盈利: 566.91 最大亏损: -145.79 总收益: 436.56 平均盈利: 145.52 typeA: 97.02 胜率: 66.67%
趋势多且增强-L3-1-4-1 总交易次数: 3 盈利: 93.91753618349432 亏损: -62.4872951270497 最大盈利: 55.50 最大亏损: -62.49 总收益: 31.43 平均盈利: 10.48 typeA: 6.98 胜率: 66.67%
趋势空且增强-2 总交易次数: 5 盈利: 156.08164933852237 亏损: -242.29446673311816 最大盈利: 84.65 最大亏损: -123.42 总收益: -86.21 平均盈利: -17.24 typeA: -10.35 胜率: 60.00%
趋势多且增强-L-4-2-3 总交易次数: 5 盈利: 453.9204599953299 亏损: -144.20013902433428 最大盈利: 227.13 最大亏损: -73.62 总收益: 309.72 平均盈利: 61.94 typeA: 37.17 胜率: 60.00%
趋势多且增强-R-1-1-2 总交易次数: 10 盈利: 1741.6754615191462 亏损: -1984.7133248690027 最大盈利: 704.29 最大亏损: -1562.82 总收益: -243.04 平均盈利: -24.30 typeA: -12.15 胜率: 50.00%
趋势多且增强-R-1-2-2 总交易次数: 2 盈利: 7.894111825828883 亏损: -176.64697002372333 最大盈利: 7.89 最大亏损: -176.65 总收益: -168.75 平均盈利: -84.38 typeA: -42.19 胜率: 50.00%
趋势多且增强-R-1-1-1 总交易次数: 2 盈利: 299.5509167394236 亏损: -14.747905282331624 最大盈利: 299.55 最大亏损: -14.75 总收益: 284.80 平均盈利: 142.40 typeA: 71.20 胜率: 50.00%
趋势多且增强-R-3-1 总交易次数: 7 盈利: 192.17992164459713 亏损: -534.9786864093035 最大盈利: 178.91 最大亏损: -194.74 总收益: -342.80 平均盈利: -48.97 typeA: -20.99 胜率: 42.86%
趋势多且增强-L-4-3-4 总交易次数: 14 盈利: 213.0118999896912 亏损: -597.5218428511503 最大盈利: 87.11 最大亏损: -278.14 总收益: -384.51 平均盈利: -27.46 typeA: -9.81 胜率: 35.71%
趋势多且增强-L-4-1-4 总交易次数: 3 盈利: 181.6652682430717 亏损: -275.60545637328676 最大盈利: 181.67 最大亏损: -157.78 总收益: -93.94 平均盈利: -31.31 typeA: -10.44 胜率: 33.33%
趋势多且增强-L-4-1-3 总交易次数: 3 盈利: 435.65564202334593 亏损: -275.8273852535888 最大盈利: 435.66 最大亏损: -171.13 总收益: 159.83 平均盈利: 53.28 typeA: 17.76 胜率: 33.33%
趋势多且增强-11 总交易次数: 3 盈利: 112.13923295030618 亏损: -303.2365576317487 最大盈利: 112.14 最大亏损: -281.30 总收益: -191.10 平均盈利: -63.70 typeA: -21.23 胜率: 33.33%
趋势多且增强-L1-3-4 总交易次数: 4 盈利: 8.68406991832694 亏损: -339.7948954699468 最大盈利: 8.68 最大亏损: -240.51 总收益: -331.11 平均盈利: -82.78 typeA: -20.69 胜率: 25.00%
趋势多且增强-L1-3-1 总交易次数: 1 盈利: 0 亏损: -215.8711438364867 最大盈利: -215.87 最大亏损: -215.87 总收益: -215.87 平均盈利: -215.87 typeA: 0.00 胜率: 0.00%
趋势多且增强-L1-3-9 总交易次数: 1 盈利: 0 亏损: -215.62782077837164 最大盈利: -215.63 最大亏损: -215.63 总收益: -215.63 平均盈利: -215.63 typeA: 0.00 胜率: 0.00%
趋势多且增强-L-4-3-3 总交易次数: 2 盈利: 0 亏损: -109.22543449542727 最大盈利: -45.57 最大亏损: -63.66 总收益: -109.23 平均盈利: -54.61 typeA: 0.00 胜率: 0.00%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     89
      胜率:          51.69%
      总收益:        114.48 USDT
      期末余额:      9934.48 USDT
      盈亏比:        1.02
      最大单笔盈利:  836.27
      最大单笔亏损:  -637.02
      手续费:       358.18222555626414
      =============================
    
profit: -65.5216004825561
maxDrawdown 17.4%
startTime: 2022-05-26 00:00:00
趋势多且增强-11 总交易次数: 2 盈利: 230.27707854231693 亏损: 0 最大盈利: 153.84 最大亏损: 76.43 总收益: 230.28 平均盈利: 115.14 typeA: 115.14 胜率: 100.00%
趋势多且增强-R-3-2 总交易次数: 2 盈利: 117.83537086558465 亏损: 0 最大盈利: 93.66 最大亏损: 24.17 总收益: 117.84 平均盈利: 58.92 typeA: 58.92 胜率: 100.00%
趋势多且增强-R-1-1-1 总交易次数: 1 盈利: 69.87304986234508 亏损: 0 最大盈利: 69.87 最大亏损: 69.87 总收益: 69.87 平均盈利: 69.87 typeA: 69.87 胜率: 100.00%
趋势多且增强-L1-3-1 总交易次数: 1 盈利: 295.1251303441078 亏损: 0 最大盈利: 295.13 最大亏损: 295.13 总收益: 295.13 平均盈利: 295.13 typeA: 295.13 胜率: 100.00%
趋势多且增强-L1-3-2 总交易次数: 1 盈利: 303.5204240723423 亏损: 0 最大盈利: 303.52 最大亏损: 303.52 总收益: 303.52 平均盈利: 303.52 typeA: 303.52 胜率: 100.00%
趋势多且增强-L-4-2-4 总交易次数: 1 盈利: 169.80334128878243 亏损: 0 最大盈利: 169.80 最大亏损: 169.80 总收益: 169.80 平均盈利: 169.80 typeA: 169.80 胜率: 100.00%
趋势空且增强-L2-3-3 总交易次数: 12 盈利: 1604.2609579716957 亏损: -992.7720272417304 最大盈利: 836.27 最大亏损: -635.34 总收益: 611.49 平均盈利: 50.96 typeA: 33.97 胜率: 66.67%
趋势多且增强-R-1-1-2 总交易次数: 6 盈利: 887.7072012905911 亏损: -108.99142222496533 最大盈利: 576.53 最大亏损: -63.18 总收益: 778.72 平均盈利: 129.79 typeA: 86.53 胜率: 66.67%
趋势空且增强-11 总交易次数: 3 盈利: 258.65874972552257 亏损: -81.59151193633848 最大盈利: 145.77 最大亏损: -81.59 总收益: 177.07 平均盈利: 59.02 typeA: 39.35 胜率: 66.67%
趋势空且增强-L2-3-5 总交易次数: 3 盈利: 33.25379026648131 亏损: -22.064192577734122 最大盈利: 22.06 最大亏损: -22.06 总收益: 11.19 平均盈利: 3.73 typeA: 2.49 胜率: 66.67%
趋势多且增强-L3-1-4-3 总交易次数: 10 盈利: 383.8350356110302 亏损: -884.9278964398853 最大盈利: 176.54 最大亏损: -480.41 总收益: -501.09 平均盈利: -50.11 typeA: -30.07 胜率: 60.00%
趋势多且增强-R-3-1 总交易次数: 2 盈利: 11.648299826259493 亏损: -216.94071661237768 最大盈利: 11.65 最大亏损: -216.94 总收益: -205.29 平均盈利: -102.65 typeA: -51.32 胜率: 50.00%
趋势多且增强-R-2-2 总交易次数: 2 盈利: 369.71712093146425 亏损: -111.40882823066543 最大盈利: 369.72 最大亏损: -111.41 总收益: 258.31 平均盈利: 129.15 typeA: 64.58 胜率: 50.00%
趋势多且增强-L3-1-3 总交易次数: 2 盈利: 2.972892315344239 亏损: -89.14016364283127 最大盈利: 2.97 最大亏损: -89.14 总收益: -86.17 平均盈利: -43.08 typeA: -21.54 胜率: 50.00%
趋势多且增强-L1-3-4 总交易次数: 4 盈利: 357.8740592299953 亏损: -165.86725614247763 最大盈利: 316.84 最大亏损: -122.41 总收益: 192.01 平均盈利: 48.00 typeA: 24.00 胜率: 50.00%
趋势多且增强-L-4-3-2 总交易次数: 2 盈利: 70.38596929222285 亏损: -36.13630991464167 最大盈利: 70.39 最大亏损: -36.14 总收益: 34.25 平均盈利: 17.12 typeA: 8.56 胜率: 50.00%
趋势多且增强-L-4-2-3 总交易次数: 4 盈利: 171.8862674413876 亏损: -454.3006836251093 最大盈利: 123.54 最大亏损: -264.18 总收益: -282.41 平均盈利: -70.60 typeA: -35.30 胜率: 50.00%
趋势多且增强-R-2-1 总交易次数: 5 盈利: 9.441261737225958 亏损: -510.20159060102463 最大盈利: 5.46 最大亏损: -203.70 总收益: -500.76 平均盈利: -100.15 typeA: -40.06 胜率: 40.00%
趋势多且增强-L-4-3-3 总交易次数: 5 盈利: 205.81955275691277 亏损: -150.4834319851108 最大盈利: 156.68 最大亏损: -94.98 总收益: 55.34 平均盈利: 11.07 typeA: 4.43 胜率: 40.00%
趋势空且增强-L2-3-4 总交易次数: 3 盈利: 91.30565209438512 亏损: -162.3569017916131 最大盈利: 91.31 最大亏损: -133.19 总收益: -71.05 平均盈利: -23.68 typeA: -7.89 胜率: 33.33%
趋势多且增强-L3-1-5 总交易次数: 3 盈利: 7.833292353087119 亏损: -75.18808244091426 最大盈利: 7.83 最大亏损: -47.00 总收益: -67.35 平均盈利: -22.45 typeA: -7.48 胜率: 33.33%
趋势多且增强-L-4-3-4 总交易次数: 10 盈利: 306.0183227388308 亏损: -536.9738631436807 最大盈利: 180.34 最大亏损: -331.80 总收益: -230.96 平均盈利: -23.10 typeA: -4.62 胜率: 20.00%
趋势空且增强-L3-1-6 总交易次数: 3 盈利: 0 亏损: -791.7032097155837 最大盈利: -37.95 最大亏损: -637.02 总收益: -791.70 平均盈利: -263.90 typeA: 0.00 胜率: 0.00%
趋势多且增强-R-1-2-2 总交易次数: 1 盈利: 0 亏损: -157.23960113960024 最大盈利: -157.24 最大亏损: -157.24 总收益: -157.24 平均盈利: -157.24 typeA: 0.00 胜率: 0.00%
趋势空且增强-L2-2-3 总交易次数: 1 盈利: 0 亏损: -296.2867316341833 最大盈利: -296.29 最大亏损: -296.29 总收益: -296.29 平均盈利: -296.29 typeA: 0.00 胜率: 0.00%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     93
      胜率:          48.39%
      总收益:        -494.78 USDT
      期末余额:      9319.22 USDT
      盈亏比:        0.90
      最大单笔盈利:  447.35
      最大单笔亏损:  -398.54
      手续费:       371.5684372836151
      =============================
    
profit: -680.7849462005906
maxDrawdown 12.3%
startTime: 2022-06-25 00:00:00
趋势多且增强-L-4-1-3 总交易次数: 1 盈利: 18.39516246539432 亏损: 0 最大盈利: 18.40 最大亏损: 18.40 总收益: 18.40 平均盈利: 18.40 typeA: 18.40 胜率: 100.00%
趋势多且增强-L3-1-5 总交易次数: 5 盈利: 164.55556686353125 亏损: 0 最大盈利: 41.94 最大亏损: 23.76 总收益: 164.56 平均盈利: 32.91 typeA: 32.91 胜率: 100.00%
趋势多且增强-R-2-2 总交易次数: 1 盈利: 42.211954864287684 亏损: 0 最大盈利: 42.21 最大亏损: 42.21 总收益: 42.21 平均盈利: 42.21 typeA: 42.21 胜率: 100.00%
趋势多且增强-L-4-3-2 总交易次数: 1 盈利: 232.77731629392954 亏损: 0 最大盈利: 232.78 最大亏损: 232.78 总收益: 232.78 平均盈利: 232.78 typeA: 232.78 胜率: 100.00%
趋势多且增强-L-4-2-2 总交易次数: 1 盈利: 146.37038182099283 亏损: 0 最大盈利: 146.37 最大亏损: 146.37 总收益: 146.37 平均盈利: 146.37 typeA: 146.37 胜率: 100.00%
趋势空且增强-L2-3-5 总交易次数: 3 盈利: 273.13164161382883 亏损: 0 最大盈利: 247.98 最大亏损: 11.85 总收益: 273.13 平均盈利: 91.04 typeA: 91.04 胜率: 100.00%
趋势空且增强-11 总交易次数: 4 盈利: 703.2136921188393 亏损: -16.93331121433308 最大盈利: 447.35 最大亏损: -16.93 总收益: 686.28 平均盈利: 171.57 typeA: 128.68 胜率: 75.00%
趋势多且增强-R-2-1 总交易次数: 4 盈利: 98.27988479128058 亏损: -140.5861386138605 最大盈利: 52.59 最大亏损: -140.59 总收益: -42.31 平均盈利: -10.58 typeA: -7.93 胜率: 75.00%
趋势多且增强-11 总交易次数: 3 盈利: 103.22014679679458 亏损: -61.9470605440178 最大盈利: 69.68 最大亏损: -61.95 总收益: 41.27 平均盈利: 13.76 typeA: 9.17 胜率: 66.67%
趋势空且增强-L2-3-4 总交易次数: 11 盈利: 732.7569808064796 亏损: -405.3858126023458 最大盈利: 352.18 最大亏损: -208.60 总收益: 327.37 平均盈利: 29.76 typeA: 16.23 胜率: 54.55%
趋势多且增强-R-1-1-2 总交易次数: 4 盈利: 110.38243348200547 亏损: -221.00681303571122 最大盈利: 107.73 最大亏损: -163.68 总收益: -110.62 平均盈利: -27.66 typeA: -13.83 胜率: 50.00%
趋势多且增强-L-4-3-3 总交易次数: 4 盈利: 577.9206990254884 亏损: -339.45564542233456 最大盈利: 423.70 最大亏损: -330.13 总收益: 238.47 平均盈利: 59.62 typeA: 29.81 胜率: 50.00%
趋势多且增强-R-3-2 总交易次数: 2 盈利: 17.66026319769948 亏损: -29.029738660258275 最大盈利: 17.66 最大亏损: -29.03 总收益: -11.37 平均盈利: -5.68 typeA: -2.84 胜率: 50.00%
趋势空且增强-L2-3-3 总交易次数: 7 盈利: 176.2308747549181 亏损: -419.49797233155977 最大盈利: 97.48 最大亏损: -337.55 总收益: -243.27 平均盈利: -34.75 typeA: -14.89 胜率: 42.86%
趋势多且增强-R-3-1 总交易次数: 5 盈利: 207.53065191387623 亏损: -214.45029293906106 最大盈利: 182.62 最大亏损: -125.10 总收益: -6.92 平均盈利: -1.38 typeA: -0.55 胜率: 40.00%
趋势多且增强-L-4-3-4 总交易次数: 11 盈利: 286.70793908276755 亏损: -209.86308899736525 最大盈利: 142.27 最大亏损: -85.98 总收益: 76.84 平均盈利: 6.99 typeA: 2.54 胜率: 36.36%
趋势多且增强-L3-1-3 总交易次数: 3 盈利: 2.3863702837090153 亏损: -35.301639768979776 最大盈利: 2.39 最大亏损: -30.38 总收益: -32.92 平均盈利: -10.97 typeA: -3.66 胜率: 33.33%
趋势多且增强-L3-1-4-3 总交易次数: 9 盈利: 419.05424799386674 亏损: -1086.017130201754 最大盈利: 288.92 最大亏损: -378.69 总收益: -666.96 平均盈利: -74.11 typeA: -24.70 胜率: 33.33%
趋势多且增强-L1-3-4 总交易次数: 5 盈利: 17.989849277146284 亏损: -630.2371222539041 最大盈利: 17.99 最大亏损: -398.54 总收益: -612.25 平均盈利: -122.45 typeA: -24.49 胜率: 20.00%
趋势多且增强-L-4-2-3 总交易次数: 2 盈利: 0 亏损: -360.47478422430675 最大盈利: -96.29 最大亏损: -264.18 总收益: -360.47 平均盈利: -180.24 typeA: 0.00 胜率: 0.00%
趋势多且增强-L1-3-1 总交易次数: 1 盈利: 0 亏损: -106.18811747191675 最大盈利: -106.19 最大亏损: -106.19 总收益: -106.19 平均盈利: -106.19 typeA: 0.00 胜率: 0.00%
趋势空且增强-L2-2-3 总交易次数: 1 盈利: 0 亏损: -127.88856485034556 最大盈利: -127.89 最大亏损: -127.89 总收益: -127.89 平均盈利: -127.89 typeA: 0.00 胜率: 0.00%
趋势多且增强-L-4-2-4 总交易次数: 1 盈利: 0 亏损: -54.995608056944285 最大盈利: -55.00 最大亏损: -55.00 总收益: -55.00 平均盈利: -55.00 typeA: 0.00 胜率: 0.00%
趋势多且增强-L1-3-2 总交易次数: 2 盈利: 0 亏损: -179.34466477012228 最大盈利: -36.59 最大亏损: -142.75 总收益: -179.34 平均盈利: -89.67 typeA: 0.00 胜率: 0.00%
趋势空且增强-L3-1-6 总交易次数: 1 盈利: 0 亏损: -45.14413208389091 最大盈利: -45.14 最大亏损: -45.14 总收益: -45.14 平均盈利: -45.14 typeA: 0.00 胜率: 0.00%
趋势多且增强-L1-2-1 总交易次数: 1 盈利: 0 亏损: -141.81336560441028 最大盈利: -141.81 最大亏损: -141.81 总收益: -141.81 平均盈利: -141.81 typeA: 0.00 胜率: 0.00%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     91
      胜率:          42.86%
      总收益:        204.57 USDT
      期末余额:      10020.57 USDT
      盈亏比:        1.05
      最大单笔盈利:  452.25
      最大单笔亏损:  -357.34
      手续费:       365.8005969284719
      =============================
    
profit: 20.57180278301894
maxDrawdown 15.4%
startTime: 2022-07-25 00:00:00
趋势多且增强-L-4-3-2 总交易次数: 1 盈利: 29.836155738891005 亏损: 0 最大盈利: 29.84 最大亏损: 29.84 总收益: 29.84 平均盈利: 29.84 typeA: 29.84 胜率: 100.00%
趋势空且增强-L2-3-4 总交易次数: 5 盈利: 146.94602197961544 亏损: -0.5577505407359591 最大盈利: 56.64 最大亏损: -0.56 总收益: 146.39 平均盈利: 29.28 typeA: 23.42 胜率: 80.00%
趋势空且增强-L2-3-5 总交易次数: 4 盈利: 25.965362763127487 亏损: -112.91585127201613 最大盈利: 13.30 最大亏损: -112.92 总收益: -86.95 平均盈利: -21.74 typeA: -16.30 胜率: 75.00%
趋势空且增强-11 总交易次数: 4 盈利: 231.57414891637194 亏损: -2 最大盈利: 132.82 最大亏损: -2.00 总收益: 229.57 平均盈利: 57.39 typeA: 43.05 胜率: 75.00%
趋势多且增强-R-3-1 总交易次数: 3 盈利: 317.15872296756186 亏损: -37.55131727816356 最大盈利: 182.62 最大亏损: -37.55 总收益: 279.61 平均盈利: 93.20 typeA: 62.14 胜率: 66.67%
趋势多且增强-L-4-3-3 总交易次数: 6 盈利: 502.6228046848299 亏损: -27.3642278941888 最大盈利: 215.57 最大亏损: -16.42 总收益: 475.26 平均盈利: 79.21 typeA: 52.81 胜率: 66.67%
趋势多且增强-L3-1-4-3 总交易次数: 8 盈利: 795.2577639848676 亏损: -250.76485766996896 最大盈利: 382.05 最大亏损: -162.19 总收益: 544.49 平均盈利: 68.06 typeA: 42.54 胜率: 62.50%
趋势多且增强-11 总交易次数: 5 盈利: 438.58238501744904 亏损: -71.58818873210176 最大盈利: 259.08 最大亏损: -59.82 总收益: 366.99 平均盈利: 73.40 typeA: 44.04 胜率: 60.00%
趋势空且增强-L2-3-3 总交易次数: 5 盈利: 140.09304702023184 亏损: -199.31122662395842 最大盈利: 84.60 最大亏损: -141.66 总收益: -59.22 平均盈利: -11.84 typeA: -7.11 胜率: 60.00%
趋势多且增强-R-2-1 总交易次数: 6 盈利: 640.5857470601176 亏损: -194.51008024790033 最大盈利: 299.35 最大亏损: -140.59 总收益: 446.08 平均盈利: 74.35 typeA: 37.17 胜率: 50.00%
趋势多且增强-R-1-1-2 总交易次数: 2 盈利: 8.853908188585706 亏损: -132.7953950811095 最大盈利: 8.85 最大亏损: -132.80 总收益: -123.94 平均盈利: -61.97 typeA: -30.99 胜率: 50.00%
趋势多且增强-L1-3-4 总交易次数: 2 盈利: 151.1885900570491 亏损: -262.6245146977269 最大盈利: 151.19 最大亏损: -262.62 总收益: -111.44 平均盈利: -55.72 typeA: -27.86 胜率: 50.00%
趋势多且增强-L3-1-3 总交易次数: 4 盈利: 46.28417687434621 亏损: -389.8516968642042 最大盈利: 36.99 最大亏损: -322.87 总收益: -343.57 平均盈利: -85.89 typeA: -42.95 胜率: 50.00%
趋势多且增强-L3-1-5 总交易次数: 2 盈利: 18.324088863075538 亏损: -357.3389131489571 最大盈利: 18.32 最大亏损: -357.34 总收益: -339.01 平均盈利: -169.51 typeA: -84.75 胜率: 50.00%
趋势空且增强-L3-1-6 总交易次数: 7 盈利: 823.0767900100525 亏损: -411.0383248008126 最大盈利: 452.25 最大亏损: -186.93 总收益: 412.04 平均盈利: 58.86 typeA: 25.23 胜率: 42.86%
趋势多且增强-L1-3-2 总交易次数: 1 盈利: 0 亏损: -27.478339079598783 最大盈利: -27.48 最大亏损: -27.48 总收益: -27.48 平均盈利: -27.48 typeA: 0.00 胜率: 0.00%
趋势多且增强-L-4-3-4 总交易次数: 14 盈利: 0 亏损: -491.59370017174325 最大盈利: -0.54 最大亏损: -79.71 总收益: -491.59 平均盈利: -35.11 typeA: 0.00 胜率: 0.00%
趋势多且增强-L3-1-4-1 总交易次数: 2 盈利: 0 亏损: -152.84408585014825 最大盈利: -72.97 最大亏损: -79.88 总收益: -152.84 平均盈利: -76.42 typeA: 0.00 胜率: 0.00%
趋势多且增强-L-4-2-4 总交易次数: 4 盈利: 0 亏损: -257.93957257953844 最大盈利: -3.17 最大亏损: -127.70 总收益: -257.94 平均盈利: -64.48 typeA: 0.00 胜率: 0.00%
趋势多且增强-L-4-2-3 总交易次数: 1 盈利: 0 亏损: -52.28579881656703 最大盈利: -52.29 最大亏损: -52.29 总收益: -52.29 平均盈利: -52.29 typeA: 0.00 胜率: 0.00%
趋势多且增强-L1-2-5 总交易次数: 1 盈利: 0 亏损: -135.17634119515992 最大盈利: -135.18 最大亏损: -135.18 总收益: -135.18 平均盈利: -135.18 typeA: 0.00 胜率: 0.00%
趋势多且增强-L-4-1-3 总交易次数: 1 盈利: 0 亏损: -161.04174090099278 最大盈利: -161.04 最大亏损: -161.04 总收益: -161.04 平均盈利: -161.04 typeA: 0.00 胜率: 0.00%
趋势多且增强-R-2-2 总交易次数: 2 盈利: 0 亏损: -284.8943290223702 最大盈利: -7.84 最大亏损: -277.05 总收益: -284.89 平均盈利: -142.45 typeA: 0.00 胜率: 0.00%
趋势多且增强-R-3-2 总交易次数: 1 盈利: 0 亏损: -98.31165887519478 最大盈利: -98.31 最大亏损: -98.31 总收益: -98.31 平均盈利: -98.31 typeA: 0.00 胜率: 0.00%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     80
      胜率:          51.25%
      总收益:        1196.10 USDT
      期末余额:      11034.10 USDT
      盈亏比:        1.46
      最大单笔盈利:  272.22
      最大单笔亏损:  -235.95
      手续费:       322.06350910895014
      =============================
    
profit: 1034.100058292057
maxDrawdown 7.1%
startTime: 2022-08-24 00:00:00
趋势空且增强-11 总交易次数: 1 盈利: 107.69935483870967 亏损: 0 最大盈利: 107.70 最大亏损: 107.70 总收益: 107.70 平均盈利: 107.70 typeA: 107.70 胜率: 100.00%
趋势多且增强-R-2-1 总交易次数: 1 盈利: 55.066210045662615 亏损: 0 最大盈利: 55.07 最大亏损: 55.07 总收益: 55.07 平均盈利: 55.07 typeA: 55.07 胜率: 100.00%
趋势多且增强-L3-1-3 总交易次数: 1 盈利: 2.7791586998091535 亏损: 0 最大盈利: 2.78 最大亏损: 2.78 总收益: 2.78 平均盈利: 2.78 typeA: 2.78 胜率: 100.00%
趋势多且增强-L3-1-4-1 总交易次数: 1 盈利: 50.41207307386767 亏损: 0 最大盈利: 50.41 最大亏损: 50.41 总收益: 50.41 平均盈利: 50.41 typeA: 50.41 胜率: 100.00%
趋势多且增强-R-3-2 总交易次数: 2 盈利: 244.44408602355975 亏损: 0 最大盈利: 126.03 最大亏损: 118.42 总收益: 244.44 平均盈利: 122.22 typeA: 122.22 胜率: 100.00%
趋势空且增强-L2-3-5 总交易次数: 1 盈利: 234.02079207920804 亏损: 0 最大盈利: 234.02 最大亏损: 234.02 总收益: 234.02 平均盈利: 234.02 typeA: 234.02 胜率: 100.00%
趋势多且增强-L3-1-5 总交易次数: 7 盈利: 197.39335698857212 亏损: -37.446473861445824 最大盈利: 74.32 最大亏损: -27.56 总收益: 159.95 平均盈利: 22.85 typeA: 16.32 胜率: 71.43%
趋势空且增强-L2-3-3 总交易次数: 13 盈利: 652.9503393942687 亏损: -127.37912716208854 最大盈利: 182.25 最大亏损: -57.21 总收益: 525.57 平均盈利: 40.43 typeA: 27.99 胜率: 69.23%
趋势多且增强-L-4-3-3 总交易次数: 7 盈利: 428.01242175411136 亏损: -268.26159989550234 最大盈利: 158.60 最大亏损: -146.32 总收益: 159.75 平均盈利: 22.82 typeA: 13.04 胜率: 57.14%
趋势多且增强-L3-1-4-3 总交易次数: 6 盈利: 206.02668892902057 亏损: -316.1662508081672 最大盈利: 180.71 最大亏损: -135.48 总收益: -110.14 平均盈利: -18.36 typeA: -9.18 胜率: 50.00%
趋势多且增强-R-3-1 总交易次数: 6 盈利: 295.89868810276175 亏损: -381.3915081445178 最大盈利: 171.01 最大亏损: -204.48 总收益: -85.49 平均盈利: -14.25 typeA: -7.12 胜率: 50.00%
趋势空且增强-L2-3-4 总交易次数: 4 盈利: 189.82680606139542 亏损: -286.97443105472865 最大盈利: 157.32 最大亏损: -220.31 总收益: -97.15 平均盈利: -24.29 typeA: -12.14 胜率: 50.00%
趋势多且增强-L-4-3-2 总交易次数: 4 盈利: 267.5588473739858 亏损: -53.452894509061274 最大盈利: 215.04 最大亏损: -33.31 总收益: 214.11 平均盈利: 53.53 typeA: 26.76 胜率: 50.00%
趋势多且增强-11 总交易次数: 3 盈利: 1.402995234853503 亏损: -334.8349734623166 最大盈利: 1.40 最大亏损: -235.95 总收益: -333.43 平均盈利: -111.14 typeA: -37.04 胜率: 33.33%
趋势多且增强-L1-3-4 总交易次数: 3 盈利: 153.02067355785266 亏损: -151.56574195395092 最大盈利: 153.02 最大亏损: -102.57 总收益: 1.45 平均盈利: 0.48 typeA: 0.16 胜率: 33.33%
趋势多且增强-L-4-3-4 总交易次数: 14 盈利: 689.1927478744278 亏损: -269.07772774627256 最大盈利: 272.22 最大亏损: -108.36 总收益: 420.12 平均盈利: 30.01 typeA: 8.57 胜率: 28.57%
趋势空且增强-L3-1-6 总交易次数: 3 盈利: 0 亏损: -294.7308610290625 最大盈利: -65.24 最大亏损: -148.49 总收益: -294.73 平均盈利: -98.24 typeA: 0.00 胜率: 0.00%
趋势多且增强-L1-3-1 总交易次数: 1 盈利: 0 亏损: -17.754806177119896 最大盈利: -17.75 最大亏损: -17.75 总收益: -17.75 平均盈利: -17.75 typeA: 0.00 胜率: 0.00%
趋势多且增强-R-1-2-2 总交易次数: 1 盈利: 0 亏损: -40.2665274878227 最大盈利: -40.27 最大亏损: -40.27 总收益: -40.27 平均盈利: -40.27 typeA: 0.00 胜率: 0.00%
趋势多且增强-L-4-4-4 总交易次数: 1 盈利: 0 亏损: -0.3022584479532924 最大盈利: -0.30 最大亏损: -0.30 总收益: -0.30 平均盈利: -0.30 typeA: 0.00 胜率: 0.00%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     77
      胜率:          49.35%
      总收益:        1440.53 USDT
      期末余额:      11286.53 USDT
      盈亏比:        1.63
      最大单笔盈利:  716.22
      最大单笔亏损:  -633.58
      手续费:       308.4784223804985
      =============================
    
profit: 1286.5291413873892
maxDrawdown 6.3%
startTime: 2022-09-23 00:00:00
趋势空且增强-11 总交易次数: 2 盈利: 117.31521636810632 亏损: 0 最大盈利: 96.27 最大亏损: 21.04 总收益: 117.32 平均盈利: 58.66 typeA: 58.66 胜率: 100.00%
趋势多且增强-R-3-1 总交易次数: 6 盈利: 462.33115323625555 亏损: 0 最大盈利: 226.37 最大亏损: 4.82 总收益: 462.33 平均盈利: 77.06 typeA: 77.06 胜率: 100.00%
趋势空且增强-L2-2-3 总交易次数: 2 盈利: 134.77301489537587 亏损: 0 最大盈利: 89.84 最大亏损: 44.93 总收益: 134.77 平均盈利: 67.39 typeA: 67.39 胜率: 100.00%
趋势多且增强-L3-1-5 总交易次数: 2 盈利: 37.80758335809607 亏损: 0 最大盈利: 31.42 最大亏损: 6.39 总收益: 37.81 平均盈利: 18.90 typeA: 18.90 胜率: 100.00%
趋势空且增强-L2-3-4 总交易次数: 6 盈利: 104.00295251992179 亏损: -95.96767021274152 最大盈利: 62.93 最大亏损: -84.22 总收益: 8.04 平均盈利: 1.34 typeA: 0.89 胜率: 66.67%
趋势多且增强-L3-1-4-3 总交易次数: 8 盈利: 623.2734006780415 亏损: -83.43362677922886 最大盈利: 589.63 最大亏损: -71.04 总收益: 539.84 平均盈利: 67.48 typeA: 42.17 胜率: 62.50%
趋势空且增强-L2-3-3 总交易次数: 6 盈利: 52.56710594998981 亏损: -126.05136185540178 最大盈利: 32.84 最大亏损: -95.13 总收益: -73.48 平均盈利: -12.25 typeA: -6.12 胜率: 50.00%
趋势多且增强-L3-1-3 总交易次数: 4 盈利: 10.757260386082852 亏损: -52.677463537356715 最大盈利: 6.02 最大亏损: -29.55 总收益: -41.92 平均盈利: -10.48 typeA: -5.24 胜率: 50.00%
趋势多且增强-R-3-2 总交易次数: 2 盈利: 242.90005363847598 亏损: -6.863628993027768 最大盈利: 242.90 最大亏损: -6.86 总收益: 236.04 平均盈利: 118.02 typeA: 59.01 胜率: 50.00%
趋势多且增强-L-4-3-4 总交易次数: 20 盈利: 1317.7911690568694 亏损: -558.1911212713084 最大盈利: 716.22 最大亏损: -188.28 总收益: 759.60 平均盈利: 37.98 typeA: 13.29 胜率: 35.00%
趋势空且增强-L3-1-6 总交易次数: 3 盈利: 318.1042225201064 亏损: -252.68587462198724 最大盈利: 318.10 最大亏损: -171.68 总收益: 65.42 平均盈利: 21.81 typeA: 7.27 胜率: 33.33%
趋势多且增强-L-4-3-3 总交易次数: 10 盈利: 291.5947757423644 亏损: -249.88590292719567 最大盈利: 117.72 最大亏损: -84.64 总收益: 41.71 平均盈利: 4.17 typeA: 1.25 胜率: 30.00%
趋势多且增强-L1-3-4 总交易次数: 1 盈利: 0 亏损: -123.4394218942188 最大盈利: -123.44 最大亏损: -123.44 总收益: -123.44 平均盈利: -123.44 typeA: 0.00 胜率: 0.00%
趋势空且增强-L2-3-5 总交易次数: 3 盈利: 0 亏损: -694.6894853594017 最大盈利: -22.05 最大亏损: -633.58 总收益: -694.69 平均盈利: -231.56 typeA: 0.00 胜率: 0.00%
趋势多且增强-L1-3-2 总交易次数: 1 盈利: 0 亏损: -25.12822207534605 最大盈利: -25.13 最大亏损: -25.13 总收益: -25.13 平均盈利: -25.13 typeA: 0.00 胜率: 0.00%
趋势多且增强-L-4-3-2 总交易次数: 1 盈利: 0 亏损: -3.6749874350817664 最大盈利: -3.67 最大亏损: -3.67 总收益: -3.67 平均盈利: -3.67 typeA: 0.00 胜率: 0.00%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     105
      胜率:          59.05%
      总收益:        5809.33 USDT
      期末余额:      15597.33 USDT
      盈亏比:        1.83
      最大单笔盈利:  1689.60
      最大单笔亏损:  -694.30
      手续费:       421.61065127998023
      =============================
    
profit: 5597.334081374931
maxDrawdown 6.8%
startTime: 2022-10-23 00:00:00
趋势多且增强-L-4-3-2 总交易次数: 1 盈利: 313.32661822985386 亏损: 0 最大盈利: 313.33 最大亏损: 313.33 总收益: 313.33 平均盈利: 313.33 typeA: 313.33 胜率: 100.00%
趋势多且增强-L1-3-1 总交易次数: 1 盈利: 1689.5961188599133 亏损: 0 最大盈利: 1689.60 最大亏损: 1689.60 总收益: 1689.60 平均盈利: 1689.60 typeA: 1689.60 胜率: 100.00%
趋势空且增强-L1-1-2 总交易次数: 2 盈利: 286.23943920440877 亏损: 0 最大盈利: 227.59 最大亏损: 58.65 总收益: 286.24 平均盈利: 143.12 typeA: 143.12 胜率: 100.00%
趋势空且增强-2 总交易次数: 4 盈利: 330.48678709387224 亏损: 0 最大盈利: 129.96 最大亏损: 18.85 总收益: 330.49 平均盈利: 82.62 typeA: 82.62 胜率: 100.00%
趋势多且增强-R-1-2-2 总交易次数: 2 盈利: 17.50293631981069 亏损: 0 最大盈利: 15.47 最大亏损: 2.03 总收益: 17.50 平均盈利: 8.75 typeA: 8.75 胜率: 100.00%
趋势空且增强-L2-3-4 总交易次数: 2 盈利: 70.66795481594477 亏损: 0 最大盈利: 57.32 最大亏损: 13.34 总收益: 70.67 平均盈利: 35.33 typeA: 35.33 胜率: 100.00%
趋势空且增强-11 总交易次数: 3 盈利: 634.8257018093345 亏损: 0 最大盈利: 231.84 最大亏损: 199.06 总收益: 634.83 平均盈利: 211.61 typeA: 211.61 胜率: 100.00%
趋势多且增强-L1-3-4 总交易次数: 1 盈利: 140.58414147176282 亏损: 0 最大盈利: 140.58 最大亏损: 140.58 总收益: 140.58 平均盈利: 140.58 typeA: 140.58 胜率: 100.00%
趋势多且增强-R-2-2 总交易次数: 1 盈利: 85.08606344253822 亏损: 0 最大盈利: 85.09 最大亏损: 85.09 总收益: 85.09 平均盈利: 85.09 typeA: 85.09 胜率: 100.00%
趋势空且增强-L2-3-3 总交易次数: 8 盈利: 402.2953207880398 亏损: -294.82841140529484 最大盈利: 199.39 最大亏损: -294.83 总收益: 107.47 平均盈利: 13.43 typeA: 11.75 胜率: 87.50%
趋势空且增强-L2-3-5 总交易次数: 7 盈利: 194.02648369051292 亏损: -2 最大盈利: 67.62 最大亏损: -2.00 总收益: 192.03 平均盈利: 27.43 typeA: 23.51 胜率: 85.71%
趋势多且增强-R-1-1-2 总交易次数: 5 盈利: 1508.8126129147838 亏损: -52.3508477421512 最大盈利: 877.91 最大亏损: -52.35 总收益: 1456.46 平均盈利: 291.29 typeA: 233.03 胜率: 80.00%
趋势多且增强-L3-1-4-1 总交易次数: 6 盈利: 726.413414114149 亏损: -253.20297506370514 最大盈利: 491.62 最大亏损: -171.23 总收益: 473.21 平均盈利: 78.87 typeA: 52.58 胜率: 66.67%
趋势空且增强-L2-1-3 总交易次数: 3 盈利: 215.98836753672475 亏损: -673.6892458100556 最大盈利: 108.77 最大亏损: -673.69 总收益: -457.70 平均盈利: -152.57 typeA: -101.72 胜率: 66.67%
趋势空且增强-L3-1-6 总交易次数: 6 盈利: 3336.8880442593963 亏损: -587.2597067727338 最大盈利: 1566.67 最大亏损: -392.11 总收益: 2749.63 平均盈利: 458.27 typeA: 305.53 胜率: 66.67%
趋势多且增强-L1-1-6 总交易次数: 5 盈利: 1107.7422267489585 亏损: -394.80928280919875 最大盈利: 712.76 最大亏损: -248.87 总收益: 712.93 平均盈利: 142.59 typeA: 85.55 胜率: 60.00%
趋势多且增强-L3-1-5 总交易次数: 7 盈利: 230.95459731573555 亏损: -140.9742260549857 最大盈利: 133.21 最大亏损: -120.33 总收益: 89.98 平均盈利: 12.85 typeA: 7.34 胜率: 57.14%
趋势多且增强-L-4-2-4 总交易次数: 4 盈利: 832.3689032345177 亏损: -234.1402301684742 最大盈利: 830.87 最大亏损: -130.63 总收益: 598.23 平均盈利: 149.56 typeA: 74.78 胜率: 50.00%
趋势多且增强-R-1-1-1 总交易次数: 2 盈利: 137.98366530544223 亏损: -694.3034254752507 最大盈利: 137.98 最大亏损: -694.30 总收益: -556.32 平均盈利: -278.16 typeA: -139.08 胜率: 50.00%
趋势多且增强-L3-1-4-3 总交易次数: 11 盈利: 70.1113808547425 亏损: -507.51649874554016 最大盈利: 45.67 最大亏损: -335.73 总收益: -437.41 平均盈利: -39.76 typeA: -18.07 胜率: 45.45%
趋势多且增强-L3-1-3 总交易次数: 3 盈利: 312.1202872531415 亏损: -557.7077615161152 最大盈利: 312.12 最大亏损: -487.79 总收益: -245.59 平均盈利: -81.86 typeA: -27.28 胜率: 33.33%
趋势多且增强-L-4-1-4 总交易次数: 5 盈利: 167.43091353353708 亏损: -310.4911033082294 最大盈利: 167.43 最大亏损: -159.19 总收益: -143.06 平均盈利: -28.61 typeA: -5.72 胜率: 20.00%
趋势多且增强-L-4-3-4 总交易次数: 7 盈利: 1.4381017881704237 亏损: -873.5552678054023 最大盈利: 1.44 最大亏损: -390.74 总收益: -872.12 平均盈利: -124.59 typeA: -17.80 胜率: 14.29%
趋势多且增强-L1-2-2 总交易次数: 1 盈利: 0 亏损: -315.4508108108114 最大盈利: -315.45 最大亏损: -315.45 总收益: -315.45 平均盈利: -315.45 typeA: 0.00 胜率: 0.00%
趋势多且增强-L-4-1-3 总交易次数: 2 盈利: 0 亏损: -606.0386698212867 最大盈利: -220.95 最大亏损: -385.09 总收益: -606.04 平均盈利: -303.02 typeA: 0.00 胜率: 0.00%
趋势多且增强-11 总交易次数: 1 盈利: 0 亏损: -163.4882428067022 最大盈利: -163.49 最大亏损: -163.49 总收益: -163.49 平均盈利: -163.49 typeA: 0.00 胜率: 0.00%
趋势多且增强-L-4-2-3 总交易次数: 2 盈利: 0 亏损: -230.01479860181996 最大盈利: -56.77 最大亏损: -173.24 总收益: -230.01 平均盈利: -115.01 typeA: 0.00 胜率: 0.00%
趋势多且增强-R-3-1 总交易次数: 1 盈利: 0 亏损: -35.87568641196385 最大盈利: -35.88 最大亏损: -35.88 总收益: -35.88 平均盈利: -35.88 typeA: 0.00 胜率: 0.00%
趋势多且增强-R-3-2 总交易次数: 2 盈利: 0 亏损: -75.8588080806393 最大盈利: -5.73 最大亏损: -70.13 总收益: -75.86 平均盈利: -37.93 typeA: 0.00 胜率: 0.00%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     103
      胜率:          49.51%
      总收益:        301.47 USDT
      期末余额:      10095.47 USDT
      盈亏比:        1.05
      最大单笔盈利:  633.89
      最大单笔亏损:  -668.93
      手续费:       411.9257475996539
      =============================
    
profit: 95.46925718099374
maxDrawdown 19.4%
startTime: 2022-11-22 00:00:00
趋势多且增强-L1-2-1 总交易次数: 1 盈利: 552.6168481375371 亏损: 0 最大盈利: 552.62 最大亏损: 552.62 总收益: 552.62 平均盈利: 552.62 typeA: 552.62 胜率: 100.00%
趋势多且增强-R-1-1-1 总交易次数: 1 盈利: 443.13356678339267 亏损: 0 最大盈利: 443.13 最大亏损: 443.13 总收益: 443.13 平均盈利: 443.13 typeA: 443.13 胜率: 100.00%
趋势空且增强-2 总交易次数: 1 盈利: 8.422697991663412 亏损: 0 最大盈利: 8.42 最大亏损: 8.42 总收益: 8.42 平均盈利: 8.42 typeA: 8.42 胜率: 100.00%
趋势多且增强-R-3-2 总交易次数: 1 盈利: 112.7971117424241 亏损: 0 最大盈利: 112.80 最大亏损: 112.80 总收益: 112.80 平均盈利: 112.80 typeA: 112.80 胜率: 100.00%
趋势多且增强-R-2-2 总交易次数: 3 盈利: 371.00455080824815 亏损: 0 最大盈利: 202.56 最大亏损: 14.21 总收益: 371.00 平均盈利: 123.67 typeA: 123.67 胜率: 100.00%
趋势空且增强-11 总交易次数: 6 盈利: 581.3848755271438 亏损: -108.8222440461571 最大盈利: 234.97 最大亏损: -108.82 总收益: 472.56 平均盈利: 78.76 typeA: 65.63 胜率: 83.33%
趋势多且增强-R-3-1 总交易次数: 5 盈利: 401.7306513538988 亏损: -48.4036599920439 最大盈利: 194.78 最大亏损: -48.40 总收益: 353.33 平均盈利: 70.67 typeA: 56.53 胜率: 80.00%
趋势多且增强-11 总交易次数: 3 盈利: 484.0275360531179 亏损: -92.33459632760132 最大盈利: 449.47 最大亏损: -92.33 总收益: 391.69 平均盈利: 130.56 typeA: 87.05 胜率: 66.67%
趋势空且增强-L2-3-5 总交易次数: 3 盈利: 661.5742980847017 亏损: -5.12757973733607 最大盈利: 633.89 最大亏损: -5.13 总收益: 656.45 平均盈利: 218.82 typeA: 145.88 胜率: 66.67%
趋势多且增强-L3-1-5 总交易次数: 5 盈利: 86.52478851058996 亏损: -53.89433627886559 最大盈利: 57.90 最大亏损: -35.42 总收益: 32.63 平均盈利: 6.53 typeA: 3.92 胜率: 60.00%
趋势多且增强-L3-1-4-3 总交易次数: 14 盈利: 289.83566860351965 亏损: -1071.1453520675393 最大盈利: 100.23 最大亏损: -508.18 总收益: -781.31 平均盈利: -55.81 typeA: -31.89 胜率: 57.14%
趋势空且增强-L2-3-3 总交易次数: 13 盈利: 235.67328342413302 亏损: -382.4515033771134 最大盈利: 58.57 最大亏损: -209.14 总收益: -146.78 平均盈利: -11.29 typeA: -6.08 胜率: 53.85%
趋势多且增强-L-4-2-3 总交易次数: 6 盈利: 1315.1505427988711 亏损: -342.6282652596444 最大盈利: 613.68 最大亏损: -208.00 总收益: 972.52 平均盈利: 162.09 typeA: 81.04 胜率: 50.00%
趋势空且增强-L2-3-4 总交易次数: 8 盈利: 113.40994533154822 亏损: -476.29617950648213 最大盈利: 45.67 最大亏损: -229.45 总收益: -362.89 平均盈利: -45.36 typeA: -22.68 胜率: 50.00%
趋势多且增强-L-4-3-4 总交易次数: 16 盈利: 358.17613528494235 亏损: -1042.1406082177507 最大盈利: 136.74 最大亏损: -437.61 总收益: -683.96 平均盈利: -42.75 typeA: -16.03 胜率: 37.50%
趋势多且增强-L-4-2-4 总交易次数: 2 盈利: 0 亏损: -109.68212138831862 最大盈利: -53.97 最大亏损: -55.71 总收益: -109.68 平均盈利: -54.84 typeA: 0.00 胜率: 0.00%
趋势多且增强-L1-3-1 总交易次数: 2 盈利: 0 亏损: -183.49070011198955 最大盈利: -64.79 最大亏损: -118.70 总收益: -183.49 平均盈利: -91.75 typeA: 0.00 胜率: 0.00%
趋势多且增强-L3-1-4-1 总交易次数: 2 盈利: 0 亏损: -859.6040882863849 最大盈利: -190.68 最大亏损: -668.93 总收益: -859.60 平均盈利: -429.80 typeA: 0.00 胜率: 0.00%
趋势多且增强-L1-2-5 总交易次数: 1 盈利: 0 亏损: -172.8525580910704 最大盈利: -172.85 最大亏损: -172.85 总收益: -172.85 平均盈利: -172.85 typeA: 0.00 胜率: 0.00%
趋势多且增强-L1-3-4 总交易次数: 3 盈利: 0 亏损: -66.00020465455754 最大盈利: -12.61 最大亏损: -27.74 总收益: -66.00 平均盈利: -22.00 typeA: 0.00 胜率: 0.00%
趋势多且增强-R-2-1 总交易次数: 3 盈利: 0 亏损: -312.08777351747307 最大盈利: -0.79 最大亏损: -293.10 总收益: -312.09 平均盈利: -104.03 typeA: 0.00 胜率: 0.00%
趋势多且增强-R-1-1-2 总交易次数: 1 盈利: 0 亏损: -50.94842309006032 最大盈利: -50.95 最大亏损: -50.95 总收益: -50.95 平均盈利: -50.95 typeA: 0.00 胜率: 0.00%
趋势多且增强-L-4-3-3 总交易次数: 2 盈利: 0 亏损: -83.73182456870518 最大盈利: -41.32 最大亏损: -42.41 总收益: -83.73 平均盈利: -41.87 typeA: 0.00 胜率: 0.00%
趋势空且增强-L3-1-6 总交易次数: 1 盈利: 0 亏损: -252.35122473564405 最大盈利: -252.35 最大亏损: -252.35 总收益: -252.35 平均盈利: -252.35 typeA: 0.00 胜率: 0.00%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     93
      胜率:          53.76%
      总收益:        275.33 USDT
      期末余额:      10087.33 USDT
      盈亏比:        1.08
      最大单笔盈利:  349.59
      最大单笔亏损:  -570.82
      手续费:       374.20283801705364
      =============================
    
profit: 87.33355090016994
maxDrawdown 11.4%
startTime: 2022-12-22 00:00:00
趋势空且增强-L2-3-4 总交易次数: 8 盈利: 483.23992016863497 亏损: 0 最大盈利: 349.59 最大亏损: 6.61 总收益: 483.24 平均盈利: 60.40 typeA: 60.40 胜率: 100.00%
趋势多且增强-L3-1-5 总交易次数: 7 盈利: 408.203088815869 亏损: 0 最大盈利: 207.44 最大亏损: 12.26 总收益: 408.20 平均盈利: 58.31 typeA: 58.31 胜率: 100.00%
趋势多且增强-R-3-1 总交易次数: 5 盈利: 294.51215238695204 亏损: 0 最大盈利: 118.90 最大亏损: 16.75 总收益: 294.51 平均盈利: 58.90 typeA: 58.90 胜率: 100.00%
趋势空且增强-11 总交易次数: 1 盈利: 288.8938746438739 亏损: 0 最大盈利: 288.89 最大亏损: 288.89 总收益: 288.89 平均盈利: 288.89 typeA: 288.89 胜率: 100.00%
趋势多且增强-R-2-1 总交易次数: 1 盈利: 86.32375264402168 亏损: 0 最大盈利: 86.32 最大亏损: 86.32 总收益: 86.32 平均盈利: 86.32 typeA: 86.32 胜率: 100.00%
趋势多且增强-L3-1-4-3 总交易次数: 12 盈利: 686.395299427195 亏损: -106.07934626919409 最大盈利: 285.65 最大亏损: -87.44 总收益: 580.32 平均盈利: 48.36 typeA: 32.24 胜率: 66.67%
趋势多且增强-R-3-2 总交易次数: 5 盈利: 437.40647252976436 亏损: -63.33188279793178 最大盈利: 266.93 最大亏损: -56.90 总收益: 374.07 平均盈利: 74.81 typeA: 44.89 胜率: 60.00%
趋势空且增强-L2-3-3 总交易次数: 11 盈利: 435.0054729389137 亏损: -673.9582076018445 最大盈利: 174.36 最大亏损: -570.82 总收益: -238.95 平均盈利: -21.72 typeA: -11.85 胜率: 54.55%
趋势多且增强-L-4-3-4 总交易次数: 12 盈利: 606.7650942812556 亏损: -247.9785542911564 最大盈利: 312.47 最大亏损: -72.48 总收益: 358.79 平均盈利: 29.90 typeA: 14.95 胜率: 50.00%
趋势多且增强-11 总交易次数: 3 盈利: 34.55575868372976 亏损: -594.8274162244808 最大盈利: 34.56 最大亏损: -552.19 总收益: -560.27 平均盈利: -186.76 typeA: -62.25 胜率: 33.33%
趋势多且增强-L3-1-3 总交易次数: 4 盈利: 38.86535092841331 亏损: -417.5155694983881 最大盈利: 38.87 最大亏损: -257.59 总收益: -378.65 平均盈利: -94.66 typeA: -23.67 胜率: 25.00%
趋势多且增强-L1-3-4 总交易次数: 4 盈利: 34.053814147017526 亏损: -140.14496891635915 最大盈利: 34.05 最大亏损: -62.52 总收益: -106.09 平均盈利: -26.52 typeA: -6.63 胜率: 25.00%
趋势空且增强-L2-3-5 总交易次数: 10 盈利: 61.66466088895073 亏损: -638.9980334346777 最大盈利: 34.93 最大亏损: -255.02 总收益: -577.33 平均盈利: -57.73 typeA: -11.55 胜率: 20.00%
趋势空且增强-L3-1-6 总交易次数: 2 盈利: 0 亏损: -296.2298011487633 最大盈利: -43.88 最大亏损: -252.35 总收益: -296.23 平均盈利: -148.11 typeA: 0.00 胜率: 0.00%
趋势多且增强-L1-3-2 总交易次数: 1 盈利: 0 亏损: -8.600211249010876 最大盈利: -8.60 最大亏损: -8.60 总收益: -8.60 平均盈利: -8.60 typeA: 0.00 胜率: 0.00%
趋势多且增强-L-4-3-3 总交易次数: 3 盈利: 0 亏损: -143.07647499857188 最大盈利: -15.16 最大亏损: -81.97 总收益: -143.08 平均盈利: -47.69 typeA: 0.00 胜率: 0.00%
趋势多且增强-L-4-2-3 总交易次数: 2 盈利: 0 亏损: -74.08744038999112 最大盈利: -18.27 最大亏损: -55.81 总收益: -74.09 平均盈利: -37.04 typeA: 0.00 胜率: 0.00%
趋势多且增强-L1-3-1 总交易次数: 1 盈利: 0 亏损: -211.4298724954472 最大盈利: -211.43 最大亏损: -211.43 总收益: -211.43 平均盈利: -211.43 typeA: 0.00 胜率: 0.00%
趋势多且增强-L-4-4-4 总交易次数: 1 盈利: 0 亏损: -4.293382268609488 最大盈利: -4.29 最大亏损: -4.29 总收益: -4.29 平均盈利: -4.29 typeA: 0.00 胜率: 0.00%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     99
      胜率:          46.46%
      总收益:        -229.80 USDT
      期末余额:      9572.20 USDT
      盈亏比:        0.95
      最大单笔盈利:  643.73
      最大单笔亏损:  -435.83
      手续费:       395.70359470603677
      =============================
    
profit: -427.8018828389504
maxDrawdown 14.1%
startTime: 2023-01-21 00:00:00
趋势多且增强-L3-1-3 总交易次数: 2 盈利: 77.66036864558194 亏损: 0 最大盈利: 38.87 最大亏损: 38.80 总收益: 77.66 平均盈利: 38.83 typeA: 38.83 胜率: 100.00%
趋势多且增强-L3-1-5 总交易次数: 2 盈利: 107.01808110113669 亏损: 0 最大盈利: 61.69 最大亏损: 45.33 总收益: 107.02 平均盈利: 53.51 typeA: 53.51 胜率: 100.00%
趋势多且增强-L1-3-4 总交易次数: 1 盈利: 197.84514646754639 亏损: 0 最大盈利: 197.85 最大亏损: 197.85 总收益: 197.85 平均盈利: 197.85 typeA: 197.85 胜率: 100.00%
趋势多且增强-L3-1-4-1 总交易次数: 1 盈利: 51.29545196778929 亏损: 0 最大盈利: 51.30 最大亏损: 51.30 总收益: 51.30 平均盈利: 51.30 typeA: 51.30 胜率: 100.00%
趋势多且增强-L1-2-2 总交易次数: 1 盈利: 44.4285876090166 亏损: 0 最大盈利: 44.43 最大亏损: 44.43 总收益: 44.43 平均盈利: 44.43 typeA: 44.43 胜率: 100.00%
趋势多且增强-L-4-1-1 总交易次数: 1 盈利: 187.9832271762208 亏损: 0 最大盈利: 187.98 最大亏损: 187.98 总收益: 187.98 平均盈利: 187.98 typeA: 187.98 胜率: 100.00%
趋势空且增强-L2-1-3 总交易次数: 1 盈利: 125.07361671811938 亏损: 0 最大盈利: 125.07 最大亏损: 125.07 总收益: 125.07 平均盈利: 125.07 typeA: 125.07 胜率: 100.00%
趋势多且增强-L1-3-1 总交易次数: 1 盈利: 8.439958231812607 亏损: 0 最大盈利: 8.44 最大亏损: 8.44 总收益: 8.44 平均盈利: 8.44 typeA: 8.44 胜率: 100.00%
趋势多且增强-R-1-1-2 总交易次数: 1 盈利: 16.79985897285314 亏损: 0 最大盈利: 16.80 最大亏损: 16.80 总收益: 16.80 平均盈利: 16.80 typeA: 16.80 胜率: 100.00%
趋势空且增强-L2-3-3 总交易次数: 11 盈利: 449.56915084337083 亏损: -46.209502285834205 最大盈利: 231.65 最大亏损: -21.49 总收益: 403.36 平均盈利: 36.67 typeA: 26.67 胜率: 72.73%
趋势多且增强-11 总交易次数: 6 盈利: 634.5277852498718 亏损: -540.2450469787942 最大盈利: 260.32 最大亏损: -435.83 总收益: 94.28 平均盈利: 15.71 typeA: 10.48 胜率: 66.67%
趋势多且增强-R-2-1 总交易次数: 6 盈利: 585.9082009078434 亏损: -279.80988791601715 最大盈利: 343.77 最大亏损: -242.00 总收益: 306.10 平均盈利: 51.02 typeA: 34.01 胜率: 66.67%
趋势空且增强-L2-3-5 总交易次数: 6 盈利: 334.9369653385634 亏损: -196.06101456430974 最大盈利: 319.91 最大亏损: -172.52 总收益: 138.88 平均盈利: 23.15 typeA: 11.57 胜率: 50.00%
趋势多且增强-L3-1-4-3 总交易次数: 10 盈利: 132.08026700372196 亏损: -411.38871108081327 最大盈利: 50.15 最大亏损: -188.37 总收益: -279.31 平均盈利: -27.93 typeA: -13.97 胜率: 50.00%
趋势空且增强-L2-2-3 总交易次数: 2 盈利: 40.75320584926944 亏损: -300.81961668545654 最大盈利: 40.75 最大亏损: -300.82 总收益: -260.07 平均盈利: -130.03 typeA: -65.02 胜率: 50.00%
趋势多且增强-L-4-2-3 总交易次数: 2 盈利: 192.000643224699 亏损: -49.69604725124828 最大盈利: 192.00 最大亏损: -49.70 总收益: 142.30 平均盈利: 71.15 typeA: 35.58 胜率: 50.00%
趋势空且增强-11 总交易次数: 2 盈利: 189.52063387256578 亏损: -153.36131669059938 最大盈利: 189.52 最大亏损: -153.36 总收益: 36.16 平均盈利: 18.08 typeA: 9.04 胜率: 50.00%
趋势空且增强-L2-3-4 总交易次数: 12 盈利: 743.8890885177074 亏损: -488.30355084078576 最大盈利: 643.73 最大亏损: -191.86 总收益: 255.59 平均盈利: 21.30 typeA: 8.88 胜率: 41.67%
趋势多且增强-L-4-2-4 总交易次数: 5 盈利: 34.96739495798441 亏损: -133.16583997955308 最大盈利: 34.97 最大亏损: -46.62 总收益: -98.20 平均盈利: -19.64 typeA: -3.93 胜率: 20.00%
趋势多且增强-L-4-3-4 总交易次数: 12 盈利: 5.237666056934401 亏损: -740.1388022706551 最大盈利: 3.85 最大亏损: -342.26 总收益: -734.90 平均盈利: -61.24 typeA: -10.21 胜率: 16.67%
趋势空且增强-L3-1-6 总交易次数: 1 盈利: 0 亏损: -43.878576413119234 最大盈利: -43.88 最大亏损: -43.88 总收益: -43.88 平均盈利: -43.88 typeA: 0.00 胜率: 0.00%
趋势多且增强-L-4-4-4 总交易次数: 1 盈利: 0 亏损: -4.293382268609488 最大盈利: -4.29 最大亏损: -4.29 总收益: -4.29 平均盈利: -4.29 typeA: 0.00 胜率: 0.00%
趋势多且增强-L-4-2-2 总交易次数: 2 盈利: 0 亏损: -144.7201700581452 最大盈利: -44.03 最大亏损: -100.69 总收益: -144.72 平均盈利: -72.36 typeA: 0.00 胜率: 0.00%
趋势多且增强-R-3-1 总交易次数: 2 盈利: 0 亏损: -88.9867825337748 最大盈利: -34.51 最大亏损: -54.48 总收益: -88.99 平均盈利: -44.49 typeA: 0.00 胜率: 0.00%
趋势多且增强-L-4-1-3 总交易次数: 1 盈利: 0 亏损: -114.77524773350216 最大盈利: -114.78 最大亏损: -114.78 总收益: -114.78 平均盈利: -114.78 typeA: 0.00 胜率: 0.00%
趋势多且增强-L-4-3-3 总交易次数: 5 盈利: 0 亏损: -498.021867989269 最大盈利: -34.94 最大亏损: -272.16 总收益: -498.02 平均盈利: -99.60 typeA: 0.00 胜率: 0.00%
趋势多且增强-R-1-2-2 总交易次数: 1 盈利: 0 亏损: -110.67391304347802 最大盈利: -110.67 最大亏损: -110.67 总收益: -110.67 平均盈利: -110.67 typeA: 0.00 胜率: 0.00%
趋势多且增强-L1-3-9 总交易次数: 1 盈利: 0 亏损: -45.1879049676025 最大盈利: -45.19 最大亏损: -45.19 总收益: -45.19 平均盈利: -45.19 typeA: 0.00 胜率: 0.00%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     84
      胜率:          42.86%
      总收益:        -1757.74 USDT
      期末余额:      8072.26 USDT
      盈亏比:        0.58
      最大单笔盈利:  300.08
      最大单笔亏损:  -553.20
      手续费:       337.8611339112766
      =============================
    
profit: -1927.738627135347
maxDrawdown 20.8%
startTime: 2023-02-20 00:00:00
趋势多且增强-L-4-2-2 总交易次数: 1 盈利: 43.6797094657921 亏损: 0 最大盈利: 43.68 最大亏损: 43.68 总收益: 43.68 平均盈利: 43.68 typeA: 43.68 胜率: 100.00%
趋势多且增强-L3-1-5 总交易次数: 2 盈利: 98.69108138555491 亏损: 0 最大盈利: 60.30 最大亏损: 38.39 总收益: 98.69 平均盈利: 49.35 typeA: 49.35 胜率: 100.00%
趋势多且增强-R-1-1-1 总交易次数: 1 盈利: 38.13649136892743 亏损: 0 最大盈利: 38.14 最大亏损: 38.14 总收益: 38.14 平均盈利: 38.14 typeA: 38.14 胜率: 100.00%
趋势多且增强-R-2-2 总交易次数: 1 盈利: 188.24257357974022 亏损: 0 最大盈利: 188.24 最大亏损: 188.24 总收益: 188.24 平均盈利: 188.24 typeA: 188.24 胜率: 100.00%
趋势空且增强-L2-3-3 总交易次数: 11 盈利: 468.85080379306135 亏损: -16.040713463766348 最大盈利: 168.02 最大亏损: -8.22 总收益: 452.81 平均盈利: 41.16 typeA: 29.94 胜率: 72.73%
趋势空且增强-L2-3-4 总交易次数: 3 盈利: 68.22271520803201 亏损: -357.0675052410902 最大盈利: 41.05 最大亏损: -357.07 总收益: -288.84 平均盈利: -96.28 typeA: -64.19 胜率: 66.67%
趋势多且增强-R-3-1 总交易次数: 11 盈利: 572.6242794859493 亏损: -1099.575765582655 最大盈利: 196.57 最大亏损: -512.84 总收益: -526.95 平均盈利: -47.90 typeA: -26.13 胜率: 54.55%
趋势多且增强-L1-3-4 总交易次数: 2 盈利: 105.75470668485661 亏损: -63.71604938271532 最大盈利: 105.75 最大亏损: -63.72 总收益: 42.04 平均盈利: 21.02 typeA: 10.51 胜率: 50.00%
趋势多且增强-L-4-3-3 总交易次数: 5 盈利: 54.89956145130981 亏损: -95.29544872760285 最大盈利: 53.86 最大亏损: -40.78 总收益: -40.40 平均盈利: -8.08 typeA: -3.23 胜率: 40.00%
趋势空且增强-L3-1-6 总交易次数: 5 盈利: 396.83499160874135 亏损: -100.7466980297419 最大盈利: 300.08 最大亏损: -65.81 总收益: 296.09 平均盈利: 59.22 typeA: 23.69 胜率: 40.00%
趋势多且增强-L3-1-4-3 总交易次数: 9 盈利: 94.82985608594076 亏损: -377.2895598817063 最大盈利: 62.20 最大亏损: -195.29 总收益: -282.46 平均盈利: -31.38 typeA: -10.46 胜率: 33.33%
趋势多且增强-L-4-3-2 总交易次数: 3 盈利: 6.048839393533408 亏损: -54.181713280406356 最大盈利: 6.05 最大亏损: -42.33 总收益: -48.13 平均盈利: -16.04 typeA: -5.35 胜率: 33.33%
趋势多且增强-11 总交易次数: 3 盈利: 12.57788578371751 亏损: -29.426505889233255 最大盈利: 12.58 最大亏损: -19.33 总收益: -16.85 平均盈利: -5.62 typeA: -1.87 胜率: 33.33%
趋势空且增强-L2-3-5 总交易次数: 4 盈利: 3.378865286367083 亏损: -121.54262509566014 最大盈利: 3.38 最大亏损: -65.49 总收益: -118.16 平均盈利: -29.54 typeA: -7.39 胜率: 25.00%
趋势多且增强-L3-1-3 总交易次数: 4 盈利: 197.0722453921713 亏损: -349.2935664236685 最大盈利: 197.07 最大亏损: -217.92 总收益: -152.22 平均盈利: -38.06 typeA: -9.51 胜率: 25.00%
趋势多且增强-L-4-3-4 总交易次数: 12 盈利: 66.81676519879791 亏损: -259.54030184485066 最大盈利: 54.79 最大亏损: -72.07 总收益: -192.72 平均盈利: -16.06 typeA: -4.02 胜率: 25.00%
趋势多且增强-R-3-2 总交易次数: 1 盈利: 0 亏损: -58.077527109559036 最大盈利: -58.08 最大亏损: -58.08 总收益: -58.08 平均盈利: -58.08 typeA: 0.00 胜率: 0.00%
趋势空且增强-11 总交易次数: 3 盈利: 0 亏损: -841.7529135746013 最大盈利: -103.40 最大亏损: -553.20 总收益: -841.75 平均盈利: -280.58 typeA: 0.00 胜率: 0.00%
趋势多且增强-L1-3-2 总交易次数: 1 盈利: 0 亏损: -31.355517494493547 最大盈利: -31.36 最大亏损: -31.36 总收益: -31.36 平均盈利: -31.36 typeA: 0.00 胜率: 0.00%
趋势多且增强-R-1-1-2 总交易次数: 1 盈利: 0 亏损: -206.30322949414128 最大盈利: -206.30 最大亏损: -206.30 总收益: -206.30 平均盈利: -206.30 typeA: 0.00 胜率: 0.00%
趋势多且增强-R-2-1 总交易次数: 1 盈利: 0 亏损: -113.19435779194374 最大盈利: -113.19 最大亏损: -113.19 总收益: -113.19 平均盈利: -113.19 typeA: 0.00 胜率: 0.00%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     83
      胜率:          46.99%
      总收益:        2411.26 USDT
      期末余额:      12243.26 USDT
      盈亏比:        1.80
      最大单笔盈利:  675.21
      最大单笔亏损:  -330.40
      手续费:       333.63010145109666
      =============================
    
profit: 2243.2637514114394
maxDrawdown 7.9%
startTime: 2023-03-22 00:00:00
趋势多且增强-R-3-2 总交易次数: 1 盈利: 39.73441168797297 亏损: 0 最大盈利: 39.73 最大亏损: 39.73 总收益: 39.73 平均盈利: 39.73 typeA: 39.73 胜率: 100.00%
趋势空且增强-L1-1-2 总交易次数: 1 盈利: 254.6773243584348 亏损: 0 最大盈利: 254.68 最大亏损: 254.68 总收益: 254.68 平均盈利: 254.68 typeA: 254.68 胜率: 100.00%
趋势多且增强-R-1-1-1 总交易次数: 1 盈利: 76.13670827015093 亏损: 0 最大盈利: 76.14 最大亏损: 76.14 总收益: 76.14 平均盈利: 76.14 typeA: 76.14 胜率: 100.00%
趋势空且增强-2 总交易次数: 1 盈利: 675.2130610461938 亏损: 0 最大盈利: 675.21 最大亏损: 675.21 总收益: 675.21 平均盈利: 675.21 typeA: 675.21 胜率: 100.00%
趋势空且增强-L2-3-4 总交易次数: 7 盈利: 204.60347656651732 亏损: -73.04743173622114 最大盈利: 62.31 最大亏损: -68.60 总收益: 131.56 平均盈利: 18.79 typeA: 13.42 胜率: 71.43%
趋势多且增强-11 总交易次数: 7 盈利: 832.9064043620965 亏损: -460.9492336910763 最大盈利: 260.87 最大亏损: -249.86 总收益: 371.96 平均盈利: 53.14 typeA: 37.96 胜率: 71.43%
趋势多且增强-R-2-1 总交易次数: 5 盈利: 57.8676462653883 亏损: -232.84819456282625 最大盈利: 39.26 最大亏损: -186.00 总收益: -174.98 平均盈利: -35.00 typeA: -21.00 胜率: 60.00%
趋势多且增强-L3-1-4-3 总交易次数: 10 盈利: 160.19765005292993 亏损: -326.1317873218199 最大盈利: 97.67 最大亏损: -206.78 总收益: -165.93 平均盈利: -16.59 typeA: -8.30 胜率: 50.00%
趋势空且增强-L2-3-3 总交易次数: 6 盈利: 892.3709394036091 亏损: -160.54141027269196 最大盈利: 637.15 最大亏损: -147.77 总收益: 731.83 平均盈利: 121.97 typeA: 60.99 胜率: 50.00%
趋势多且增强-L3-1-3 总交易次数: 4 盈利: 601.4686079647175 亏损: -58.8156840631808 最大盈利: 479.34 最大亏损: -54.18 总收益: 542.65 平均盈利: 135.66 typeA: 67.83 胜率: 50.00%
趋势多且增强-L3-1-5 总交易次数: 2 盈利: 3.3803309565467843 亏损: -41.18150263128464 最大盈利: 3.38 最大亏损: -41.18 总收益: -37.80 平均盈利: -18.90 typeA: -9.45 胜率: 50.00%
趋势多且增强-R-1-1-2 总交易次数: 2 盈利: 178.18987181114414 亏损: -119.11374018976231 最大盈利: 178.19 最大亏损: -119.11 总收益: 59.08 平均盈利: 29.54 typeA: 14.77 胜率: 50.00%
趋势多且增强-R-1-2-2 总交易次数: 2 盈利: 161.03055924628626 亏损: -28.313673884435694 最大盈利: 161.03 最大亏损: -28.31 总收益: 132.72 平均盈利: 66.36 typeA: 33.18 胜率: 50.00%
趋势空且增强-L3-1-6 总交易次数: 5 盈利: 454.89124816471667 亏损: -288.31499831033005 最大盈利: 428.94 最大亏损: -173.68 总收益: 166.58 平均盈利: 33.32 typeA: 13.33 胜率: 40.00%
趋势多且增强-L-4-2-3 总交易次数: 3 盈利: 187.47230748698848 亏损: -100.20599084675142 最大盈利: 187.47 最大亏损: -63.05 总收益: 87.27 平均盈利: 29.09 typeA: 9.70 胜率: 33.33%
趋势多且增强-R-3-1 总交易次数: 3 盈利: 2.916041794713997 亏损: -373.63855405305725 最大盈利: 2.92 最大亏损: -330.40 总收益: -370.72 平均盈利: -123.57 typeA: -41.19 胜率: 33.33%
趋势空且增强-L2-3-5 总交易次数: 3 盈利: 256.0182094081935 亏损: -42.22727407200418 最大盈利: 256.02 最大亏损: -31.16 总收益: 213.79 平均盈利: 71.26 typeA: 23.75 胜率: 33.33%
趋势多且增强-L-4-3-4 总交易次数: 10 盈利: 286.0277722515236 亏损: -134.2673128968864 最大盈利: 205.29 最大亏损: -47.40 总收益: 151.76 平均盈利: 15.18 typeA: 4.55 胜率: 30.00%
趋势多且增强-L-4-3-3 总交易次数: 4 盈利: 83.70986417279077 亏损: -131.4147214401641 最大盈利: 83.71 最大亏损: -96.18 总收益: -47.70 平均盈利: -11.93 typeA: -2.98 胜率: 25.00%
趋势多且增强-L1-3-1 总交易次数: 1 盈利: 0 亏损: -124.45107491856632 最大盈利: -124.45 最大亏损: -124.45 总收益: -124.45 平均盈利: -124.45 typeA: 0.00 胜率: 0.00%
趋势多且增强-L3-1-4-1 总交易次数: 1 盈利: 0 亏损: -58.27392120075096 最大盈利: -58.27 最大亏损: -58.27 总收益: -58.27 平均盈利: -58.27 typeA: 0.00 胜率: 0.00%
趋势空且增强-L2-2-3 总交易次数: 1 盈利: 0 亏损: -8.007207207206546 最大盈利: -8.01 最大亏损: -8.01 总收益: -8.01 平均盈利: -8.01 typeA: 0.00 胜率: 0.00%
趋势多且增强-L1-3-4 总交易次数: 1 盈利: 0 亏损: -23.604321728691428 最大盈利: -23.60 最大亏损: -23.60 总收益: -23.60 平均盈利: -23.60 typeA: 0.00 胜率: 0.00%
趋势多且增强-L1-3-2 总交易次数: 1 盈利: 0 亏损: -8.891211947157323 最大盈利: -8.89 最大亏损: -8.89 总收益: -8.89 平均盈利: -8.89 typeA: 0.00 胜率: 0.00%
趋势多且增强-L-4-1-3 总交易次数: 1 盈利: 0 亏损: -203.3094368846114 最大盈利: -203.31 最大亏损: -203.31 总收益: -203.31 平均盈利: -203.31 typeA: 0.00 胜率: 0.00%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     80
      胜率:          46.25%
      总收益:        -314.85 USDT
      期末余额:      9525.15 USDT
      盈亏比:        0.84
      最大单笔盈利:  250.66
      最大单笔亏损:  -281.54
      手续费:       319.8147035446543
      =============================
    
profit: -474.85220099317485
maxDrawdown 8.1%
startTime: 2023-04-21 00:00:00
趋势多且增强-R-2-2 总交易次数: 1 盈利: 175.42564766839328 亏损: 0 最大盈利: 175.43 最大亏损: 175.43 总收益: 175.43 平均盈利: 175.43 typeA: 175.43 胜率: 100.00%
趋势空且增强-L2-2-3 总交易次数: 1 盈利: 55.06679654884411 亏损: 0 最大盈利: 55.07 最大亏损: 55.07 总收益: 55.07 平均盈利: 55.07 typeA: 55.07 胜率: 100.00%
趋势多且增强-L3-1-4-3 总交易次数: 6 盈利: 56.74820871875285 亏损: -22.05214600882436 最大盈利: 15.41 最大亏损: -22.05 总收益: 34.70 平均盈利: 5.78 typeA: 4.82 胜率: 83.33%
趋势空且增强-L2-3-4 总交易次数: 8 盈利: 111.20063627709108 亏损: -160.29344526198813 最大盈利: 28.34 最大亏损: -120.72 总收益: -49.09 平均盈利: -6.14 typeA: -4.60 胜率: 75.00%
趋势多且增强-11 总交易次数: 4 盈利: 149.38500175634724 亏损: -50.91757621377512 最大盈利: 94.51 最大亏损: -50.92 总收益: 98.47 平均盈利: 24.62 typeA: 18.46 胜率: 75.00%
趋势多且增强-R-3-1 总交易次数: 7 盈利: 184.42569891526796 亏损: -193.9222377745471 最大盈利: 76.11 最大亏损: -168.38 总收益: -9.50 平均盈利: -1.36 typeA: -0.97 胜率: 71.43%
趋势空且增强-L2-3-3 总交易次数: 12 盈利: 593.9567395955141 亏损: -149.3554088642121 最大盈利: 250.66 最大亏损: -56.96 总收益: 444.60 平均盈利: 37.05 typeA: 21.61 胜率: 58.33%
趋势多且增强-L3-1-5 总交易次数: 6 盈利: 95.7183996027456 亏损: -230.87413030458487 最大盈利: 72.05 最大亏损: -219.05 总收益: -135.16 平均盈利: -22.53 typeA: -11.26 胜率: 50.00%
趋势多且增强-L3-1-3 总交易次数: 2 盈利: 10.505315822389353 亏损: -21.590202939118438 最大盈利: 10.51 最大亏损: -21.59 总收益: -11.08 平均盈利: -5.54 typeA: -2.77 胜率: 50.00%
趋势空且增强-L2-3-5 总交易次数: 3 盈利: 50.30425481340739 亏损: -163.08003899080805 最大盈利: 50.30 最大亏损: -145.87 总收益: -112.78 平均盈利: -37.59 typeA: -12.53 胜率: 33.33%
趋势多且增强-L-4-3-3 总交易次数: 7 盈利: 104.81777381989957 亏损: -89.63490626757611 最大盈利: 104.04 最大亏损: -26.63 总收益: 15.18 平均盈利: 2.17 typeA: 0.62 胜率: 28.57%
趋势多且增强-L-4-3-4 总交易次数: 17 盈利: 39.80828474898445 亏损: -302.3695712087926 最大盈利: 35.01 最大亏损: -60.14 总收益: -262.56 平均盈利: -15.44 typeA: -1.82 胜率: 11.76%
趋势多且增强-R-2-1 总交易次数: 1 盈利: 0 亏损: -186.00453800579893 最大盈利: -186.00 最大亏损: -186.00 总收益: -186.00 平均盈利: -186.00 typeA: 0.00 胜率: 0.00%
趋势多且增强-R-1-1-2 总交易次数: 1 盈利: 0 亏损: -14.855857014273223 最大盈利: -14.86 最大亏损: -14.86 总收益: -14.86 平均盈利: -14.86 typeA: 0.00 胜率: 0.00%
趋势多且增强-L1-3-1 总交易次数: 1 盈利: 0 亏损: -281.5374001452424 最大盈利: -281.54 最大亏损: -281.54 总收益: -281.54 平均盈利: -281.54 typeA: 0.00 胜率: 0.00%
趋势多且增强-L-4-2-3 总交易次数: 1 盈利: 0 亏损: -39.25037257824078 最大盈利: -39.25 最大亏损: -39.25 总收益: -39.25 平均盈利: -39.25 typeA: 0.00 胜率: 0.00%
趋势多且增强-R-3-2 总交易次数: 1 盈利: 0 亏损: -9.780544747082295 最大盈利: -9.78 最大亏损: -9.78 总收益: -9.78 平均盈利: -9.78 typeA: 0.00 胜率: 0.00%
趋势多且增强-L1-3-4 总交易次数: 1 盈利: 0 亏损: -26.696582955948895 最大盈利: -26.70 最大亏损: -26.70 总收益: -26.70 平均盈利: -26.70 typeA: 0.00 胜率: 0.00%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     85
      胜率:          42.35%
      总收益:        158.61 USDT
      期末余额:      9986.61 USDT
      盈亏比:        1.07
      最大单笔盈利:  1197.14
      最大单笔亏损:  -285.18
      手续费:       341.7233282210089
      =============================
    
profit: -13.391181323888304
maxDrawdown 7.8%
startTime: 2023-05-21 00:00:00
趋势多且增强-L3-1-3 总交易次数: 3 盈利: 164.9513133123344 亏损: 0 最大盈利: 124.81 最大亏损: 16.05 总收益: 164.95 平均盈利: 54.98 typeA: 54.98 胜率: 100.00%
趋势空且增强-L3-1-6 总交易次数: 1 盈利: 1197.138011017686 亏损: 0 最大盈利: 1197.14 最大亏损: 1197.14 总收益: 1197.14 平均盈利: 1197.14 typeA: 1197.14 胜率: 100.00%
趋势多且增强-L3-1-5 总交易次数: 4 盈利: 31.00816756513755 亏损: -10.715385732965931 最大盈利: 11.73 最大亏损: -10.72 总收益: 20.29 平均盈利: 5.07 typeA: 3.80 胜率: 75.00%
趋势多且增强-L3-1-4-3 总交易次数: 11 盈利: 205.32718681651687 亏损: -168.7719399945238 最大盈利: 58.65 最大亏损: -140.94 总收益: 36.56 平均盈利: 3.32 typeA: 2.11 胜率: 63.64%
趋势空且增强-L2-3-3 总交易次数: 10 盈利: 87.17930629549176 亏损: -238.3879314136306 最大盈利: 25.59 最大亏损: -131.73 总收益: -151.21 平均盈利: -15.12 typeA: -7.56 胜率: 50.00%
趋势多且增强-R-3-2 总交易次数: 2 盈利: 128.59356014580797 亏损: -9.44231055530661 最大盈利: 128.59 最大亏损: -9.44 总收益: 119.15 平均盈利: 59.58 typeA: 29.79 胜率: 50.00%
趋势多且增强-L-4-3-4 总交易次数: 14 盈利: 181.4721412011233 亏损: -111.76213718710166 最大盈利: 145.73 最大亏损: -30.14 总收益: 69.71 平均盈利: 4.98 typeA: 2.13 胜率: 42.86%
趋势空且增强-L2-3-5 总交易次数: 5 盈利: 203.5998888194075 亏损: -98.4185396416072 最大盈利: 102.47 最大亏损: -50.23 总收益: 105.18 平均盈利: 21.04 typeA: 8.41 胜率: 40.00%
趋势多且增强-R-3-1 总交易次数: 8 盈利: 175.56346335748793 亏损: -376.99280447129394 最大盈利: 161.38 最大亏损: -285.18 总收益: -201.43 平均盈利: -25.18 typeA: -9.44 胜率: 37.50%
趋势空且增强-L2-3-4 总交易次数: 11 盈利: 61.745378663828205 亏损: -410.83942371083435 最大盈利: 28.00 最大亏损: -140.72 总收益: -349.09 平均盈利: -31.74 typeA: -11.54 胜率: 36.36%
趋势多且增强-L-4-3-3 总交易次数: 10 盈利: 110.66126150886372 亏损: -524.2984489425219 最大盈利: 110.66 最大亏损: -158.42 总收益: -413.64 平均盈利: -41.36 typeA: -4.14 胜率: 10.00%
趋势多且增强-L-4-4-4 总交易次数: 1 盈利: 0 亏损: -63.682204551687136 最大盈利: -63.68 最大亏损: -63.68 总收益: -63.68 平均盈利: -63.68 typeA: 0.00 胜率: 0.00%
趋势多且增强-L1-3-1 总交易次数: 1 盈利: 0 亏损: -101.35547984100032 最大盈利: -101.36 最大亏损: -101.36 总收益: -101.36 平均盈利: -101.36 typeA: 0.00 胜率: 0.00%
趋势多且增强-L1-3-4 总交易次数: 2 盈利: 0 亏损: -170.53747209532665 最大盈利: -21.45 最大亏损: -149.09 总收益: -170.54 平均盈利: -85.27 typeA: 0.00 胜率: 0.00%
趋势多且增强-L-4-3-2 总交易次数: 1 盈利: 0 亏损: -27.817947062621112 最大盈利: -27.82 最大亏损: -27.82 总收益: -27.82 平均盈利: -27.82 typeA: 0.00 胜率: 0.00%
趋势多且增强-11 总交易次数: 1 盈利: 0 亏损: -75.60883482714502 最大盈利: -75.61 最大亏损: -75.61 总收益: -75.61 平均盈利: -75.61 typeA: 0.00 胜率: 0.00%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     86
      胜率:          45.35%
      总收益:        -2031.18 USDT
      期末余额:      7794.82 USDT
      盈亏比:        0.62
      最大单笔盈利:  341.14
      最大单笔亏损:  -774.78
      手续费:       346.31308977229577
      =============================
    
profit: -2205.1834946273893
maxDrawdown 24.3%
startTime: 2023-06-20 00:00:00
趋势多且增强-L-4-2-4 总交易次数: 1 盈利: 45.42475204829624 亏损: 0 最大盈利: 45.42 最大亏损: 45.42 总收益: 45.42 平均盈利: 45.42 typeA: 45.42 胜率: 100.00%
趋势多且增强-L1-3-4 总交易次数: 3 盈利: 354.8377814261246 亏损: -324.38280281107825 最大盈利: 341.14 最大亏损: -324.38 总收益: 30.45 平均盈利: 10.15 typeA: 6.77 胜率: 66.67%
趋势多且增强-R-3-1 总交易次数: 3 盈利: 107.37896739652032 亏损: -2 最大盈利: 77.91 最大亏损: -2.00 总收益: 105.38 平均盈利: 35.13 typeA: 23.42 胜率: 66.67%
趋势空且增强-L2-2-3 总交易次数: 3 盈利: 247.7179752069406 亏损: -22.032618025751248 最大盈利: 158.44 最大亏损: -22.03 总收益: 225.69 平均盈利: 75.23 typeA: 50.15 胜率: 66.67%
趋势空且增强-L2-3-5 总交易次数: 5 盈利: 285.4956588969216 亏损: -274.48862131152305 最大盈利: 259.08 最大亏损: -174.47 总收益: 11.01 平均盈利: 2.20 typeA: 1.32 胜率: 60.00%
趋势空且增强-L2-3-3 总交易次数: 11 盈利: 187.5976270132033 亏损: -1771.504466704771 最大盈利: 55.38 最大亏损: -774.78 总收益: -1583.91 平均盈利: -143.99 typeA: -78.55 胜率: 54.55%
趋势空且增强-L2-3-4 总交易次数: 13 盈利: 594.6630995850132 亏损: -972.9231896515248 最大盈利: 245.33 最大亏损: -366.45 总收益: -378.26 平均盈利: -29.10 typeA: -15.67 胜率: 53.85%
趋势多且增强-L3-1-4-3 总交易次数: 16 盈利: 509.1285140755265 亏损: -653.2400421518867 最大盈利: 327.06 最大亏损: -374.43 总收益: -144.11 平均盈利: -9.01 typeA: -4.50 胜率: 50.00%
趋势多且增强-R-2-1 总交易次数: 2 盈利: 219.63455582722085 亏损: -46.907920347358676 最大盈利: 219.63 最大亏损: -46.91 总收益: 172.73 平均盈利: 86.36 typeA: 43.18 胜率: 50.00%
趋势多且增强-L-4-3-2 总交易次数: 2 盈利: 95.45502879929018 亏损: -21.72291350531185 最大盈利: 95.46 最大亏损: -21.72 总收益: 73.73 平均盈利: 36.87 typeA: 18.43 胜率: 50.00%
趋势多且增强-L1-3-1 总交易次数: 2 盈利: 164.8490864623787 亏损: -31.823579545454805 最大盈利: 164.85 最大亏损: -31.82 总收益: 133.03 平均盈利: 66.51 typeA: 33.26 胜率: 50.00%
趋势多且增强-L3-1-5 总交易次数: 5 盈利: 42.35593055473388 亏损: -442.6242298154418 最大盈利: 26.15 最大亏损: -275.55 总收益: -400.27 平均盈利: -80.05 typeA: -32.02 胜率: 40.00%
趋势多且增强-11 总交易次数: 3 盈利: 184.45001528584513 亏损: -141.83974016496208 最大盈利: 184.45 最大亏损: -107.87 总收益: 42.61 平均盈利: 14.20 typeA: 4.73 胜率: 33.33%
趋势多且增强-L-4-3-4 总交易次数: 8 盈利: 265.75115221305737 亏损: -278.9689090599026 最大盈利: 260.10 最大亏损: -148.28 总收益: -13.22 平均盈利: -1.65 typeA: -0.41 胜率: 25.00%
趋势多且增强-L1-3-2 总交易次数: 1 盈利: 0 亏损: -63.25689277899398 最大盈利: -63.26 最大亏损: -63.26 总收益: -63.26 平均盈利: -63.26 typeA: 0.00 胜率: 0.00%
趋势多且增强-L-4-3-3 总交易次数: 4 盈利: 0 亏损: -156.86829851054287 最大盈利: -7.91 最大亏损: -103.16 总收益: -156.87 平均盈利: -39.22 typeA: 0.00 胜率: 0.00%
趋势多且增强-L1-2-2 总交易次数: 1 盈利: 0 亏损: -70.19126396749357 最大盈利: -70.19 最大亏损: -70.19 总收益: -70.19 平均盈利: -70.19 typeA: 0.00 胜率: 0.00%
趋势空且增强-L3-1-6 总交易次数: 2 盈利: 0 亏损: -55.027530102044174 最大盈利: -22.26 最大亏损: -32.77 总收益: -55.03 平均盈利: -27.51 typeA: 0.00 胜率: 0.00%
趋势多且增强-L3-1-4-1 总交易次数: 1 盈利: 0 亏损: -6.1206209644165925 最大盈利: -6.12 最大亏损: -6.12 总收益: -6.12 平均盈利: -6.12 typeA: 0.00 胜率: 0.00%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     87
      胜率:          49.43%
      总收益:        2134.22 USDT
      期末余额:      11958.22 USDT
      盈亏比:        1.82
      最大单笔盈利:  1148.20
      最大单笔亏损:  -324.38
      手续费:       350.20268055798556
      =============================
    
profit: 1958.218562957847
maxDrawdown 3.4%
startTime: 2023-07-20 00:00:00
趋势空且增强-L3-1-6 总交易次数: 2 盈利: 359.3571449137966 亏损: 0 最大盈利: 197.25 最大亏损: 162.10 总收益: 359.36 平均盈利: 179.68 typeA: 179.68 胜率: 100.00%
趋势多且增强-L3-1-4-1 总交易次数: 1 盈利: 234.3463441451346 亏损: 0 最大盈利: 234.35 最大亏损: 234.35 总收益: 234.35 平均盈利: 234.35 typeA: 234.35 胜率: 100.00%
趋势多且增强-11 总交易次数: 3 盈利: 131.84094856189304 亏损: 0 最大盈利: 73.45 最大亏损: 19.29 总收益: 131.84 平均盈利: 43.95 typeA: 43.95 胜率: 100.00%
趋势多且增强-R-3-2 总交易次数: 1 盈利: 82.20186576833348 亏损: 0 最大盈利: 82.20 最大亏损: 82.20 总收益: 82.20 平均盈利: 82.20 typeA: 82.20 胜率: 100.00%
趋势多且增强-L3-1-5 总交易次数: 2 盈利: 62.81053865021599 亏损: 0 最大盈利: 39.76 最大亏损: 23.05 总收益: 62.81 平均盈利: 31.41 typeA: 31.41 胜率: 100.00%
趋势多且增强-R-1-1-1 总交易次数: 1 盈利: 1148.19633460352 亏损: 0 最大盈利: 1148.20 最大亏损: 1148.20 总收益: 1148.20 平均盈利: 1148.20 typeA: 1148.20 胜率: 100.00%
趋势空且增强-L2-3-4 总交易次数: 13 盈利: 1001.6351467429472 亏损: -395.2161021189145 最大盈利: 379.10 最大亏损: -192.25 总收益: 606.42 平均盈利: 46.65 typeA: 25.12 胜率: 53.85%
趋势多且增强-L1-3-4 总交易次数: 4 盈利: 123.92761992913366 亏损: -472.2763650428375 最大盈利: 119.23 最大亏损: -324.38 总收益: -348.35 平均盈利: -87.09 typeA: -43.54 胜率: 50.00%
趋势多且增强-R-3-1 总交易次数: 10 盈利: 390.4283830881164 亏损: -350.84370773584124 最大盈利: 114.32 最大亏损: -121.59 总收益: 39.58 平均盈利: 3.96 typeA: 1.98 胜率: 50.00%
趋势多且增强-L3-1-3 总交易次数: 2 盈利: 9.13363028953184 亏损: -37.395625237070256 最大盈利: 9.13 最大亏损: -37.40 总收益: -28.26 平均盈利: -14.13 typeA: -7.07 胜率: 50.00%
趋势多且增强-L-4-3-3 总交易次数: 6 盈利: 101.88418046481827 亏损: -215.3859353447923 最大盈利: 66.22 最大亏损: -130.66 总收益: -113.50 平均盈利: -18.92 typeA: -9.46 胜率: 50.00%
趋势多且增强-L-4-3-2 总交易次数: 2 盈利: 350.79566878980825 亏损: -25.864739424479456 最大盈利: 350.80 最大亏损: -25.86 总收益: 324.93 平均盈利: 162.47 typeA: 81.23 胜率: 50.00%
趋势多且增强-R-2-2 总交易次数: 2 盈利: 10.72729844413108 亏损: -6.22748414376353 最大盈利: 10.73 最大亏损: -6.23 总收益: 4.50 平均盈利: 2.25 typeA: 1.12 胜率: 50.00%
趋势多且增强-L-4-3-4 总交易次数: 13 盈利: 464.16030503578554 亏损: -149.234370717472 最大盈利: 195.76 最大亏损: -33.07 总收益: 314.93 平均盈利: 24.23 typeA: 11.18 胜率: 46.15%
趋势多且增强-L3-1-4-3 总交易次数: 10 盈利: 175.23184465470592 亏损: -338.9008915655438 最大盈利: 143.00 最大亏损: -153.55 总收益: -163.67 平均盈利: -16.37 typeA: -6.55 胜率: 40.00%
趋势空且增强-L2-3-5 总交易次数: 3 盈利: 3.362283876155793 亏损: -226.37118716548053 最大盈利: 3.36 最大亏损: -211.11 总收益: -223.01 平均盈利: -74.34 typeA: -24.78 胜率: 33.33%
趋势空且增强-L2-3-3 总交易次数: 8 盈利: 84.78828389959418 亏损: -215.8019113259757 最大盈利: 47.42 最大亏损: -116.98 总收益: -131.01 平均盈利: -16.38 typeA: -4.09 胜率: 25.00%
趋势空且增强-L2-2-3 总交易次数: 1 盈利: 0 亏损: -18.114930182598698 最大盈利: -18.11 最大亏损: -18.11 总收益: -18.11 平均盈利: -18.11 typeA: 0.00 胜率: 0.00%
趋势多且增强-L1-3-2 总交易次数: 1 盈利: 0 亏损: -80.83634953464316 最大盈利: -80.84 最大亏损: -80.84 总收益: -80.84 平均盈利: -80.84 typeA: 0.00 胜率: 0.00%
趋势多且增强-L1-3-1 总交易次数: 1 盈利: 0 亏损: -33.12314780226624 最大盈利: -33.12 最大亏损: -33.12 总收益: -33.12 平均盈利: -33.12 typeA: 0.00 胜率: 0.00%
趋势多且增强-R-2-1 总交易次数: 1 盈利: 0 亏损: -35.016511558090365 最大盈利: -35.02 最大亏损: -35.02 总收益: -35.02 平均盈利: -35.02 typeA: 0.00 胜率: 0.00%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     74
      胜率:          51.35%
      总收益:        -273.83 USDT
      期末余额:      9578.17 USDT
      盈亏比:        0.85
      最大单笔盈利:  194.35
      最大单笔亏损:  -296.01
      手续费:       295.8944265834103
      =============================
    
profit: -421.8301765279357
maxDrawdown 7.1%
startTime: 2023-08-19 00:00:00
趋势多且增强-R-3-1 总交易次数: 4 盈利: 190.24274767052552 亏损: 0 最大盈利: 82.95 最大亏损: 10.99 总收益: 190.24 平均盈利: 47.56 typeA: 47.56 胜率: 100.00%
趋势多且增强-L1-3-4 总交易次数: 1 盈利: 9.052747946936295 亏损: 0 最大盈利: 9.05 最大亏损: 9.05 总收益: 9.05 平均盈利: 9.05 typeA: 9.05 胜率: 100.00%
趋势空且增强-L3-1-6 总交易次数: 2 盈利: 150.7104816273695 亏损: 0 最大盈利: 131.84 最大亏损: 18.87 总收益: 150.71 平均盈利: 75.36 typeA: 75.36 胜率: 100.00%
趋势空且增强-L2-3-4 总交易次数: 5 盈利: 156.28660403003482 亏损: -5.16769596199622 最大盈利: 108.07 最大亏损: -5.17 总收益: 151.12 平均盈利: 30.22 typeA: 24.18 胜率: 80.00%
趋势多且增强-L3-1-4-3 总交易次数: 9 盈利: 103.8123320360601 亏损: -307.5848386809199 最大盈利: 29.25 最大亏损: -266.28 总收益: -203.77 平均盈利: -22.64 typeA: -17.61 胜率: 77.78%
趋势多且增强-L-4-3-3 总交易次数: 11 盈利: 420.66097061629944 亏损: -172.5440587586648 最大盈利: 194.35 最大亏损: -56.73 总收益: 248.12 平均盈利: 22.56 typeA: 12.30 胜率: 54.55%
趋势多且增强-L1-3-2 总交易次数: 2 盈利: 40.45101431042716 亏损: -296.01470367591946 最大盈利: 40.45 最大亏损: -296.01 总收益: -255.56 平均盈利: -127.78 typeA: -63.89 胜率: 50.00%
趋势空且增强-L2-3-5 总交易次数: 6 盈利: 146.9061332711026 亏损: -110.872534956829 最大盈利: 92.82 最大亏损: -92.47 总收益: 36.03 平均盈利: 6.01 typeA: 3.00 胜率: 50.00%
趋势空且增强-L2-3-3 总交易次数: 12 盈利: 117.59903249542337 亏损: -304.4561608699004 最大盈利: 54.38 最大亏损: -104.30 总收益: -186.86 平均盈利: -15.57 typeA: -6.49 胜率: 41.67%
趋势多且增强-L-4-3-4 总交易次数: 14 盈利: 198.59430268883145 亏损: -413.857833262758 最大盈利: 120.32 最大亏损: -212.19 总收益: -215.26 平均盈利: -15.38 typeA: -4.39 胜率: 28.57%
趋势多且增强-L3-1-5 总交易次数: 5 盈利: 11.09067103109603 亏损: -180.49018295375555 最大盈利: 11.09 最大亏损: -97.05 总收益: -169.40 平均盈利: -33.88 typeA: -6.78 胜率: 20.00%
趋势多且增强-L-4-3-2 总交易次数: 1 盈利: 0 亏损: -21.037765788639952 最大盈利: -21.04 最大亏损: -21.04 总收益: -21.04 平均盈利: -21.04 typeA: 0.00 胜率: 0.00%
趋势多且增强-L3-1-3 总交易次数: 2 盈利: 0 亏损: -7.211439342652849 最大盈利: -3.57 最大亏损: -3.64 总收益: -7.21 平均盈利: -3.61 typeA: 0.00 胜率: 0.00%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     78
      胜率:          48.72%
      总收益:        -75.19 USDT
      期末余额:      9768.81 USDT
      盈亏比:        0.94
      最大单笔盈利:  307.26
      最大单笔亏损:  -181.41
      手续费:       311.9953160404308
      =============================
    
profit: -231.18868346256386
maxDrawdown 4.9%
startTime: 2023-09-18 00:00:00
趋势多且增强-L3-1-5 总交易次数: 5 盈利: 59.17478596642401 亏损: -10.400268862376311 最大盈利: 20.69 最大亏损: -10.40 总收益: 48.77 平均盈利: 9.75 typeA: 7.80 胜率: 80.00%
趋势空且增强-L2-3-3 总交易次数: 9 盈利: 86.82502972488636 亏损: -114.64764875733772 最大盈利: 23.66 最大亏损: -69.93 总收益: -27.82 平均盈利: -3.09 typeA: -2.06 胜率: 66.67%
趋势空且增强-L2-3-5 总交易次数: 3 盈利: 19.436247372892904 亏损: -21.68897637795309 最大盈利: 11.60 最大亏损: -21.69 总收益: -2.25 平均盈利: -0.75 typeA: -0.50 胜率: 66.67%
趋势多且增强-L3-1-4-3 总交易次数: 17 盈利: 206.3416210813759 亏损: -245.1327706314125 最大盈利: 80.21 最大亏损: -76.87 总收益: -38.79 平均盈利: -2.28 typeA: -1.21 胜率: 52.94%
趋势多且增强-L-4-3-2 总交易次数: 2 盈利: 54.14150489330918 亏损: -37.05727166471896 最大盈利: 54.14 最大亏损: -37.06 总收益: 17.08 平均盈利: 8.54 typeA: 4.27 胜率: 50.00%
趋势空且增强-L2-3-4 总交易次数: 10 盈利: 52.96999121537104 亏损: -140.11756971488737 最大盈利: 20.02 最大亏损: -59.86 总收益: -87.15 平均盈利: -8.71 typeA: -4.36 胜率: 50.00%
趋势多且增强-L3-1-3 总交易次数: 2 盈利: 39.17661967368863 亏损: -12.287772251757426 最大盈利: 39.18 最大亏损: -12.29 总收益: 26.89 平均盈利: 13.44 typeA: 6.72 胜率: 50.00%
趋势多且增强-R-3-1 总交易次数: 2 盈利: 71.02548287615632 亏损: -30.925459496255364 最大盈利: 71.03 最大亏损: -30.93 总收益: 40.10 平均盈利: 20.05 typeA: 10.03 胜率: 50.00%
趋势多且增强-L-4-3-3 总交易次数: 9 盈利: 126.32733788308603 亏损: -195.6612875952643 最大盈利: 71.89 最大亏损: -68.67 总收益: -69.33 平均盈利: -7.70 typeA: -2.57 胜率: 33.33%
趋势多且增强-L-4-3-4 总交易次数: 12 盈利: 49.985134010458495 亏损: -113.6719164919098 最大盈利: 22.40 最大亏损: -24.30 总收益: -63.69 平均盈利: -5.31 typeA: -1.77 胜率: 33.33%
趋势空且增强-L3-1-6 总交易次数: 6 盈利: 355.16561830558345 亏损: -241.81905391365478 最大盈利: 307.26 最大亏损: -181.41 总收益: 113.35 平均盈利: 18.89 typeA: 6.30 胜率: 33.33%
趋势多且增强-L-4-3-1 总交易次数: 1 盈利: 0 亏损: -32.348060708263 最大盈利: -32.35 最大亏损: -32.35 总收益: -32.35 平均盈利: -32.35 typeA: 0.00 胜率: 0.00%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     89
      胜率:          62.92%
      总收益:        2932.19 USDT
      期末余额:      12754.19 USDT
      盈亏比:        2.09
      最大单笔盈利:  552.11
      最大单笔亏损:  -355.01
      手续费:       356.5696151964123
      =============================
    
profit: 2754.186259048054
maxDrawdown 9.8%
startTime: 2023-10-18 00:00:00
趋势空且增强-L3-1-6 总交易次数: 1 盈利: 28.608429545138122 亏损: 0 最大盈利: 28.61 最大亏损: 28.61 总收益: 28.61 平均盈利: 28.61 typeA: 28.61 胜率: 100.00%
趋势多且增强-R-3-2 总交易次数: 1 盈利: 17.215552927260678 亏损: 0 最大盈利: 17.22 最大亏损: 17.22 总收益: 17.22 平均盈利: 17.22 typeA: 17.22 胜率: 100.00%
趋势多且增强-L3-1-5 总交易次数: 1 盈利: 14.069257744009201 亏损: 0 最大盈利: 14.07 最大亏损: 14.07 总收益: 14.07 平均盈利: 14.07 typeA: 14.07 胜率: 100.00%
趋势多且增强-L-4-3-2 总交易次数: 1 盈利: 35.93200058368747 亏损: 0 最大盈利: 35.93 最大亏损: 35.93 总收益: 35.93 平均盈利: 35.93 typeA: 35.93 胜率: 100.00%
趋势多且增强-L3-1-3 总交易次数: 3 盈利: 135.1817596942082 亏损: 0 最大盈利: 80.86 最大亏损: 2.04 总收益: 135.18 平均盈利: 45.06 typeA: 45.06 胜率: 100.00%
趋势多且增强-L1-3-4 总交易次数: 1 盈利: 348.28158374576685 亏损: 0 最大盈利: 348.28 最大亏损: 348.28 总收益: 348.28 平均盈利: 348.28 typeA: 348.28 胜率: 100.00%
趋势多且增强-L-4-1-3 总交易次数: 1 盈利: 355.11556049932074 亏损: 0 最大盈利: 355.12 最大亏损: 355.12 总收益: 355.12 平均盈利: 355.12 typeA: 355.12 胜率: 100.00%
趋势多且增强-L3-1-4-3 总交易次数: 14 盈利: 350.038102875842 亏损: -360.96380662904585 最大盈利: 79.47 最大亏损: -190.53 总收益: -10.93 平均盈利: -0.78 typeA: -0.67 胜率: 85.71%
趋势多且增强-11 总交易次数: 4 盈利: 853.7883043103694 亏损: -232.12248253185382 最大盈利: 532.77 最大亏损: -232.12 总收益: 621.67 平均盈利: 155.42 typeA: 116.56 胜率: 75.00%
趋势多且增强-R-3-1 总交易次数: 4 盈利: 566.4943959706965 亏损: -56.00270067516867 最大盈利: 248.57 最大亏损: -56.00 总收益: 510.49 平均盈利: 127.62 typeA: 95.72 胜率: 75.00%
趋势空且增强-L2-3-5 总交易次数: 6 盈利: 72.26397442555667 亏损: -81.10147472794503 最大盈利: 25.53 最大亏损: -58.90 总收益: -8.84 平均盈利: -1.47 typeA: -0.98 胜率: 66.67%
趋势多且增强-L-4-2-4 总交易次数: 3 盈利: 343.9523332392869 亏损: -136.63201610873415 最大盈利: 332.67 最大亏损: -136.63 总收益: 207.32 平均盈利: 69.11 typeA: 46.07 胜率: 66.67%
趋势空且增强-L2-3-3 总交易次数: 10 盈利: 775.0043886970228 亏损: -593.7156360602958 最大盈利: 552.11 最大亏损: -355.01 总收益: 181.29 平均盈利: 18.13 typeA: 9.06 胜率: 50.00%
趋势多且增强-L-4-3-4 总交易次数: 12 盈利: 407.1897112986018 亏损: -326.75553400322667 最大盈利: 312.10 最大亏损: -233.98 总收益: 80.43 平均盈利: 6.70 typeA: 3.35 胜率: 50.00%
趋势多且增强-L-4-3-3 总交易次数: 4 盈利: 229.6187283152599 亏损: -59.04445534665926 最大盈利: 131.14 最大亏损: -32.46 总收益: 170.57 平均盈利: 42.64 typeA: 21.32 胜率: 50.00%
趋势多且增强-L1-3-1 总交易次数: 2 盈利: 113.10077274877914 亏损: -33.51232091690515 最大盈利: 113.10 最大亏损: -33.51 总收益: 79.59 平均盈利: 39.79 typeA: 19.90 胜率: 50.00%
趋势多且增强-R-2-1 总交易次数: 2 盈利: 274.1878453038665 亏损: -76.37252042006952 最大盈利: 274.19 最大亏损: -76.37 总收益: 197.82 平均盈利: 98.91 typeA: 49.45 胜率: 50.00%
趋势多且增强-L-4-2-3 总交易次数: 4 盈利: 202.69270915705735 亏损: -62.00788989598772 最大盈利: 145.90 最大亏损: -38.53 总收益: 140.68 平均盈利: 35.17 typeA: 17.59 胜率: 50.00%
趋势空且增强-L2-3-4 总交易次数: 13 盈利: 507.41046896290436 亏损: -637.1039367612782 最大盈利: 265.88 最大亏损: -178.30 总收益: -129.69 平均盈利: -9.98 typeA: -4.60 胜率: 46.15%
趋势多且增强-L-4-2-2 总交易次数: 1 盈利: 0 亏损: -38.13251238120633 最大盈利: -38.13 最大亏损: -38.13 总收益: -38.13 平均盈利: -38.13 typeA: 0.00 胜率: 0.00%
趋势多且增强-L1-3-2 总交易次数: 1 盈利: 0 亏损: -4.4923345382017015 最大盈利: -4.49 最大亏损: -4.49 总收益: -4.49 平均盈利: -4.49 typeA: 0.00 胜率: 0.00%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     88
      胜率:          56.82%
      总收益:        3398.25 USDT
      期末余额:      13220.25 USDT
      盈亏比:        2.14
      最大单笔盈利:  1053.58
      最大单笔亏损:  -610.81
      手续费:       354.2512214709563
      =============================
    
profit: 3220.247946838381
maxDrawdown 6.5%
startTime: 2023-11-17 00:00:00
趋势多且增强-R-2-1 总交易次数: 2 盈利: 449.1223963280444 亏损: 0 最大盈利: 302.66 最大亏损: 146.46 总收益: 449.12 平均盈利: 224.56 typeA: 224.56 胜率: 100.00%
趋势多且增强-L3-1-5 总交易次数: 3 盈利: 249.49671596066776 亏损: 0 最大盈利: 171.23 最大亏损: 15.27 总收益: 249.50 平均盈利: 83.17 typeA: 83.17 胜率: 100.00%
趋势空且增强-L1-1-2 总交易次数: 1 盈利: 327.36368038740926 亏损: 0 最大盈利: 327.36 最大亏损: 327.36 总收益: 327.36 平均盈利: 327.36 typeA: 327.36 胜率: 100.00%
趋势多且增强-L1-3-9 总交易次数: 1 盈利: 155.10563665855594 亏损: 0 最大盈利: 155.11 最大亏损: 155.11 总收益: 155.11 平均盈利: 155.11 typeA: 155.11 胜率: 100.00%
趋势多且增强-R-1-2-2 总交易次数: 1 盈利: 51.47107618423972 亏损: 0 最大盈利: 51.47 最大亏损: 51.47 总收益: 51.47 平均盈利: 51.47 typeA: 51.47 胜率: 100.00%
趋势空且增强-L2-3-3 总交易次数: 9 盈利: 645.2338133860633 亏损: -14.635334419220502 最大盈利: 471.97 最大亏损: -11.57 总收益: 630.60 平均盈利: 70.07 typeA: 54.50 胜率: 77.78%
趋势空且增强-11 总交易次数: 4 盈利: 310.34723914569014 亏损: -184.56860872333644 最大盈利: 109.47 最大亏损: -184.57 总收益: 125.78 平均盈利: 31.44 typeA: 23.58 胜率: 75.00%
趋势多且增强-L-4-3-3 总交易次数: 4 盈利: 341.60087740416344 亏损: -48.36960399571905 最大盈利: 221.16 最大亏损: -48.37 总收益: 293.23 平均盈利: 73.31 typeA: 54.98 胜率: 75.00%
趋势多且增强-L-4-2-3 总交易次数: 4 盈利: 254.2576200556852 亏损: -163.65259014998335 最大盈利: 187.11 最大亏损: -163.65 总收益: 90.61 平均盈利: 22.65 typeA: 16.99 胜率: 75.00%
趋势空且增强-L2-3-5 总交易次数: 3 盈利: 339.6956301911009 亏损: -22.299012312271326 最大盈利: 319.45 最大亏损: -22.30 总收益: 317.40 平均盈利: 105.80 typeA: 70.54 胜率: 66.67%
趋势多且增强-L1-3-1 总交易次数: 3 盈利: 1072.2067843606028 亏损: -20.672338659472878 最大盈利: 1053.58 最大亏损: -20.67 总收益: 1051.53 平均盈利: 350.51 typeA: 233.69 胜率: 66.67%
趋势多且增强-R-1-1-2 总交易次数: 3 盈利: 263.97879320142175 亏损: -23.099504062466167 最大盈利: 231.10 最大亏损: -23.10 总收益: 240.88 平均盈利: 80.29 typeA: 53.53 胜率: 66.67%
趋势多且增强-L3-1-4-3 总交易次数: 11 盈利: 446.81050416462256 亏损: -480.98532698383724 最大盈利: 329.88 最大亏损: -179.55 总收益: -34.17 平均盈利: -3.11 typeA: -1.69 胜率: 54.55%
趋势多且增强-L-4-2-4 总交易次数: 4 盈利: 258.4503929800674 亏损: -78.20963187033422 最大盈利: 247.16 最大亏损: -44.08 总收益: 180.24 平均盈利: 45.06 typeA: 22.53 胜率: 50.00%
趋势多且增强-R-3-1 总交易次数: 2 盈利: 23.50167807759373 亏损: -49.06437659033196 最大盈利: 23.50 最大亏损: -49.06 总收益: -25.56 平均盈利: -12.78 typeA: -6.39 胜率: 50.00%
趋势空且增强-L2-3-4 总交易次数: 9 盈利: 443.8512689277319 亏损: -635.6863420061101 最大盈利: 359.10 最大亏损: -330.42 总收益: -191.84 平均盈利: -21.32 typeA: -9.47 胜率: 44.44%
趋势多且增强-L-4-3-4 总交易次数: 12 盈利: 262.2835730346912 亏损: -174.36373732304065 最大盈利: 153.81 最大亏损: -40.60 总收益: 87.92 平均盈利: 7.33 typeA: 3.05 胜率: 41.67%
趋势多且增强-L1-3-4 总交易次数: 3 盈利: 455.9141395232737 亏损: -689.4566199948298 最大盈利: 455.91 最大亏损: -610.81 总收益: -233.54 平均盈利: -77.85 typeA: -25.95 胜率: 33.33%
趋势多且增强-11 总交易次数: 4 盈利: 23.806413183758202 亏损: -74.77038960190664 最大盈利: 23.81 最大亏损: -41.94 总收益: -50.96 平均盈利: -12.74 typeA: -3.19 胜率: 25.00%
趋势多且增强-L3-1-3 总交易次数: 1 盈利: 0 亏损: -4.555072834141611 最大盈利: -4.56 最大亏损: -4.56 总收益: -4.56 平均盈利: -4.56 typeA: 0.00 胜率: 0.00%
趋势多且增强-L-4-2-2 总交易次数: 1 盈利: 0 亏损: -98.37848807711781 最大盈利: -98.38 最大亏损: -98.38 总收益: -98.38 平均盈利: -98.38 typeA: 0.00 胜率: 0.00%
趋势多且增强-L3-1-4-1 总交易次数: 1 盈利: 0 亏损: -107.60872008090756 最大盈利: -107.61 最大亏损: -107.61 总收益: -107.61 平均盈利: -107.61 typeA: 0.00 胜率: 0.00%
趋势空且增强-L3-1-6 总交易次数: 1 盈利: 0 亏损: -69.00011164452421 最大盈利: -69.00 最大亏损: -69.00 总收益: -69.00 平均盈利: -69.00 typeA: 0.00 胜率: 0.00%
趋势空且增强-2 总交易次数: 1 盈利: 0 亏损: -36.874476987448006 最大盈利: -36.87 最大亏损: -36.87 总收益: -36.87 平均盈利: -36.87 typeA: 0.00 胜率: 0.00%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     108
      胜率:          57.41%
      总收益:        -309.99 USDT
      期末余额:      9472.01 USDT
      盈亏比:        0.94
      最大单笔盈利:  327.08
      最大单笔亏损:  -897.70
      手续费:       433.93951688348886
      =============================
    
profit: -527.9871524964401
maxDrawdown 14.5%
startTime: 2023-12-17 00:00:00
趋势多且增强-R-2-1 总交易次数: 1 盈利: 76.2537232307858 亏损: 0 最大盈利: 76.25 最大亏损: 76.25 总收益: 76.25 平均盈利: 76.25 typeA: 76.25 胜率: 100.00%
趋势多且增强-L1-3-1 总交易次数: 1 盈利: 118.09284709447027 亏损: 0 最大盈利: 118.09 最大亏损: 118.09 总收益: 118.09 平均盈利: 118.09 typeA: 118.09 胜率: 100.00%
趋势多且增强-L-4-2-4 总交易次数: 1 盈利: 25.651100946708887 亏损: 0 最大盈利: 25.65 最大亏损: 25.65 总收益: 25.65 平均盈利: 25.65 typeA: 25.65 胜率: 100.00%
趋势多且增强-L-4-3-2 总交易次数: 1 盈利: 62.15355680938126 亏损: 0 最大盈利: 62.15 最大亏损: 62.15 总收益: 62.15 平均盈利: 62.15 typeA: 62.15 胜率: 100.00%
趋势多且增强-R-2-2 总交易次数: 1 盈利: 228.32596319343378 亏损: 0 最大盈利: 228.33 最大亏损: 228.33 总收益: 228.33 平均盈利: 228.33 typeA: 228.33 胜率: 100.00%
趋势空且增强-L2-2-3 总交易次数: 1 盈利: 74.82027649769451 亏损: 0 最大盈利: 74.82 最大亏损: 74.82 总收益: 74.82 平均盈利: 74.82 typeA: 74.82 胜率: 100.00%
趋势多且增强-L3-1-4-1 总交易次数: 1 盈利: 39.72682433286923 亏损: 0 最大盈利: 39.73 最大亏损: 39.73 总收益: 39.73 平均盈利: 39.73 typeA: 39.73 胜率: 100.00%
趋势多且增强-L-4-2-2 总交易次数: 1 盈利: 137.55565895079593 亏损: 0 最大盈利: 137.56 最大亏损: 137.56 总收益: 137.56 平均盈利: 137.56 typeA: 137.56 胜率: 100.00%
趋势多且增强-L3-1-5 总交易次数: 6 盈利: 442.6397790255561 亏损: -5.297130922282319 最大盈利: 229.34 最大亏损: -5.30 总收益: 437.34 平均盈利: 72.89 typeA: 60.74 胜率: 83.33%
趋势多且增强-L3-1-4-3 总交易次数: 12 盈利: 393.45462402302616 亏损: -368.91709771315044 最大盈利: 144.09 最大亏损: -323.96 总收益: 24.54 平均盈利: 2.04 typeA: 1.53 胜率: 75.00%
趋势空且增强-L2-3-4 总交易次数: 18 盈利: 282.5613397706026 亏损: -195.20366118787854 最大盈利: 53.54 最大亏损: -69.70 总收益: 87.36 平均盈利: 4.85 typeA: 3.50 胜率: 72.22%
趋势空且增强-L2-3-3 总交易次数: 10 盈利: 626.5324149402793 亏损: -67.24415022714919 最大盈利: 233.42 最大亏损: -28.74 总收益: 559.29 平均盈利: 55.93 typeA: 39.15 胜率: 70.00%
趋势空且增强-11 总交易次数: 3 盈利: 572.5696196083584 亏损: -897.701492537314 最大盈利: 327.08 最大亏损: -897.70 总收益: -325.13 平均盈利: -108.38 typeA: -72.26 胜率: 66.67%
趋势多且增强-R-1-1-2 总交易次数: 3 盈利: 471.0348306998088 亏损: -172.06335510908326 最大盈利: 279.89 最大亏损: -172.06 总收益: 298.97 平均盈利: 99.66 typeA: 66.44 胜率: 66.67%
趋势空且增强-L3-1-6 总交易次数: 2 盈利: 96.1634307659488 亏损: -21.90695360119337 最大盈利: 96.16 最大亏损: -21.91 总收益: 74.26 平均盈利: 37.13 typeA: 18.56 胜率: 50.00%
趋势多且增强-L1-3-2 总交易次数: 2 盈利: 24.908170954892906 亏损: -157.5963645418328 最大盈利: 24.91 最大亏损: -157.60 总收益: -132.69 平均盈利: -66.34 typeA: -33.17 胜率: 50.00%
趋势多且增强-L-4-3-3 总交易次数: 4 盈利: 166.67190679320004 亏损: -72.35326997888492 最大盈利: 163.73 最大亏损: -37.63 总收益: 94.32 平均盈利: 23.58 typeA: 11.79 胜率: 50.00%
趋势多且增强-R-3-1 总交易次数: 7 盈利: 329.05669608071014 亏损: -1201.575514800339 最大盈利: 240.02 最大亏损: -837.68 总收益: -872.52 平均盈利: -124.65 typeA: -53.42 胜率: 42.86%
趋势空且增强-L2-3-5 总交易次数: 7 盈利: 63.87201005554945 亏损: -512.2580238191762 最大盈利: 45.14 最大亏损: -173.75 总收益: -448.39 平均盈利: -64.06 typeA: -27.45 胜率: 42.86%
趋势多且增强-L1-3-4 总交易次数: 5 盈利: 28.97612105242299 亏损: -231.09476925195366 最大盈利: 15.90 最大亏损: -90.25 总收益: -202.12 平均盈利: -40.42 typeA: -16.17 胜率: 40.00%
趋势多且增强-L-4-3-4 总交易次数: 13 盈利: 319.7519983221256 亏损: -197.9653157078825 最大盈利: 281.11 最大亏损: -50.14 总收益: 121.79 平均盈利: 9.37 typeA: 2.16 胜率: 23.08%
趋势多且增强-11 总交易次数: 5 盈利: 142.17862336403425 亏损: -439.6296200507875 最大盈利: 142.18 最大亏损: -298.36 总收益: -297.45 平均盈利: -59.49 typeA: -11.90 胜率: 20.00%
趋势多且增强-L-4-2-3 总交易次数: 3 盈利: 0 亏损: -492.13194956019026 最大盈利: -120.53 最大亏损: -246.59 总收益: -492.13 平均盈利: -164.04 typeA: 0.00 胜率: 0.00%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     68
      胜率:          48.53%
      总收益:        1463.37 USDT
      期末余额:      11327.37 USDT
      盈亏比:        1.80
      最大单笔盈利:  841.46
      最大单笔亏损:  -385.53
      手续费:       272.15446414725096
      =============================
    
profit: 1327.3695089892317
maxDrawdown 5.2%
startTime: 2024-01-16 00:00:00
趋势多且增强-L-4-2-3 总交易次数: 1 盈利: 52.98324593937841 亏损: 0 最大盈利: 52.98 最大亏损: 52.98 总收益: 52.98 平均盈利: 52.98 typeA: 52.98 胜率: 100.00%
趋势空且增强-11 总交易次数: 1 盈利: 195.01660059464746 亏损: 0 最大盈利: 195.02 最大亏损: 195.02 总收益: 195.02 平均盈利: 195.02 typeA: 195.02 胜率: 100.00%
趋势多且增强-L3-1-4-1 总交易次数: 1 盈利: 149.72981714143535 亏损: 0 最大盈利: 149.73 最大亏损: 149.73 总收益: 149.73 平均盈利: 149.73 typeA: 149.73 胜率: 100.00%
趋势多且增强-L3-1-5 总交易次数: 3 盈利: 438.54674870189586 亏损: 0 最大盈利: 400.73 最大亏损: 18.21 总收益: 438.55 平均盈利: 146.18 typeA: 146.18 胜率: 100.00%
趋势空且增强-L3-1-6 总交易次数: 6 盈利: 634.974799535526 亏损: -41.450758042647706 最大盈利: 163.28 最大亏损: -41.45 总收益: 593.52 平均盈利: 98.92 typeA: 82.43 胜率: 83.33%
趋势多且增强-L3-1-3 总交易次数: 3 盈利: 111.71369539169261 亏损: -9.365009208101979 最大盈利: 86.25 最大亏损: -9.37 总收益: 102.35 平均盈利: 34.12 typeA: 22.75 胜率: 66.67%
趋势多且增强-L-4-3-3 总交易次数: 8 盈利: 1150.445379522999 亏损: -84.71425811474496 最大盈利: 841.46 最大亏损: -41.18 总收益: 1065.73 平均盈利: 133.22 typeA: 83.26 胜率: 62.50%
趋势多且增强-L3-1-4-3 总交易次数: 9 盈利: 218.8542660959629 亏损: -109.74534989791852 最大盈利: 203.48 最大亏损: -30.96 总收益: 109.11 平均盈利: 12.12 typeA: 5.39 胜率: 44.44%
趋势多且增强-L-4-3-4 总交易次数: 13 盈利: 188.42197028117778 亏损: -524.3396154126176 最大盈利: 96.66 最大亏损: -385.53 总收益: -335.92 平均盈利: -25.84 typeA: -9.94 胜率: 38.46%
趋势空且增强-L2-3-5 总交易次数: 8 盈利: 31.23960924738506 亏损: -109.63386269205786 最大盈利: 16.47 最大亏损: -53.43 总收益: -78.39 平均盈利: -9.80 typeA: -3.67 胜率: 37.50%
趋势空且增强-L2-3-4 总交易次数: 4 盈利: 17.185421994886347 亏损: -216.77978665312727 最大盈利: 17.19 最大亏损: -201.43 总收益: -199.59 平均盈利: -49.90 typeA: -12.47 胜率: 25.00%
趋势空且增强-L2-3-3 总交易次数: 4 盈利: 102.43653289722117 亏损: -245.30421811720743 最大盈利: 102.44 最大亏损: -177.36 总收益: -142.87 平均盈利: -35.72 typeA: -8.93 胜率: 25.00%
趋势多且增强-R-3-1 总交易次数: 5 盈利: 1.869195046438128 亏损: -349.5668180278339 最大盈利: 1.87 最大亏损: -253.43 总收益: -347.70 平均盈利: -69.54 typeA: -13.91 胜率: 20.00%
趋势多且增强-L-4-2-4 总交易次数: 1 盈利: 0 亏损: -88.79017704169009 最大盈利: -88.79 最大亏损: -88.79 总收益: -88.79 平均盈利: -88.79 typeA: 0.00 胜率: 0.00%
趋势多且增强-L1-3-4 总交易次数: 1 盈利: 0 亏损: -50.35792019347008 最大盈利: -50.36 最大亏损: -50.36 总收益: -50.36 平均盈利: -50.36 typeA: 0.00 胜率: 0.00%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     98
      胜率:          48.98%
      总收益:        5818.06 USDT
      期末余额:      15620.06 USDT
      盈亏比:        1.72
      最大单笔盈利:  2533.05
      最大单笔亏损:  -643.03
      手续费:       394.2612485187662
      =============================
    
profit: 5620.060836375702
maxDrawdown 14.0%
startTime: 2024-02-15 00:00:00
趋势多且增强-L3-1-3 总交易次数: 3 盈利: 514.0236868968142 亏损: 0 最大盈利: 429.86 最大亏损: 37.09 总收益: 514.02 平均盈利: 171.34 typeA: 171.34 胜率: 100.00%
趋势多且增强-R-3-1 总交易次数: 2 盈利: 107.96723280232678 亏损: 0 最大盈利: 103.96 最大亏损: 4.00 总收益: 107.97 平均盈利: 53.98 typeA: 53.98 胜率: 100.00%
趋势多且增强-L-4-2-3 总交易次数: 1 盈利: 73.51705195696886 亏损: 0 最大盈利: 73.52 最大亏损: 73.52 总收益: 73.52 平均盈利: 73.52 typeA: 73.52 胜率: 100.00%
趋势多且增强-R-2-1 总交易次数: 1 盈利: 169.65994992249873 亏损: 0 最大盈利: 169.66 最大亏损: 169.66 总收益: 169.66 平均盈利: 169.66 typeA: 169.66 胜率: 100.00%
趋势多且增强-L1-3-2 总交易次数: 1 盈利: 880.2755136409572 亏损: 0 最大盈利: 880.28 最大亏损: 880.28 总收益: 880.28 平均盈利: 880.28 typeA: 880.28 胜率: 100.00%
趋势空且增强-L1-1-2 总交易次数: 1 盈利: 182.87507270729665 亏损: 0 最大盈利: 182.88 最大亏损: 182.88 总收益: 182.88 平均盈利: 182.88 typeA: 182.88 胜率: 100.00%
趋势空且增强-L3-1-6 总交易次数: 2 盈利: 2734.3351506929275 亏损: 0 最大盈利: 2533.05 最大亏损: 201.29 总收益: 2734.34 平均盈利: 1367.17 typeA: 1367.17 胜率: 100.00%
趋势多且增强-R-1-2-2 总交易次数: 1 盈利: 133.77988868274568 亏损: 0 最大盈利: 133.78 最大亏损: 133.78 总收益: 133.78 平均盈利: 133.78 typeA: 133.78 胜率: 100.00%
趋势多且增强-L1-1-6 总交易次数: 1 盈利: 361.6097066463914 亏损: 0 最大盈利: 361.61 最大亏损: 361.61 总收益: 361.61 平均盈利: 361.61 typeA: 361.61 胜率: 100.00%
趋势多且增强-L3-1-5 总交易次数: 1 盈利: 71.81919683054258 亏损: 0 最大盈利: 71.82 最大亏损: 71.82 总收益: 71.82 平均盈利: 71.82 typeA: 71.82 胜率: 100.00%
趋势多且增强-L3-1-4-3 总交易次数: 4 盈利: 184.51247672017098 亏损: -29.545999041685928 最大盈利: 138.64 最大亏损: -29.55 总收益: 154.97 平均盈利: 38.74 typeA: 29.06 胜率: 75.00%
趋势多且增强-11 总交易次数: 8 盈利: 1704.437273282099 亏损: -307.6823216054339 最大盈利: 489.36 最大亏损: -229.51 总收益: 1396.75 平均盈利: 174.59 typeA: 130.95 胜率: 75.00%
趋势空且增强-11 总交易次数: 3 盈利: 122.66411383132433 亏损: -639.3749050584846 最大盈利: 73.89 最大亏损: -639.37 总收益: -516.71 平均盈利: -172.24 typeA: -114.83 胜率: 66.67%
趋势多且增强-L3-1-4-1 总交易次数: 9 盈利: 1207.470343003698 亏损: -816.4753469105573 最大盈利: 603.27 最大亏损: -439.62 总收益: 390.99 平均盈利: 43.44 typeA: 28.96 胜率: 66.67%
趋势空且增强-L2-3-5 总交易次数: 2 盈利: 15.939734545019416 亏损: -6.65317515701307 最大盈利: 15.94 最大亏损: -6.65 总收益: 9.29 平均盈利: 4.64 typeA: 2.32 胜率: 50.00%
趋势空且增强-L2-2-3 总交易次数: 2 盈利: 562.1186420053541 亏损: -9.952521581099571 最大盈利: 562.12 最大亏损: -9.95 总收益: 552.17 平均盈利: 276.08 typeA: 138.04 胜率: 50.00%
趋势空且增强-L2-3-4 总交易次数: 11 盈利: 606.2375009815837 亏损: -777.1429723126961 最大盈利: 463.16 最大亏损: -428.73 总收益: -170.91 平均盈利: -15.54 typeA: -7.06 胜率: 45.45%
趋势多且增强-L-4-1-4 总交易次数: 5 盈利: 1145.8788393832426 亏损: -334.59545784593587 最大盈利: 898.64 最大亏损: -173.00 总收益: 811.28 平均盈利: 162.26 typeA: 64.90 胜率: 40.00%
趋势空且增强-L2-3-3 总交易次数: 7 盈利: 627.658528503478 亏损: -995.1935878246463 最大盈利: 443.73 最大亏损: -412.65 总收益: -367.54 平均盈利: -52.51 typeA: -15.00 胜率: 28.57%
趋势多且增强-L-4-3-4 总交易次数: 12 盈利: 391.8203410437244 亏损: -305.37222875746977 最大盈利: 259.80 最大亏损: -65.93 总收益: 86.45 平均盈利: 7.20 typeA: 1.80 胜率: 25.00%
趋势多且增强-L1-3-4 总交易次数: 4 盈利: 47.96675964667594 亏损: -390.4118774125964 最大盈利: 47.97 最大亏损: -225.54 总收益: -342.45 平均盈利: -85.61 typeA: -21.40 胜率: 25.00%
趋势多且增强-R-1-1-2 总交易次数: 4 盈利: 548.6220033691853 亏损: -406.4286434681884 最大盈利: 548.62 最大亏损: -275.00 总收益: 142.19 平均盈利: 35.55 typeA: 8.89 胜率: 25.00%
趋势空且增强-2 总交易次数: 6 盈利: 1485.8050852131703 亏损: -1622.8061130654826 最大盈利: 1485.81 最大亏损: -643.03 总收益: -137.00 平均盈利: -22.83 typeA: -3.81 胜率: 16.67%
趋势多且增强-L-4-3-2 总交易次数: 1 盈利: 0 亏损: -63.29485251590546 最大盈利: -63.29 最大亏损: -63.29 总收益: -63.29 平均盈利: -63.29 typeA: 0.00 胜率: 0.00%
趋势多且增强-L-4-3-3 总交易次数: 2 盈利: 0 亏损: -262.8454786000425 最大盈利: -25.88 最大亏损: -236.96 总收益: -262.85 平均盈利: -131.42 typeA: 0.00 胜率: 0.00%
趋势多且增强-L-4-1-3 总交易次数: 3 盈利: 0 亏损: -964.9887537905239 最大盈利: -154.06 最大亏损: -626.15 总收益: -964.99 平均盈利: -321.66 typeA: 0.00 胜率: 0.00%
趋势多且增强-L1-2-5 总交易次数: 1 盈利: 0 亏损: -130.16902098473113 最大盈利: -130.17 最大亏损: -130.17 总收益: -130.17 平均盈利: -130.17 typeA: 0.00 胜率: 0.00%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     100
      胜率:          49.00%
      总收益:        1149.38 USDT
      期末余额:      10949.38 USDT
      盈亏比:        1.13
      最大单笔盈利:  993.07
      最大单笔亏损:  -865.30
      手续费:       399.7906321376459
      =============================
    
profit: 949.378408292012
maxDrawdown 15.8%
startTime: 2024-03-16 00:00:00
趋势空且增强-L2-2-3 总交易次数: 2 盈利: 331.21703696883856 亏损: 0 最大盈利: 179.23 最大亏损: 151.99 总收益: 331.22 平均盈利: 165.61 typeA: 165.61 胜率: 100.00%
趋势多且增强-L-4-1-2 总交易次数: 1 盈利: 277.0320416200708 亏损: 0 最大盈利: 277.03 最大亏损: 277.03 总收益: 277.03 平均盈利: 277.03 typeA: 277.03 胜率: 100.00%
趋势多且增强-L1-2-2 总交易次数: 1 盈利: 37.65109176277439 亏损: 0 最大盈利: 37.65 最大亏损: 37.65 总收益: 37.65 平均盈利: 37.65 typeA: 37.65 胜率: 100.00%
趋势多且增强-R-1-1-1 总交易次数: 3 盈利: 380.6255500725343 亏损: 0 最大盈利: 279.12 最大亏损: 4.96 总收益: 380.63 平均盈利: 126.88 typeA: 126.88 胜率: 100.00%
趋势空且增强-L2-1-3 总交易次数: 1 盈利: 37.755889481338585 亏损: 0 最大盈利: 37.76 最大亏损: 37.76 总收益: 37.76 平均盈利: 37.76 typeA: 37.76 胜率: 100.00%
趋势多且增强-L3-1-4-1 总交易次数: 8 盈利: 899.2363425053403 亏损: -64.2867711476688 最大盈利: 639.21 最大亏损: -64.29 总收益: 834.95 平均盈利: 104.37 typeA: 91.32 胜率: 87.50%
趋势多且增强-L1-1-6 总交易次数: 3 盈利: 527.9179292561093 亏损: -110.87864724532386 最大盈利: 458.04 最大亏损: -110.88 总收益: 417.04 平均盈利: 139.01 typeA: 92.68 胜率: 66.67%
趋势多且增强-11 总交易次数: 8 盈利: 2406.5757286738976 亏损: -660.5356030692269 最大盈利: 993.07 最大亏损: -336.23 总收益: 1746.04 平均盈利: 218.26 typeA: 136.41 胜率: 62.50%
趋势空且增强-11 总交易次数: 5 盈利: 674.2928839304774 亏损: -50.27387869126431 最大盈利: 253.32 最大亏损: -36.49 总收益: 624.02 平均盈利: 124.80 typeA: 74.88 胜率: 60.00%
趋势空且增强-L2-3-3 总交易次数: 7 盈利: 332.4178398050664 亏损: -405.8259156007564 最大盈利: 98.28 最大亏损: -176.70 总收益: -73.41 平均盈利: -10.49 typeA: -5.99 胜率: 57.14%
趋势空且增强-L2-3-4 总交易次数: 2 盈利: 62.4850613271836 亏损: -49.54326260677846 最大盈利: 62.49 最大亏损: -49.54 总收益: 12.94 平均盈利: 6.47 typeA: 3.24 胜率: 50.00%
趋势空且增强-L2-3-5 总交易次数: 2 盈利: 717.9680592524018 亏损: -146.9897001602207 最大盈利: 717.97 最大亏损: -146.99 总收益: 570.98 平均盈利: 285.49 typeA: 142.74 胜率: 50.00%
趋势多且增强-L3-1-5 总交易次数: 4 盈利: 69.57640019434163 亏损: -170.70976031900088 最大盈利: 43.91 最大亏损: -157.27 总收益: -101.13 平均盈利: -25.28 typeA: -12.64 胜率: 50.00%
趋势空且增强-L1-1-2 总交易次数: 2 盈利: 151.95377769705794 亏损: -21.214380460138305 最大盈利: 151.95 最大亏损: -21.21 总收益: 130.74 平均盈利: 65.37 typeA: 32.68 胜率: 50.00%
趋势多且增强-L1-3-9 总交易次数: 2 盈利: 578.4952543038565 亏损: -418.0905473706848 最大盈利: 578.50 最大亏损: -418.09 总收益: 160.40 平均盈利: 80.20 typeA: 40.10 胜率: 50.00%
趋势空且增强-2 总交易次数: 11 盈利: 730.5234632009058 亏损: -1230.5230972089123 最大盈利: 475.16 最大亏损: -400.57 总收益: -500.00 平均盈利: -45.45 typeA: -20.66 胜率: 45.45%
趋势多且增强-R-1-1-2 总交易次数: 9 盈利: 477.68649773957276 亏损: -1769.6074920252545 最大盈利: 230.69 最大亏损: -865.30 总收益: -1291.92 平均盈利: -143.55 typeA: -63.79 胜率: 44.44%
趋势多且增强-L-4-1-3 总交易次数: 7 盈利: 916.3900409018017 亏损: -453.8966302049985 最大盈利: 438.02 最大亏损: -195.39 总收益: 462.49 平均盈利: 66.07 typeA: 28.32 胜率: 42.86%
趋势多且增强-L1-2-5 总交易次数: 3 盈利: 283.4536108707824 亏损: -396.978558776789 最大盈利: 283.45 最大亏损: -260.37 总收益: -113.52 平均盈利: -37.84 typeA: -12.61 胜率: 33.33%
趋势多且增强-L-4-1-4 总交易次数: 8 盈利: 93.7567402978454 亏损: -446.4629480630465 最大盈利: 93.76 最大亏损: -152.66 总收益: -352.71 平均盈利: -44.09 typeA: -5.51 胜率: 12.50%
趋势多且增强-R-1-2-2 总交易次数: 3 盈利: 0 亏损: -252.28200264419405 最大盈利: -77.29 最大亏损: -88.52 总收益: -252.28 平均盈利: -84.09 typeA: 0.00 胜率: 0.00%
趋势多且增强-L3-1-3 总交易次数: 5 盈利: 0 亏损: -1438.2583174160704 最大盈利: -8.56 最大亏损: -695.46 总收益: -1438.26 平均盈利: -287.65 typeA: 0.00 胜率: 0.00%
趋势多且增强-L3-1-4-3 总交易次数: 1 盈利: 0 亏损: -136.86032065313873 最大盈利: -136.86 最大亏损: -136.86 总收益: -136.86 平均盈利: -136.86 typeA: 0.00 胜率: 0.00%
趋势多且增强-L1-3-4 总交易次数: 1 盈利: 0 亏损: -39.95230679384869 最大盈利: -39.95 最大亏损: -39.95 总收益: -39.95 平均盈利: -39.95 typeA: 0.00 胜率: 0.00%
趋势多且增强-L-4-2-4 总交易次数: 1 盈利: 0 亏损: -574.462691112872 最大盈利: -574.46 最大亏损: -574.46 总收益: -574.46 平均盈利: -574.46 typeA: 0.00 胜率: 0.00%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     105
      胜率:          45.71%
      总收益:        718.25 USDT
      期末余额:      10508.25 USDT
      盈亏比:        1.13
      最大单笔盈利:  778.29
      最大单笔亏损:  -574.46
      手续费:       419.38483777166505
      =============================
    
profit: 508.24787345082404
maxDrawdown 10.1%
startTime: 2024-04-15 00:00:00
趋势多且增强-11 总交易次数: 4 盈利: 325.77404395082755 亏损: 0 最大盈利: 152.12 最大亏损: 17.65 总收益: 325.77 平均盈利: 81.44 typeA: 81.44 胜率: 100.00%
趋势空且增强-L2-3-3 总交易次数: 4 盈利: 391.5987990948789 亏损: 0 最大盈利: 180.44 最大亏损: 29.58 总收益: 391.60 平均盈利: 97.90 typeA: 97.90 胜率: 100.00%
趋势空且增强-L2-3-5 总交易次数: 4 盈利: 228.80524355731188 亏损: 0 最大盈利: 130.69 最大亏损: 23.09 总收益: 228.81 平均盈利: 57.20 typeA: 57.20 胜率: 100.00%
趋势多且增强-L1-3-4 总交易次数: 1 盈利: 166.59691182446107 亏损: 0 最大盈利: 166.60 最大亏损: 166.60 总收益: 166.60 平均盈利: 166.60 typeA: 166.60 胜率: 100.00%
趋势空且增强-L2-1-3 总交易次数: 1 盈利: 97.80946441100829 亏损: 0 最大盈利: 97.81 最大亏损: 97.81 总收益: 97.81 平均盈利: 97.81 typeA: 97.81 胜率: 100.00%
趋势多且增强-L1-2-1 总交易次数: 1 盈利: 766.7169887009416 亏损: 0 最大盈利: 766.72 最大亏损: 766.72 总收益: 766.72 平均盈利: 766.72 typeA: 766.72 胜率: 100.00%
趋势空且增强-11 总交易次数: 8 盈利: 849.9495738446402 亏损: -430.72734760042744 最大盈利: 361.82 最大亏损: -290.06 总收益: 419.22 平均盈利: 52.40 typeA: 39.30 胜率: 75.00%
趋势空且增强-L2-3-4 总交易次数: 6 盈利: 659.3098376051614 亏损: -234.6899792401706 最大盈利: 506.21 最大亏损: -133.60 总收益: 424.62 平均盈利: 70.77 typeA: 47.18 胜率: 66.67%
趋势空且增强-2 总交易次数: 8 盈利: 309.1816731539925 亏损: -266.80364312070174 最大盈利: 159.95 最大亏损: -207.23 总收益: 42.38 平均盈利: 5.30 typeA: 3.31 胜率: 62.50%
趋势多且增强-L3-1-5 总交易次数: 5 盈利: 135.57784197142905 亏损: -445.9479743482118 最大盈利: 50.80 最大亏损: -390.73 总收益: -310.37 平均盈利: -62.07 typeA: -37.24 胜率: 60.00%
趋势多且增强-R-1-1-2 总交易次数: 9 盈利: 914.590710858635 亏损: -525.1746585410045 最大盈利: 778.29 最大亏损: -204.38 总收益: 389.42 平均盈利: 43.27 typeA: 19.23 胜率: 44.44%
趋势空且增强-L3-1-6 总交易次数: 3 盈利: 399.05625535843666 亏损: -69.36760623066728 最大盈利: 399.06 最大亏损: -37.58 总收益: 329.69 平均盈利: 109.90 typeA: 36.63 胜率: 33.33%
趋势多且增强-R-1-2-2 总交易次数: 3 盈利: 20.616711437861373 亏损: -260.64003953715616 最大盈利: 20.62 最大亏损: -248.06 总收益: -240.02 平均盈利: -80.01 typeA: -26.67 胜率: 33.33%
趋势多且增强-L-4-1-3 总交易次数: 7 盈利: 92.66525261152381 亏损: -282.81253015109866 最大盈利: 50.64 最大亏损: -103.41 总收益: -190.15 平均盈利: -27.16 typeA: -7.76 胜率: 28.57%
趋势多且增强-L3-1-4-3 总交易次数: 7 盈利: 43.00073845590789 亏损: -522.240819106059 最大盈利: 25.68 最大亏损: -443.63 总收益: -479.24 平均盈利: -68.46 typeA: -19.56 胜率: 28.57%
趋势多且增强-L-4-1-4 总交易次数: 4 盈利: 268.7996074582909 亏损: -183.26905658927282 最大盈利: 268.80 最大亏损: -99.32 总收益: 85.53 平均盈利: 21.38 typeA: 5.35 胜率: 25.00%
趋势多且增强-L-4-2-4 总交易次数: 9 盈利: 212.13247675813653 亏损: -912.5668335913294 最大盈利: 170.09 最大亏损: -574.46 总收益: -700.43 平均盈利: -77.83 typeA: -17.29 胜率: 22.22%
趋势多且增强-L3-1-4-1 总交易次数: 5 盈利: 242.285956528442 亏损: -356.46989578516735 最大盈利: 242.29 最大亏损: -244.37 总收益: -114.18 平均盈利: -22.84 typeA: -4.57 胜率: 20.00%
趋势多且增强-L-4-3-4 总交易次数: 7 盈利: 171.03042373463518 亏损: -239.77066637699812 最大盈利: 171.03 最大亏损: -81.57 总收益: -68.74 平均盈利: -9.82 typeA: -1.40 胜率: 14.29%
趋势多且增强-L-4-1-2 总交易次数: 1 盈利: 0 亏损: -313.10150647983767 最大盈利: -313.10 最大亏损: -313.10 总收益: -313.10 平均盈利: -313.10 typeA: 0.00 胜率: 0.00%
趋势多且增强-L1-3-1 总交易次数: 1 盈利: 0 亏损: -40.1979295045606 最大盈利: -40.20 最大亏损: -40.20 总收益: -40.20 平均盈利: -40.20 typeA: 0.00 胜率: 0.00%
趋势多且增强-L-4-2-3 总交易次数: 2 盈利: 0 亏损: -77.15016558569482 最大盈利: -26.34 最大亏损: -50.81 总收益: -77.15 平均盈利: -38.58 typeA: 0.00 胜率: 0.00%
趋势多且增强-L1-3-2 总交易次数: 1 盈利: 0 亏损: -60.70189484921401 最大盈利: -60.70 最大亏损: -60.70 总收益: -60.70 平均盈利: -60.70 typeA: 0.00 胜率: 0.00%
趋势多且增强-R-2-1 总交易次数: 1 盈利: 0 亏损: -96.50676640598265 最大盈利: -96.51 最大亏损: -96.51 总收益: -96.51 平均盈利: -96.51 typeA: 0.00 胜率: 0.00%
趋势多且增强-R-2-2 总交易次数: 1 盈利: 0 亏损: -162.39204076012112 最大盈利: -162.39 最大亏损: -162.39 总收益: -162.39 平均盈利: -162.39 typeA: 0.00 胜率: 0.00%
趋势多且增强-L1-2-5 总交易次数: 1 盈利: 0 亏损: -46.6145646110938 最大盈利: -46.61 最大亏损: -46.61 总收益: -46.61 平均盈利: -46.61 typeA: 0.00 胜率: 0.00%
趋势多且增强-R-3-1 总交易次数: 1 盈利: 0 亏损: -50.104719450931434 最大盈利: -50.10 最大亏损: -50.10 总收益: -50.10 平均盈利: -50.10 typeA: 0.00 胜率: 0.00%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     104
      胜率:          49.04%
      总收益:        -448.82 USDT
      期末余额:      9343.18 USDT
      盈亏比:        0.92
      最大单笔盈利:  467.95
      最大单笔亏损:  -572.47
      手续费:       416.336966082268
      =============================
    
profit: -656.8204319969664
maxDrawdown 18.6%
startTime: 2024-05-15 00:00:00
趋势多且增强-L3-1-3 总交易次数: 2 盈利: 185.90625913646616 亏损: 0 最大盈利: 171.22 最大亏损: 14.69 总收益: 185.91 平均盈利: 92.95 typeA: 92.95 胜率: 100.00%
趋势多且增强-L1-2-1 总交易次数: 1 盈利: 273.2024276606193 亏损: 0 最大盈利: 273.20 最大亏损: 273.20 总收益: 273.20 平均盈利: 273.20 typeA: 273.20 胜率: 100.00%
趋势多且增强-L-4-1-3 总交易次数: 1 盈利: 123.87085115354549 亏损: 0 最大盈利: 123.87 最大亏损: 123.87 总收益: 123.87 平均盈利: 123.87 typeA: 123.87 胜率: 100.00%
趋势多且增强-R-1-1-1 总交易次数: 1 盈利: 38.04539385847891 亏损: 0 最大盈利: 38.05 最大亏损: 38.05 总收益: 38.05 平均盈利: 38.05 typeA: 38.05 胜率: 100.00%
趋势多且增强-11 总交易次数: 8 盈利: 543.6766267865912 亏损: -151.12835285833165 最大盈利: 151.55 最大亏损: -151.13 总收益: 392.55 平均盈利: 49.07 typeA: 42.93 胜率: 87.50%
趋势空且增强-L2-3-3 总交易次数: 8 盈利: 739.1058811323564 亏损: -188.50046449900512 最大盈利: 467.95 最大亏损: -188.50 总收益: 550.61 平均盈利: 68.83 typeA: 60.22 胜率: 87.50%
趋势多且增强-R-1-1-2 总交易次数: 4 盈利: 274.1629863864641 亏损: -572.4718553660738 最大盈利: 167.91 最大亏损: -572.47 总收益: -298.31 平均盈利: -74.58 typeA: -55.93 胜率: 75.00%
趋势空且增强-L2-3-5 总交易次数: 7 盈利: 231.46211680426188 亏损: -80.80721914274528 最大盈利: 115.72 最大亏损: -52.72 总收益: 150.65 平均盈利: 21.52 typeA: 15.37 胜率: 71.43%
趋势多且增强-L3-1-4-3 总交易次数: 10 盈利: 583.4832428353293 亏损: -324.7301521225734 最大盈利: 443.08 最大亏损: -186.22 总收益: 258.75 平均盈利: 25.88 typeA: 18.11 胜率: 70.00%
趋势多且增强-L-4-2-4 总交易次数: 3 盈利: 284.21416844354 亏损: -51.03718879989975 最大盈利: 221.36 最大亏损: -51.04 总收益: 233.18 平均盈利: 77.73 typeA: 51.82 胜率: 66.67%
趋势多且增强-R-2-1 总交易次数: 5 盈利: 497.6515882022246 亏损: -59.38661324733617 最大盈利: 226.27 最大亏损: -36.75 总收益: 438.26 平均盈利: 87.65 typeA: 52.59 胜率: 60.00%
趋势多且增强-L3-1-5 总交易次数: 4 盈利: 260.1216016157327 亏损: -133.56674352242416 最大盈利: 236.05 最大亏损: -109.14 总收益: 126.55 平均盈利: 31.64 typeA: 15.82 胜率: 50.00%
趋势空且增强-L2-1-3 总交易次数: 2 盈利: 59.78474697077769 亏损: -4.455683771175085 最大盈利: 59.78 最大亏损: -4.46 总收益: 55.33 平均盈利: 27.66 typeA: 13.83 胜率: 50.00%
趋势多且增强-L1-3-9 总交易次数: 2 盈利: 118.75025793530325 亏损: -46.21250149396383 最大盈利: 118.75 最大亏损: -46.21 总收益: 72.54 平均盈利: 36.27 typeA: 18.13 胜率: 50.00%
趋势空且增强-11 总交易次数: 5 盈利: 310.72963390942056 亏损: -922.3701631068709 最大盈利: 240.59 最大亏损: -532.71 总收益: -611.64 平均盈利: -122.33 typeA: -48.93 胜率: 40.00%
趋势多且增强-L-4-2-3 总交易次数: 6 盈利: 109.81153716242792 亏损: -485.8229704568133 最大盈利: 94.58 最大亏损: -286.51 总收益: -376.01 平均盈利: -62.67 typeA: -20.89 胜率: 33.33%
趋势多且增强-L3-1-4-1 总交易次数: 3 盈利: 21.221971123666616 亏损: -114.6949835420686 最大盈利: 21.22 最大亏损: -64.50 总收益: -93.47 平均盈利: -31.16 typeA: -10.38 胜率: 33.33%
趋势多且增强-L1-3-4 总交易次数: 5 盈利: 165.69346443030662 亏损: -475.5216911195414 最大盈利: 165.69 最大亏损: -176.85 总收益: -309.83 平均盈利: -61.97 typeA: -12.39 胜率: 20.00%
趋势空且增强-L2-3-4 总交易次数: 7 盈利: 14.349302150132669 亏损: -423.9225574549927 最大盈利: 14.35 最大亏损: -133.27 总收益: -409.57 平均盈利: -58.51 typeA: -8.36 胜率: 14.29%
趋势多且增强-L-4-3-4 总交易次数: 8 盈利: 113.50403255104324 亏损: -263.608413987825 最大盈利: 113.50 最大亏损: -85.08 总收益: -150.10 平均盈利: -18.76 typeA: -2.35 胜率: 12.50%
趋势空且增强-2 总交易次数: 3 盈利: 0 亏损: -171.38141975075604 最大盈利: -37.83 最大亏损: -93.63 总收益: -171.38 平均盈利: -57.13 typeA: 0.00 胜率: 0.00%
趋势多且增强-L-4-1-4 总交易次数: 2 盈利: 0 亏损: -132.84012023310666 最大盈利: -40.61 最大亏损: -92.23 总收益: -132.84 平均盈利: -66.42 typeA: 0.00 胜率: 0.00%
趋势空且增强-L3-1-6 总交易次数: 3 盈利: 0 亏损: -596.8436432562388 最大盈利: -41.97 最大亏损: -386.36 总收益: -596.84 平均盈利: -198.95 typeA: 0.00 胜率: 0.00%
趋势多且增强-L1-2-5 总交易次数: 1 盈利: 0 亏损: -77.20773058673738 最大盈利: -77.21 最大亏损: -77.21 总收益: -77.21 平均盈利: -77.21 typeA: 0.00 胜率: 0.00%
趋势多且增强-L-4-2-2 总交易次数: 1 盈利: 0 亏损: -37.21075069508725 最大盈利: -37.21 最大亏损: -37.21 总收益: -37.21 平均盈利: -37.21 typeA: 0.00 胜率: 0.00%
趋势多且增强-R-3-1 总交易次数: 1 盈利: 0 亏损: -9.531707985207436 最大盈利: -9.53 最大亏损: -9.53 总收益: -9.53 平均盈利: -9.53 typeA: 0.00 胜率: 0.00%
趋势多且增强-R-1-2-2 总交易次数: 1 盈利: 0 亏损: -74.31559524688232 最大盈利: -74.32 最大亏损: -74.32 总收益: -74.32 平均盈利: -74.32 typeA: 0.00 胜率: 0.00%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     92
      胜率:          48.91%
      总收益:        -284.14 USDT
      期末余额:      9531.86 USDT
      盈亏比:        0.95
      最大单笔盈利:  666.95
      最大单笔亏损:  -912.30
      手续费:       367.9172978992774
      =============================
    
profit: -468.1396247453158
maxDrawdown 16.8%
startTime: 2024-06-14 00:00:00
趋势多且增强-R-1-1-1 总交易次数: 1 盈利: 38.04539385847891 亏损: 0 最大盈利: 38.05 最大亏损: 38.05 总收益: 38.05 平均盈利: 38.05 typeA: 38.05 胜率: 100.00%
趋势空且增强-11 总交易次数: 3 盈利: 522.1760228487443 亏损: 0 最大盈利: 374.46 最大亏损: 13.57 总收益: 522.18 平均盈利: 174.06 typeA: 174.06 胜率: 100.00%
趋势多且增强-L-4-2-2 总交易次数: 2 盈利: 169.94463778320582 亏损: 0 最大盈利: 111.47 最大亏损: 58.48 总收益: 169.94 平均盈利: 84.97 typeA: 84.97 胜率: 100.00%
趋势多且增强-R-3-1 总交易次数: 2 盈利: 125.84840180266018 亏损: 0 最大盈利: 113.99 最大亏损: 11.86 总收益: 125.85 平均盈利: 62.92 typeA: 62.92 胜率: 100.00%
趋势多且增强-L1-3-1 总交易次数: 1 盈利: 229.50688952303267 亏损: 0 最大盈利: 229.51 最大亏损: 229.51 总收益: 229.51 平均盈利: 229.51 typeA: 229.51 胜率: 100.00%
趋势多且增强-L1-3-2 总交易次数: 2 盈利: 950.9131960265195 亏损: 0 最大盈利: 666.95 最大亏损: 283.96 总收益: 950.91 平均盈利: 475.46 typeA: 475.46 胜率: 100.00%
趋势多且增强-R-2-2 总交易次数: 1 盈利: 33.37922318645124 亏损: 0 最大盈利: 33.38 最大亏损: 33.38 总收益: 33.38 平均盈利: 33.38 typeA: 33.38 胜率: 100.00%
趋势多且增强-R-1-2-2 总交易次数: 1 盈利: 297.8647987965399 亏损: 0 最大盈利: 297.86 最大亏损: 297.86 总收益: 297.86 平均盈利: 297.86 typeA: 297.86 胜率: 100.00%
趋势空且增强-L3-1-6 总交易次数: 1 盈利: 201.43050847457624 亏损: 0 最大盈利: 201.43 最大亏损: 201.43 总收益: 201.43 平均盈利: 201.43 typeA: 201.43 胜率: 100.00%
趋势多且增强-R-1-1-2 总交易次数: 9 盈利: 669.0753623492126 亏损: -500.44975650772585 最大盈利: 337.76 最大亏损: -441.88 总收益: 168.63 平均盈利: 18.74 typeA: 14.57 胜率: 77.78%
趋势空且增强-L2-3-5 总交易次数: 4 盈利: 597.47215712174 亏损: -223.6067049173814 最大盈利: 351.91 最大亏损: -160.22 总收益: 373.87 平均盈利: 93.47 typeA: 46.73 胜率: 50.00%
趋势多且增强-R-2-1 总交易次数: 4 盈利: 322.1077062516905 亏损: -959.8859194146589 最大盈利: 212.65 最大亏损: -912.30 总收益: -637.78 平均盈利: -159.44 typeA: -79.72 胜率: 50.00%
趋势多且增强-L-4-2-3 总交易次数: 4 盈利: 268.2663797659587 亏损: -90.89115410721271 最大盈利: 170.08 最大亏损: -64.01 总收益: 177.38 平均盈利: 44.34 typeA: 22.17 胜率: 50.00%
趋势多且增强-L3-1-4-3 总交易次数: 8 盈利: 91.1409768126714 亏损: -458.46837944882213 最大盈利: 55.07 最大亏损: -352.68 总收益: -367.33 平均盈利: -45.92 typeA: -22.96 胜率: 50.00%
趋势多且增强-L3-1-4-1 总交易次数: 2 盈利: 160.39746609274653 亏损: -37.56741373176784 最大盈利: 160.40 最大亏损: -37.57 总收益: 122.83 平均盈利: 61.42 typeA: 30.71 胜率: 50.00%
趋势空且增强-L2-3-4 总交易次数: 9 盈利: 87.29971157344305 亏损: -75.60361843990697 最大盈利: 34.37 最大亏损: -35.17 总收益: 11.70 平均盈利: 1.30 typeA: 0.58 胜率: 44.44%
趋势空且增强-L2-3-3 总交易次数: 10 盈利: 384.132622079376 亏损: -1293.077610445155 最大盈利: 237.45 最大亏损: -575.08 总收益: -908.94 平均盈利: -90.89 typeA: -36.36 胜率: 40.00%
趋势多且增强-L-4-3-4 总交易次数: 11 盈利: 219.01968068042302 亏损: -249.73048175233637 最大盈利: 117.94 最大亏损: -62.67 总收益: -30.71 平均盈利: -2.79 typeA: -0.76 胜率: 27.27%
趋势多且增强-11 总交易次数: 4 盈利: 21.309242298085135 亏损: -458.3769930615434 最大盈利: 21.31 最大亏损: -270.18 总收益: -437.07 平均盈利: -109.27 typeA: -27.32 胜率: 25.00%
趋势多且增强-L1-3-4 总交易次数: 5 盈利: 27.212563915265427 亏损: -257.7266063998478 最大盈利: 27.21 最大亏损: -211.33 总收益: -230.51 平均盈利: -46.10 typeA: -9.22 胜率: 20.00%
趋势多且增强-L-4-3-3 总交易次数: 2 盈利: 0 亏损: -32.55221486900258 最大盈利: -1.20 最大亏损: -31.36 总收益: -32.55 平均盈利: -16.28 typeA: 0.00 胜率: 0.00%
趋势多且增强-L3-1-5 总交易次数: 2 盈利: 0 亏损: -352.8541603219124 最大盈利: -92.99 最大亏损: -259.86 总收益: -352.85 平均盈利: -176.43 typeA: 0.00 胜率: 0.00%
趋势多且增强-L-4-2-4 总交易次数: 2 盈利: 0 亏损: -565.6552485893126 最大盈利: -127.29 最大亏损: -438.36 总收益: -565.66 平均盈利: -282.83 typeA: 0.00 胜率: 0.00%
趋势多且增强-L-4-1-4 总交易次数: 1 盈利: 0 亏损: -44.68863288487897 最大盈利: -44.69 最大亏损: -44.69 总收益: -44.69 平均盈利: -44.69 typeA: 0.00 胜率: 0.00%
趋势空且增强-2 总交易次数: 1 盈利: 0 亏损: -99.54767109466911 最大盈利: -99.55 最大亏损: -99.55 总收益: -99.55 平均盈利: -99.55 typeA: 0.00 胜率: 0.00%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     90
      胜率:          45.56%
      总收益:        1604.33 USDT
      期末余额:      11424.33 USDT
      盈亏比:        1.25
      最大单笔盈利:  699.01
      最大单笔亏损:  -1268.96
      手续费:       360.12524743279823
      =============================
    
profit: 1424.3254001382047
maxDrawdown 16.6%
startTime: 2024-07-14 00:00:00
趋势空且增强-L2-2-3 总交易次数: 1 盈利: 367.857787631642 亏损: 0 最大盈利: 367.86 最大亏损: 367.86 总收益: 367.86 平均盈利: 367.86 typeA: 367.86 胜率: 100.00%
趋势多且增强-R-1-1-1 总交易次数: 1 盈利: 63.54208481709222 亏损: 0 最大盈利: 63.54 最大亏损: 63.54 总收益: 63.54 平均盈利: 63.54 typeA: 63.54 胜率: 100.00%
趋势多且增强-L1-2-5 总交易次数: 1 盈利: 197.87924071082347 亏损: 0 最大盈利: 197.88 最大亏损: 197.88 总收益: 197.88 平均盈利: 197.88 typeA: 197.88 胜率: 100.00%
趋势多且增强-11 总交易次数: 4 盈利: 309.84851101649946 亏损: -6.734349843735995 最大盈利: 228.78 最大亏损: -6.73 总收益: 303.11 平均盈利: 75.78 typeA: 56.83 胜率: 75.00%
趋势空且增强-11 总交易次数: 4 盈利: 555.3702489735834 亏损: -257.09787310742604 最大盈利: 421.46 最大亏损: -257.10 总收益: 298.27 平均盈利: 74.57 typeA: 55.93 胜率: 75.00%
趋势多且增强-L3-1-4-1 总交易次数: 3 盈利: 610.9190376673139 亏损: -24.8806577386003 最大盈利: 465.44 最大亏损: -24.88 总收益: 586.04 平均盈利: 195.35 typeA: 130.24 胜率: 66.67%
趋势多且增强-L3-1-3 总交易次数: 3 盈利: 890.4029782053215 亏损: -223.6266005121646 最大盈利: 699.01 最大亏损: -223.63 总收益: 666.78 平均盈利: 222.26 typeA: 148.18 胜率: 66.67%
趋势多且增强-L-4-2-3 总交易次数: 3 盈利: 419.93662498943445 亏损: -15.29900237529703 最大盈利: 258.17 最大亏损: -15.30 总收益: 404.64 平均盈利: 134.88 typeA: 89.92 胜率: 66.67%
趋势多且增强-L-4-3-4 总交易次数: 8 盈利: 507.646477950728 亏损: -90.40128741286533 最大盈利: 203.97 最大亏损: -54.72 总收益: 417.25 平均盈利: 52.16 typeA: 26.08 胜率: 50.00%
趋势空且增强-L2-3-5 总交易次数: 4 盈利: 523.7836580682961 亏损: -843.0321674479104 最大盈利: 299.46 最大亏损: -572.57 总收益: -319.25 平均盈利: -79.81 typeA: -39.91 胜率: 50.00%
趋势多且增强-R-1-1-2 总交易次数: 12 盈利: 960.9130604741792 亏损: -337.92353917243514 最大盈利: 440.01 最大亏损: -118.15 总收益: 622.99 平均盈利: 51.92 typeA: 25.96 胜率: 50.00%
趋势空且增强-2 总交易次数: 2 盈利: 83.32863501483716 亏损: -275.4649523661998 最大盈利: 83.33 最大亏损: -275.46 总收益: -192.14 平均盈利: -96.07 typeA: -48.03 胜率: 50.00%
趋势多且增强-L-4-1-3 总交易次数: 2 盈利: 311.2254122211442 亏损: -111.02245028864682 最大盈利: 311.23 最大亏损: -111.02 总收益: 200.20 平均盈利: 100.10 typeA: 50.05 胜率: 50.00%
趋势多且增强-R-1-2-2 总交易次数: 2 盈利: 250.91630231105506 亏损: -335.34631931166354 最大盈利: 250.92 最大亏损: -335.35 总收益: -84.43 平均盈利: -42.22 typeA: -21.11 胜率: 50.00%
趋势多且增强-L1-3-1 总交易次数: 2 盈利: 397.51816354923545 亏损: -32.31924278625225 最大盈利: 397.52 最大亏损: -32.32 总收益: 365.20 平均盈利: 182.60 typeA: 91.30 胜率: 50.00%
趋势多且增强-R-2-1 总交易次数: 2 盈利: 20.168514412416283 亏损: -119.42186026575311 最大盈利: 20.17 最大亏损: -119.42 总收益: -99.25 平均盈利: -49.63 typeA: -24.81 胜率: 50.00%
趋势空且增强-L2-3-4 总交易次数: 2 盈利: 214.0897424060575 亏损: -96.99598550866529 最大盈利: 214.09 最大亏损: -97.00 总收益: 117.09 平均盈利: 58.55 typeA: 29.27 胜率: 50.00%
趋势多且增强-L3-1-5 总交易次数: 2 盈利: 25.490471224045937 亏损: -192.2942598187314 最大盈利: 25.49 最大亏损: -192.29 总收益: -166.80 平均盈利: -83.40 typeA: -41.70 胜率: 50.00%
趋势空且增强-L2-3-3 总交易次数: 11 盈利: 866.8666541560677 亏损: -889.4714862323156 最大盈利: 442.61 最大亏损: -430.48 总收益: -22.60 平均盈利: -2.05 typeA: -0.93 胜率: 45.45%
趋势空且增强-L3-1-6 总交易次数: 3 盈利: 339.61608300907875 亏损: -63.627781458671976 最大盈利: 339.62 最大亏损: -40.72 总收益: 275.99 平均盈利: 92.00 typeA: 30.66 胜率: 33.33%
趋势多且增强-L3-1-4-3 总交易次数: 3 盈利: 3.381468665898846 亏损: -307.16218254563165 最大盈利: 3.38 最大亏损: -298.52 总收益: -303.78 平均盈利: -101.26 typeA: -33.75 胜率: 33.33%
趋势多且增强-L1-3-4 总交易次数: 5 盈利: 0 亏损: -354.03450950609994 最大盈利: -6.02 最大亏损: -160.60 总收益: -354.03 平均盈利: -70.81 typeA: 0.00 胜率: 0.00%
趋势多且增强-L-4-3-3 总交易次数: 2 盈利: 0 亏损: -87.29887262368587 最大盈利: -34.30 最大亏损: -52.99 总收益: -87.30 平均盈利: -43.65 typeA: 0.00 胜率: 0.00%
趋势多且增强-L-4-2-4 总交易次数: 5 盈利: 0 亏损: -1431.5081123816778 最大盈利: -10.41 最大亏损: -1268.96 总收益: -1431.51 平均盈利: -286.30 typeA: 0.00 胜率: 0.00%
趋势多且增强-L-4-1-4 总交易次数: 2 盈利: 0 亏损: -141.21365315483635 最大盈利: -65.15 最大亏损: -76.07 总收益: -141.21 平均盈利: -70.61 typeA: 0.00 胜率: 0.00%
趋势多且增强-L-4-1-2 总交易次数: 1 盈利: 0 亏损: -80.19861147728288 最大盈利: -80.20 最大亏损: -80.20 总收益: -80.20 平均盈利: -80.20 typeA: 0.00 胜率: 0.00%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     83
      胜率:          38.55%
      总收益:        -3508.23 USDT
      期末余额:      6325.77 USDT
      盈亏比:        0.40
      最大单笔盈利:  425.59
      最大单笔亏损:  -624.36
      手续费:       332.08261287989995
      =============================
    
profit: -3674.231015847892
maxDrawdown 38.9%
startTime: 2024-08-13 00:00:00
趋势空且增强-L2-1-3 总交易次数: 1 盈利: 4.493600445186479 亏损: 0 最大盈利: 4.49 最大亏损: 4.49 总收益: 4.49 平均盈利: 4.49 typeA: 4.49 胜率: 100.00%
趋势多且增强-L3-1-4-1 总交易次数: 1 盈利: 79.86693961105479 亏损: 0 最大盈利: 79.87 最大亏损: 79.87 总收益: 79.87 平均盈利: 79.87 typeA: 79.87 胜率: 100.00%
趋势多且增强-R-1-2-2 总交易次数: 1 盈利: 270.8760626398223 亏损: 0 最大盈利: 270.88 最大亏损: 270.88 总收益: 270.88 平均盈利: 270.88 typeA: 270.88 胜率: 100.00%
趋势多且增强-L1-3-2 总交易次数: 1 盈利: 48.55748194014493 亏损: 0 最大盈利: 48.56 最大亏损: 48.56 总收益: 48.56 平均盈利: 48.56 typeA: 48.56 胜率: 100.00%
趋势多且增强-R-2-1 总交易次数: 4 盈利: 124.56639571233308 亏损: -302.12757973733596 最大盈利: 83.98 最大亏损: -302.13 总收益: -177.56 平均盈利: -44.39 typeA: -33.29 胜率: 75.00%
趋势多且增强-L1-3-4 总交易次数: 4 盈利: 12.167595530470159 亏损: -191.67424999862772 最大盈利: 6.34 最大亏损: -102.45 总收益: -179.51 平均盈利: -44.88 typeA: -22.44 胜率: 50.00%
趋势多且增强-L3-1-5 总交易次数: 4 盈利: 57.26013781807565 亏损: -207.6235152109553 最大盈利: 31.77 最大亏损: -184.64 总收益: -150.36 平均盈利: -37.59 typeA: -18.80 胜率: 50.00%
趋势多且增强-11 总交易次数: 4 盈利: 244.31129203635504 亏损: -331.5357649519924 最大盈利: 190.11 最大亏损: -202.85 总收益: -87.22 平均盈利: -21.81 typeA: -10.90 胜率: 50.00%
趋势多且增强-L-4-2-4 总交易次数: 2 盈利: 5.147993054846351 亏损: -43.7516805866783 最大盈利: 5.15 最大亏损: -43.75 总收益: -38.60 平均盈利: -19.30 typeA: -9.65 胜率: 50.00%
趋势空且增强-L2-3-3 总交易次数: 9 盈利: 119.25896187319256 亏损: -222.17934451524502 最大盈利: 47.76 最大亏损: -92.61 总收益: -102.92 平均盈利: -11.44 typeA: -5.08 胜率: 44.44%
趋势空且增强-L3-1-6 总交易次数: 5 盈利: 489.9549057768612 亏损: -763.5319251990601 最大盈利: 425.59 最大亏损: -624.36 总收益: -273.58 平均盈利: -54.72 typeA: -21.89 胜率: 40.00%
趋势多且增强-L3-1-4-3 总交易次数: 8 盈利: 30.345351347181406 亏损: -192.2176939859263 最大盈利: 19.95 最大亏损: -122.93 总收益: -161.87 平均盈利: -20.23 typeA: -7.59 胜率: 37.50%
趋势空且增强-11 总交易次数: 6 盈利: 126.12785629889093 亏损: -796.7916888575851 最大盈利: 90.14 最大亏损: -321.92 总收益: -670.66 平均盈利: -111.78 typeA: -37.26 胜率: 33.33%
趋势多且增强-R-3-1 总交易次数: 3 盈利: 117.1251063829783 亏损: -421.765041803524 最大盈利: 117.13 最大亏损: -404.84 总收益: -304.64 平均盈利: -101.55 typeA: -33.85 胜率: 33.33%
趋势多且增强-L-4-3-3 总交易次数: 3 盈利: 106.57129367327782 亏损: -110.29248461427353 最大盈利: 106.57 最大亏损: -63.73 总收益: -3.72 平均盈利: -1.24 typeA: -0.41 胜率: 33.33%
趋势多且增强-L-4-3-4 总交易次数: 10 盈利: 452.7893261732174 亏损: -498.70613296820886 最大盈利: 203.97 最大亏损: -195.17 总收益: -45.92 平均盈利: -4.59 typeA: -1.38 胜率: 30.00%
趋势空且增强-L2-3-4 总交易次数: 4 盈利: 39.24088541666725 亏损: -550.6917681228789 最大盈利: 39.24 最大亏损: -410.92 总收益: -511.45 平均盈利: -127.86 typeA: -31.97 胜率: 25.00%
趋势多且增强-L-4-2-3 总交易次数: 5 盈利: 57.171434207930886 亏损: -570.2240325021704 最大盈利: 57.17 最大亏损: -468.23 总收益: -513.05 平均盈利: -102.61 typeA: -20.52 胜率: 20.00%
趋势多且增强-L3-1-3 总交易次数: 4 盈利: 0 亏损: -119.70400759520064 最大盈利: -4.01 最大亏损: -54.81 总收益: -119.70 平均盈利: -29.93 typeA: 0.00 胜率: 0.00%
趋势空且增强-L2-2-3 总交易次数: 1 盈利: 0 亏损: -375.86340562990296 最大盈利: -375.86 最大亏损: -375.86 总收益: -375.86 平均盈利: -375.86 typeA: 0.00 胜率: 0.00%
趋势多且增强-R-3-2 总交易次数: 1 盈利: 0 亏损: -157.60303183425972 最大盈利: -157.60 最大亏损: -157.60 总收益: -157.60 平均盈利: -157.60 typeA: 0.00 胜率: 0.00%
趋势空且增强-L2-3-5 总交易次数: 1 盈利: 0 亏损: -2 最大盈利: -2.00 最大亏损: -2.00 总收益: -2.00 平均盈利: -2.00 typeA: 0.00 胜率: 0.00%
趋势多且增强-L1-3-1 总交易次数: 1 盈利: 0 亏损: -35.78028767255556 最大盈利: -35.78 最大亏损: -35.78 总收益: -35.78 平均盈利: -35.78 typeA: 0.00 胜率: 0.00%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     77
      胜率:          55.84%
      总收益:        2075.63 USDT
      期末余额:      11921.63 USDT
      盈亏比:        1.67
      最大单笔盈利:  549.79
      最大单笔亏损:  -256.35
      手续费:       308.15507910421474
      =============================
    
profit: 1921.6301638310615
maxDrawdown 4.7%
startTime: 2024-09-12 00:00:00
趋势多且增强-L3-1-4-1 总交易次数: 2 盈利: 330.0609379857893 亏损: 0 最大盈利: 215.37 最大亏损: 114.69 总收益: 330.06 平均盈利: 165.03 typeA: 165.03 胜率: 100.00%
趋势多且增强-R-1-2-2 总交易次数: 2 盈利: 166.3889253467245 亏损: 0 最大盈利: 154.48 最大亏损: 11.91 总收益: 166.39 平均盈利: 83.19 typeA: 83.19 胜率: 100.00%
趋势空且增强-L2-3-5 总交易次数: 1 盈利: 6.465111905210338 亏损: 0 最大盈利: 6.47 最大亏损: 6.47 总收益: 6.47 平均盈利: 6.47 typeA: 6.47 胜率: 100.00%
趋势多且增强-R-3-1 总交易次数: 1 盈利: 244.54442525427012 亏损: 0 最大盈利: 244.54 最大亏损: 244.54 总收益: 244.54 平均盈利: 244.54 typeA: 244.54 胜率: 100.00%
趋势多且增强-R-2-2 总交易次数: 1 盈利: 6.538730890768029 亏损: 0 最大盈利: 6.54 最大亏损: 6.54 总收益: 6.54 平均盈利: 6.54 typeA: 6.54 胜率: 100.00%
趋势多且增强-L3-1-4-3 总交易次数: 6 盈利: 82.0981338111102 亏损: -34.33379067032642 最大盈利: 34.54 最大亏损: -34.33 总收益: 47.76 平均盈利: 7.96 typeA: 6.63 胜率: 83.33%
趋势多且增强-L1-3-4 总交易次数: 4 盈利: 520.8686845880111 亏损: -15.572713388766957 最大盈利: 396.08 最大亏损: -15.57 总收益: 505.30 平均盈利: 126.32 typeA: 94.74 胜率: 75.00%
趋势空且增强-11 总交易次数: 6 盈利: 859.5751677403825 亏损: -159.4044365841094 最大盈利: 368.09 最大亏损: -158.35 总收益: 700.17 平均盈利: 116.70 typeA: 77.80 胜率: 66.67%
趋势多且增强-L3-1-3 总交易次数: 3 盈利: 16.823921460135466 亏损: -223.17844685147747 最大盈利: 12.86 最大亏损: -223.18 总收益: -206.35 平均盈利: -68.78 typeA: -45.86 胜率: 66.67%
趋势多且增强-R-1-1-2 总交易次数: 3 盈利: 362.138886945022 亏损: -240.62869541632793 最大盈利: 197.55 最大亏损: -240.63 总收益: 121.51 平均盈利: 40.50 typeA: 27.00 胜率: 66.67%
趋势空且增强-L2-3-3 总交易次数: 6 盈利: 136.26444807299885 亏损: -124.18983876830987 最大盈利: 67.94 最大亏损: -61.83 总收益: 12.07 平均盈利: 2.01 typeA: 1.01 胜率: 50.00%
趋势多且增强-L-4-2-3 总交易次数: 4 盈利: 76.62393969780604 亏损: -285.1236251714434 最大盈利: 46.51 最大亏损: -246.56 总收益: -208.50 平均盈利: -52.12 typeA: -26.06 胜率: 50.00%
趋势空且增强-L2-2-3 总交易次数: 2 盈利: 14.030357311209908 亏损: -254.3306811566083 最大盈利: 14.03 最大亏损: -254.33 总收益: -240.30 平均盈利: -120.15 typeA: -60.08 胜率: 50.00%
趋势多且增强-L-4-3-3 总交易次数: 2 盈利: 140.29010367577732 亏损: -47.27396226415041 最大盈利: 140.29 最大亏损: -47.27 总收益: 93.02 平均盈利: 46.51 typeA: 23.25 胜率: 50.00%
趋势空且增强-L3-1-6 总交易次数: 2 盈利: 113.05594336839943 亏损: -207.76926179911226 最大盈利: 113.06 最大亏损: -207.77 总收益: -94.71 平均盈利: -47.36 typeA: -23.68 胜率: 50.00%
趋势多且增强-L3-1-5 总交易次数: 2 盈利: 29.848185844147423 亏损: -150.42261528742944 最大盈利: 29.85 最大亏损: -150.42 总收益: -120.57 平均盈利: -60.29 typeA: -30.14 胜率: 50.00%
趋势多且增强-L1-3-2 总交易次数: 2 盈利: 233.57439703153867 亏损: -32.53921480549878 最大盈利: 233.57 最大亏损: -32.54 总收益: 201.04 平均盈利: 100.52 typeA: 50.26 胜率: 50.00%
趋势多且增强-L-4-3-4 总交易次数: 11 盈利: 801.0946376028751 亏损: -541.7135829257586 最大盈利: 506.13 最大亏损: -256.35 总收益: 259.38 平均盈利: 23.58 typeA: 10.72 胜率: 45.45%
趋势空且增强-L2-3-4 总交易次数: 7 盈利: 403.7183329784614 亏损: -108.07484316576868 最大盈利: 227.18 最大亏损: -42.83 总收益: 295.64 平均盈利: 42.23 typeA: 18.10 胜率: 42.86%
趋势多且增强-11 总交易次数: 5 盈利: 607.4363605143761 亏损: -415.2706167274884 最大盈利: 549.79 最大亏损: -250.96 总收益: 192.17 平均盈利: 38.43 typeA: 15.37 胜率: 40.00%
趋势多且增强-L1-3-1 总交易次数: 1 盈利: 0 亏损: -39.03323910712597 最大盈利: -39.03 最大亏损: -39.03 总收益: -39.03 平均盈利: -39.03 typeA: 0.00 胜率: 0.00%
趋势多且增强-L1-3-9 总交易次数: 2 盈利: 0 亏损: -119.05901822619822 最大盈利: -50.31 最大亏损: -68.75 总收益: -119.06 平均盈利: -59.53 typeA: 0.00 胜率: 0.00%
趋势多且增强-L-4-2-4 总交易次数: 2 盈利: 0 亏损: -77.89088587804363 最大盈利: -38.72 最大亏损: -39.17 总收益: -77.89 平均盈利: -38.95 typeA: 0.00 胜率: 0.00%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     77
      胜率:          53.25%
      总收益:        3172.19 USDT
      期末余额:      13016.19 USDT
      盈亏比:        1.76
      最大单笔盈利:  905.14
      最大单笔亏损:  -470.12
      手续费:       311.1730313622791
      =============================
    
profit: 3016.185827123314
maxDrawdown 9.7%
startTime: 2024-10-12 00:00:00
趋势多且增强-R-3-1 总交易次数: 1 盈利: 193.0470230974507 亏损: 0 最大盈利: 193.05 最大亏损: 193.05 总收益: 193.05 平均盈利: 193.05 typeA: 193.05 胜率: 100.00%
趋势多且增强-L1-3-2 总交易次数: 1 盈利: 176.95455730298082 亏损: 0 最大盈利: 176.95 最大亏损: 176.95 总收益: 176.95 平均盈利: 176.95 typeA: 176.95 胜率: 100.00%
趋势多且增强-R-2-1 总交易次数: 1 盈利: 276.97688014881743 亏损: 0 最大盈利: 276.98 最大亏损: 276.98 总收益: 276.98 平均盈利: 276.98 typeA: 276.98 胜率: 100.00%
趋势多且增强-L1-3-1 总交易次数: 2 盈利: 872.7543447127337 亏损: 0 最大盈利: 783.20 最大亏损: 89.55 总收益: 872.75 平均盈利: 436.38 typeA: 436.38 胜率: 100.00%
趋势多且增强-L3-1-5 总交易次数: 2 盈利: 113.99600049924223 亏损: 0 最大盈利: 76.15 最大亏损: 37.85 总收益: 114.00 平均盈利: 57.00 typeA: 57.00 胜率: 100.00%
趋势空且增强-L2-3-5 总交易次数: 2 盈利: 293.7768018730741 亏损: 0 最大盈利: 193.68 最大亏损: 100.10 总收益: 293.78 平均盈利: 146.89 typeA: 146.89 胜率: 100.00%
趋势空且增强-L2-1-3 总交易次数: 2 盈利: 35.04728955580734 亏损: 0 最大盈利: 19.74 最大亏损: 15.31 总收益: 35.05 平均盈利: 17.52 typeA: 17.52 胜率: 100.00%
趋势多且增强-L1-2-2 总交易次数: 1 盈利: 149.56589976814678 亏损: 0 最大盈利: 149.57 最大亏损: 149.57 总收益: 149.57 平均盈利: 149.57 typeA: 149.57 胜率: 100.00%
趋势多且增强-R-1-1-2 总交易次数: 4 盈利: 305.9556132981625 亏损: -106.11151387332748 最大盈利: 258.26 最大亏损: -106.11 总收益: 199.84 平均盈利: 49.96 typeA: 37.47 胜率: 75.00%
趋势多且增强-L1-3-4 总交易次数: 7 盈利: 1803.751760663512 亏损: -158.5870143665548 最大盈利: 905.14 最大亏损: -100.91 总收益: 1645.16 平均盈利: 235.02 typeA: 167.88 胜率: 71.43%
趋势多且增强-L3-1-4-1 总交易次数: 7 盈利: 699.2762803955223 亏损: -24.679646302303368 最大盈利: 414.76 最大亏损: -19.94 总收益: 674.60 平均盈利: 96.37 typeA: 68.84 胜率: 71.43%
趋势多且增强-L-4-3-4 总交易次数: 10 盈利: 648.4506958213938 亏损: -260.38179427290214 最大盈利: 296.51 最大亏损: -206.25 总收益: 388.07 平均盈利: 38.81 typeA: 19.40 胜率: 50.00%
趋势空且增强-2 总交易次数: 6 盈利: 175.7690380646018 亏损: -831.254219668085 最大盈利: 68.95 最大亏损: -459.12 总收益: -655.49 平均盈利: -109.25 typeA: -54.62 胜率: 50.00%
趋势多且增强-11 总交易次数: 2 盈利: 144.4076742364904 亏损: -179.91032646770452 最大盈利: 144.41 最大亏损: -179.91 总收益: -35.50 平均盈利: -17.75 typeA: -8.88 胜率: 50.00%
趋势空且增强-11 总交易次数: 2 盈利: 438.9735468778115 亏损: -144.15097843165202 最大盈利: 438.97 最大亏损: -144.15 总收益: 294.82 平均盈利: 147.41 typeA: 73.71 胜率: 50.00%
趋势多且增强-L-4-2-3 总交易次数: 2 盈利: 215.72466883972368 亏损: -141.21265822784682 最大盈利: 215.72 最大亏损: -141.21 总收益: 74.51 平均盈利: 37.26 typeA: 18.63 胜率: 50.00%
趋势空且增强-L2-3-4 总交易次数: 3 盈利: 17.805940594058853 亏损: -441.02668953228095 最大盈利: 17.81 最大亏损: -426.40 总收益: -423.22 平均盈利: -141.07 typeA: -47.02 胜率: 33.33%
趋势多且增强-L-4-2-4 总交易次数: 3 盈利: 115.65648641076035 亏损: -45.79575387707365 最大盈利: 115.66 最大亏损: -32.98 总收益: 69.86 平均盈利: 23.29 typeA: 7.76 胜率: 33.33%
趋势多且增强-L-4-1-3 总交易次数: 7 盈利: 639.476022871638 亏损: -347.64579139072396 最大盈利: 391.78 最大亏损: -130.57 总收益: 291.83 平均盈利: 41.69 typeA: 11.91 胜率: 28.57%
趋势多且增强-L-4-1-4 总交易次数: 4 盈利: 33.25351309307825 亏损: -227.08664626752835 最大盈利: 33.25 最大亏损: -111.86 总收益: -193.83 平均盈利: -48.46 typeA: -12.11 胜率: 25.00%
趋势多且增强-L3-1-3 总交易次数: 2 盈利: 0 亏损: -103.4083855860662 最大盈利: -40.81 最大亏损: -62.60 总收益: -103.41 平均盈利: -51.70 typeA: 0.00 胜率: 0.00%
趋势空且增强-L2-3-3 总交易次数: 1 盈利: 0 亏损: -152.8810284610243 最大盈利: -152.88 最大亏损: -152.88 总收益: -152.88 平均盈利: -152.88 typeA: 0.00 胜率: 0.00%
趋势空且增强-L3-1-6 总交易次数: 2 盈利: 0 亏损: -229.09630911988984 最大盈利: -71.04 最大亏损: -158.06 总收益: -229.10 平均盈利: -114.55 typeA: 0.00 胜率: 0.00%
趋势多且增强-L1-1-6 总交易次数: 1 盈利: 0 亏损: -149.38327316486155 最大盈利: -149.38 最大亏损: -149.38 总收益: -149.38 平均盈利: -149.38 typeA: 0.00 胜率: 0.00%
趋势多且增强-L1-2-1 总交易次数: 1 盈利: 0 亏损: -165.7060339889244 最大盈利: -165.71 最大亏损: -165.71 总收益: -165.71 平均盈利: -165.71 typeA: 0.00 胜率: 0.00%
趋势空且增强-L1-1-2 总交易次数: 1 盈利: 0 亏损: -470.11614800294035 最大盈利: -470.12 最大亏损: -470.12 总收益: -470.12 平均盈利: -470.12 typeA: 0.00 胜率: 0.00%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     2
      胜率:          100.00%
      总收益:        366.72 USDT
      期末余额:      10360.72 USDT
      盈亏比:        Infinity
      最大单笔盈利:  328.88
      最大单笔亏损:  37.85
      手续费:       9.941809292762867
      =============================
    
profit: 360.72391650915597
maxDrawdown 0.0%
startTime: 2024-11-11 00:00:00
趋势空且增强-L1-1-2 总交易次数: 1 盈利: 328.87579291999134 亏损: 0 最大盈利: 328.88 最大亏损: 328.88 总收益: 328.88 平均盈利: 328.88 typeA: 328.88 胜率: 100.00%
趋势多且增强-L3-1-5 总交易次数: 1 盈利: 37.84812358916549 亏损: 0 最大盈利: 37.85 最大亏损: 37.85 总收益: 37.85 平均盈利: 37.85 typeA: 37.85 胜率: 100.00%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     105
      胜率:          48.57%
      总收益:        3941.91 USDT
      期末余额:      13731.91 USDT
      盈亏比:        1.71
      最大单笔盈利:  1261.70
      最大单笔亏损:  -310.24
      手续费:       420.506715785891
      =============================
    
profit: 3731.914222053045
maxDrawdown 9.5%
startTime: 2024-12-11 00:00:00
趋势空且增强-L2-2-3 总交易次数: 3 盈利: 181.98283563091005 亏损: 0 最大盈利: 108.24 最大亏损: 32.26 总收益: 181.98 平均盈利: 60.66 typeA: 60.66 胜率: 100.00%
趋势多且增强-L1-3-9 总交易次数: 1 盈利: 3.4008897362568633 亏损: 0 最大盈利: 3.40 最大亏损: 3.40 总收益: 3.40 平均盈利: 3.40 typeA: 3.40 胜率: 100.00%
趋势多且增强-L1-3-4 总交易次数: 2 盈利: 97.16348595120563 亏损: 0 最大盈利: 83.34 最大亏损: 13.82 总收益: 97.16 平均盈利: 48.58 typeA: 48.58 胜率: 100.00%
趋势空且增强-L2-3-4 总交易次数: 3 盈利: 569.3932602236483 亏损: 0 最大盈利: 544.56 最大亏损: 3.64 总收益: 569.39 平均盈利: 189.80 typeA: 189.80 胜率: 100.00%
趋势多且增强-L-4-1-2 总交易次数: 1 盈利: 95.79489530796212 亏损: 0 最大盈利: 95.79 最大亏损: 95.79 总收益: 95.79 平均盈利: 95.79 typeA: 95.79 胜率: 100.00%
趋势多且增强-L3-1-4-1 总交易次数: 6 盈利: 69.19927256433449 亏损: -53.93028063465843 最大盈利: 23.76 最大亏损: -53.93 总收益: 15.27 平均盈利: 2.54 typeA: 2.12 胜率: 83.33%
趋势多且增强-L1-1-6 总交易次数: 4 盈利: 927.1492773839566 亏损: -103.54296524942816 最大盈利: 577.65 最大亏损: -103.54 总收益: 823.61 平均盈利: 205.90 typeA: 154.43 胜率: 75.00%
趋势空且增强-L2-1-3 总交易次数: 5 盈利: 273.28785387544093 亏损: -161.2647265364075 最大盈利: 126.44 最大亏损: -158.06 总收益: 112.02 平均盈利: 22.40 typeA: 13.44 胜率: 60.00%
趋势空且增强-2 总交易次数: 12 盈利: 497.40960648324256 亏损: -267.89885441248816 最大盈利: 276.70 最大亏损: -109.85 总收益: 229.51 平均盈利: 19.13 typeA: 9.56 胜率: 50.00%
趋势多且增强-R-1-1-2 总交易次数: 14 盈利: 2416.1306331547 亏损: -606.248962757142 最大盈利: 920.53 最大亏损: -162.10 总收益: 1809.88 平均盈利: 129.28 typeA: 64.64 胜率: 50.00%
趋势多且增强-R-1-2-2 总交易次数: 6 盈利: 326.3675281041075 亏损: -125.10384946655637 最大盈利: 178.97 最大亏损: -84.35 总收益: 201.26 平均盈利: 33.54 typeA: 16.77 胜率: 50.00%
趋势多且增强-L3-1-3 总交易次数: 2 盈利: 245.11034566110774 亏损: -191.91299019607962 最大盈利: 245.11 最大亏损: -191.91 总收益: 53.20 平均盈利: 26.60 typeA: 13.30 胜率: 50.00%
趋势空且增强-L3-1-6 总交易次数: 3 盈利: 277.2983868872895 亏损: -257.5297156581373 最大盈利: 277.30 最大亏损: -175.00 总收益: 19.77 平均盈利: 6.59 typeA: 2.20 胜率: 33.33%
趋势多且增强-L-4-1-3 总交易次数: 9 盈利: 240.43482702646833 亏损: -955.1862779235972 最大盈利: 176.29 最大亏损: -310.24 总收益: -714.75 平均盈利: -79.42 typeA: -26.47 胜率: 33.33%
趋势多且增强-L3-1-5 总交易次数: 3 盈利: 574.2620608670112 亏损: -219.07047017607147 最大盈利: 574.26 最大亏损: -132.34 总收益: 355.19 平均盈利: 118.40 typeA: 39.46 胜率: 33.33%
趋势多且增强-11 总交易次数: 6 盈利: 1426.0244724967636 亏损: -308.79210920478397 最大盈利: 1261.70 最大亏损: -192.02 总收益: 1117.23 平均盈利: 186.21 typeA: 62.06 胜率: 33.33%
趋势空且增强-11 总交易次数: 7 盈利: 876.1158880954604 亏损: -946.5265894848385 最大盈利: 750.81 最大亏损: -296.53 总收益: -70.41 平均盈利: -10.06 typeA: -2.87 胜率: 28.57%
趋势多且增强-L-4-1-4 总交易次数: 11 盈利: 264.9483711699344 亏损: -722.6495512197172 最大盈利: 239.71 最大亏损: -285.39 总收益: -457.70 平均盈利: -41.61 typeA: -11.35 胜率: 27.27%
趋势空且增强-L2-3-3 总交易次数: 4 盈利: 120.58015679913409 亏损: -427.26521351080436 最大盈利: 120.58 最大亏损: -295.16 总收益: -306.69 平均盈利: -76.67 typeA: -19.17 胜率: 25.00%
趋势多且增强-L-4-2-4 总交易次数: 1 盈利: 0 亏损: -44.61297464851062 最大盈利: -44.61 最大亏损: -44.61 总收益: -44.61 平均盈利: -44.61 typeA: 0.00 胜率: 0.00%
趋势多且增强-L-4-3-4 总交易次数: 1 盈利: 0 亏损: -25.511428840183516 最大盈利: -25.51 最大亏损: -25.51 总收益: -25.51 平均盈利: -25.51 typeA: 0.00 胜率: 0.00%
趋势多且增强-R-1-1-1 总交易次数: 1 盈利: 0 亏损: -123.09286544648366 最大盈利: -123.09 最大亏损: -123.09 总收益: -123.09 平均盈利: -123.09 typeA: 0.00 胜率: 0.00%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     102
      胜率:          48.04%
      总收益:        3720.47 USDT
      期末余额:      13514.47 USDT
      盈亏比:        1.57
      最大单笔盈利:  1134.96
      最大单笔亏损:  -537.07
      手续费:       410.08224174570813
      =============================
    
profit: 3514.472495596554
maxDrawdown 10.6%
startTime: 2025-01-10 00:00:00
趋势多且增强-L-4-1-2 总交易次数: 1 盈利: 173.41959345865882 亏损: 0 最大盈利: 173.42 最大亏损: 173.42 总收益: 173.42 平均盈利: 173.42 typeA: 173.42 胜率: 100.00%
趋势多且增强-L1-3-9 总交易次数: 1 盈利: 117.75445425961813 亏损: 0 最大盈利: 117.75 最大亏损: 117.75 总收益: 117.75 平均盈利: 117.75 typeA: 117.75 胜率: 100.00%
趋势空且增强-L2-3-4 总交易次数: 4 盈利: 611.1290989501385 亏损: 0 最大盈利: 493.16 最大亏损: 28.14 总收益: 611.13 平均盈利: 152.78 typeA: 152.78 胜率: 100.00%
趋势多且增强-L3-1-4-3 总交易次数: 2 盈利: 148.43350591266798 亏损: 0 最大盈利: 129.14 最大亏损: 19.30 总收益: 148.43 平均盈利: 74.22 typeA: 74.22 胜率: 100.00%
趋势空且增强-L2-1-3 总交易次数: 6 盈利: 1723.7728028860552 亏损: -210.05916785924717 最大盈利: 982.63 最大亏损: -180.29 总收益: 1513.71 平均盈利: 252.29 typeA: 168.20 胜率: 66.67%
趋势空且增强-11 总交易次数: 3 盈利: 393.5034504751798 亏损: -72.32656249999876 最大盈利: 344.93 最大亏损: -72.33 总收益: 321.18 平均盈利: 107.06 typeA: 71.38 胜率: 66.67%
趋势空且增强-L2-3-5 总交易次数: 5 盈利: 613.826239032687 亏损: -435.0295631217349 最大盈利: 587.95 最大亏损: -318.61 总收益: 178.80 平均盈利: 35.76 typeA: 21.46 胜率: 60.00%
趋势空且增强-L2-3-3 总交易次数: 5 盈利: 205.39671133840466 亏损: -49.195876695630716 最大盈利: 119.28 最大亏损: -27.91 总收益: 156.20 平均盈利: 31.24 typeA: 18.74 胜率: 60.00%
趋势多且增强-L3-1-4-1 总交易次数: 11 盈利: 1421.320017946046 亏损: -1091.8607380194608 最大盈利: 1134.96 最大亏损: -457.89 总收益: 329.46 平均盈利: 29.95 typeA: 16.34 胜率: 54.55%
趋势多且增强-11 总交易次数: 6 盈利: 846.2932411712693 亏损: -475.3455549490021 最大盈利: 808.88 最大亏损: -202.53 总收益: 370.95 平均盈利: 61.82 typeA: 30.91 胜率: 50.00%
趋势多且增强-L-4-1-3 总交易次数: 6 盈利: 1570.5211971088584 亏损: -158.04609333893575 最大盈利: 1089.79 最大亏损: -96.88 总收益: 1412.48 平均盈利: 235.41 typeA: 117.71 胜率: 50.00%
趋势空且增强-L1-1-2 总交易次数: 4 盈利: 285.63114459072887 亏损: -545.8197443967216 最大盈利: 144.53 最大亏损: -537.07 总收益: -260.19 平均盈利: -65.05 typeA: -32.52 胜率: 50.00%
趋势多且增强-R-1-1-1 总交易次数: 2 盈利: 111.74160847037534 亏损: -306.7556727294261 最大盈利: 111.74 最大亏损: -306.76 总收益: -195.01 平均盈利: -97.51 typeA: -48.75 胜率: 50.00%
趋势空且增强-L3-1-6 总交易次数: 2 盈利: 260.5859241236362 亏损: -109.8085555929806 最大盈利: 260.59 最大亏损: -109.81 总收益: 150.78 平均盈利: 75.39 typeA: 37.69 胜率: 50.00%
趋势多且增强-R-1-1-2 总交易次数: 15 盈利: 1294.5408287902583 亏损: -599.1713334155859 最大盈利: 470.07 最大亏损: -179.88 总收益: 695.37 平均盈利: 46.36 typeA: 21.64 胜率: 46.67%
趋势多且增强-L3-1-5 总交易次数: 5 盈利: 124.63569907012995 亏损: -619.2668904885024 最大盈利: 65.90 最大亏损: -395.22 总收益: -494.63 平均盈利: -98.93 typeA: -39.57 胜率: 40.00%
趋势多且增强-L-4-2-4 总交易次数: 3 盈利: 230.03849749766275 亏损: -341.96497281720576 最大盈利: 230.04 最大亏损: -325.37 总收益: -111.93 平均盈利: -37.31 typeA: -12.44 胜率: 33.33%
趋势多且增强-R-1-2-2 总交易次数: 3 盈利: 3.5967656663042598 亏损: -58.49484676836917 最大盈利: 3.60 最大亏损: -50.57 总收益: -54.90 平均盈利: -18.30 typeA: -6.10 胜率: 33.33%
趋势多且增强-L-4-1-4 总交易次数: 4 盈利: 48.46513961863124 亏损: -72.68013544498639 最大盈利: 48.47 最大亏损: -34.73 总收益: -24.21 平均盈利: -6.05 typeA: -1.51 胜率: 25.00%
趋势空且增强-2 总交易次数: 9 盈利: 11.057441253263587 亏损: -1001.6390034821062 最大盈利: 11.06 最大亏损: -283.16 总收益: -990.58 平均盈利: -110.06 typeA: -12.23 胜率: 11.11%
趋势多且增强-L1-2-2 总交易次数: 1 盈利: 0 亏损: -50.630554941410125 最大盈利: -50.63 最大亏损: -50.63 总收益: -50.63 平均盈利: -50.63 typeA: 0.00 胜率: 0.00%
趋势多且增强-L3-1-3 总交易次数: 1 盈利: 0 亏损: -23.617600808715967 最大盈利: -23.62 最大亏损: -23.62 总收益: -23.62 平均盈利: -23.62 typeA: 0.00 胜率: 0.00%
趋势多且增强-L1-1-6 总交易次数: 1 盈利: 0 亏损: -103.46717561877122 最大盈利: -103.47 最大亏损: -103.47 总收益: -103.47 平均盈利: -103.47 typeA: 0.00 胜率: 0.00%
趋势多且增强-L-4-3-4 总交易次数: 1 盈利: 0 亏损: -21.754752567134506 最大盈利: -21.75 最大亏损: -21.75 总收益: -21.75 平均盈利: -21.75 typeA: 0.00 胜率: 0.00%
趋势多且增强-L1-3-4 总交易次数: 1 盈利: 0 亏损: -128.25607046809915 最大盈利: -128.26 最大亏损: -128.26 总收益: -128.26 平均盈利: -128.26 typeA: 0.00 胜率: 0.00%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     104
      胜率:          55.77%
      总收益:        -2391.05 USDT
      期末余额:      7398.95 USDT
      盈亏比:        0.70
      最大单笔盈利:  419.16
      最大单笔亏损:  -856.23
      手续费:       417.4493864099274
      =============================
    
profit: -2601.0494026552014
maxDrawdown 30.2%
startTime: 2025-02-09 00:00:00
趋势多且增强-L-4-1-2 总交易次数: 1 盈利: 149.65761861313842 亏损: 0 最大盈利: 149.66 最大亏损: 149.66 总收益: 149.66 平均盈利: 149.66 typeA: 149.66 胜率: 100.00%
趋势空且增强-L2-2-3 总交易次数: 2 盈利: 152.2839505542278 亏损: 0 最大盈利: 99.59 最大亏损: 52.69 总收益: 152.28 平均盈利: 76.14 typeA: 76.14 胜率: 100.00%
趋势多且增强-L-4-3-4 总交易次数: 1 盈利: 212.3888694958359 亏损: 0 最大盈利: 212.39 最大亏损: 212.39 总收益: 212.39 平均盈利: 212.39 typeA: 212.39 胜率: 100.00%
趋势空且增强-L1-1-2 总交易次数: 1 盈利: 82.71732463612868 亏损: 0 最大盈利: 82.72 最大亏损: 82.72 总收益: 82.72 平均盈利: 82.72 typeA: 82.72 胜率: 100.00%
趋势多且增强-L-4-1-3 总交易次数: 7 盈利: 291.3956282093102 亏损: -21.997568436740547 最大盈利: 123.40 最大亏损: -22.00 总收益: 269.40 平均盈利: 38.49 typeA: 32.99 胜率: 85.71%
趋势空且增强-L2-3-5 总交易次数: 5 盈利: 792.5209489369815 亏损: -77.65684288843873 最大盈利: 419.16 最大亏损: -77.66 总收益: 714.86 平均盈利: 142.97 typeA: 114.38 胜率: 80.00%
趋势空且增强-2 总交易次数: 7 盈利: 153.01400366752793 亏损: -71.19730276993482 最大盈利: 66.19 最大亏损: -58.59 总收益: 81.82 平均盈利: 11.69 typeA: 8.35 胜率: 71.43%
趋势多且增强-L1-2-5 总交易次数: 3 盈利: 144.51153303067642 亏损: -341.12936145397936 最大盈利: 139.31 最大亏损: -341.13 总收益: -196.62 平均盈利: -65.54 typeA: -43.70 胜率: 66.67%
趋势多且增强-L1-1-6 总交易次数: 3 盈利: 257.3050499973985 亏损: -197.31662366384174 最大盈利: 202.95 最大亏损: -197.32 总收益: 59.99 平均盈利: 20.00 typeA: 13.33 胜率: 66.67%
趋势多且增强-R-1-1-2 总交易次数: 17 盈利: 1174.9746023772973 亏损: -914.9266067262031 最大盈利: 380.79 最大亏损: -328.81 总收益: 260.05 平均盈利: 15.30 typeA: 9.90 胜率: 64.71%
趋势多且增强-L1-3-4 总交易次数: 4 盈利: 46.44117169919595 亏损: -122.6980689087795 最大盈利: 31.66 最大亏损: -121.08 总收益: -76.26 平均盈利: -19.06 typeA: -9.53 胜率: 50.00%
趋势空且增强-L2-1-3 总交易次数: 2 盈利: 102.63770752786037 亏损: -9.200287953927912 最大盈利: 102.64 最大亏损: -9.20 总收益: 93.44 平均盈利: 46.72 typeA: 23.36 胜率: 50.00%
趋势空且增强-L2-3-3 总交易次数: 2 盈利: 81.80757006645571 亏损: -53.449449676613035 最大盈利: 81.81 最大亏损: -53.45 总收益: 28.36 平均盈利: 14.18 typeA: 7.09 胜率: 50.00%
趋势多且增强-L-4-1-4 总交易次数: 6 盈利: 297.1307199339369 亏损: -472.56766924655494 最大盈利: 169.67 最大亏损: -413.21 总收益: -175.44 平均盈利: -29.24 typeA: -14.62 胜率: 50.00%
趋势多且增强-L1-3-9 总交易次数: 2 盈利: 74.03491212861483 亏损: -42.13996693694485 最大盈利: 74.03 最大亏损: -42.14 总收益: 31.89 平均盈利: 15.95 typeA: 7.97 胜率: 50.00%
趋势多且增强-L3-1-5 总交易次数: 2 盈利: 50.3433747455026 亏损: -387.574144189858 最大盈利: 50.34 最大亏损: -387.57 总收益: -337.23 平均盈利: -168.62 typeA: -84.31 胜率: 50.00%
趋势空且增强-L3-1-6 总交易次数: 2 盈利: 260.1511260182081 亏损: -346.2842489397384 最大盈利: 260.15 最大亏损: -346.28 总收益: -86.13 平均盈利: -43.07 typeA: -21.53 胜率: 50.00%
趋势多且增强-L3-1-4-1 总交易次数: 11 盈利: 256.467619692965 亏损: -2083.320068687471 最大盈利: 169.78 最大亏损: -856.23 总收益: -1826.85 平均盈利: -166.08 typeA: -75.48 胜率: 45.45%
趋势空且增强-L2-3-4 总交易次数: 7 盈利: 483.00247970988266 亏损: -593.4980191978086 最大盈利: 224.07 最大亏损: -270.90 总收益: -110.50 平均盈利: -15.79 typeA: -6.77 胜率: 42.86%
趋势空且增强-11 总交易次数: 5 盈利: 202.5251268230813 亏损: -940.5831726618353 最大盈利: 138.72 最大亏损: -676.98 总收益: -738.06 平均盈利: -147.61 typeA: -59.04 胜率: 40.00%
趋势多且增强-R-1-2-2 总交易次数: 5 盈利: 58.928072471067125 亏损: -828.4722895512244 最大盈利: 33.34 最大亏损: -531.37 总收益: -769.54 平均盈利: -153.91 typeA: -61.56 胜率: 40.00%
趋势多且增强-L-4-2-4 总交易次数: 5 盈利: 369.00592334494814 亏损: -351.0235695980588 最大盈利: 369.01 最大亏损: -184.61 总收益: 17.98 平均盈利: 3.60 typeA: 0.72 胜率: 20.00%
趋势多且增强-L3-1-3 总交易次数: 1 盈利: 0 亏损: -16.536202384412473 最大盈利: -16.54 最大亏损: -16.54 总收益: -16.54 平均盈利: -16.54 typeA: 0.00 胜率: 0.00%
趋势多且增强-11 总交易次数: 1 盈利: 0 亏损: -188.47835781277638 最大盈利: -188.48 最大亏损: -188.48 总收益: -188.48 平均盈利: -188.48 typeA: 0.00 胜率: 0.00%
趋势多且增强-L-4-2-3 总交易次数: 1 盈利: 0 亏损: -6.511732851985519 最大盈利: -6.51 最大亏损: -6.51 总收益: -6.51 平均盈利: -6.51 typeA: 0.00 胜率: 0.00%
趋势多且增强-R-1-1-1 总交易次数: 1 盈利: 0 亏损: -17.733181798312682 最大盈利: -17.73 最大亏损: -17.73 总收益: -17.73 平均盈利: -17.73 typeA: 0.00 胜率: 0.00%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     100
      胜率:          54.00%
      总收益:        2013.77 USDT
      期末余额:      11811.77 USDT
      盈亏比:        1.40
      最大单笔盈利:  959.90
      最大单笔亏损:  -478.64
      手续费:       402.59033744547787
      =============================
    
profit: 1811.7749677920983
maxDrawdown 11.3%
startTime: 2025-03-11 00:00:00
趋势空且增强-L2-1-3 总交易次数: 3 盈利: 159.87493736995106 亏损: 0 最大盈利: 103.06 最大亏损: 25.99 总收益: 159.87 平均盈利: 53.29 typeA: 53.29 胜率: 100.00%
趋势多且增强-R-2-1 总交易次数: 1 盈利: 74.47472769550858 亏损: 0 最大盈利: 74.47 最大亏损: 74.47 总收益: 74.47 平均盈利: 74.47 typeA: 74.47 胜率: 100.00%
趋势空且增强-L2-3-3 总交易次数: 1 盈利: 86.75114085792524 亏损: 0 最大盈利: 86.75 最大亏损: 86.75 总收益: 86.75 平均盈利: 86.75 typeA: 86.75 胜率: 100.00%
趋势空且增强-L2-3-5 总交易次数: 2 盈利: 44.62193378599292 亏损: 0 最大盈利: 28.80 最大亏损: 15.82 总收益: 44.62 平均盈利: 22.31 typeA: 22.31 胜率: 100.00%
趋势多且增强-L3-1-4-1 总交易次数: 5 盈利: 1125.3231131859077 亏损: -11.346108903949139 最大盈利: 959.90 最大亏损: -11.35 总收益: 1113.98 平均盈利: 222.80 typeA: 178.24 胜率: 80.00%
趋势多且增强-L3-1-4-3 总交易次数: 4 盈利: 313.446541032874 亏损: -2 最大盈利: 242.61 最大亏损: -2.00 总收益: 311.45 平均盈利: 77.86 typeA: 58.40 胜率: 75.00%
趋势多且增强-L3-1-5 总交易次数: 7 盈利: 955.8402354644015 亏损: -209.81987826009072 最大盈利: 411.99 最大亏损: -144.94 总收益: 746.02 平均盈利: 106.57 typeA: 76.13 胜率: 71.43%
趋势多且增强-R-1-2-2 总交易次数: 9 盈利: 602.9704717251237 亏损: -940.8221828636877 最大盈利: 261.12 最大亏损: -478.64 总收益: -337.85 平均盈利: -37.54 typeA: -25.03 胜率: 66.67%
趋势空且增强-L2-2-3 总交易次数: 3 盈利: 101.43390279126798 亏损: -185.08399770393416 最大盈利: 87.00 最大亏损: -185.08 总收益: -83.65 平均盈利: -27.88 typeA: -18.59 胜率: 66.67%
趋势多且增强-R-1-1-2 总交易次数: 6 盈利: 588.9071814733627 亏损: -65.35598334363125 最大盈利: 424.68 最大亏损: -36.68 总收益: 523.55 平均盈利: 87.26 typeA: 58.18 胜率: 66.67%
趋势多且增强-L-4-3-4 总交易次数: 3 盈利: 163.91791986740247 亏损: -55.37349857006544 最大盈利: 161.16 最大亏损: -55.37 总收益: 108.54 平均盈利: 36.18 typeA: 24.12 胜率: 66.67%
趋势多且增强-L1-1-6 总交易次数: 2 盈利: 55.583873290137774 亏损: -197.31662366384174 最大盈利: 55.58 最大亏损: -197.32 总收益: -141.73 平均盈利: -70.87 typeA: -35.43 胜率: 50.00%
趋势空且增强-11 总交易次数: 8 盈利: 863.8437933517655 亏损: -642.0446884502066 最大盈利: 292.83 最大亏损: -350.94 总收益: 221.80 平均盈利: 27.72 typeA: 13.86 胜率: 50.00%
趋势多且增强-L-4-2-3 总交易次数: 4 盈利: 280.15362321379143 亏损: -298.66667950984026 最大盈利: 259.54 最大亏损: -219.89 总收益: -18.51 平均盈利: -4.63 typeA: -2.31 胜率: 50.00%
趋势空且增强-L2-3-4 总交易次数: 6 盈利: 134.74370958632454 亏损: -302.2160704388059 最大盈利: 80.21 最大亏损: -230.69 总收益: -167.47 平均盈利: -27.91 typeA: -13.96 胜率: 50.00%
趋势多且增强-L1-2-5 总交易次数: 2 盈利: 168.92627329929917 亏损: -38.16968140973331 最大盈利: 168.93 最大亏损: -38.17 总收益: 130.76 平均盈利: 65.38 typeA: 32.69 胜率: 50.00%
趋势多且增强-L3-1-3 总交易次数: 2 盈利: 31.008047320999264 亏损: -153.25662272441906 最大盈利: 31.01 最大亏损: -153.26 总收益: -122.25 平均盈利: -61.12 typeA: -30.56 胜率: 50.00%
趋势空且增强-2 总交易次数: 9 盈利: 186.29413602155597 亏损: -547.4272553793357 最大盈利: 97.74 最大亏损: -233.83 总收益: -361.13 平均盈利: -40.13 typeA: -17.83 胜率: 44.44%
趋势多且增强-L-4-2-4 总交易次数: 5 盈利: 510.94852555708826 亏损: -147.44215014838983 最大盈利: 510.24 最大亏损: -77.07 总收益: 363.51 平均盈利: 72.70 typeA: 29.08 胜率: 40.00%
趋势多且增强-L-4-1-4 总交易次数: 3 盈利: 103.89178720571336 亏损: -34.759447931313055 最大盈利: 103.89 最大亏损: -24.90 总收益: 69.13 平均盈利: 23.04 typeA: 7.68 胜率: 33.33%
趋势多且增强-L-4-1-2 总交易次数: 3 盈利: 74.70797922568434 亏损: -57.02401260848253 最大盈利: 74.71 最大亏损: -28.85 总收益: 17.68 平均盈利: 5.89 typeA: 1.96 胜率: 33.33%
趋势多且增强-L1-3-4 总交易次数: 4 盈利: 407.74910044520357 亏损: -141.66263327335636 最大盈利: 407.75 最大亏损: -79.69 总收益: 266.09 平均盈利: 66.52 typeA: 16.63 胜率: 25.00%
趋势空且增强-L3-1-6 总交易次数: 2 盈利: 0 亏损: -337.5262350607288 最大盈利: -10.55 最大亏损: -326.98 总收益: -337.53 平均盈利: -168.76 typeA: 0.00 胜率: 0.00%
趋势多且增强-L-4-1-3 总交易次数: 2 盈利: 0 亏损: -84.59954640709418 最大盈利: -28.88 最大亏损: -55.72 总收益: -84.60 平均盈利: -42.30 typeA: 0.00 胜率: 0.00%
趋势多且增强-11 总交易次数: 3 盈利: 0 亏损: -512.6648539180545 最大盈利: -106.85 最大亏损: -271.20 总收益: -512.66 平均盈利: -170.89 typeA: 0.00 胜率: 0.00%
趋势多且增强-R-2-2 总交易次数: 1 盈利: 0 亏损: -57.05983540622498 最大盈利: -57.06 最大亏损: -57.06 总收益: -57.06 平均盈利: -57.06 typeA: 0.00 胜率: 0.00%
tradeNumTotal 4678
profitTotal 165265.3308086048
maxLossTotal -2061.77
winRateTotal 2703.22
period month 53
avgRate 51.00
maxDrawdownTotal 38.9
趋势多且增强-L-4-1-1 总交易次数: 1 盈利: 187.9832271762208 亏损: 0 最大盈利: 187.98 最大亏损: 187.98 总收益: 187.98 平均盈利: 187.98 typeA: 187.98 胜率: 100.00%
趋势空且增强-L2-1-3 总交易次数: 68 盈利: 9124.174455835286 亏损: -1529.8398031870045 最大盈利: 1220.97 最大亏损: -673.69 总收益: 7594.33 平均盈利: 111.68 typeA: 87.04 胜率: 77.94%
趋势多且增强-R-1-1-1 总交易次数: 33 盈利: 4860.187075438595 亏损: -1682.5991224617235 最大盈利: 1148.20 最大亏损: -694.30 总收益: 3177.59 平均盈利: 96.29 typeA: 67.11 胜率: 69.70%
趋势空且增强-L2-2-3 总交易次数: 42 盈利: 3918.190387922348 亏损: -1717.2953279040744 最大盈利: 1142.40 最大亏损: -375.86 总收益: 2200.90 平均盈利: 52.40 typeA: 36.18 胜率: 69.05%
趋势多且增强-L3-1-5 总交易次数: 183 盈利: 11697.99368219941 亏损: -6964.297338557426 最大盈利: 1373.52 最大亏损: -395.22 总收益: 4733.70 平均盈利: 25.87 typeA: 17.39 胜率: 67.21%
趋势多且增强-R-2-2 总交易次数: 23 盈利: 2065.323624484191 亏损: -767.6799062384537 最大盈利: 369.72 最大亏损: -277.05 总收益: 1297.64 平均盈利: 56.42 typeA: 36.80 胜率: 65.22%
趋势空且增强-L1-1-2 总交易次数: 37 盈利: 6171.886933348584 亏损: -3768.569829967331 最大盈利: 2068.45 最大亏损: -808.06 总收益: 2403.32 平均盈利: 64.95 typeA: 42.13 胜率: 64.86%
趋势多且增强-L3-1-4-1 总交易次数: 186 盈利: 20825.370565308283 亏损: -12286.710441465324 最大盈利: 1855.48 最大亏损: -1830.26 总收益: 8538.66 平均盈利: 45.91 typeA: 29.12 胜率: 63.44%
趋势空且增强-11 总交易次数: 164 盈利: 19324.35083210607 亏损: -13737.03923781807 最大盈利: 892.06 最大亏损: -897.70 总收益: 5587.31 平均盈利: 34.07 typeA: 21.60 胜率: 63.41%
趋势多且增强-L-4-2-2 总交易次数: 13 盈利: 774.3049375550022 亏损: -318.4419212115566 最大盈利: 197.33 最大亏损: -100.69 总收益: 455.86 平均盈利: 35.07 typeA: 21.58 胜率: 61.54%
趋势多且增强-R-1-2-2 总交易次数: 72 盈利: 7413.508445869265 亏损: -4792.24720589423 最大盈利: 1403.49 最大亏损: -830.33 总收益: 2621.26 平均盈利: 36.41 typeA: 22.25 胜率: 61.11%
趋势多且增强-L3-1-4-3 总交易次数: 341 盈利: 11741.482921392642 亏损: -12749.57604448343 最大盈利: 1285.64 最大亏损: -521.42 总收益: -1008.09 平均盈利: -2.96 typeA: -1.77 胜率: 59.82%
趋势空且增强-L2-3-3 总交易次数: 377 盈利: 21820.686421375674 亏损: -17367.95965887806 最大盈利: 1862.45 最大亏损: -774.78 总收益: 4452.73 平均盈利: 11.81 typeA: 7.02 胜率: 59.42%
趋势多且增强-R-2-1 总交易次数: 86 盈利: 7110.237206893132 亏损: -4996.536565567239 最大盈利: 1699.60 最大亏损: -912.30 总收益: 2113.70 平均盈利: 24.58 typeA: 14.29 胜率: 58.14%
趋势空且增强-L2-3-4 总交易次数: 337 盈利: 17910.99056872444 亏损: -14555.695014088586 最大盈利: 1020.85 最大亏损: -647.04 总收益: 3355.30 平均盈利: 9.96 typeA: 5.76 胜率: 57.86%
趋势多且增强-R-3-1 总交易次数: 132 盈利: 7891.338940692395 亏损: -6946.908067631695 最大盈利: 1253.97 最大亏损: -837.68 总收益: 944.43 平均盈利: 7.15 typeA: 4.12 胜率: 57.58%
趋势多且增强-L1-2-1 总交易次数: 7 盈利: 1859.604771694 亏损: -350.4566031446385 最大盈利: 766.72 最大亏损: -165.71 总收益: 1509.15 平均盈利: 215.59 typeA: 123.19 胜率: 57.14%
趋势空且增强-L2-3-5 总交易次数: 197 盈利: 12705.027995188673 亏损: -7564.277934349762 最大盈利: 1298.29 最大亏损: -633.58 总收益: 5140.75 平均盈利: 26.10 typeA: 14.84 胜率: 56.85%
趋势多且增强-R-1-1-2 总交易次数: 254 盈利: 29739.686831603995 亏损: -19983.928113571255 最大盈利: 2358.53 最大亏损: -2061.77 总收益: 9755.76 平均盈利: 38.41 typeA: 21.62 胜率: 56.30%
趋势空且增强-2 总交易次数: 204 盈利: 31055.52115507377 亏损: -16339.645202314798 最大盈利: 4403.10 最大亏损: -818.35 总收益: 14715.88 平均盈利: 72.14 typeA: 38.90 胜率: 53.92%
趋势多且增强-L3-1-3 总交易次数: 114 盈利: 11730.481883390901 亏损: -5770.332641033766 最大盈利: 2591.16 最大亏损: -695.46 总收益: 5960.15 平均盈利: 52.28 typeA: 27.52 胜率: 52.63%
趋势多且增强-R-3-2 总交易次数: 27 盈利: 1440.7887485268834 亏损: -566.2214381222441 最大盈利: 266.93 最大亏损: -157.60 总收益: 874.57 平均盈利: 32.39 typeA: 16.79 胜率: 51.85%
趋势多且增强-11 总交易次数: 199 盈利: 26097.368283881842 亏损: -18040.892965109335 最大盈利: 2423.17 最大亏损: -907.40 总收益: 8056.48 平均盈利: 40.48 typeA: 20.34 胜率: 50.25%
趋势多且增强-L1-2-2 总交易次数: 10 盈利: 10463.568812160125 亏损: -607.4023833940779 最大盈利: 7106.66 最大亏损: -315.45 总收益: 9856.17 平均盈利: 985.62 typeA: 492.81 胜率: 50.00%
趋势多且增强-L1-1-6 总交易次数: 44 盈利: 14409.34898771663 亏损: -3842.002299084854 最大盈利: 8558.15 最大亏损: -381.66 总收益: 10567.35 平均盈利: 240.17 typeA: 114.63 胜率: 47.73%
趋势多且增强-L-4-1-2 总交易次数: 21 盈利: 2624.0868594716917 亏损: -2372.258743234387 最大盈利: 943.21 最大亏损: -1085.49 总收益: 251.83 平均盈利: 11.99 typeA: 5.71 胜率: 47.62%
趋势多且增强-L1-3-9 总交易次数: 34 盈利: 4504.662928826276 亏损: -2576.536609655994 最大盈利: 1115.35 最大亏损: -462.86 总收益: 1928.13 平均盈利: 56.71 typeA: 26.69 胜率: 47.06%
趋势多且增强-L-4-3-2 总交易次数: 26 盈利: 1518.4115061978928 亏损: -740.3789900942227 最大盈利: 350.80 最大亏损: -264.34 总收益: 778.03 平均盈利: 29.92 typeA: 13.81 胜率: 46.15%
趋势多且增强-L-4-2-3 总交易次数: 97 盈利: 5186.068084106658 亏损: -6209.5981674283485 最大盈利: 613.68 最大亏损: -468.23 总收益: -1023.53 平均盈利: -10.55 typeA: -4.24 胜率: 40.21%
趋势多且增强-L1-3-1 总交易次数: 38 盈利: 46687.002555956766 亏损: -1803.5831960113749 最大盈利: 41166.13 最大亏损: -281.54 总收益: 44883.42 平均盈利: 1181.14 typeA: 466.20 胜率: 39.47%
趋势多且增强-L1-3-2 总交易次数: 28 盈利: 2789.875437685746 亏损: -1248.2416633477046 最大盈利: 880.28 最大亏损: -296.01 总收益: 1541.63 平均盈利: 55.06 typeA: 21.63 胜率: 39.29%
趋势空且增强-L3-1-6 总交易次数: 127 盈利: 16239.119897877028 亏损: -10681.185829152897 最大盈利: 2533.05 最大亏损: -727.25 总收益: 5557.93 平均盈利: 43.76 typeA: 16.54 胜率: 37.80%
趋势多且增强-L1-3-4 总交易次数: 141 盈利: 9468.159485084245 亏损: -9617.95420760383 最大盈利: 905.14 最大亏损: -610.81 总收益: -149.79 平均盈利: -1.06 typeA: -0.40 胜率: 37.59%
趋势多且增强-L1-2-5 总交易次数: 30 盈利: 3792.4944471838276 亏损: -2534.681466389091 最大盈利: 1027.78 最大亏损: -341.13 总收益: 1257.81 平均盈利: 41.93 typeA: 15.37 胜率: 36.67%
趋势多且增强-L-4-3-3 总交易次数: 150 盈利: 12359.383016418627 亏损: -5530.694467168573 最大盈利: 5340.69 最大亏损: -337.38 总收益: 6828.69 平均盈利: 45.52 typeA: 16.39 胜率: 36.00%
趋势多且增强-L-4-1-3 总交易次数: 137 盈利: 10889.083192829383 亏损: -10618.73522948343 最大盈利: 1089.79 最大亏损: -626.15 总收益: 270.35 平均盈利: 1.97 typeA: 0.69 胜率: 35.04%
趋势多且增强-L-4-3-4 总交易次数: 439 盈利: 13650.561511909305 亏损: -15452.010528498997 最大盈利: 954.88 最大亏损: -801.84 总收益: -1801.45 平均盈利: -4.10 typeA: -1.35 胜率: 32.80%
趋势多且增强-L-4-2-4 总交易次数: 127 盈利: 8701.047778393327 亏损: -8600.46077434883 最大盈利: 2117.62 最大亏损: -1268.96 总收益: 100.59 平均盈利: 0.79 typeA: 0.24 胜率: 29.92%
趋势多且增强-L-4-1-4 总交易次数: 125 盈利: 9814.459457322337 亏损: -9499.334848791279 最大盈利: 1225.93 最大亏损: -701.06 总收益: 315.12 平均盈利: 2.52 typeA: 0.67 胜率: 26.40%
趋势多且增强-L-4-3-1 总交易次数: 2 盈利: 0 亏损: -79.44138787375489 最大盈利: -32.35 最大亏损: -47.09 总收益: -79.44 平均盈利: -39.72 typeA: 0.00 胜率: 0.00%
趋势多且增强-L-4-4-4 总交易次数: 5 盈利: 0 亏损: -1078.8418716550054 最大盈利: -0.30 最大亏损: -1006.27 总收益: -1078.84 平均盈利: -215.77 typeA: 0.00 胜率: 0.00%
^C
root@iZj6c630isgmtl3542rbfrZ:~/web/okex-node-sdk-sample/server# git pull 
remote: Enumerating objects: 9, done.
remote: Counting objects: 100% (9/9), done.
remote: Compressing objects: 100% (5/5), done.
remote: Total 5 (delta 4), reused 0 (delta 0), pack-reused 0 (from 0)
Unpacking objects: 100% (5/5), 445 bytes | 49.00 KiB/s, done.
From https://gitee.com/pphxiong/okex-node-sdk-sample
   6afdda18..bb3f6b58  develop    -> origin/develop
Updating 6afdda18..bb3f6b58
Fast-forward
 server/app/swapApiDSTest.js | 24 ++++++++++++------------
 1 file changed, 12 insertions(+), 12 deletions(-)
root@iZj6c630isgmtl3542rbfrZ:~/web/okex-node-sdk-sample/server# npm run start:test

> @ali/topSdk@2.0.0 start:test
> node startTest.js --env=manul

8092 server start
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     43
      胜率:          72.09%
      总收益:        50330.52 USDT
      期末余额:      60242.52 USDT
      盈亏比:        12.21
      最大单笔盈利:  41166.13
      最大单笔亏损:  -791.31
      手续费:       182.32882626643544
      =============================
    
profit: 50242.51786698863
maxDrawdown 6.6%
startTime: 2021-01-01 00:00:00
趋势多且增强-L3-1-4-3 总交易次数: 8 盈利: 2334.868742478277 亏损: 0 最大盈利: 1173.14 最大亏损: 7.83 总收益: 2334.87 平均盈利: 291.86 typeA: 291.86 胜率: 100.00%
趋势多且增强-R-3-1 总交易次数: 1 盈利: 1253.9729691279001 亏损: 0 最大盈利: 1253.97 最大亏损: 1253.97 总收益: 1253.97 平均盈利: 1253.97 typeA: 1253.97 胜率: 100.00%
趋势多且增强-L3-1-3 总交易次数: 1 盈利: 26.27955215085412 亏损: 0 最大盈利: 26.28 最大亏损: 26.28 总收益: 26.28 平均盈利: 26.28 typeA: 26.28 胜率: 100.00%
趋势空且增强-L2-3-5 总交易次数: 1 盈利: 69.65077233042291 亏损: 0 最大盈利: 69.65 最大亏损: 69.65 总收益: 69.65 平均盈利: 69.65 typeA: 69.65 胜率: 100.00%
趋势空且增强-L3-1-6 总交易次数: 1 盈利: 365.78030390905883 亏损: 0 最大盈利: 365.78 最大亏损: 365.78 总收益: 365.78 平均盈利: 365.78 typeA: 365.78 胜率: 100.00%
趋势多且增强-L1-3-1 总交易次数: 1 盈利: 41166.13172492735 亏损: 0 最大盈利: 41166.13 最大亏损: 41166.13 总收益: 41166.13 平均盈利: 41166.13 typeA: 41166.13 胜率: 100.00%
趋势空且增强-L2-1-3 总交易次数: 1 盈利: 4307.5352040816315 亏损: 0 最大盈利: 4307.54 最大亏损: 4307.54 总收益: 4307.54 平均盈利: 4307.54 typeA: 4307.54 胜率: 100.00%
趋势多且增强-R-1-1-2 总交易次数: 1 盈利: 748.207093608299 亏损: 0 最大盈利: 748.21 最大亏损: 748.21 总收益: 748.21 平均盈利: 748.21 typeA: 748.21 胜率: 100.00%
趋势空且增强-11 总交易次数: 1 盈利: 610.3596563936394 亏损: 0 最大盈利: 610.36 最大亏损: 610.36 总收益: 610.36 平均盈利: 610.36 typeA: 610.36 胜率: 100.00%
趋势多且增强-L3-1-4-1 总交易次数: 1 盈利: 126.59163987138236 亏损: 0 最大盈利: 126.59 最大亏损: 126.59 总收益: 126.59 平均盈利: 126.59 typeA: 126.59 胜率: 100.00%
趋势空且增强-L2-3-3 总交易次数: 7 盈利: 1609.7051347292056 亏损: -130.04836415362817 最大盈利: 538.62 最大亏损: -130.05 总收益: 1479.66 平均盈利: 211.38 typeA: 181.17 胜率: 85.71%
趋势空且增强-L2-3-4 总交易次数: 5 盈利: 1032.1319813980822 亏损: -387.3981651376139 最大盈利: 479.77 最大亏损: -387.40 总收益: 644.73 平均盈利: 128.95 typeA: 103.16 胜率: 80.00%
趋势多且增强-L1-2-5 总交易次数: 2 盈利: 1027.778426791277 亏损: -393.696035970509 最大盈利: 1027.78 最大亏损: -393.70 总收益: 634.08 平均盈利: 317.04 typeA: 158.52 胜率: 50.00%
趋势多且增强-L3-1-5 总交易次数: 3 盈利: 66.86007733204417 亏损: -367.7120754032773 最大盈利: 66.86 最大亏损: -346.55 总收益: -300.85 平均盈利: -100.28 typeA: -33.42 胜率: 33.33%
趋势空且增强-L-4-3-4 总交易次数: 7 盈利: 73.4507857806718 亏损: -1933.00395501652 最大盈利: 40.45 最大亏损: -791.31 总收益: -1859.55 平均盈利: -265.65 typeA: -75.90 胜率: 28.57%
趋势空且增强-L-4-2-4 总交易次数: 1 盈利: 0 亏损: -671.2696296296294 最大盈利: -671.27 最大亏损: -671.27 总收益: -671.27 平均盈利: -671.27 typeA: 0.00 胜率: 0.00%
趋势空且增强-L-4-1-4 总交易次数: 1 盈利: 0 亏损: -605.6579726102809 最大盈利: -605.66 最大亏损: -605.66 总收益: -605.66 平均盈利: -605.66 typeA: 0.00 胜率: 0.00%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     78
      胜率:          57.69%
      总收益:        8576.76 USDT
      期末余额:      18418.76 USDT
      盈亏比:        1.75
      最大单笔盈利:  3571.11
      最大单笔亏损:  -1830.26
      手续费:       314.1971312465202
      =============================
    
profit: 8418.755495825262
maxDrawdown 19.9%
startTime: 2021-01-31 00:00:00
趋势多且增强-L1-2-5 总交易次数: 1 盈利: 1027.778426791277 亏损: 0 最大盈利: 1027.78 最大亏损: 1027.78 总收益: 1027.78 平均盈利: 1027.78 typeA: 1027.78 胜率: 100.00%
趋势多且增强-L3-1-3 总交易次数: 2 盈利: 323.12577292249495 亏损: 0 最大盈利: 314.62 最大亏损: 8.50 总收益: 323.13 平均盈利: 161.56 typeA: 161.56 胜率: 100.00%
趋势多且增强-L1-2-2 总交易次数: 1 盈利: 3571.1130287555643 亏损: 0 最大盈利: 3571.11 最大亏损: 3571.11 总收益: 3571.11 平均盈利: 3571.11 typeA: 3571.11 胜率: 100.00%
趋势空且增强-L2-2-3 总交易次数: 2 盈利: 207.0650945684061 亏损: 0 最大盈利: 176.55 最大亏损: 30.51 总收益: 207.07 平均盈利: 103.53 typeA: 103.53 胜率: 100.00%
趋势多且增强-L1-3-9 总交易次数: 2 盈利: 1620.963021440421 亏损: 0 最大盈利: 1115.35 最大亏损: 505.61 总收益: 1620.96 平均盈利: 810.48 typeA: 810.48 胜率: 100.00%
趋势空且增强-L2-1-3 总交易次数: 2 盈利: 1705.3074103069116 亏损: 0 最大盈利: 1655.41 最大亏损: 49.90 总收益: 1705.31 平均盈利: 852.65 typeA: 852.65 胜率: 100.00%
趋势多且增强-R-1-2-2 总交易次数: 1 盈利: 187.52745282213303 亏损: 0 最大盈利: 187.53 最大亏损: 187.53 总收益: 187.53 平均盈利: 187.53 typeA: 187.53 胜率: 100.00%
趋势多且增强-L1-3-2 总交易次数: 1 盈利: 110.59676367731632 亏损: 0 最大盈利: 110.60 最大亏损: 110.60 总收益: 110.60 平均盈利: 110.60 typeA: 110.60 胜率: 100.00%
趋势多且增强-L3-1-4-1 总交易次数: 6 盈利: 1210.3970320964388 亏损: -1830.2636752207823 最大盈利: 391.77 最大亏损: -1830.26 总收益: -619.87 平均盈利: -103.31 typeA: -86.09 胜率: 83.33%
趋势空且增强-L2-3-5 总交易次数: 4 盈利: 713.4414655902629 亏损: -511.18683258000095 最大盈利: 371.89 最大亏损: -511.19 总收益: 202.25 平均盈利: 50.56 typeA: 37.92 胜率: 75.00%
趋势多且增强-L3-1-4-3 总交易次数: 4 盈利: 214.1037450415048 亏损: -141.77322013293826 最大盈利: 105.07 最大亏损: -141.77 总收益: 72.33 平均盈利: 18.08 typeA: 13.56 胜率: 75.00%
趋势空且增强-L-4-2-4 总交易次数: 3 盈利: 937.5251858911352 亏损: -245.66193189141845 最大盈利: 914.98 最大亏损: -245.66 总收益: 691.86 平均盈利: 230.62 typeA: 153.76 胜率: 66.67%
趋势空且增强-11 总交易次数: 3 盈利: 347.7510700728197 亏损: -139.78780152251704 最大盈利: 252.80 最大亏损: -139.79 总收益: 207.96 平均盈利: 69.32 typeA: 46.22 胜率: 66.67%
趋势空且增强-2 总交易次数: 5 盈利: 2317.7291914528905 亏损: -956.3180552076793 最大盈利: 1750.26 最大亏损: -720.61 总收益: 1361.41 平均盈利: 272.28 typeA: 163.37 胜率: 60.00%
趋势多且增强-R-2-1 总交易次数: 4 盈利: 325.031645752954 亏损: -214.55557243800789 最大盈利: 175.18 最大亏损: -172.02 总收益: 110.48 平均盈利: 27.62 typeA: 13.81 胜率: 50.00%
趋势空且增强-L2-3-4 总交易次数: 8 盈利: 2195.5791904268463 亏损: -1371.871006002372 最大盈利: 1290.39 最大亏损: -647.04 总收益: 823.71 平均盈利: 102.96 typeA: 51.48 胜率: 50.00%
趋势多且增强-L3-1-5 总交易次数: 2 盈利: 16.347789132072144 亏损: -2.692358297843565 最大盈利: 16.35 最大亏损: -2.69 总收益: 13.66 平均盈利: 6.83 typeA: 3.41 胜率: 50.00%
趋势多且增强-L1-3-1 总交易次数: 2 盈利: 429.99408108907915 亏损: -79.40413449360571 最大盈利: 429.99 最大亏损: -79.40 总收益: 350.59 平均盈利: 175.29 typeA: 87.65 胜率: 50.00%
趋势空且增强-L-4-3-4 总交易次数: 9 盈利: 1504.9688352843996 亏损: -1405.4971012788926 最大盈利: 566.56 最大亏损: -800.41 总收益: 99.47 平均盈利: 11.05 typeA: 4.91 胜率: 44.44%
趋势空且增强-L-4-1-4 总交易次数: 3 盈利: 820.8365350338651 亏损: -1226.6205123439152 最大盈利: 820.84 最大亏损: -620.96 总收益: -405.78 平均盈利: -135.26 typeA: -45.08 胜率: 33.33%
趋势多且增强-R-1-1-2 总交易次数: 3 盈利: 211.99362530511922 亏损: -568.4589181007295 最大盈利: 211.99 最大亏损: -317.10 总收益: -356.47 平均盈利: -118.82 typeA: -39.60 胜率: 33.33%
趋势多且增强-L1-3-4 总交易次数: 4 盈利: 0.24174972991786658 亏损: -443.52274254056783 最大盈利: 0.24 最大亏损: -238.28 总收益: -443.28 平均盈利: -110.82 typeA: -27.71 胜率: 25.00%
趋势多且增强-11 总交易次数: 4 盈利: 0 亏损: -1184.2109443812635 最大盈利: -6.00 最大亏损: -866.85 总收益: -1184.21 平均盈利: -296.05 typeA: 0.00 胜率: 0.00%
趋势空且增强-L1-1-2 总交易次数: 1 盈利: 0 亏损: -808.0563264081609 最大盈利: -808.06 最大亏损: -808.06 总收益: -808.06 平均盈利: -808.06 typeA: 0.00 胜率: 0.00%
趋势空且增强-L2-3-3 总交易次数: 1 盈利: 0 亏损: -292.7814845178776 最大盈利: -292.78 最大亏损: -292.78 总收益: -292.78 平均盈利: -292.78 typeA: 0.00 胜率: 0.00%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     62
      胜率:          59.68%
      总收益:        1868.00 USDT
      期末余额:      11744.00 USDT
      盈亏比:        1.46
      最大单笔盈利:  1285.64
      最大单笔亏损:  -760.73
      手续费:       248.345584349997
      =============================
    
profit: 1743.9971982142579
maxDrawdown 10.0%
startTime: 2021-03-02 00:00:00
趋势多且增强-L3-1-4-1 总交易次数: 2 盈利: 180.55166498924575 亏损: 0 最大盈利: 154.34 最大亏损: 26.21 总收益: 180.55 平均盈利: 90.28 typeA: 90.28 胜率: 100.00%
趋势空且增强-11 总交易次数: 1 盈利: 119.69335068879488 亏损: 0 最大盈利: 119.69 最大亏损: 119.69 总收益: 119.69 平均盈利: 119.69 typeA: 119.69 胜率: 100.00%
趋势多且增强-L1-3-2 总交易次数: 1 盈利: 633.3127783964358 亏损: 0 最大盈利: 633.31 最大亏损: 633.31 总收益: 633.31 平均盈利: 633.31 typeA: 633.31 胜率: 100.00%
趋势多且增强-L3-1-4-3 总交易次数: 11 盈利: 371.32571351721356 亏损: -273.6807621161669 最大盈利: 191.89 最大亏损: -273.68 总收益: 97.64 平均盈利: 8.88 typeA: 8.07 胜率: 90.91%
趋势空且增强-L-4-2-3 总交易次数: 4 盈利: 145.11270749684394 亏损: -106.26966205689462 最大盈利: 81.99 最大亏损: -106.27 总收益: 38.84 平均盈利: 9.71 typeA: 7.28 胜率: 75.00%
趋势空且增强-L2-3-3 总交易次数: 4 盈利: 144.4407518956111 亏损: -30.718632088495216 最大盈利: 57.18 最大亏损: -30.72 总收益: 113.72 平均盈利: 28.43 typeA: 21.32 胜率: 75.00%
趋势多且增强-R-3-1 总交易次数: 6 盈利: 681.8047413563766 亏损: -571.5914230777005 最大盈利: 325.93 最大亏损: -301.10 总收益: 110.21 平均盈利: 18.37 typeA: 12.25 胜率: 66.67%
趋势空且增强-L-4-2-4 总交易次数: 3 盈利: 1037.9025620371863 亏损: -293.5409238032223 最大盈利: 795.31 最大亏损: -293.54 总收益: 744.36 平均盈利: 248.12 typeA: 165.42 胜率: 66.67%
趋势空且增强-L2-3-4 总交易次数: 5 盈利: 375.69762578017037 亏损: -152.71528971339143 最大盈利: 222.73 最大亏损: -107.32 总收益: 222.98 平均盈利: 44.60 typeA: 26.76 胜率: 60.00%
趋势空且增强-L2-3-5 总交易次数: 5 盈利: 55.179223602030916 亏损: -160.64448814397178 最大盈利: 29.28 最大亏损: -89.80 总收益: -105.47 平均盈利: -21.09 typeA: -12.66 胜率: 60.00%
趋势空且增强-L3-1-6 总交易次数: 2 盈利: 475.1441725603902 亏损: -34.72170434165655 最大盈利: 475.14 最大亏损: -34.72 总收益: 440.42 平均盈利: 220.21 typeA: 110.11 胜率: 50.00%
趋势多且增强-L1-3-4 总交易次数: 2 盈利: 357.7827665896341 亏损: -12.248052480524388 最大盈利: 357.78 最大亏损: -12.25 总收益: 345.53 平均盈利: 172.77 typeA: 86.38 胜率: 50.00%
趋势空且增强-L-4-3-4 总交易次数: 8 盈利: 93.31047601721862 亏损: -1599.6332115376567 最大盈利: 87.44 最大亏损: -760.73 总收益: -1506.32 平均盈利: -188.29 typeA: -47.07 胜率: 25.00%
趋势多且增强-L3-1-3 总交易次数: 4 盈利: 1285.6352296702078 亏损: -520.2131071792185 最大盈利: 1285.64 最大亏损: -418.12 总收益: 765.42 平均盈利: 191.36 typeA: 47.84 胜率: 25.00%
趋势多且增强-11 总交易次数: 2 盈利: 0 亏损: -307.9091870388006 最大盈利: -113.87 最大亏损: -194.04 总收益: -307.91 平均盈利: -153.95 typeA: 0.00 胜率: 0.00%
趋势多且增强-L3-1-5 总交易次数: 2 盈利: 0 亏损: -25.010122805403938 最大盈利: -10.44 最大亏损: -14.57 总收益: -25.01 平均盈利: -12.51 typeA: 0.00 胜率: 0.00%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     65
      胜率:          49.23%
      总收益:        31015.95 USDT
      期末余额:      40883.95 USDT
      盈亏比:        4.77
      最大单笔盈利:  8558.15
      最大单笔亏损:  -837.05
      手续费:       265.70469688433155
      =============================
    
profit: 30883.947386089523
maxDrawdown 25.4%
startTime: 2021-04-01 00:00:00
趋势空且增强-L-4-2-4 总交易次数: 1 盈利: 57.29876306706606 亏损: 0 最大盈利: 57.30 最大亏损: 57.30 总收益: 57.30 平均盈利: 57.30 typeA: 57.30 胜率: 100.00%
趋势空且增强-11 总交易次数: 1 盈利: 311.9625620915039 亏损: 0 最大盈利: 311.96 最大亏损: 311.96 总收益: 311.96 平均盈利: 311.96 typeA: 311.96 胜率: 100.00%
趋势多且增强-L3-1-4-1 总交易次数: 5 盈利: 1620.2571954094365 亏损: 0 最大盈利: 632.65 最大亏损: 114.52 总收益: 1620.26 平均盈利: 324.05 typeA: 324.05 胜率: 100.00%
趋势多且增强-L1-2-2 总交易次数: 1 盈利: 7106.6643783272675 亏损: 0 最大盈利: 7106.66 最大亏损: 7106.66 总收益: 7106.66 平均盈利: 7106.66 typeA: 7106.66 胜率: 100.00%
趋势空且增强-L1-1-2 总交易次数: 3 盈利: 2529.655163571467 亏损: 0 最大盈利: 2068.45 最大亏损: 5.19 总收益: 2529.66 平均盈利: 843.22 typeA: 843.22 胜率: 100.00%
趋势空且增强-2 总交易次数: 7 盈利: 8042.655075524437 亏损: -910.3390777950168 最大盈利: 3130.79 最大亏损: -690.41 总收益: 7132.32 平均盈利: 1018.90 typeA: 727.80 胜率: 71.43%
趋势多且增强-L3-1-4-3 总交易次数: 3 盈利: 318.95423375113245 亏损: -19.239509262365814 最大盈利: 301.53 最大亏损: -19.24 总收益: 299.71 平均盈利: 99.90 typeA: 66.61 胜率: 66.67%
趋势多且增强-R-1-1-2 总交易次数: 6 盈利: 5639.386119840765 亏损: -275.6047071660821 最大盈利: 2358.53 最大亏损: -188.01 总收益: 5363.78 平均盈利: 893.96 typeA: 596.01 胜率: 66.67%
趋势空且增强-L-4-1-4 总交易次数: 2 盈利: 142.93506365340963 亏损: -102.43624246318537 最大盈利: 142.94 最大亏损: -102.44 总收益: 40.50 平均盈利: 20.25 typeA: 10.12 胜率: 50.00%
趋势空且增强-L3-1-6 总交易次数: 2 盈利: 355.17498388947337 亏损: -727.2506891391669 最大盈利: 355.17 最大亏损: -727.25 总收益: -372.08 平均盈利: -186.04 typeA: -93.02 胜率: 50.00%
趋势多且增强-L3-1-3 总交易次数: 2 盈利: 2591.160619748811 亏损: -28.055393939394772 最大盈利: 2591.16 最大亏损: -28.06 总收益: 2563.11 平均盈利: 1281.55 typeA: 640.78 胜率: 50.00%
趋势多且增强-L1-1-6 总交易次数: 6 盈利: 9738.20045090315 亏损: -745.8424153503765 最大盈利: 8558.15 最大亏损: -274.27 总收益: 8992.36 平均盈利: 1498.73 typeA: 749.36 胜率: 50.00%
趋势多且增强-11 总交易次数: 3 盈利: 395.8133278780743 亏损: -1048.5173397267893 最大盈利: 395.81 最大亏损: -754.03 总收益: -652.70 平均盈利: -217.57 typeA: -72.52 胜率: 33.33%
趋势空且增强-L-4-3-4 总交易次数: 7 盈利: 303.74870104973513 亏损: -1922.5789636627107 最大盈利: 267.03 最大亏损: -743.59 总收益: -1618.83 平均盈利: -231.26 typeA: -66.07 胜率: 28.57%
趋势多且增强-L1-3-4 总交易次数: 4 盈利: 91.14953794031875 亏损: -250.13660406025838 最大盈利: 91.15 最大亏损: -185.87 总收益: -158.99 平均盈利: -39.75 typeA: -9.94 胜率: 25.00%
趋势空且增强-L2-3-3 总交易次数: 3 盈利: 0 亏损: -642.4089085197456 最大盈利: -30.77 最大亏损: -537.67 总收益: -642.41 平均盈利: -214.14 typeA: 0.00 胜率: 0.00%
趋势空且增强-L-4-4-4 总交易次数: 1 盈利: 0 亏损: -837.0549511442773 最大盈利: -837.05 最大亏损: -837.05 总收益: -837.05 平均盈利: -837.05 typeA: 0.00 胜率: 0.00%
趋势多且增强-R-3-2 总交易次数: 1 盈利: 0 亏损: -53.812430273148706 最大盈利: -53.81 最大亏损: -53.81 总收益: -53.81 平均盈利: -53.81 typeA: 0.00 胜率: 0.00%
趋势空且增强-L2-3-4 总交易次数: 1 盈利: 0 亏损: -55.32288202692086 最大盈利: -55.32 最大亏损: -55.32 总收益: -55.32 平均盈利: -55.32 typeA: 0.00 胜率: 0.00%
趋势多且增强-L1-3-2 总交易次数: 2 盈利: 0 亏损: -232.71219641385258 最大盈利: -40.20 最大亏损: -192.51 总收益: -232.71 平均盈利: -116.36 typeA: 0.00 胜率: 0.00%
趋势空且增强-L2-2-3 总交易次数: 1 盈利: 0 亏损: -105.83588853533904 最大盈利: -105.84 最大亏损: -105.84 总收益: -105.84 平均盈利: -105.84 typeA: 0.00 胜率: 0.00%
趋势多且增强-L1-3-1 总交易次数: 2 盈利: 0 亏损: -86.06432894145084 最大盈利: -9.96 最大亏损: -76.11 总收益: -86.06 平均盈利: -43.03 typeA: 0.00 胜率: 0.00%
趋势空且增强-L2-1-3 总交易次数: 1 盈利: 0 亏损: -185.8562621364377 最大盈利: -185.86 最大亏损: -185.86 总收益: -185.86 平均盈利: -185.86 typeA: 0.00 胜率: 0.00%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     96
      胜率:          55.21%
      总收益:        11322.01 USDT
      期末余额:      21130.01 USDT
      盈亏比:        2.09
      最大单笔盈利:  1403.49
      最大单笔亏损:  -999.95
      手续费:       384.7400934852603
      =============================
    
profit: 11130.00635391174
maxDrawdown 9.9%
startTime: 2021-05-01 00:00:00
趋势空且增强-11 总交易次数: 2 盈利: 1364.9921454046873 亏损: 0 最大盈利: 892.06 最大亏损: 472.93 总收益: 1364.99 平均盈利: 682.50 typeA: 682.50 胜率: 100.00%
趋势空且增强-L2-1-3 总交易次数: 4 盈利: 1162.917506688279 亏损: 0 最大盈利: 904.79 最大亏损: 16.95 总收益: 1162.92 平均盈利: 290.73 typeA: 290.73 胜率: 100.00%
趋势空且增强-L-4-2-4 总交易次数: 1 盈利: 19.04030516366164 亏损: 0 最大盈利: 19.04 最大亏损: 19.04 总收益: 19.04 平均盈利: 19.04 typeA: 19.04 胜率: 100.00%
趋势多且增强-L3-1-4-3 总交易次数: 1 盈利: 3.8424179463025663 亏损: 0 最大盈利: 3.84 最大亏损: 3.84 总收益: 3.84 平均盈利: 3.84 typeA: 3.84 胜率: 100.00%
趋势多且增强-L3-1-5 总交易次数: 4 盈利: 420.9571945636531 亏损: -116.01091770922451 最大盈利: 220.66 最大亏损: -116.01 总收益: 304.95 平均盈利: 76.24 typeA: 57.18 胜率: 75.00%
趋势空且增强-L2-3-4 总交易次数: 3 盈利: 706.0097978253963 亏损: -166.0985047798018 最大盈利: 544.81 最大亏损: -166.10 总收益: 539.91 平均盈利: 179.97 typeA: 119.99 胜率: 66.67%
趋势空且增强-2 总交易次数: 6 盈利: 1118.9766594589362 亏损: -765.9583428341833 最大盈利: 663.85 最大亏损: -659.30 总收益: 353.02 平均盈利: 58.84 typeA: 39.23 胜率: 66.67%
趋势多且增强-R-1-1-1 总交易次数: 3 盈利: 632.2413296191328 亏损: -1.7791717283266706 最大盈利: 563.84 最大亏损: -1.78 总收益: 630.46 平均盈利: 210.15 typeA: 140.11 胜率: 66.67%
趋势多且增强-R-1-2-2 总交易次数: 3 盈利: 2544.2751812680026 亏损: -76.3661311686997 最大盈利: 1403.49 最大亏损: -76.37 总收益: 2467.91 平均盈利: 822.64 typeA: 548.45 胜率: 66.67%
趋势多且增强-L3-1-4-1 总交易次数: 12 盈利: 2312.502607621399 亏损: -1479.584471776617 最大盈利: 896.86 最大亏损: -904.79 总收益: 832.92 平均盈利: 69.41 typeA: 40.49 胜率: 58.33%
趋势多且增强-L1-1-6 总交易次数: 11 盈利: 3007.869195238719 亏损: -747.6297288396213 最大盈利: 963.19 最大亏损: -285.49 总收益: 2260.24 平均盈利: 205.48 typeA: 112.09 胜率: 54.55%
趋势空且增强-L-4-1-4 总交易次数: 18 盈利: 3989.374430931612 亏损: -2577.7176256183448 最大盈利: 1285.54 最大亏损: -999.95 总收益: 1411.66 平均盈利: 78.43 typeA: 39.21 胜率: 50.00%
趋势多且增强-R-1-1-2 总交易次数: 8 盈利: 1449.53365896394 亏损: -1610.1671086257297 最大盈利: 1006.97 最大亏损: -602.56 总收益: -160.63 平均盈利: -20.08 typeA: -10.04 胜率: 50.00%
趋势多且增强-L3-1-3 总交易次数: 2 盈利: 266.7041146287154 亏损: -71.69467625326254 最大盈利: 266.70 最大亏损: -71.69 总收益: 195.01 平均盈利: 97.50 typeA: 48.75 胜率: 50.00%
趋势空且增强-L1-1-2 总交易次数: 2 盈利: 165.66500103708924 亏损: -39.039208480564746 最大盈利: 165.67 最大亏损: -39.04 总收益: 126.63 平均盈利: 63.31 typeA: 31.66 胜率: 50.00%
趋势多且增强-L1-2-5 总交易次数: 2 盈利: 1183.2986955803844 亏损: -12.814317086761186 最大盈利: 1183.30 最大亏损: -12.81 总收益: 1170.48 平均盈利: 585.24 typeA: 292.62 胜率: 50.00%
趋势空且增强-L2-3-3 总交易次数: 6 盈利: 657.9544345183319 亏损: -642.6412390295757 最大盈利: 462.16 最大亏损: -219.22 总收益: 15.31 平均盈利: 2.55 typeA: 0.85 胜率: 33.33%
趋势多且增强-11 总交易次数: 3 盈利: 747.8384603505887 亏损: -520.6358999366578 最大盈利: 747.84 最大亏损: -282.42 总收益: 227.20 平均盈利: 75.73 typeA: 25.24 胜率: 33.33%
趋势空且增强-L2-3-5 总交易次数: 1 盈利: 0 亏损: -113.28862517727524 最大盈利: -113.29 最大亏损: -113.29 总收益: -113.29 平均盈利: -113.29 typeA: 0.00 胜率: 0.00%
趋势空且增强-L3-1-6 总交易次数: 2 盈利: 0 亏损: -853.7143262842385 最大盈利: -235.62 最大亏损: -618.09 总收益: -853.71 平均盈利: -426.86 typeA: 0.00 胜率: 0.00%
趋势多且增强-L1-3-9 总交易次数: 1 盈利: 0 亏损: -426.29501719470187 最大盈利: -426.30 最大亏损: -426.30 总收益: -426.30 平均盈利: -426.30 typeA: 0.00 胜率: 0.00%
趋势空且增强-L2-2-3 总交易次数: 1 盈利: 0 亏损: -210.5514703735064 最大盈利: -210.55 最大亏损: -210.55 总收益: -210.55 平均盈利: -210.55 typeA: 0.00 胜率: 0.00%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     99
      胜率:          53.54%
      总收益:        1276.84 USDT
      期末余额:      11076.84 USDT
      盈亏比:        1.14
      最大单笔盈利:  2423.17
      最大单笔亏损:  -1818.29
      手续费:       397.95124525693177
      =============================
    
profit: 1076.839238973249
maxDrawdown 29.8%
startTime: 2021-05-31 00:00:00
趋势多且增强-L3-1-4-3 总交易次数: 1 盈利: 3.8424179463025663 亏损: 0 最大盈利: 3.84 最大亏损: 3.84 总收益: 3.84 平均盈利: 3.84 typeA: 3.84 胜率: 100.00%
趋势空且增强-L1-1-2 总交易次数: 3 盈利: 459.6346747737031 亏损: 0 最大盈利: 179.73 最大亏损: 108.57 总收益: 459.63 平均盈利: 153.21 typeA: 153.21 胜率: 100.00%
趋势多且增强-R-1-2-2 总交易次数: 2 盈利: 262.5951226750388 亏损: 0 最大盈利: 216.85 最大亏损: 45.74 总收益: 262.60 平均盈利: 131.30 typeA: 131.30 胜率: 100.00%
趋势多且增强-L3-1-5 总交易次数: 2 盈利: 193.1171341293117 亏损: 0 最大盈利: 125.93 最大亏损: 67.18 总收益: 193.12 平均盈利: 96.56 typeA: 96.56 胜率: 100.00%
趋势空且增强-L2-3-4 总交易次数: 3 盈利: 625.4418587944054 亏损: 0 最大盈利: 563.08 最大亏损: 11.00 总收益: 625.44 平均盈利: 208.48 typeA: 208.48 胜率: 100.00%
趋势空且增强-L-4-3-4 总交易次数: 1 盈利: 28.46510919557738 亏损: 0 最大盈利: 28.47 最大亏损: 28.47 总收益: 28.47 平均盈利: 28.47 typeA: 28.47 胜率: 100.00%
趋势空且增强-L2-2-3 总交易次数: 1 盈利: 4.381879087574844 亏损: 0 最大盈利: 4.38 最大亏损: 4.38 总收益: 4.38 平均盈利: 4.38 typeA: 4.38 胜率: 100.00%
趋势空且增强-11 总交易次数: 5 盈利: 127.97841420120385 亏损: -633.6457753824751 最大盈利: 70.69 最大亏损: -633.65 总收益: -505.67 平均盈利: -101.13 typeA: -80.91 胜率: 80.00%
趋势多且增强-L3-1-3 总交易次数: 3 盈利: 381.1762799744609 亏损: -113.59075205952728 最大盈利: 280.52 最大亏损: -113.59 总收益: 267.59 平均盈利: 89.20 typeA: 59.47 胜率: 66.67%
趋势多且增强-11 总交易次数: 6 盈利: 2909.220094096537 亏损: -161.2687885445589 最大盈利: 2423.17 最大亏损: -119.67 总收益: 2747.95 平均盈利: 457.99 typeA: 305.34 胜率: 66.67%
趋势空且增强-L2-1-3 总交易次数: 3 盈利: 378.51443160690974 亏损: -70.90601864546052 最大盈利: 216.38 最大亏损: -70.91 总收益: 307.61 平均盈利: 102.54 typeA: 68.36 胜率: 66.67%
趋势空且增强-L2-3-3 总交易次数: 3 盈利: 326.7056479744281 亏损: -66.33927586840558 最大盈利: 274.60 最大亏损: -66.34 总收益: 260.37 平均盈利: 86.79 typeA: 57.86 胜率: 66.67%
趋势空且增强-2 总交易次数: 13 盈利: 2321.9519935774247 亏损: -1378.993134784656 最大盈利: 756.36 最大亏损: -818.35 总收益: 942.96 平均盈利: 72.54 typeA: 44.64 胜率: 61.54%
趋势多且增强-L1-2-5 总交易次数: 5 盈利: 311.1933932078672 亏损: -103.73618183758131 最大盈利: 279.17 最大亏损: -80.66 总收益: 207.46 平均盈利: 41.49 typeA: 24.89 胜率: 60.00%
趋势多且增强-L1-3-9 总交易次数: 4 盈利: 540.0976045349489 亏损: -163.93388491024635 最大盈利: 352.37 最大亏损: -99.31 总收益: 376.16 平均盈利: 94.04 typeA: 47.02 胜率: 50.00%
趋势多且增强-R-1-1-2 总交易次数: 12 盈利: 695.2842044145727 亏损: -2513.7332524199232 最大盈利: 328.83 最大亏损: -1818.29 总收益: -1818.45 平均盈利: -151.54 typeA: -75.77 胜率: 50.00%
趋势多且增强-L1-1-6 总交易次数: 5 盈利: 11.634065477483684 亏损: -501.69262023152606 最大盈利: 9.39 最大亏损: -324.21 总收益: -490.06 平均盈利: -98.01 typeA: -39.20 胜率: 40.00%
趋势多且增强-L3-1-4-1 总交易次数: 8 盈利: 36.60393915680093 亏损: -954.4250043297135 最大盈利: 15.84 最大亏损: -635.08 总收益: -917.82 平均盈利: -114.73 typeA: -43.02 胜率: 37.50%
趋势空且增强-L-4-1-4 总交易次数: 12 盈利: 686.9034581243111 亏损: -1844.0635203894494 最大盈利: 617.96 最大亏损: -390.76 总收益: -1157.16 平均盈利: -96.43 typeA: -16.07 胜率: 16.67%
趋势多且增强-R-1-1-1 总交易次数: 2 盈利: 0 亏损: -212.43861365874162 最大盈利: -4.23 最大亏损: -208.20 总收益: -212.44 平均盈利: -106.22 typeA: 0.00 胜率: 0.00%
趋势多且增强-L1-3-4 总交易次数: 2 盈利: 0 亏损: -108.5598748538 最大盈利: -14.64 最大亏损: -93.92 总收益: -108.56 平均盈利: -54.28 typeA: 0.00 胜率: 0.00%
趋势空且增强-L-4-2-4 总交易次数: 2 盈利: 0 亏损: -89.1256535339905 最大盈利: -24.93 最大亏损: -64.20 总收益: -89.13 平均盈利: -44.56 typeA: 0.00 胜率: 0.00%
趋势空且增强-L3-1-6 总交易次数: 1 盈利: 0 亏损: -111.45013252555864 最大盈利: -111.45 最大亏损: -111.45 总收益: -111.45 平均盈利: -111.45 typeA: 0.00 胜率: 0.00%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     106
      胜率:          54.72%
      总收益:        3096.27 USDT
      期末余额:      12884.27 USDT
      盈亏比:        1.45
      最大单笔盈利:  737.33
      最大单笔亏损:  -665.55
      手续费:       423.62820002553275
      =============================
    
profit: 2884.2681061433777
maxDrawdown 8.0%
startTime: 2021-06-30 00:00:00
趋势空且增强-2 总交易次数: 2 盈利: 31.30791228133861 亏损: 0 最大盈利: 16.50 最大亏损: 14.81 总收益: 31.31 平均盈利: 15.65 typeA: 15.65 胜率: 100.00%
趋势多且增强-L3-1-4-3 总交易次数: 1 盈利: 9.930787589498912 亏损: 0 最大盈利: 9.93 最大亏损: 9.93 总收益: 9.93 平均盈利: 9.93 typeA: 9.93 胜率: 100.00%
趋势多且增强-L3-1-3 总交易次数: 3 盈利: 923.116627775951 亏损: 0 最大盈利: 654.93 最大亏损: 107.47 总收益: 923.12 平均盈利: 307.71 typeA: 307.71 胜率: 100.00%
趋势空且增强-11 总交易次数: 4 盈利: 860.0340149311281 亏损: 0 最大盈利: 390.00 最大亏损: 82.18 总收益: 860.03 平均盈利: 215.01 typeA: 215.01 胜率: 100.00%
趋势空且增强-L1-1-2 总交易次数: 1 盈利: 252.851167618059 亏损: 0 最大盈利: 252.85 最大亏损: 252.85 总收益: 252.85 平均盈利: 252.85 typeA: 252.85 胜率: 100.00%
趋势多且增强-L3-1-4-1 总交易次数: 12 盈利: 571.2707640077937 亏损: -206.5281381223412 最大盈利: 234.77 最大亏损: -78.02 总收益: 364.74 平均盈利: 30.40 typeA: 22.80 胜率: 75.00%
趋势空且增强-L2-3-4 总交易次数: 7 盈利: 1068.3888286604963 亏损: -596.5631375410632 最大盈利: 451.44 最大亏损: -298.38 总收益: 471.83 平均盈利: 67.40 typeA: 48.15 胜率: 71.43%
趋势多且增强-R-1-1-2 总交易次数: 15 盈利: 1016.9804829782428 亏损: -653.5450517744189 最大盈利: 328.83 最大亏损: -250.84 总收益: 363.44 平均盈利: 24.23 typeA: 16.15 胜率: 66.67%
趋势空且增强-L2-1-3 总交易次数: 3 盈利: 161.48189197097358 亏损: -308.65070164734635 最大盈利: 104.11 最大亏损: -308.65 总收益: -147.17 平均盈利: -49.06 typeA: -32.71 胜率: 66.67%
趋势多且增强-11 总交易次数: 6 盈利: 622.0896435050814 亏损: -472.3076774876502 最大盈利: 348.99 最大亏损: -344.89 总收益: 149.78 平均盈利: 24.96 typeA: 16.64 胜率: 66.67%
趋势多且增强-R-1-1-1 总交易次数: 3 盈利: 289.20759610260643 亏损: -209.27999640223075 最大盈利: 241.97 最大亏损: -209.28 总收益: 79.93 平均盈利: 26.64 typeA: 17.76 胜率: 66.67%
趋势空且增强-L2-3-3 总交易次数: 4 盈利: 489.0521546850005 亏损: -371.3016623926797 最大盈利: 390.56 最大亏损: -199.24 总收益: 117.75 平均盈利: 29.44 typeA: 14.72 胜率: 50.00%
趋势空且增强-L-4-1-4 总交易次数: 6 盈利: 219.32132622418266 亏损: -126.6014068199113 最大盈利: 138.91 最大亏损: -68.55 总收益: 92.72 平均盈利: 15.45 typeA: 7.73 胜率: 50.00%
趋势空且增强-L-4-2-4 总交易次数: 6 盈利: 1703.7624804238903 亏损: -742.6398332287454 最大盈利: 737.33 最大亏损: -665.55 总收益: 961.12 平均盈利: 160.19 typeA: 80.09 胜率: 50.00%
趋势多且增强-L3-1-5 总交易次数: 5 盈利: 106.02330196154 亏损: -703.1984788388248 最大盈利: 99.16 最大亏损: -333.66 总收益: -597.18 平均盈利: -119.44 typeA: -47.77 胜率: 40.00%
趋势多且增强-L1-3-4 总交易次数: 7 盈利: 508.7939475811291 亏损: -252.97574419596054 最大盈利: 316.68 最大亏损: -68.71 总收益: 255.82 平均盈利: 36.55 typeA: 10.44 胜率: 28.57%
趋势空且增强-L3-1-6 总交易次数: 7 盈利: 463.7470656585755 亏损: -617.9156586586282 最大盈利: 342.48 最大亏损: -213.19 总收益: -154.17 平均盈利: -22.02 typeA: -6.29 胜率: 28.57%
趋势空且增强-L-4-3-4 总交易次数: 4 盈利: 678.0763139775075 亏损: -296.9521519908014 最大盈利: 678.08 最大亏损: -140.67 总收益: 381.12 平均盈利: 95.28 typeA: 23.82 胜率: 25.00%
趋势多且增强-L1-1-6 总交易次数: 2 盈利: 0 亏损: -283.3053770589866 最大盈利: -56.79 最大亏损: -226.52 总收益: -283.31 平均盈利: -141.65 typeA: 0.00 胜率: 0.00%
趋势空且增强-L-4-2-3 总交易次数: 1 盈利: 0 亏损: -125.35499467344148 最大盈利: -125.35 最大亏损: -125.35 总收益: -125.35 平均盈利: -125.35 typeA: 0.00 胜率: 0.00%
趋势多且增强-R-2-2 总交易次数: 1 盈利: 0 亏损: -106.89059221513212 最大盈利: -106.89 最大亏损: -106.89 总收益: -106.89 平均盈利: -106.89 typeA: 0.00 胜率: 0.00%
趋势空且增强-L2-3-5 总交易次数: 1 盈利: 0 亏损: -245.37844183564494 最大盈利: -245.38 最大亏损: -245.38 总收益: -245.38 平均盈利: -245.38 typeA: 0.00 胜率: 0.00%
趋势空且增强-L2-2-3 总交易次数: 1 盈利: 0 亏损: -6.7003887725893545 最大盈利: -6.70 最大亏损: -6.70 总收益: -6.70 平均盈利: -6.70 typeA: 0.00 胜率: 0.00%
趋势多且增强-L1-2-5 总交易次数: 1 盈利: 0 亏损: -164.35338041473625 最大盈利: -164.35 最大亏损: -164.35 总收益: -164.35 平均盈利: -164.35 typeA: 0.00 胜率: 0.00%
趋势多且增强-L1-3-9 总交易次数: 1 盈利: 0 亏损: -204.87663921225771 最大盈利: -204.88 最大亏损: -204.88 总收益: -204.88 平均盈利: -204.88 typeA: 0.00 胜率: 0.00%
趋势多且增强-L1-3-1 总交易次数: 1 盈利: 0 亏损: -5.238293540626248 最大盈利: -5.24 最大亏损: -5.24 总收益: -5.24 平均盈利: -5.24 typeA: 0.00 胜率: 0.00%
趋势多且增强-R-2-1 总交易次数: 1 盈利: 0 亏损: -178.6104549655951 最大盈利: -178.61 最大亏损: -178.61 总收益: -178.61 平均盈利: -178.61 typeA: 0.00 胜率: 0.00%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     97
      胜率:          51.55%
      总收益:        3911.97 USDT
      期末余额:      13715.97 USDT
      盈亏比:        1.43
      最大单笔盈利:  1654.31
      最大单笔亏损:  -813.44
      手续费:       390.68485206677195
      =============================
    
profit: 3715.973848529722
maxDrawdown 17.1%
startTime: 2021-07-30 00:00:00
趋势多且增强-R-1-1-1 总交易次数: 1 盈利: 241.9654610290366 亏损: 0 最大盈利: 241.97 最大亏损: 241.97 总收益: 241.97 平均盈利: 241.97 typeA: 241.97 胜率: 100.00%
趋势多且增强-L3-1-4-1 总交易次数: 8 盈利: 1723.19590157685 亏损: 0 最大盈利: 987.39 最大亏损: 6.19 总收益: 1723.20 平均盈利: 215.40 typeA: 215.40 胜率: 100.00%
趋势多且增强-L3-1-3 总交易次数: 4 盈利: 802.3948639732694 亏损: 0 最大盈利: 629.49 最大亏损: 12.28 总收益: 802.39 平均盈利: 200.60 typeA: 200.60 胜率: 100.00%
趋势空且增强-L1-1-2 总交易次数: 2 盈利: 276.1656544695295 亏损: 0 最大盈利: 218.26 最大亏损: 57.91 总收益: 276.17 平均盈利: 138.08 typeA: 138.08 胜率: 100.00%
趋势多且增强-R-1-2-2 总交易次数: 1 盈利: 628.2127705011391 亏损: 0 最大盈利: 628.21 最大亏损: 628.21 总收益: 628.21 平均盈利: 628.21 typeA: 628.21 胜率: 100.00%
趋势空且增强-L2-3-5 总交易次数: 4 盈利: 634.6410171653487 亏损: -60.85539653012399 最大盈利: 437.23 最大亏损: -60.86 总收益: 573.79 平均盈利: 143.45 typeA: 107.58 胜率: 75.00%
趋势多且增强-L3-1-5 总交易次数: 5 盈利: 736.5064443662255 亏损: -321.5428686508322 最大盈利: 350.23 最大亏损: -290.29 总收益: 414.96 平均盈利: 82.99 typeA: 49.80 胜率: 60.00%
趋势空且增强-L-4-1-4 总交易次数: 15 盈利: 2851.087684705037 亏损: -1547.8108040828376 最大盈利: 876.97 最大亏损: -569.19 总收益: 1303.28 平均盈利: 86.89 typeA: 46.34 胜率: 53.33%
趋势多且增强-L1-2-5 总交易次数: 4 盈利: 469.7240655905995 亏损: -96.31897242331057 最大盈利: 362.61 最大亏损: -78.74 总收益: 373.41 平均盈利: 93.35 typeA: 46.68 胜率: 50.00%
趋势多且增强-R-1-1-2 总交易次数: 6 盈利: 626.1529724658014 亏损: -333.25972413715 最大盈利: 408.84 最大亏损: -241.27 总收益: 292.89 平均盈利: 48.82 typeA: 24.41 胜率: 50.00%
趋势空且增强-L2-3-4 总交易次数: 2 盈利: 31.683538577530847 亏损: -575.7792220711603 最大盈利: 31.68 最大亏损: -575.78 总收益: -544.10 平均盈利: -272.05 typeA: -136.02 胜率: 50.00%
趋势多且增强-L1-1-6 总交易次数: 4 盈利: 360.0048801485344 亏损: -430.60279762503757 最大盈利: 210.37 最大亏损: -216.05 总收益: -70.60 平均盈利: -17.65 typeA: -8.82 胜率: 50.00%
趋势多且增强-L1-3-9 总交易次数: 2 盈利: 194.50473093924856 亏损: -311.5535790696261 最大盈利: 194.50 最大亏损: -311.55 总收益: -117.05 平均盈利: -58.52 typeA: -29.26 胜率: 50.00%
趋势多且增强-11 总交易次数: 9 盈利: 442.60331973478986 亏损: -982.575874300385 最大盈利: 165.36 最大亏损: -457.27 总收益: -539.97 平均盈利: -60.00 typeA: -26.66 胜率: 44.44%
趋势空且增强-2 总交易次数: 8 盈利: 2008.1285545735195 亏损: -1596.2242574990578 最大盈利: 1654.31 最大亏损: -675.22 总收益: 411.90 平均盈利: 51.49 typeA: 19.31 胜率: 37.50%
趋势空且增强-L-4-3-4 总交易次数: 3 盈利: 263.26145324821704 亏损: -158.3705189557292 最大盈利: 263.26 最大亏损: -92.10 总收益: 104.89 平均盈利: 34.96 typeA: 11.65 胜率: 33.33%
趋势空且增强-11 总交易次数: 4 盈利: 185.98120563830778 亏损: -1073.423448098125 最大盈利: 185.98 最大亏损: -813.44 总收益: -887.44 平均盈利: -221.86 typeA: -55.47 胜率: 25.00%
趋势空且增强-L-4-2-4 总交易次数: 4 盈利: 391.72176039119677 亏损: -487.66259501051286 最大盈利: 391.72 最大亏损: -230.31 总收益: -95.94 平均盈利: -23.99 typeA: -6.00 胜率: 25.00%
趋势空且增强-L2-3-3 总交易次数: 5 盈利: 104.26517411267909 亏损: -613.1376362347738 最大盈利: 104.27 最大亏损: -230.39 总收益: -508.87 平均盈利: -101.77 typeA: -20.35 胜率: 20.00%
趋势空且增强-L2-1-3 总交易次数: 1 盈利: 0 亏损: -194.7308649202391 最大盈利: -194.73 最大亏损: -194.73 总收益: -194.73 平均盈利: -194.73 typeA: 0.00 胜率: 0.00%
趋势多且增强-L3-1-4-3 总交易次数: 2 盈利: 0 亏损: -74.21575093690846 最大盈利: -0.49 最大亏损: -73.73 总收益: -74.22 平均盈利: -37.11 typeA: 0.00 胜率: 0.00%
趋势多且增强-L1-3-4 总交易次数: 1 盈利: 0 亏损: -4.489417857676137 最大盈利: -4.49 最大亏损: -4.49 总收益: -4.49 平均盈利: -4.49 typeA: 0.00 胜率: 0.00%
趋势空且增强-L3-1-6 总交易次数: 2 盈利: 0 亏损: -197.6738762736468 最大盈利: -56.99 最大亏损: -140.68 总收益: -197.67 平均盈利: -98.84 typeA: 0.00 胜率: 0.00%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     99
      胜率:          52.53%
      总收益:        3803.05 USDT
      期末余额:      13605.05 USDT
      盈亏比:        2.02
      最大单笔盈利:  551.67
      最大单笔亏损:  -454.73
      手续费:       395.9807733101463
      =============================
    
profit: 3605.0463918024616
maxDrawdown 6.1%
startTime: 2021-08-29 00:00:00
趋势空且增强-11 总交易次数: 2 盈利: 346.72664303707614 亏损: 0 最大盈利: 279.18 最大亏损: 67.55 总收益: 346.73 平均盈利: 173.36 typeA: 173.36 胜率: 100.00%
趋势多且增强-L1-3-9 总交易次数: 1 盈利: 50.53420458755787 亏损: 0 最大盈利: 50.53 最大亏损: 50.53 总收益: 50.53 平均盈利: 50.53 typeA: 50.53 胜率: 100.00%
趋势空且增强-L3-1-6 总交易次数: 2 盈利: 669.50203727702 亏损: 0 最大盈利: 445.21 最大亏损: 224.29 总收益: 669.50 平均盈利: 334.75 typeA: 334.75 胜率: 100.00%
趋势多且增强-R-1-2-2 总交易次数: 3 盈利: 97.9187531823319 亏损: 0 最大盈利: 64.94 最大亏损: 14.77 总收益: 97.92 平均盈利: 32.64 typeA: 32.64 胜率: 100.00%
趋势空且增强-L-4-3-4 总交易次数: 1 盈利: 348.1177056115468 亏损: 0 最大盈利: 348.12 最大亏损: 348.12 总收益: 348.12 平均盈利: 348.12 typeA: 348.12 胜率: 100.00%
趋势空且增强-L2-1-3 总交易次数: 1 盈利: 133.39887347943397 亏损: 0 最大盈利: 133.40 最大亏损: 133.40 总收益: 133.40 平均盈利: 133.40 typeA: 133.40 胜率: 100.00%
趋势多且增强-L3-1-4-3 总交易次数: 1 盈利: 14.872227579555895 亏损: 0 最大盈利: 14.87 最大亏损: 14.87 总收益: 14.87 平均盈利: 14.87 typeA: 14.87 胜率: 100.00%
趋势多且增强-L3-1-4-1 总交易次数: 7 盈利: 402.2446733144302 亏损: -138.73239615800426 最大盈利: 303.65 最大亏损: -138.73 总收益: 263.51 平均盈利: 37.64 typeA: 32.27 胜率: 85.71%
趋势多且增强-L3-1-5 总交易次数: 4 盈利: 122.12684919559256 亏损: -223.31510687695058 最大盈利: 59.88 最大亏损: -223.32 总收益: -101.19 平均盈利: -25.30 typeA: -18.97 胜率: 75.00%
趋势空且增强-L2-3-3 总交易次数: 3 盈利: 366.34164083417033 亏损: -72.59197176885874 最大盈利: 276.58 最大亏损: -72.59 总收益: 293.75 平均盈利: 97.92 typeA: 65.28 胜率: 66.67%
趋势空且增强-L2-3-5 总交易次数: 5 盈利: 610.098509317 亏损: -227.54117196562152 最大盈利: 497.57 最大亏损: -169.54 总收益: 382.56 平均盈利: 76.51 typeA: 45.91 胜率: 60.00%
趋势多且增强-R-1-1-2 总交易次数: 12 盈利: 1366.6601680100105 亏损: -503.91423750373843 最大盈利: 457.37 最大亏损: -293.10 总收益: 862.75 平均盈利: 71.90 typeA: 41.94 胜率: 58.33%
趋势空且增强-2 总交易次数: 4 盈利: 127.42886144334352 亏损: -121.92203852145619 最大盈利: 94.10 最大亏损: -117.87 总收益: 5.51 平均盈利: 1.38 typeA: 0.69 胜率: 50.00%
趋势空且增强-L2-3-4 总交易次数: 4 盈利: 95.0971226054429 亏损: -156.3280753351153 最大盈利: 61.25 最大亏损: -110.90 总收益: -61.23 平均盈利: -15.31 typeA: -7.65 胜率: 50.00%
趋势多且增强-R-1-1-1 总交易次数: 2 盈利: 49.94223572403533 亏损: -102.46828994061958 最大盈利: 49.94 最大亏损: -102.47 总收益: -52.53 平均盈利: -26.26 typeA: -13.13 胜率: 50.00%
趋势多且增强-L1-3-4 总交易次数: 5 盈利: 215.21943362051098 亏损: -232.47302063641507 最大盈利: 205.97 最大亏损: -151.43 总收益: -17.25 平均盈利: -3.45 typeA: -1.38 胜率: 40.00%
趋势空且增强-L-4-2-4 总交易次数: 8 盈利: 362.56496201028284 亏损: -663.6378933305389 最大盈利: 247.66 最大亏损: -454.73 总收益: -301.07 平均盈利: -37.63 typeA: -14.11 胜率: 37.50%
趋势空且增强-L-4-1-4 总交易次数: 17 盈利: 779.2219089188922 亏损: -641.4870903602463 最大盈利: 309.89 最大亏损: -128.54 总收益: 137.73 平均盈利: 8.10 typeA: 2.86 胜率: 35.29%
趋势多且增强-L1-2-5 总交易次数: 9 盈利: 1274.507808295045 亏损: -200.57596561875425 最大盈利: 551.67 最大亏损: -112.41 总收益: 1073.93 平均盈利: 119.33 typeA: 39.77 胜率: 33.33%
趋势多且增强-L1-1-6 总交易次数: 3 盈利: 105.62367237584928 亏损: -63.393717184014484 最大盈利: 105.62 最大亏损: -36.79 总收益: 42.23 平均盈利: 14.08 typeA: 4.69 胜率: 33.33%
趋势多且增强-11 总交易次数: 2 盈利: 0 亏损: -317.2967931794185 最大盈利: -85.61 最大亏损: -231.69 总收益: -317.30 平均盈利: -158.65 typeA: 0.00 胜率: 0.00%
趋势多且增强-L3-1-3 总交易次数: 1 盈利: 0 亏损: -1.282731903292202 最大盈利: -1.28 最大亏损: -1.28 总收益: -1.28 平均盈利: -1.28 typeA: 0.00 胜率: 0.00%
趋势多且增强-L1-2-1 总交易次数: 1 盈利: 0 亏损: -42.9372035513038 最大盈利: -42.94 最大亏损: -42.94 总收益: -42.94 平均盈利: -42.94 typeA: 0.00 胜率: 0.00%
趋势多且增强-R-2-1 总交易次数: 1 盈利: 0 亏损: -25.204194782309067 最大盈利: -25.20 最大亏损: -25.20 总收益: -25.20 平均盈利: -25.20 typeA: 0.00 胜率: 0.00%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     101
      胜率:          44.55%
      总收益:        1895.46 USDT
      期末余额:      11691.46 USDT
      盈亏比:        1.24
      最大单笔盈利:  2299.54
      最大单笔亏损:  -731.06
      手续费:       406.945352980418
      =============================
    
profit: 1691.4569880512718
maxDrawdown 22.1%
startTime: 2021-09-28 00:00:00
趋势多且增强-L3-1-4-3 总交易次数: 1 盈利: 7.563720161746075 亏损: 0 最大盈利: 7.56 最大亏损: 7.56 总收益: 7.56 平均盈利: 7.56 typeA: 7.56 胜率: 100.00%
趋势多且增强-L1-3-9 总交易次数: 1 盈利: 17.77802096047806 亏损: 0 最大盈利: 17.78 最大亏损: 17.78 总收益: 17.78 平均盈利: 17.78 typeA: 17.78 胜率: 100.00%
趋势空且增强-L-4-2-3 总交易次数: 1 盈利: 13.065092611439415 亏损: 0 最大盈利: 13.07 最大亏损: 13.07 总收益: 13.07 平均盈利: 13.07 typeA: 13.07 胜率: 100.00%
趋势多且增强-L3-1-3 总交易次数: 2 盈利: 103.98503791606088 亏损: 0 最大盈利: 103.63 最大亏损: 0.35 总收益: 103.99 平均盈利: 51.99 typeA: 51.99 胜率: 100.00%
趋势空且增强-L2-3-3 总交易次数: 4 盈利: 166.27719184932576 亏损: -219.06167356414647 最大盈利: 71.68 最大亏损: -219.06 总收益: -52.78 平均盈利: -13.20 typeA: -9.90 胜率: 75.00%
趋势空且增强-L2-3-5 总交易次数: 4 盈利: 708.2432504772744 亏损: -398.2160746439677 最大盈利: 440.73 最大亏损: -398.22 总收益: 310.03 平均盈利: 77.51 typeA: 58.13 胜率: 75.00%
趋势多且增强-L3-1-4-1 总交易次数: 13 盈利: 840.0793616230976 亏损: -236.21013597417883 最大盈利: 453.01 最大亏损: -78.23 总收益: 603.87 平均盈利: 46.45 typeA: 32.16 胜率: 69.23%
趋势空且增强-L2-1-3 总交易次数: 6 盈利: 1758.7615266599996 亏损: -149.61665792782006 最大盈利: 1220.97 最大亏损: -95.86 总收益: 1609.14 平均盈利: 268.19 typeA: 178.80 胜率: 66.67%
趋势多且增强-L3-1-5 总交易次数: 3 盈利: 218.10451165051492 亏损: -39.19494047619051 最大盈利: 151.29 最大亏损: -39.19 总收益: 178.91 平均盈利: 59.64 typeA: 39.76 胜率: 66.67%
趋势空且增强-L-4-2-4 总交易次数: 4 盈利: 30.839949188566408 亏损: -376.02625539793996 最大盈利: 27.92 最大亏损: -287.88 总收益: -345.19 平均盈利: -86.30 typeA: -43.15 胜率: 50.00%
趋势多且增强-11 总交易次数: 9 盈利: 3027.2436237459956 亏损: -503.5681553143796 最大盈利: 2299.54 最大亏损: -174.70 总收益: 2523.68 平均盈利: 280.41 typeA: 124.61 胜率: 44.44%
趋势多且增强-R-1-1-2 总交易次数: 7 盈利: 1153.849539206455 亏损: -309.6387641305333 最大盈利: 880.68 最大亏损: -117.46 总收益: 844.21 平均盈利: 120.60 typeA: 51.69 胜率: 42.86%
趋势空且增强-L-4-1-4 总交易次数: 11 盈利: 569.3231917533446 亏损: -1048.3428571927773 最大盈利: 322.59 最大亏损: -600.10 总收益: -479.02 平均盈利: -43.55 typeA: -15.83 胜率: 36.36%
趋势空且增强-L2-3-4 总交易次数: 3 盈利: 29.211352716825587 亏损: -196.69716479165186 最大盈利: 29.21 最大亏损: -159.01 总收益: -167.49 平均盈利: -55.83 typeA: -18.61 胜率: 33.33%
趋势空且增强-L1-1-2 总交易次数: 6 盈利: 205.56105144527083 亏损: -1087.8180463188235 最大盈利: 153.33 最大亏损: -731.06 总收益: -882.26 平均盈利: -147.04 typeA: -49.01 胜率: 33.33%
趋势空且增强-L3-1-6 总交易次数: 4 盈利: 243.5077010606745 亏损: -521.5416118155077 最大盈利: 243.51 最大亏损: -220.67 总收益: -278.03 平均盈利: -69.51 typeA: -17.38 胜率: 25.00%
趋势空且增强-L-4-3-4 总交易次数: 4 盈利: 285.10497627544095 亏损: -581.6784035854125 最大盈利: 285.10 最大亏损: -272.25 总收益: -296.57 平均盈利: -74.14 typeA: -18.54 胜率: 25.00%
趋势多且增强-L1-2-5 总交易次数: 5 盈利: 311.7711289076794 亏损: -448.7331292398477 最大盈利: 311.77 最大亏损: -188.65 总收益: -136.96 平均盈利: -27.39 typeA: -5.48 胜率: 20.00%
趋势多且增强-L1-3-4 总交易次数: 3 盈利: 0 亏损: -414.80125053752164 最大盈利: -40.65 最大亏损: -301.55 总收益: -414.80 平均盈利: -138.27 typeA: 0.00 胜率: 0.00%
趋势多且增强-L1-2-2 总交易次数: 3 盈利: 0 亏损: -295.5362244514983 最大盈利: -42.74 最大亏损: -128.39 总收益: -295.54 平均盈利: -98.51 typeA: 0.00 胜率: 0.00%
趋势空且增强-2 总交易次数: 5 盈利: 0 亏损: -849.3406555861609 最大盈利: -4.02 最大亏损: -538.14 总收益: -849.34 平均盈利: -169.87 typeA: 0.00 胜率: 0.00%
趋势多且增强-L1-1-6 总交易次数: 2 盈利: 0 亏损: -118.79123921056251 最大盈利: -53.45 最大亏损: -65.34 总收益: -118.79 平均盈利: -59.40 typeA: 0.00 胜率: 0.00%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     95
      胜率:          46.32%
      总收益:        2952.46 USDT
      期末余额:      12762.46 USDT
      盈亏比:        1.56
      最大单笔盈利:  2299.54
      最大单笔亏损:  -731.06
      手续费:       380.13586681927086
      =============================
    
profit: 2762.464225425181
maxDrawdown 6.1%
startTime: 2021-10-28 00:00:00
趋势空且增强-L3-1-6 总交易次数: 1 盈利: 137.5143183651515 亏损: 0 最大盈利: 137.51 最大亏损: 137.51 总收益: 137.51 平均盈利: 137.51 typeA: 137.51 胜率: 100.00%
趋势多且增强-L3-1-5 总交易次数: 2 盈利: 265.08526188983194 亏损: 0 最大盈利: 179.45 最大亏损: 85.63 总收益: 265.09 平均盈利: 132.54 typeA: 132.54 胜率: 100.00%
趋势多且增强-L1-3-9 总交易次数: 1 盈利: 161.2326530612247 亏损: 0 最大盈利: 161.23 最大亏损: 161.23 总收益: 161.23 平均盈利: 161.23 typeA: 161.23 胜率: 100.00%
趋势多且增强-L1-3-4 总交易次数: 3 盈利: 444.71464128448656 亏损: 0 最大盈利: 245.89 最大亏损: 69.81 总收益: 444.71 平均盈利: 148.24 typeA: 148.24 胜率: 100.00%
趋势多且增强-L1-2-1 总交易次数: 1 盈利: 267.068507194902 亏损: 0 最大盈利: 267.07 最大亏损: 267.07 总收益: 267.07 平均盈利: 267.07 typeA: 267.07 胜率: 100.00%
趋势空且增强-11 总交易次数: 2 盈利: 250.0859672342483 亏损: 0 最大盈利: 172.15 最大亏损: 77.94 总收益: 250.09 平均盈利: 125.04 typeA: 125.04 胜率: 100.00%
趋势多且增强-L3-1-4-1 总交易次数: 7 盈利: 139.57811494840428 亏损: -180.15847302436995 最大盈利: 34.44 最大亏损: -180.16 总收益: -40.58 平均盈利: -5.80 typeA: -4.97 胜率: 85.71%
趋势空且增强-L2-3-5 总交易次数: 5 盈利: 503.6309871973208 亏损: -241.83399428202574 最大盈利: 376.08 最大亏损: -241.83 总收益: 261.80 平均盈利: 52.36 typeA: 41.89 胜率: 80.00%
趋势空且增强-L2-1-3 总交易次数: 3 盈利: 506.9111216653258 亏损: -5.802318950769397 最大盈利: 430.18 最大亏损: -5.80 总收益: 501.11 平均盈利: 167.04 typeA: 111.36 胜率: 66.67%
趋势多且增强-R-1-1-2 总交易次数: 8 盈利: 312.93172609832123 亏损: -388.75392533951015 最大盈利: 224.15 最大亏损: -184.53 总收益: -75.82 平均盈利: -9.48 typeA: -5.92 胜率: 62.50%
趋势空且增强-L1-1-2 总交易次数: 2 盈利: 111.3711161488197 亏损: -731.0591322155371 最大盈利: 111.37 最大亏损: -731.06 总收益: -619.69 平均盈利: -309.84 typeA: -154.92 胜率: 50.00%
趋势空且增强-L2-3-3 总交易次数: 4 盈利: 458.43867118645846 亏损: -108.53264963527732 最大盈利: 430.97 最大亏损: -64.12 总收益: 349.91 平均盈利: 87.48 typeA: 43.74 胜率: 50.00%
趋势多且增强-R-2-1 总交易次数: 2 盈利: 7.66812362201787 亏损: -54.94337087532139 最大盈利: 7.67 最大亏损: -54.94 总收益: -47.28 平均盈利: -23.64 typeA: -11.82 胜率: 50.00%
趋势多且增强-R-1-2-2 总交易次数: 2 盈利: 25.559264271036678 亏损: -323.3284231670569 最大盈利: 25.56 最大亏损: -323.33 总收益: -297.77 平均盈利: -148.88 typeA: -74.44 胜率: 50.00%
趋势空且增强-L-4-1-4 总交易次数: 12 盈利: 1615.4285611288965 亏损: -303.71122049948116 最大盈利: 810.37 最大亏损: -83.58 总收益: 1311.72 平均盈利: 109.31 typeA: 45.55 胜率: 41.67%
趋势空且增强-L-4-2-4 总交易次数: 5 盈利: 429.36908953156774 亏损: -427.642710879681 最大盈利: 260.25 最大亏损: -271.60 总收益: 1.73 平均盈利: 0.35 typeA: 0.14 胜率: 40.00%
趋势空且增强-2 总交易次数: 6 盈利: 151.94233005309857 亏损: -446.7759714055064 最大盈利: 112.65 最大亏损: -304.60 总收益: -294.83 平均盈利: -49.14 typeA: -16.38 胜率: 33.33%
趋势多且增强-11 总交易次数: 3 盈利: 2299.539285151946 亏损: -87.71396822664785 最大盈利: 2299.54 最大亏损: -63.22 总收益: 2211.83 平均盈利: 737.28 typeA: 245.73 胜率: 33.33%
趋势空且增强-L2-3-4 总交易次数: 7 盈利: 114.4322264025734 亏损: -565.1197485994483 最大盈利: 72.71 最大亏损: -162.06 总收益: -450.69 平均盈利: -64.38 typeA: -18.39 胜率: 28.57%
趋势多且增强-L3-1-3 总交易次数: 3 盈利: 0 亏损: -237.43000235136853 最大盈利: -19.83 最大亏损: -144.20 总收益: -237.43 平均盈利: -79.14 typeA: 0.00 胜率: 0.00%
趋势多且增强-L1-2-5 总交易次数: 9 盈利: 0 亏损: -606.3732546032653 最大盈利: -0.47 最大亏损: -271.43 总收益: -606.37 平均盈利: -67.37 typeA: 0.00 胜率: 0.00%
趋势空且增强-L-4-3-4 总交易次数: 3 盈利: 0 亏损: -316.767317901194 最大盈利: -0.47 最大亏损: -210.92 总收益: -316.77 平均盈利: -105.59 typeA: 0.00 胜率: 0.00%
趋势多且增强-L1-1-6 总交易次数: 2 盈利: 0 亏损: -115.15130911155327 最大盈利: -52.19 最大亏损: -62.96 总收益: -115.15 平均盈利: -57.58 typeA: 0.00 胜率: 0.00%
趋势多且增强-L3-1-4-3 总交易次数: 1 盈利: 0 亏损: -69.31168888692004 最大盈利: -69.31 最大亏损: -69.31 总收益: -69.31 平均盈利: -69.31 typeA: 0.00 胜率: 0.00%
趋势多且增强-L1-3-2 总交易次数: 1 盈利: 0 亏损: -39.62826105551244 最大盈利: -39.63 最大亏损: -39.63 总收益: -39.63 平均盈利: -39.63 typeA: 0.00 胜率: 0.00%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     83
      胜率:          44.58%
      总收益:        -3102.16 USDT
      期末余额:      6729.84 USDT
      盈亏比:        0.64
      最大单笔盈利:  649.80
      最大单笔亏损:  -2061.77
      手续费:       334.092795084142
      =============================
    
profit: -3270.1588883652976
maxDrawdown 32.7%
startTime: 2021-11-27 00:00:00
趋势多且增强-L3-1-5 总交易次数: 2 盈利: 178.59450271514655 亏损: 0 最大盈利: 171.83 最大亏损: 6.77 总收益: 178.59 平均盈利: 89.30 typeA: 89.30 胜率: 100.00%
趋势多且增强-L1-3-1 总交易次数: 1 盈利: 84.85142632965285 亏损: 0 最大盈利: 84.85 最大亏损: 84.85 总收益: 84.85 平均盈利: 84.85 typeA: 84.85 胜率: 100.00%
趋势多且增强-R-1-1-1 总交易次数: 2 盈利: 576.9973225909112 亏损: 0 最大盈利: 471.30 最大亏损: 105.70 总收益: 577.00 平均盈利: 288.50 typeA: 288.50 胜率: 100.00%
趋势空且增强-11 总交易次数: 1 盈利: 211.29566265060336 亏损: 0 最大盈利: 211.30 最大亏损: 211.30 总收益: 211.30 平均盈利: 211.30 typeA: 211.30 胜率: 100.00%
趋势空且增强-2 总交易次数: 1 盈利: 12.093940817284716 亏损: 0 最大盈利: 12.09 最大亏损: 12.09 总收益: 12.09 平均盈利: 12.09 typeA: 12.09 胜率: 100.00%
趋势多且增强-R-1-1-2 总交易次数: 12 盈利: 995.6839917373096 亏损: -2144.317720330137 最大盈利: 321.57 最大亏损: -2061.77 总收益: -1148.63 平均盈利: -95.72 typeA: -71.79 胜率: 75.00%
趋势多且增强-L3-1-3 总交易次数: 3 盈利: 60.643124787865936 亏损: -11.301005872434065 最大盈利: 59.23 最大亏损: -11.30 总收益: 49.34 平均盈利: 16.45 typeA: 10.97 胜率: 66.67%
趋势空且增强-L2-1-3 总交易次数: 3 盈利: 181.00699085157567 亏损: -13.320882852292346 最大盈利: 162.42 最大亏损: -13.32 总收益: 167.69 平均盈利: 55.90 typeA: 37.27 胜率: 66.67%
趋势多且增强-L3-1-4-1 总交易次数: 5 盈利: 92.67949739870082 亏损: -205.54006360757336 最大盈利: 45.38 最大亏损: -143.35 总收益: -112.86 平均盈利: -22.57 typeA: -13.54 胜率: 60.00%
趋势空且增强-L2-3-3 总交易次数: 2 盈利: 107.01824137346897 亏损: -769.004461895414 最大盈利: 107.02 最大亏损: -769.00 总收益: -661.99 平均盈利: -330.99 typeA: -165.50 胜率: 50.00%
趋势空且增强-L2-3-5 总交易次数: 2 盈利: 15.753979054493504 亏损: -119.03845540130735 最大盈利: 15.75 最大亏损: -119.04 总收益: -103.28 平均盈利: -51.64 typeA: -25.82 胜率: 50.00%
趋势空且增强-L-4-3-4 总交易次数: 3 盈利: 274.61166396667477 亏损: -122.12177984695708 最大盈利: 274.61 最大亏损: -117.68 总收益: 152.49 平均盈利: 50.83 typeA: 16.94 胜率: 33.33%
趋势空且增强-L-4-2-4 总交易次数: 6 盈利: 1025.2765014573095 亏损: -619.3115653581376 最大盈利: 649.80 最大亏损: -246.30 总收益: 405.96 平均盈利: 67.66 typeA: 22.55 胜率: 33.33%
趋势空且增强-L-4-2-3 总交易次数: 3 盈利: 52.46138459828918 亏损: -134.80444568601888 最大盈利: 52.46 最大亏损: -71.37 总收益: -82.34 平均盈利: -27.45 typeA: -9.15 胜率: 33.33%
趋势多且增强-L3-1-4-3 总交易次数: 3 盈利: 199.38006611974942 亏损: -193.8137893150421 最大盈利: 199.38 最大亏损: -137.29 总收益: 5.57 平均盈利: 1.86 typeA: 0.62 胜率: 33.33%
趋势空且增强-L-4-1-4 总交易次数: 7 盈利: 801.6712693532786 亏损: -1087.8935909883544 最大盈利: 419.04 最大亏损: -927.73 总收益: -286.22 平均盈利: -40.89 typeA: -11.68 胜率: 28.57%
趋势空且增强-L2-3-4 总交易次数: 7 盈利: 304.06227403816763 亏损: -1465.5714841561444 最大盈利: 268.85 最大亏损: -470.02 总收益: -1161.51 平均盈利: -165.93 typeA: -47.41 胜率: 28.57%
趋势多且增强-L1-3-4 总交易次数: 8 盈利: 17.935333078647638 亏损: -426.74588367961763 最大盈利: 11.19 最大亏损: -204.46 总收益: -408.81 平均盈利: -51.10 typeA: -12.78 胜率: 25.00%
趋势空且增强-L3-1-6 总交易次数: 5 盈利: 393.2648713455683 亏损: -773.690527421779 最大盈利: 393.26 最大亏损: -502.61 总收益: -380.43 平均盈利: -76.09 typeA: -15.22 胜率: 20.00%
趋势多且增强-L1-1-6 总交易次数: 1 盈利: 0 亏损: -62.95751475854112 最大盈利: -62.96 最大亏损: -62.96 总收益: -62.96 平均盈利: -62.96 typeA: 0.00 胜率: 0.00%
趋势多且增强-L1-2-5 总交易次数: 1 盈利: 0 亏损: -41.569284231865204 最大盈利: -41.57 最大亏损: -41.57 总收益: -41.57 平均盈利: -41.57 typeA: 0.00 胜率: 0.00%
趋势多且增强-11 总交易次数: 4 盈利: 0 亏损: -440.3181301810841 最大盈利: -50.03 最大亏损: -209.34 总收益: -440.32 平均盈利: -110.08 typeA: 0.00 胜率: 0.00%
趋势空且增强-L1-1-2 总交易次数: 1 盈利: 0 亏损: -56.12034704730023 最大盈利: -56.12 最大亏损: -56.12 总收益: -56.12 平均盈利: -56.12 typeA: 0.00 胜率: 0.00%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     103
      胜率:          50.49%
      总收益:        3050.89 USDT
      期末余额:      12844.89 USDT
      盈亏比:        1.44
      最大单笔盈利:  1343.85
      最大单笔亏损:  -937.86
      手续费:       412.00625648248626
      =============================
    
profit: 2844.8941472929273
maxDrawdown 23.7%
startTime: 2021-12-27 00:00:00
趋势多且增强-R-1-1-1 总交易次数: 2 盈利: 272.0645014362815 亏损: 0 最大盈利: 239.63 最大亏损: 32.44 总收益: 272.06 平均盈利: 136.03 typeA: 136.03 胜率: 100.00%
趋势空且增强-L2-2-3 总交易次数: 1 盈利: 215.369151826139 亏损: 0 最大盈利: 215.37 最大亏损: 215.37 总收益: 215.37 平均盈利: 215.37 typeA: 215.37 胜率: 100.00%
趋势多且增强-L3-1-4-3 总交易次数: 6 盈利: 943.0133552641875 亏损: -207.5663551401867 最大盈利: 813.43 最大亏损: -207.57 总收益: 735.45 平均盈利: 122.57 typeA: 102.14 胜率: 83.33%
趋势空且增强-L2-3-3 总交易次数: 7 盈利: 1149.452925099034 亏损: -53.80804554193412 最大盈利: 343.21 最大亏损: -32.57 总收益: 1095.64 平均盈利: 156.52 typeA: 111.80 胜率: 71.43%
趋势空且增强-L2-3-4 总交易次数: 9 盈利: 409.590233954361 亏损: -196.33141287323502 最大盈利: 161.17 最大亏损: -110.71 总收益: 213.26 平均盈利: 23.70 typeA: 15.80 胜率: 66.67%
趋势空且增强-2 总交易次数: 3 盈利: 497.9543996595882 亏损: -176.97439140056852 最大盈利: 479.90 最大亏损: -176.97 总收益: 320.98 平均盈利: 106.99 typeA: 71.33 胜率: 66.67%
趋势空且增强-L-4-1-4 总交易次数: 8 盈利: 1519.8929027427819 亏损: -502.0071512894564 最大盈利: 747.50 最大亏损: -373.23 总收益: 1017.89 平均盈利: 127.24 typeA: 79.52 胜率: 62.50%
趋势多且增强-L3-1-4-1 总交易次数: 9 盈利: 1451.9777179056414 亏损: -236.40598682491117 最大盈利: 1343.85 最大亏损: -107.62 总收益: 1215.57 平均盈利: 135.06 typeA: 75.04 胜率: 55.56%
趋势多且增强-R-1-1-2 总交易次数: 10 盈利: 238.6546111263028 亏损: -534.8898449611944 最大盈利: 130.94 最大亏损: -165.67 总收益: -296.24 平均盈利: -29.62 typeA: -14.81 胜率: 50.00%
趋势多且增强-L3-1-5 总交易次数: 4 盈利: 801.0272672693686 亏损: -316.6741695273865 最大盈利: 714.46 最大亏损: -220.76 总收益: 484.35 平均盈利: 121.09 typeA: 60.54 胜率: 50.00%
趋势多且增强-11 总交易次数: 4 盈利: 114.91165959166449 亏损: -343.01561223743846 最大盈利: 113.54 最大亏损: -207.03 总收益: -228.10 平均盈利: -57.03 typeA: -28.51 胜率: 50.00%
趋势多且增强-R-2-1 总交易次数: 4 盈利: 39.88688583746762 亏损: -547.8513382176201 最大盈利: 22.20 最大亏损: -498.07 总收益: -507.96 平均盈利: -126.99 typeA: -63.50 胜率: 50.00%
趋势空且增强-11 总交易次数: 2 盈利: 459.86057347670175 亏损: -89.70544022906222 最大盈利: 459.86 最大亏损: -89.71 总收益: 370.16 平均盈利: 185.08 typeA: 92.54 胜率: 50.00%
趋势多且增强-R-1-2-2 总交易次数: 4 盈利: 391.2122828961769 亏损: -173.60148002100547 最大盈利: 361.87 最大亏损: -128.87 总收益: 217.61 平均盈利: 54.40 typeA: 27.20 胜率: 50.00%
趋势多且增强-L1-3-4 总交易次数: 9 盈利: 905.1123555095853 亏损: -677.4423884787874 最大盈利: 428.77 最大亏损: -562.16 总收益: 227.67 平均盈利: 25.30 typeA: 11.24 胜率: 44.44%
趋势空且增强-L-4-2-3 总交易次数: 4 盈利: 191.41523853635996 亏损: -131.9310204150626 最大盈利: 191.42 最大亏损: -70.90 总收益: 59.48 平均盈利: 14.87 typeA: 3.72 胜率: 25.00%
趋势空且增强-L-4-2-4 总交易次数: 4 盈利: 322.6552536516418 亏损: -608.260877194697 最大盈利: 322.66 最大亏损: -238.60 总收益: -285.61 平均盈利: -71.40 typeA: -17.85 胜率: 25.00%
趋势空且增强-L2-3-5 总交易次数: 4 盈利: 27.27725103404492 亏损: -1071.0743677781159 最大盈利: 27.28 最大亏损: -937.86 总收益: -1043.80 平均盈利: -260.95 typeA: -65.24 胜率: 25.00%
趋势空且增强-L-4-3-4 总交易次数: 1 盈利: 0 亏损: -20.604194727728334 最大盈利: -20.60 最大亏损: -20.60 总收益: -20.60 平均盈利: -20.60 typeA: 0.00 胜率: 0.00%
趋势多且增强-L1-3-9 总交易次数: 2 盈利: 0 亏损: -492.48318395500536 最大盈利: -29.63 最大亏损: -462.86 总收益: -492.48 平均盈利: -246.24 typeA: 0.00 胜率: 0.00%
趋势多且增强-L1-2-5 总交易次数: 2 盈利: 0 亏损: -96.1676876516344 最大盈利: -37.95 最大亏损: -58.22 总收益: -96.17 平均盈利: -48.08 typeA: 0.00 胜率: 0.00%
趋势空且增强-L3-1-6 总交易次数: 3 盈利: 0 亏损: -416.49780990052875 最大盈利: -74.32 最大亏损: -181.67 总收益: -416.50 平均盈利: -138.83 typeA: 0.00 胜率: 0.00%
趋势空且增强-L2-1-3 总交易次数: 1 盈利: 0 亏损: -7.141661158844586 最大盈利: -7.14 最大亏损: -7.14 总收益: -7.14 平均盈利: -7.14 typeA: 0.00 胜率: 0.00%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     91
      胜率:          51.65%
      总收益:        701.47 USDT
      期末余额:      10519.47 USDT
      盈亏比:        1.14
      最大单笔盈利:  628.86
      最大单笔亏损:  -830.33
      手续费:       363.9823139366484
      =============================
    
profit: 519.4703112833795
maxDrawdown 14.5%
startTime: 2022-01-26 00:00:00
趋势多且增强-L1-3-9 总交易次数: 1 盈利: 178.84402267371385 亏损: 0 最大盈利: 178.84 最大亏损: 178.84 总收益: 178.84 平均盈利: 178.84 typeA: 178.84 胜率: 100.00%
趋势多且增强-L3-1-4-1 总交易次数: 2 盈利: 122.04753411558534 亏损: 0 最大盈利: 64.94 最大亏损: 57.11 总收益: 122.05 平均盈利: 61.02 typeA: 61.02 胜率: 100.00%
趋势多且增强-L3-1-4-3 总交易次数: 6 盈利: 104.04281476558377 亏损: -51.03614619725937 最大盈利: 47.48 最大亏损: -51.04 总收益: 53.01 平均盈利: 8.83 typeA: 7.36 胜率: 83.33%
趋势多且增强-L3-1-3 总交易次数: 5 盈利: 466.74835800573027 亏损: -22.088824222269274 最大盈利: 210.03 最大亏损: -22.09 总收益: 444.66 平均盈利: 88.93 typeA: 71.15 胜率: 80.00%
趋势多且增强-R-1-2-2 总交易次数: 5 盈利: 791.5551586988009 亏损: -830.3333605686737 最大盈利: 234.67 最大亏损: -830.33 总收益: -38.78 平均盈利: -7.76 typeA: -6.20 胜率: 80.00%
趋势多且增强-R-1-1-2 总交易次数: 3 盈利: 253.4428066902301 亏损: -98.45129411764775 最大盈利: 220.58 最大亏损: -98.45 总收益: 154.99 平均盈利: 51.66 typeA: 34.44 胜率: 66.67%
趋势多且增强-L3-1-5 总交易次数: 6 盈利: 90.49858519857221 亏损: -42.109157474397364 最大盈利: 24.53 最大亏损: -25.24 总收益: 48.39 平均盈利: 8.06 typeA: 5.38 胜率: 66.67%
趋势多且增强-R-2-1 总交易次数: 3 盈利: 129.33470548080368 亏损: -137.62584304108074 最大盈利: 100.69 最大亏损: -137.63 总收益: -8.29 平均盈利: -2.76 typeA: -1.84 胜率: 66.67%
趋势空且增强-L-4-3-4 总交易次数: 8 盈利: 700.3223943197263 亏损: -216.79053631968827 最大盈利: 315.65 最大亏损: -161.51 总收益: 483.53 平均盈利: 60.44 typeA: 37.78 胜率: 62.50%
趋势空且增强-L2-3-4 总交易次数: 5 盈利: 511.3702290918813 亏损: -464.8566962747683 最大盈利: 255.32 最大亏损: -388.87 总收益: 46.51 平均盈利: 9.30 typeA: 5.58 胜率: 60.00%
趋势多且增强-L-4-2-2 总交易次数: 2 盈利: 197.32765021311602 亏损: -50.76039016115325 最大盈利: 197.33 最大亏损: -50.76 总收益: 146.57 平均盈利: 73.28 typeA: 36.64 胜率: 50.00%
趋势空且增强-L2-3-3 总交易次数: 6 盈利: 113.80275809651567 亏损: -383.3428947952064 最大盈利: 62.68 最大亏损: -178.92 总收益: -269.54 平均盈利: -44.92 typeA: -22.46 胜率: 50.00%
趋势空且增强-L-4-1-4 总交易次数: 2 盈利: 507.8633405639911 亏损: -89.32055418485609 最大盈利: 507.86 最大亏损: -89.32 总收益: 418.54 平均盈利: 209.27 typeA: 104.64 胜率: 50.00%
趋势空且增强-L-4-2-3 总交易次数: 2 盈利: 628.858650584244 亏损: -7.351933955053854 最大盈利: 628.86 最大亏损: -7.35 总收益: 621.51 平均盈利: 310.75 typeA: 155.38 胜率: 50.00%
趋势多且增强-R-3-1 总交易次数: 2 盈利: 141.88238731828469 亏损: -212.2650003359534 最大盈利: 141.88 最大亏损: -212.27 总收益: -70.38 平均盈利: -35.19 typeA: -17.60 胜率: 50.00%
趋势多且增强-R-2-2 总交易次数: 2 盈利: 23.752870179569413 亏损: -38.80679646017647 最大盈利: 23.75 最大亏损: -38.81 总收益: -15.05 平均盈利: -7.53 typeA: -3.76 胜率: 50.00%
趋势多且增强-11 总交易次数: 7 盈利: 483.9176612535743 亏损: -707.3929381318167 最大盈利: 438.25 最大亏损: -437.57 总收益: -223.48 平均盈利: -31.93 typeA: -13.68 胜率: 42.86%
趋势空且增强-2 总交易次数: 5 盈利: 215.35580291007258 亏损: -171.52091283162468 最大盈利: 115.21 最大亏损: -71.89 总收益: 43.83 平均盈利: 8.77 typeA: 3.51 胜率: 40.00%
趋势多且增强-L1-3-4 总交易次数: 4 盈利: 7.4225936164872595 亏损: -326.97270662528945 最大盈利: 7.42 最大亏损: -284.31 总收益: -319.55 平均盈利: -79.89 typeA: -19.97 胜率: 25.00%
趋势空且增强-L-4-2-4 总交易次数: 6 盈利: 33.51747667455859 亏损: -293.75474173940546 最大盈利: 33.52 最大亏损: -151.91 总收益: -260.24 平均盈利: -43.37 typeA: -7.23 胜率: 16.67%
趋势多且增强-L1-2-5 总交易次数: 3 盈利: 0 亏损: -156.23244139176478 最大盈利: -8.96 最大亏损: -108.27 总收益: -156.23 平均盈利: -52.08 typeA: 0.00 胜率: 0.00%
趋势空且增强-L1-1-2 总交易次数: 1 盈利: 0 亏损: -9.326496637144503 最大盈利: -9.33 最大亏损: -9.33 总收益: -9.33 平均盈利: -9.33 typeA: 0.00 胜率: 0.00%
趋势空且增强-L2-3-5 总交易次数: 3 盈利: 0 亏损: -283.5794503005165 最大盈利: -7.10 最大亏损: -154.49 总收益: -283.58 平均盈利: -94.53 typeA: 0.00 胜率: 0.00%
趋势空且增强-11 总交易次数: 1 盈利: 0 亏损: -383.20777591973257 最大盈利: -383.21 最大亏损: -383.21 总收益: -383.21 平均盈利: -383.21 typeA: 0.00 胜率: 0.00%
趋势多且增强-L1-3-2 总交易次数: 1 盈利: 0 亏损: -23.31059748218309 最大盈利: -23.31 最大亏损: -23.31 总收益: -23.31 平均盈利: -23.31 typeA: 0.00 胜率: 0.00%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     74
      胜率:          55.41%
      总收益:        3010.94 USDT
      期末余额:      12860.94 USDT
      盈亏比:        1.82
      最大单笔盈利:  962.15
      最大单笔亏损:  -484.32
      手续费:       297.9317232536872
      =============================
    
profit: 2860.9401617699878
maxDrawdown 9.2%
startTime: 2022-02-25 00:00:00
趋势多且增强-L3-1-4-1 总交易次数: 1 盈利: 64.93829152214225 亏损: 0 最大盈利: 64.94 最大亏损: 64.94 总收益: 64.94 平均盈利: 64.94 typeA: 64.94 胜率: 100.00%
趋势多且增强-R-2-1 总交易次数: 3 盈利: 452.39476520280675 亏损: 0 最大盈利: 196.96 最大亏损: 126.80 总收益: 452.39 平均盈利: 150.80 typeA: 150.80 胜率: 100.00%
趋势多且增强-R-1-1-2 总交易次数: 1 盈利: 27.367241246037832 亏损: 0 最大盈利: 27.37 最大亏损: 27.37 总收益: 27.37 平均盈利: 27.37 typeA: 27.37 胜率: 100.00%
趋势空且增强-L2-3-4 总交易次数: 5 盈利: 392.5237831017815 亏损: -207.95203488372067 最大盈利: 312.65 最大亏损: -207.95 总收益: 184.57 平均盈利: 36.91 typeA: 29.53 胜率: 80.00%
趋势空且增强-L2-3-3 总交易次数: 9 盈利: 1042.6475300649654 亏损: -90.66664579071795 最大盈利: 305.53 最大亏损: -57.75 总收益: 951.98 平均盈利: 105.78 typeA: 82.27 胜率: 77.78%
趋势多且增强-L3-1-5 总交易次数: 3 盈利: 31.63206485249312 亏损: -237.6117829457376 最大盈利: 17.34 最大亏损: -237.61 总收益: -205.98 平均盈利: -68.66 typeA: -45.78 胜率: 66.67%
趋势多且增强-L3-1-3 总交易次数: 3 盈利: 221.7860903106549 亏损: -2 最大盈利: 204.26 最大亏损: -2.00 总收益: 219.79 平均盈利: 73.26 typeA: 48.84 胜率: 66.67%
趋势多且增强-L1-3-4 总交易次数: 3 盈利: 297.76755712533816 亏损: -48.595741261551716 最大盈利: 295.26 最大亏损: -48.60 总收益: 249.17 平均盈利: 83.06 typeA: 55.37 胜率: 66.67%
趋势空且增强-L-4-3-4 总交易次数: 9 盈利: 1164.2227470262815 亏损: -489.74127047212625 最大盈利: 444.14 最大亏损: -287.97 总收益: 674.48 平均盈利: 74.94 typeA: 41.64 胜率: 55.56%
趋势多且增强-L3-1-4-3 总交易次数: 8 盈利: 47.2617526166233 亏损: -514.7354250458774 最大盈利: 22.61 最大亏损: -438.99 总收益: -467.47 平均盈利: -58.43 typeA: -29.22 胜率: 50.00%
趋势空且增强-L2-2-3 总交易次数: 2 盈利: 444.6567429460125 亏损: -6.378775939059146 最大盈利: 444.66 最大亏损: -6.38 总收益: 438.28 平均盈利: 219.14 typeA: 109.57 胜率: 50.00%
趋势空且增强-L-4-2-4 总交易次数: 2 盈利: 126.64832302181682 亏损: -25.799594606503256 最大盈利: 126.65 最大亏损: -25.80 总收益: 100.85 平均盈利: 50.42 typeA: 25.21 胜率: 50.00%
趋势空且增强-L-4-2-3 总交易次数: 2 盈利: 1.4297471067293928 亏损: -38.99690495961278 最大盈利: 1.43 最大亏损: -39.00 总收益: -37.57 平均盈利: -18.78 typeA: -9.39 胜率: 50.00%
趋势多且增强-11 总交易次数: 9 盈利: 2027.9469023512065 亏损: -1017.5031283577953 最大盈利: 962.15 最大亏损: -484.32 总收益: 1010.44 平均盈利: 112.27 typeA: 49.89 胜率: 44.44%
趋势空且增强-2 总交易次数: 3 盈利: 115.21093749999993 亏损: -236.08720033712805 最大盈利: 115.21 最大亏损: -156.19 总收益: -120.88 平均盈利: -40.29 typeA: -13.43 胜率: 33.33%
趋势多且增强-R-3-1 总交易次数: 3 盈利: 188.63231642426382 亏损: -38.963585449848864 最大盈利: 188.63 最大亏损: -30.63 总收益: 149.67 平均盈利: 49.89 typeA: 16.63 胜率: 33.33%
趋势空且增强-L2-3-5 总交易次数: 4 盈利: 15.532657571829908 亏损: -528.7722074949079 最大盈利: 15.53 最大亏损: -333.58 总收益: -513.24 平均盈利: -128.31 typeA: -32.08 胜率: 25.00%
趋势多且增强-L1-3-1 总交易次数: 2 盈利: 0 亏损: -124.33575804332973 最大盈利: -18.21 最大亏损: -106.13 总收益: -124.34 平均盈利: -62.17 typeA: 0.00 胜率: 0.00%
趋势多且增强-L1-3-9 总交易次数: 1 盈利: 0 亏损: -27.824514715092725 最大盈利: -27.82 最大亏损: -27.82 总收益: -27.82 平均盈利: -27.82 typeA: 0.00 胜率: 0.00%
趋势多且增强-L-4-2-2 总交易次数: 1 盈利: 0 亏损: -15.694717917985916 最大盈利: -15.69 最大亏损: -15.69 总收益: -15.69 平均盈利: -15.69 typeA: 0.00 胜率: 0.00%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     99
      胜率:          59.60%
      总收益:        -1154.73 USDT
      期末余额:      8645.27 USDT
      盈亏比:        0.83
      最大单笔盈利:  1011.20
      最大单笔亏损:  -527.56
      手续费:       397.9325503397895
      =============================
    
profit: -1354.733962750237
maxDrawdown 28.4%
startTime: 2022-03-27 00:00:00
趋势多且增强-L1-3-1 总交易次数: 1 盈利: 129.6866540532678 亏损: 0 最大盈利: 129.69 最大亏损: 129.69 总收益: 129.69 平均盈利: 129.69 typeA: 129.69 胜率: 100.00%
趋势多且增强-L1-3-2 总交易次数: 1 盈利: 16.10138805069352 亏损: 0 最大盈利: 16.10 最大亏损: 16.10 总收益: 16.10 平均盈利: 16.10 typeA: 16.10 胜率: 100.00%
趋势多且增强-L3-1-5 总交易次数: 6 盈利: 168.14025418473696 亏损: 0 最大盈利: 58.20 最大亏损: 10.52 总收益: 168.14 平均盈利: 28.02 typeA: 28.02 胜率: 100.00%
趋势空且增强-L2-3-4 总交易次数: 4 盈利: 89.98795977097727 亏损: 0 最大盈利: 30.18 最大亏损: 11.88 总收益: 89.99 平均盈利: 22.50 typeA: 22.50 胜率: 100.00%
趋势多且增强-R-1-2-2 总交易次数: 4 盈利: 114.44824879708457 亏损: 0 最大盈利: 39.43 最大亏损: 7.89 总收益: 114.45 平均盈利: 28.61 typeA: 28.61 胜率: 100.00%
趋势空且增强-2 总交易次数: 4 盈利: 333.24255855599836 亏损: 0 最大盈利: 267.07 最大亏损: 13.98 总收益: 333.24 平均盈利: 83.31 typeA: 83.31 胜率: 100.00%
趋势空且增强-L2-2-3 总交易次数: 1 盈利: 1011.1990768857039 亏损: 0 最大盈利: 1011.20 最大亏损: 1011.20 总收益: 1011.20 平均盈利: 1011.20 typeA: 1011.20 胜率: 100.00%
趋势多且增强-L1-3-9 总交易次数: 1 盈利: 219.91497355970125 亏损: 0 最大盈利: 219.91 最大亏损: 219.91 总收益: 219.91 平均盈利: 219.91 typeA: 219.91 胜率: 100.00%
趋势多且增强-R-2-2 总交易次数: 1 盈利: 161.1945063637013 亏损: 0 最大盈利: 161.19 最大亏损: 161.19 总收益: 161.19 平均盈利: 161.19 typeA: 161.19 胜率: 100.00%
趋势多且增强-R-3-1 总交易次数: 1 盈利: 94.65332733812842 亏损: 0 最大盈利: 94.65 最大亏损: 94.65 总收益: 94.65 平均盈利: 94.65 typeA: 94.65 胜率: 100.00%
趋势多且增强-R-2-1 总交易次数: 1 盈利: 54.69496731511368 亏损: 0 最大盈利: 54.69 最大亏损: 54.69 总收益: 54.69 平均盈利: 54.69 typeA: 54.69 胜率: 100.00%
趋势空且增强-L1-1-2 总交易次数: 1 盈利: 270.64954778318946 亏损: 0 最大盈利: 270.65 最大亏损: 270.65 总收益: 270.65 平均盈利: 270.65 typeA: 270.65 胜率: 100.00%
趋势多且增强-L3-1-4-3 总交易次数: 8 盈利: 127.25127716424187 亏损: -521.4221412045151 最大盈利: 35.08 最大亏损: -521.42 总收益: -394.17 平均盈利: -49.27 typeA: -43.11 胜率: 87.50%
趋势空且增强-L2-3-5 总交易次数: 6 盈利: 772.1198022237082 亏损: -317.6826189078096 最大盈利: 439.39 最大亏损: -317.68 总收益: 454.44 平均盈利: 75.74 typeA: 63.11 胜率: 83.33%
趋势多且增强-11 总交易次数: 4 盈利: 169.4020346979159 亏损: -130.00816039394923 最大盈利: 80.45 最大亏损: -130.01 总收益: 39.39 平均盈利: 9.85 typeA: 7.39 胜率: 75.00%
趋势多且增强-L3-1-4-1 总交易次数: 3 盈利: 214.1660097121886 亏损: -192.0246298405471 最大盈利: 148.07 最大亏损: -192.02 总收益: 22.14 平均盈利: 7.38 typeA: 4.92 胜率: 66.67%
趋势空且增强-L2-3-3 总交易次数: 10 盈利: 591.056415703508 亏损: -852.4564804337344 最大盈利: 464.10 最大亏损: -367.52 总收益: -261.40 平均盈利: -26.14 typeA: -13.07 胜率: 50.00%
趋势多且增强-R-1-1-2 总交易次数: 7 盈利: 69.03857614004485 亏损: -318.4526124388192 最大盈利: 29.49 最大亏损: -110.30 总收益: -249.41 平均盈利: -35.63 typeA: -15.27 胜率: 42.86%
趋势空且增强-L-4-2-4 总交易次数: 7 盈利: 530.4706252962071 亏损: -803.0692194544013 最大盈利: 472.96 最大亏损: -527.56 总收益: -272.60 平均盈利: -38.94 typeA: -16.69 胜率: 42.86%
趋势多且增强-L3-1-3 总交易次数: 3 盈利: 268.16355959727167 亏损: -251.26194166468792 最大盈利: 268.16 最大亏损: -237.37 总收益: 16.90 平均盈利: 5.63 typeA: 1.88 胜率: 33.33%
趋势多且增强-L1-2-5 总交易次数: 3 盈利: 78.69461302634132 亏损: -311.3207616856768 最大盈利: 78.69 最大亏损: -266.76 总收益: -232.63 平均盈利: -77.54 typeA: -25.84 胜率: 33.33%
趋势空且增强-L-4-3-4 总交易次数: 8 盈利: 225.83407804391723 亏损: -1532.395643142975 最大盈利: 224.27 最大亏损: -499.60 总收益: -1306.56 平均盈利: -163.32 typeA: -40.83 胜率: 25.00%
趋势多且增强-L1-3-4 总交易次数: 6 盈利: 98.18567920897281 亏损: -966.4022255529667 最大盈利: 98.19 最大亏损: -498.00 总收益: -868.22 平均盈利: -144.70 typeA: -24.12 胜率: 16.67%
趋势空且增强-L2-1-3 总交易次数: 1 盈利: 0 亏损: -424.3003683763101 最大盈利: -424.30 最大亏损: -424.30 总收益: -424.30 平均盈利: -424.30 typeA: 0.00 胜率: 0.00%
趋势空且增强-L-4-2-3 总交易次数: 2 盈利: 0 亏损: -81.90594344710003 最大盈利: -31.21 最大亏损: -50.70 总收益: -81.91 平均盈利: -40.95 typeA: 0.00 胜率: 0.00%
趋势空且增强-11 总交易次数: 2 盈利: 0 亏损: -112.97495613472705 最大盈利: -23.26 最大亏损: -89.72 总收益: -112.97 平均盈利: -56.49 typeA: 0.00 胜率: 0.00%
趋势多且增强-L-4-2-2 总交易次数: 1 盈利: 0 亏损: -39.62917199261487 最大盈利: -39.63 最大亏损: -39.63 总收益: -39.63 平均盈利: -39.63 typeA: 0.00 胜率: 0.00%
趋势空且增强-L-4-1-4 总交易次数: 1 盈利: 0 亏损: -103.61334535617657 最大盈利: -103.61 最大亏损: -103.61 总收益: -103.61 平均盈利: -103.61 typeA: 0.00 胜率: 0.00%
趋势多且增强-R-3-2 总交易次数: 1 盈利: 0 亏损: -4.109876195835836 最大盈利: -4.11 最大亏损: -4.11 总收益: -4.11 平均盈利: -4.11 typeA: 0.00 胜率: 0.00%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     96
      胜率:          62.50%
      总收益:        2664.48 USDT
      期末余额:      12470.48 USDT
      盈亏比:        1.47
      最大单笔盈利:  1043.97
      最大单笔亏损:  -1562.82
      手续费:       385.53594337578386
      =============================
    
profit: 2470.477866338264
maxDrawdown 12.3%
startTime: 2022-04-26 00:00:00
趋势多且增强-L1-2-5 总交易次数: 1 盈利: 78.69461302634132 亏损: 0 最大盈利: 78.69 最大亏损: 78.69 总收益: 78.69 平均盈利: 78.69 typeA: 78.69 胜率: 100.00%
趋势空且增强-11 总交易次数: 2 盈利: 59.51518036173394 亏损: 0 最大盈利: 40.22 最大亏损: 19.29 总收益: 59.52 平均盈利: 29.76 typeA: 29.76 胜率: 100.00%
趋势空且增强-L2-3-5 总交易次数: 4 盈利: 535.9323297058963 亏损: 0 最大盈利: 305.54 最大亏损: 5.17 总收益: 535.93 平均盈利: 133.98 typeA: 133.98 胜率: 100.00%
趋势多且增强-L3-1-5 总交易次数: 3 盈利: 200.3616086180155 亏损: 0 最大盈利: 132.64 最大亏损: 33.77 总收益: 200.36 平均盈利: 66.79 typeA: 66.79 胜率: 100.00%
趋势多且增强-L3-1-3 总交易次数: 1 盈利: 15.805877114870155 亏损: 0 最大盈利: 15.81 最大亏损: 15.81 总收益: 15.81 平均盈利: 15.81 typeA: 15.81 胜率: 100.00%
趋势多且增强-R-2-2 总交易次数: 1 盈利: 369.71712093146425 亏损: 0 最大盈利: 369.72 最大亏损: 369.72 总收益: 369.72 平均盈利: 369.72 typeA: 369.72 胜率: 100.00%
趋势空且增强-L2-3-4 总交易次数: 9 盈利: 1316.2036890110637 亏损: -584.7026781363404 最大盈利: 1043.97 最大亏损: -409.81 总收益: 731.50 平均盈利: 81.28 typeA: 63.22 胜率: 77.78%
趋势空且增强-L-4-2-4 总交易次数: 4 盈利: 150.75974774000605 亏损: -106.36474991493752 最大盈利: 59.26 最大亏损: -106.36 总收益: 44.39 平均盈利: 11.10 typeA: 8.32 胜率: 75.00%
趋势多且增强-L3-1-4-3 总交易次数: 8 盈利: 156.99167404776352 亏损: -38.14133174750459 最大盈利: 68.19 最大亏损: -30.70 总收益: 118.85 平均盈利: 14.86 typeA: 11.14 胜率: 75.00%
趋势空且增强-L-4-3-4 总交易次数: 9 盈利: 972.7733222702626 亏损: -557.3273301345081 最大盈利: 529.85 最大亏损: -504.23 总收益: 415.45 平均盈利: 46.16 typeA: 30.78 胜率: 66.67%
趋势多且增强-R-2-1 总交易次数: 6 盈利: 363.35059722417174 亏损: -172.87753859387476 最大盈利: 164.22 最大亏损: -119.85 总收益: 190.47 平均盈利: 31.75 typeA: 21.16 胜率: 66.67%
趋势多且增强-L1-3-4 总交易次数: 3 盈利: 114.41872027190225 亏损: -19.680608949716127 最大盈利: 105.73 最大亏损: -19.68 总收益: 94.74 平均盈利: 31.58 typeA: 21.05 胜率: 66.67%
趋势空且增强-L2-3-3 总交易次数: 7 盈利: 463.93026503508077 亏损: -232.2956130267604 最大盈利: 341.58 最大亏损: -137.77 总收益: 231.63 平均盈利: 33.09 typeA: 18.91 胜率: 57.14%
趋势多且增强-R-1-1-2 总交易次数: 10 盈利: 1741.6754615191462 亏损: -1984.7133248690027 最大盈利: 704.29 最大亏损: -1562.82 总收益: -243.04 平均盈利: -24.30 typeA: -12.15 胜率: 50.00%
趋势多且增强-R-1-2-2 总交易次数: 2 盈利: 7.894111825828883 亏损: -176.64697002372333 最大盈利: 7.89 最大亏损: -176.65 总收益: -168.75 平均盈利: -84.38 typeA: -42.19 胜率: 50.00%
趋势多且增强-R-1-1-1 总交易次数: 2 盈利: 299.5509167394236 亏损: -14.747905282331624 最大盈利: 299.55 最大亏损: -14.75 总收益: 284.80 平均盈利: 142.40 typeA: 71.20 胜率: 50.00%
趋势空且增强-L3-1-6 总交易次数: 2 盈利: 566.9075617853186 亏损: -35.36780650542087 最大盈利: 566.91 最大亏损: -35.37 总收益: 531.54 平均盈利: 265.77 typeA: 132.88 胜率: 50.00%
趋势多且增强-L3-1-4-1 总交易次数: 2 盈利: 38.41327780499718 亏损: -62.4872951270497 最大盈利: 38.41 最大亏损: -62.49 总收益: -24.07 平均盈利: -12.04 typeA: -6.02 胜率: 50.00%
趋势多且增强-R-3-1 总交易次数: 7 盈利: 192.17992164459713 亏损: -534.9786864093035 最大盈利: 178.91 最大亏损: -194.74 总收益: -342.80 平均盈利: -48.97 typeA: -20.99 胜率: 42.86%
趋势空且增强-L-4-1-4 总交易次数: 3 盈利: 491.37619090018603 亏损: -167.14281742704665 最大盈利: 491.38 最大亏损: -161.58 总收益: 324.23 平均盈利: 108.08 typeA: 36.02 胜率: 33.33%
趋势多且增强-11 总交易次数: 3 盈利: 112.13923295030618 亏损: -303.2365576317487 最大盈利: 112.14 最大亏损: -281.30 总收益: -191.10 平均盈利: -63.70 typeA: -21.23 胜率: 33.33%
趋势空且增强-2 总交易次数: 3 盈利: 34.619477666584665 亏损: -242.29446673311816 最大盈利: 34.62 最大亏损: -123.42 总收益: -207.67 平均盈利: -69.22 typeA: -23.07 胜率: 33.33%
趋势空且增强-L-4-2-3 总交易次数: 3 盈利: 40.02043828772514 亏损: -209.8766457955453 最大盈利: 40.02 最大亏损: -206.68 总收益: -169.86 平均盈利: -56.62 typeA: -18.87 胜率: 33.33%
趋势多且增强-L1-3-1 总交易次数: 1 盈利: 0 亏损: -215.8711438364867 最大盈利: -215.87 最大亏损: -215.87 总收益: -215.87 平均盈利: -215.87 typeA: 0.00 胜率: 0.00%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     88
      胜率:          54.55%
      总收益:        -291.84 USDT
      期末余额:      9530.16 USDT
      盈亏比:        0.96
      最大单笔盈利:  836.27
      最大单笔亏损:  -920.59
      手续费:       354.43350017154216
      =============================
    
profit: -469.83780581875
maxDrawdown 18.6%
startTime: 2022-05-26 00:00:00
趋势多且增强-11 总交易次数: 2 盈利: 230.27707854231693 亏损: 0 最大盈利: 153.84 最大亏损: 76.43 总收益: 230.28 平均盈利: 115.14 typeA: 115.14 胜率: 100.00%
趋势多且增强-R-3-2 总交易次数: 2 盈利: 117.83537086558465 亏损: 0 最大盈利: 93.66 最大亏损: 24.17 总收益: 117.84 平均盈利: 58.92 typeA: 58.92 胜率: 100.00%
趋势多且增强-R-1-1-1 总交易次数: 1 盈利: 69.87304986234508 亏损: 0 最大盈利: 69.87 最大亏损: 69.87 总收益: 69.87 平均盈利: 69.87 typeA: 69.87 胜率: 100.00%
趋势空且增强-L-4-2-3 总交易次数: 3 盈利: 582.1539121683892 亏损: 0 最大盈利: 523.50 最大亏损: 1.36 总收益: 582.15 平均盈利: 194.05 typeA: 194.05 胜率: 100.00%
趋势多且增强-L1-3-1 总交易次数: 1 盈利: 295.1251303441078 亏损: 0 最大盈利: 295.13 最大亏损: 295.13 总收益: 295.13 平均盈利: 295.13 typeA: 295.13 胜率: 100.00%
趋势多且增强-L3-1-4-1 总交易次数: 1 盈利: 51.71658831430504 亏损: 0 最大盈利: 51.72 最大亏损: 51.72 总收益: 51.72 平均盈利: 51.72 typeA: 51.72 胜率: 100.00%
趋势多且增强-L1-3-2 总交易次数: 1 盈利: 303.5204240723423 亏损: 0 最大盈利: 303.52 最大亏损: 303.52 总收益: 303.52 平均盈利: 303.52 typeA: 303.52 胜率: 100.00%
趋势多且增强-R-3-1 总交易次数: 3 盈利: 208.6782533146319 亏损: -216.94071661237768 最大盈利: 197.03 最大亏损: -216.94 总收益: -8.26 平均盈利: -2.75 typeA: -1.84 胜率: 66.67%
趋势多且增强-L3-1-3 总交易次数: 3 盈利: 10.009951670572395 亏损: -89.14016364283127 最大盈利: 7.04 最大亏损: -89.14 总收益: -79.13 平均盈利: -26.38 typeA: -17.59 胜率: 66.67%
趋势多且增强-R-1-1-2 总交易次数: 6 盈利: 887.7072012905911 亏损: -108.99142222496533 最大盈利: 576.53 最大亏损: -63.18 总收益: 778.72 平均盈利: 129.79 typeA: 86.53 胜率: 66.67%
趋势空且增强-L2-3-4 总交易次数: 3 盈利: 584.3329343609117 亏损: -29.165925925925674 最大盈利: 493.03 最大亏损: -29.17 总收益: 555.17 平均盈利: 185.06 typeA: 123.38 胜率: 66.67%
趋势空且增强-11 总交易次数: 3 盈利: 258.65874972552257 亏损: -81.59151193633848 最大盈利: 145.77 最大亏损: -81.59 总收益: 177.07 平均盈利: 59.02 typeA: 39.35 胜率: 66.67%
趋势空且增强-L2-3-5 总交易次数: 3 盈利: 33.25379026648131 亏损: -211.4200100300909 最大盈利: 22.06 最大亏损: -211.42 总收益: -178.17 平均盈利: -59.39 typeA: -39.59 胜率: 66.67%
趋势多且增强-L3-1-4-3 总交易次数: 11 盈利: 289.2545865319342 亏损: -878.6814790689132 最大盈利: 176.54 最大亏损: -480.41 总收益: -589.43 平均盈利: -53.58 typeA: -34.10 胜率: 63.64%
趋势多且增强-R-2-2 总交易次数: 2 盈利: 369.71712093146425 亏损: -111.40882823066543 最大盈利: 369.72 最大亏损: -111.41 总收益: 258.31 平均盈利: 129.15 typeA: 64.58 胜率: 50.00%
趋势空且增强-L2-3-3 总交易次数: 10 盈利: 1518.5598382369346 亏损: -1161.8863552365167 最大盈利: 836.27 最大亏损: -635.34 总收益: 356.67 平均盈利: 35.67 typeA: 17.83 胜率: 50.00%
趋势多且增强-R-2-1 总交易次数: 5 盈利: 9.441261737225958 亏损: -510.20159060102463 最大盈利: 5.46 最大亏损: -203.70 总收益: -500.76 平均盈利: -100.15 typeA: -40.06 胜率: 40.00%
趋势多且增强-L1-3-4 总交易次数: 8 盈利: 488.010449149559 亏损: -265.3648086421763 最大盈利: 316.84 最大亏损: -84.78 总收益: 222.65 平均盈利: 27.83 typeA: 10.44 胜率: 37.50%
趋势多且增强-L3-1-5 总交易次数: 3 盈利: 7.833292353087119 亏损: -75.18808244091426 最大盈利: 7.83 最大亏损: -47.00 总收益: -67.35 平均盈利: -22.45 typeA: -7.48 胜率: 33.33%
趋势空且增强-L3-1-6 总交易次数: 3 盈利: 68.66360932077355 亏损: -1198.7327920511907 最大盈利: 68.66 最大亏损: -637.02 总收益: -1130.07 平均盈利: -376.69 typeA: -125.55 胜率: 33.33%
趋势空且增强-L-4-3-4 总交易次数: 11 盈利: 421.7645709664381 亏损: -1684.3032384600049 最大盈利: 281.49 最大亏损: -920.59 总收益: -1262.54 平均盈利: -114.78 typeA: -31.30 胜率: 27.27%
趋势空且增强-L-4-2-4 总交易次数: 1 盈利: 0 亏损: -21.681711966548686 最大盈利: -21.68 最大亏损: -21.68 总收益: -21.68 平均盈利: -21.68 typeA: 0.00 胜率: 0.00%
趋势多且增强-R-1-2-2 总交易次数: 1 盈利: 0 亏损: -157.23960113960024 最大盈利: -157.24 最大亏损: -157.24 总收益: -157.24 平均盈利: -157.24 typeA: 0.00 胜率: 0.00%
趋势空且增强-L2-2-3 总交易次数: 1 盈利: 0 亏损: -296.2867316341833 最大盈利: -296.29 最大亏损: -296.29 总收益: -296.29 平均盈利: -296.29 typeA: 0.00 胜率: 0.00%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     97
      胜率:          47.42%
      总收益:        -1747.36 USDT
      期末余额:      8058.64 USDT
      盈亏比:        0.76
      最大单笔盈利:  887.22
      最大单笔亏损:  -928.08
      手续费:       387.69118321345854
      =============================
    
profit: -1941.3550220182788
maxDrawdown 31.1%
startTime: 2022-06-25 00:00:00
趋势多且增强-L3-1-5 总交易次数: 5 盈利: 164.55556686353125 亏损: 0 最大盈利: 41.94 最大亏损: 23.76 总收益: 164.56 平均盈利: 32.91 typeA: 32.91 胜率: 100.00%
趋势多且增强-R-2-2 总交易次数: 1 盈利: 42.211954864287684 亏损: 0 最大盈利: 42.21 最大亏损: 42.21 总收益: 42.21 平均盈利: 42.21 typeA: 42.21 胜率: 100.00%
趋势空且增强-L-4-4-4 总交易次数: 1 盈利: 196.09005105987978 亏损: 0 最大盈利: 196.09 最大亏损: 196.09 总收益: 196.09 平均盈利: 196.09 typeA: 196.09 胜率: 100.00%
趋势空且增强-L2-3-5 总交易次数: 3 盈利: 273.13164161382883 亏损: 0 最大盈利: 247.98 最大亏损: 11.85 总收益: 273.13 平均盈利: 91.04 typeA: 91.04 胜率: 100.00%
趋势多且增强-L3-1-3 总交易次数: 4 盈利: 58.120342662585614 亏损: -30.376537369915102 最大盈利: 38.94 最大亏损: -30.38 总收益: 27.74 平均盈利: 6.94 typeA: 5.20 胜率: 75.00%
趋势多且增强-R-2-1 总交易次数: 4 盈利: 98.27988479128058 亏损: -140.5861386138605 最大盈利: 52.59 最大亏损: -140.59 总收益: -42.31 平均盈利: -10.58 typeA: -7.93 胜率: 75.00%
趋势多且增强-11 总交易次数: 3 盈利: 87.12972982532438 亏损: -61.9470605440178 最大盈利: 53.59 最大亏损: -61.95 总收益: 25.18 平均盈利: 8.39 typeA: 5.60 胜率: 66.67%
趋势空且增强-11 总交易次数: 3 盈利: 255.86533503829335 亏损: -219.3626410086262 最大盈利: 251.27 最大亏损: -219.36 总收益: 36.50 平均盈利: 12.17 typeA: 8.11 胜率: 66.67%
趋势空且增强-L2-3-4 总交易次数: 11 盈利: 899.1095655889685 亏损: -824.6715881643072 最大盈利: 352.18 最大亏损: -287.87 总收益: 74.44 平均盈利: 6.77 typeA: 3.69 胜率: 54.55%
趋势多且增强-R-1-1-2 总交易次数: 4 盈利: 110.38243348200547 亏损: -221.00681303571122 最大盈利: 107.73 最大亏损: -163.68 总收益: -110.62 平均盈利: -27.66 typeA: -13.83 胜率: 50.00%
趋势空且增强-L2-3-3 总交易次数: 6 盈利: 176.2308747549181 亏损: -364.5617770948648 最大盈利: 97.48 最大亏损: -337.55 总收益: -188.33 平均盈利: -31.39 typeA: -15.69 胜率: 50.00%
趋势多且增强-R-3-2 总交易次数: 2 盈利: 17.66026319769948 亏损: -29.029738660258275 最大盈利: 17.66 最大亏损: -29.03 总收益: -11.37 平均盈利: -5.68 typeA: -2.84 胜率: 50.00%
趋势多且增强-L-4-2-2 总交易次数: 2 盈利: 146.37038182099283 亏损: -16.510885341074435 最大盈利: 146.37 最大亏损: -16.51 总收益: 129.86 平均盈利: 64.93 typeA: 32.46 胜率: 50.00%
趋势多且增强-L3-1-4-3 总交易次数: 10 盈利: 204.72407182410205 亏损: -1101.4504420506619 最大盈利: 129.17 最大亏损: -378.69 总收益: -896.73 平均盈利: -89.67 typeA: -35.87 胜率: 40.00%
趋势多且增强-R-3-1 总交易次数: 5 盈利: 207.53065191387623 亏损: -214.45029293906106 最大盈利: 182.62 最大亏损: -125.10 总收益: -6.92 平均盈利: -1.38 typeA: -0.55 胜率: 40.00%
趋势空且增强-L-4-2-3 总交易次数: 3 盈利: 887.2208044382801 亏损: -431.3044600067795 最大盈利: 887.22 最大亏损: -347.81 总收益: 455.92 平均盈利: 151.97 typeA: 50.65 胜率: 33.33%
趋势多且增强-L1-3-2 总交易次数: 3 盈利: 167.6063176367371 亏损: -162.04980708809694 最大盈利: 167.61 最大亏损: -142.75 总收益: 5.56 平均盈利: 1.85 typeA: 0.62 胜率: 33.33%
趋势空且增强-L-4-3-4 总交易次数: 14 盈利: 1565.9394664561132 亏损: -2211.778971560395 最大盈利: 724.33 最大亏损: -928.08 总收益: -645.84 平均盈利: -46.13 typeA: -13.18 胜率: 28.57%
趋势多且增强-L1-3-4 总交易次数: 8 盈利: 17.989849277146284 亏损: -751.7163604195822 最大盈利: 17.99 最大亏损: -398.54 总收益: -733.73 平均盈利: -91.72 typeA: -11.46 胜率: 12.50%
趋势多且增强-L1-3-1 总交易次数: 1 盈利: 0 亏损: -106.18811747191675 最大盈利: -106.19 最大亏损: -106.19 总收益: -106.19 平均盈利: -106.19 typeA: 0.00 胜率: 0.00%
趋势空且增强-L2-2-3 总交易次数: 1 盈利: 0 亏损: -127.88856485034556 最大盈利: -127.89 最大亏损: -127.89 总收益: -127.89 平均盈利: -127.89 typeA: 0.00 胜率: 0.00%
趋势空且增强-L-4-2-4 总交易次数: 1 盈利: 0 亏损: -121.66651522035424 最大盈利: -121.67 最大亏损: -121.67 总收益: -121.67 平均盈利: -121.67 typeA: 0.00 胜率: 0.00%
趋势空且增强-L3-1-6 总交易次数: 1 盈利: 0 亏损: -45.14413208389091 最大盈利: -45.14 最大亏损: -45.14 总收益: -45.14 平均盈利: -45.14 typeA: 0.00 胜率: 0.00%
趋势多且增强-L1-2-1 总交易次数: 1 盈利: 0 亏损: -141.81336560441028 最大盈利: -141.81 最大亏损: -141.81 总收益: -141.81 平均盈利: -141.81 typeA: 0.00 胜率: 0.00%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     85
      胜率:          50.59%
      总收益:        1302.95 USDT
      期末余额:      11130.95 USDT
      盈亏比:        1.24
      最大单笔盈利:  575.12
      最大单笔亏损:  -650.93
      手续费:       341.9830590784501
      =============================
    
profit: 1130.9495055062707
maxDrawdown 14.8%
startTime: 2022-07-25 00:00:00
趋势空且增强-L2-3-4 总交易次数: 4 盈利: 589.7845412269412 亏损: 0 最大盈利: 456.83 最大亏损: 36.37 总收益: 589.78 平均盈利: 147.45 typeA: 147.45 胜率: 100.00%
趋势空且增强-L-4-2-3 总交易次数: 1 盈利: 299.8355029585799 亏损: 0 最大盈利: 299.84 最大亏损: 299.84 总收益: 299.84 平均盈利: 299.84 typeA: 299.84 胜率: 100.00%
趋势空且增强-L2-3-5 总交易次数: 4 盈利: 25.965362763127487 亏损: -141.6234833659493 最大盈利: 13.30 最大亏损: -141.62 总收益: -115.66 平均盈利: -28.91 typeA: -21.69 胜率: 75.00%
趋势多且增强-R-3-1 总交易次数: 3 盈利: 317.15872296756186 亏损: -37.55131727816356 最大盈利: 182.62 最大亏损: -37.55 总收益: 279.61 平均盈利: 93.20 typeA: 62.14 胜率: 66.67%
趋势多且增强-L3-1-4-3 总交易次数: 8 盈利: 799.6173570081237 亏损: -250.76485766996896 最大盈利: 382.05 最大亏损: -162.19 总收益: 548.85 平均盈利: 68.61 typeA: 42.88 胜率: 62.50%
趋势多且增强-11 总交易次数: 5 盈利: 438.58238501744904 亏损: -71.58818873210176 最大盈利: 259.08 最大亏损: -59.82 总收益: 366.99 平均盈利: 73.40 typeA: 44.04 胜率: 60.00%
趋势多且增强-R-2-1 总交易次数: 6 盈利: 640.5857470601176 亏损: -194.51008024790033 最大盈利: 299.35 最大亏损: -140.59 总收益: 446.08 平均盈利: 74.35 typeA: 37.17 胜率: 50.00%
趋势多且增强-R-1-1-2 总交易次数: 2 盈利: 8.853908188585706 亏损: -132.7953950811095 最大盈利: 8.85 最大亏损: -132.80 总收益: -123.94 平均盈利: -61.97 typeA: -30.99 胜率: 50.00%
趋势多且增强-L1-3-4 总交易次数: 4 盈利: 241.5695140510872 亏损: -87.37700014470144 最大盈利: 151.19 最大亏损: -50.52 总收益: 154.19 平均盈利: 38.55 typeA: 19.27 胜率: 50.00%
趋势多且增强-L3-1-3 总交易次数: 4 盈利: 46.28417687434621 亏损: -389.8516968642042 最大盈利: 36.99 最大亏损: -322.87 总收益: -343.57 平均盈利: -85.89 typeA: -42.95 胜率: 50.00%
趋势多且增强-L3-1-4-1 总交易次数: 2 盈利: 56.44342379958297 亏损: -79.87707123637003 最大盈利: 56.44 最大亏损: -79.88 总收益: -23.43 平均盈利: -11.72 typeA: -5.86 胜率: 50.00%
趋势空且增强-L2-3-3 总交易次数: 4 盈利: 394.7521303884985 亏损: -199.31122662395842 最大盈利: 357.30 最大亏损: -141.66 总收益: 195.44 平均盈利: 48.86 typeA: 24.43 胜率: 50.00%
趋势空且增强-11 总交易次数: 2 盈利: 11.185586641276235 亏损: -2 最大盈利: 11.19 最大亏损: -2.00 总收益: 9.19 平均盈利: 4.59 typeA: 2.30 胜率: 50.00%
趋势多且增强-L3-1-5 总交易次数: 4 盈利: 261.93969579949277 亏损: -360.78120974445767 最大盈利: 243.62 最大亏损: -357.34 总收益: -98.84 平均盈利: -24.71 typeA: -12.36 胜率: 50.00%
趋势空且增强-L-4-3-4 总交易次数: 17 盈利: 1660.6476134548125 亏损: -1357.9977495128503 最大盈利: 575.12 最大亏损: -406.29 总收益: 302.65 平均盈利: 17.80 typeA: 8.38 胜率: 47.06%
趋势空且增强-L3-1-6 总交易次数: 6 盈利: 370.8227950563089 亏损: -442.8468053661843 最大盈利: 300.66 最大亏损: -186.93 总收益: -72.02 平均盈利: -12.00 typeA: -4.00 胜率: 33.33%
趋势空且增强-L-4-2-4 总交易次数: 3 盈利: 489.4477508650519 亏损: -1001.6876686012866 最大盈利: 489.45 最大亏损: -650.93 总收益: -512.24 平均盈利: -170.75 typeA: -56.91 胜率: 33.33%
趋势多且增强-L1-3-2 总交易次数: 1 盈利: 0 亏损: -25.979613251387704 最大盈利: -25.98 最大亏损: -25.98 总收益: -25.98 平均盈利: -25.98 typeA: 0.00 胜率: 0.00%
趋势多且增强-L1-3-1 总交易次数: 1 盈利: 0 亏损: -55.60101580135516 最大盈利: -55.60 最大亏损: -55.60 总收益: -55.60 平均盈利: -55.60 typeA: 0.00 胜率: 0.00%
趋势多且增强-L1-2-5 总交易次数: 1 盈利: 0 亏损: -135.17634119515992 最大盈利: -135.18 最大亏损: -135.18 总收益: -135.18 平均盈利: -135.18 typeA: 0.00 胜率: 0.00%
趋势多且增强-R-2-2 总交易次数: 2 盈利: 0 亏损: -284.8943290223702 最大盈利: -7.84 最大亏损: -277.05 总收益: -284.89 平均盈利: -142.45 typeA: 0.00 胜率: 0.00%
趋势多且增强-R-3-2 总交易次数: 1 盈利: 0 亏损: -98.31165887519478 最大盈利: -98.31 最大亏损: -98.31 总收益: -98.31 平均盈利: -98.31 typeA: 0.00 胜率: 0.00%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     73
      胜率:          52.05%
      总收益:        -1224.05 USDT
      期末余额:      8627.95 USDT
      盈亏比:        0.67
      最大单笔盈利:  234.02
      最大单笔亏损:  -391.90
      手续费:       294.15419147565257
      =============================
    
profit: -1372.0487654562876
maxDrawdown 16.5%
startTime: 2022-08-24 00:00:00
趋势空且增强-11 总交易次数: 1 盈利: 107.69935483870967 亏损: 0 最大盈利: 107.70 最大亏损: 107.70 总收益: 107.70 平均盈利: 107.70 typeA: 107.70 胜率: 100.00%
趋势多且增强-R-2-1 总交易次数: 1 盈利: 55.066210045662615 亏损: 0 最大盈利: 55.07 最大亏损: 55.07 总收益: 55.07 平均盈利: 55.07 typeA: 55.07 胜率: 100.00%
趋势多且增强-L3-1-3 总交易次数: 1 盈利: 2.7791586998091535 亏损: 0 最大盈利: 2.78 最大亏损: 2.78 总收益: 2.78 平均盈利: 2.78 typeA: 2.78 胜率: 100.00%
趋势多且增强-L3-1-4-1 总交易次数: 1 盈利: 39.29436060365311 亏损: 0 最大盈利: 39.29 最大亏损: 39.29 总收益: 39.29 平均盈利: 39.29 typeA: 39.29 胜率: 100.00%
趋势多且增强-R-3-2 总交易次数: 2 盈利: 244.44408602355975 亏损: 0 最大盈利: 126.03 最大亏损: 118.42 总收益: 244.44 平均盈利: 122.22 typeA: 122.22 胜率: 100.00%
趋势空且增强-L2-3-5 总交易次数: 1 盈利: 234.02079207920804 亏损: 0 最大盈利: 234.02 最大亏损: 234.02 总收益: 234.02 平均盈利: 234.02 typeA: 234.02 胜率: 100.00%
趋势多且增强-L3-1-5 总交易次数: 8 盈利: 226.8857309938776 亏损: -37.446473861445824 最大盈利: 74.32 最大亏损: -27.56 总收益: 189.44 平均盈利: 23.68 typeA: 17.76 胜率: 75.00%
趋势空且增强-L2-3-3 总交易次数: 8 盈利: 201.10717910409483 亏损: -556.4536170325729 最大盈利: 91.10 最大亏损: -391.90 总收益: -355.35 平均盈利: -44.42 typeA: -27.76 胜率: 62.50%
趋势多且增强-L3-1-4-3 总交易次数: 6 盈利: 74.17598838292446 亏损: -316.1662508081672 最大盈利: 50.43 最大亏损: -135.48 总收益: -241.99 平均盈利: -40.33 typeA: -20.17 胜率: 50.00%
趋势多且增强-R-3-1 总交易次数: 6 盈利: 295.89868810276175 亏损: -381.3915081445178 最大盈利: 171.01 最大亏损: -204.48 总收益: -85.49 平均盈利: -14.25 typeA: -7.12 胜率: 50.00%
趋势空且增强-L2-3-4 总交易次数: 4 盈利: 189.82680606139542 亏损: -286.97443105472865 最大盈利: 157.32 最大亏损: -220.31 总收益: -97.15 平均盈利: -24.29 typeA: -12.14 胜率: 50.00%
趋势空且增强-L-4-3-4 总交易次数: 22 盈利: 693.3142407275471 亏损: -777.6717632752465 最大盈利: 201.59 最大亏损: -183.73 总收益: -84.36 平均盈利: -3.83 typeA: -1.74 胜率: 45.45%
趋势多且增强-11 总交易次数: 3 盈利: 1.402995234853503 亏损: -334.8349734623166 最大盈利: 1.40 最大亏损: -235.95 总收益: -333.43 平均盈利: -111.14 typeA: -37.04 胜率: 33.33%
趋势多且增强-L1-3-4 总交易次数: 4 盈利: 153.02067355785266 亏损: -186.54525584283908 最大盈利: 153.02 最大亏损: -102.57 总收益: -33.52 平均盈利: -8.38 typeA: -2.10 胜率: 25.00%
趋势空且增强-L3-1-6 总交易次数: 3 盈利: 0 亏损: -807.4794227654165 最大盈利: -194.06 最大亏损: -377.26 总收益: -807.48 平均盈利: -269.16 typeA: 0.00 胜率: 0.00%
趋势多且增强-L1-3-1 总交易次数: 1 盈利: 0 亏损: -17.754806177119896 最大盈利: -17.75 最大亏损: -17.75 总收益: -17.75 平均盈利: -17.75 typeA: 0.00 胜率: 0.00%
趋势多且增强-R-1-2-2 总交易次数: 1 盈利: 0 亏损: -40.2665274878227 最大盈利: -40.27 最大亏损: -40.27 总收益: -40.27 平均盈利: -40.27 typeA: 0.00 胜率: 0.00%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     67
      胜率:          59.70%
      总收益:        1600.85 USDT
      期末余额:      11466.85 USDT
      盈亏比:        1.67
      最大单笔盈利:  551.15
      最大单笔亏损:  -633.58
      手续费:       268.37381444288206
      =============================
    
profit: 1466.848744040015
maxDrawdown 6.2%
startTime: 2022-09-23 00:00:00
趋势多且增强-R-3-1 总交易次数: 7 盈利: 553.580262953061 亏损: 0 最大盈利: 226.37 最大亏损: 4.82 总收益: 553.58 平均盈利: 79.08 typeA: 79.08 胜率: 100.00%
趋势空且增强-11 总交易次数: 1 盈利: 21.04229060391547 亏损: 0 最大盈利: 21.04 最大亏损: 21.04 总收益: 21.04 平均盈利: 21.04 typeA: 21.04 胜率: 100.00%
趋势多且增强-L3-1-5 总交易次数: 3 盈利: 588.9586981392686 亏损: 0 最大盈利: 551.15 最大亏损: 6.39 总收益: 588.96 平均盈利: 196.32 typeA: 196.32 胜率: 100.00%
趋势空且增强-L2-2-3 总交易次数: 1 盈利: 89.83806343906541 亏损: 0 最大盈利: 89.84 最大亏损: 89.84 总收益: 89.84 平均盈利: 89.84 typeA: 89.84 胜率: 100.00%
趋势多且增强-L3-1-4-3 总交易次数: 10 盈利: 101.74431030783477 亏损: -73.04463533771275 最大盈利: 39.43 最大亏损: -71.04 总收益: 28.70 平均盈利: 2.87 typeA: 2.30 胜率: 80.00%
趋势空且增强-L-4-3-4 总交易次数: 18 盈利: 1454.5671655069423 亏损: -481.23865640532074 最大盈利: 362.32 最大亏损: -113.81 总收益: 973.33 平均盈利: 54.07 typeA: 30.04 胜率: 55.56%
趋势多且增强-L1-3-4 总交易次数: 2 盈利: 448.34607454401413 亏损: -123.4394218942188 最大盈利: 448.35 最大亏损: -123.44 总收益: 324.91 平均盈利: 162.45 typeA: 81.23 胜率: 50.00%
趋势空且增强-L2-3-4 总交易次数: 6 盈利: 46.141994601842285 亏损: -239.23022526656166 最大盈利: 23.33 最大亏损: -84.22 总收益: -193.09 平均盈利: -32.18 typeA: -16.09 胜率: 50.00%
趋势多且增强-L3-1-3 总交易次数: 6 盈利: 97.5167243726818 亏损: -64.78325868560545 最大盈利: 86.76 最大亏损: -29.55 总收益: 32.73 平均盈利: 5.46 typeA: 2.73 胜率: 50.00%
趋势多且增强-R-3-2 总交易次数: 2 盈利: 242.90005363847598 亏损: -6.863628993027768 最大盈利: 242.90 最大亏损: -6.86 总收益: 236.04 平均盈利: 118.02 typeA: 59.01 胜率: 50.00%
趋势空且增强-L2-3-3 总交易次数: 6 盈利: 359.72224387213834 亏损: -168.198492415071 最大盈利: 230.90 最大亏损: -95.13 总收益: 191.52 平均盈利: 31.92 typeA: 10.64 胜率: 33.33%
趋势空且增强-L3-1-6 总交易次数: 2 盈利: 0 亏损: -548.9438966723404 最大盈利: -171.68 最大亏损: -377.26 总收益: -548.94 平均盈利: -274.47 typeA: 0.00 胜率: 0.00%
趋势空且增强-L2-3-5 总交易次数: 2 盈利: 0 亏损: -672.6387001940155 最大盈利: -39.06 最大亏损: -633.58 总收益: -672.64 平均盈利: -336.32 typeA: 0.00 胜率: 0.00%
趋势多且增强-L1-3-2 总交易次数: 1 盈利: 0 亏损: -25.12822207534605 最大盈利: -25.13 最大亏损: -25.13 总收益: -25.13 平均盈利: -25.13 typeA: 0.00 胜率: 0.00%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     98
      胜率:          66.33%
      总收益:        7490.20 USDT
      期末余额:      17292.20 USDT
      盈亏比:        2.14
      最大单笔盈利:  2714.39
      最大单笔亏损:  -964.93
      手续费:       393.83758102022193
      =============================
    
profit: 7292.2005381423005
maxDrawdown 8.9%
startTime: 2022-10-23 00:00:00
趋势多且增强-L1-3-1 总交易次数: 1 盈利: 1689.5961188599133 亏损: 0 最大盈利: 1689.60 最大亏损: 1689.60 总收益: 1689.60 平均盈利: 1689.60 typeA: 1689.60 胜率: 100.00%
趋势空且增强-L1-1-2 总交易次数: 2 盈利: 286.23943920440877 亏损: 0 最大盈利: 227.59 最大亏损: 58.65 总收益: 286.24 平均盈利: 143.12 typeA: 143.12 胜率: 100.00%
趋势空且增强-L2-3-5 总交易次数: 6 盈利: 803.559894836972 亏损: 0 最大盈利: 636.88 最大亏损: 13.30 总收益: 803.56 平均盈利: 133.93 typeA: 133.93 胜率: 100.00%
趋势多且增强-R-1-2-2 总交易次数: 2 盈利: 17.50293631981069 亏损: 0 最大盈利: 15.47 最大亏损: 2.03 总收益: 17.50 平均盈利: 8.75 typeA: 8.75 胜率: 100.00%
趋势空且增强-L2-3-4 总交易次数: 2 盈利: 70.66795481594477 亏损: 0 最大盈利: 57.32 最大亏损: 13.34 总收益: 70.67 平均盈利: 35.33 typeA: 35.33 胜率: 100.00%
趋势空且增强-11 总交易次数: 2 盈利: 402.9879962228183 亏损: 0 最大盈利: 203.93 最大亏损: 199.06 总收益: 402.99 平均盈利: 201.49 typeA: 201.49 胜率: 100.00%
趋势多且增强-R-2-2 总交易次数: 1 盈利: 85.08606344253822 亏损: 0 最大盈利: 85.09 最大亏损: 85.09 总收益: 85.09 平均盈利: 85.09 typeA: 85.09 胜率: 100.00%
趋势空且增强-L2-3-3 总交易次数: 7 盈利: 537.8127444465131 亏损: -294.82841140529484 最大盈利: 199.39 最大亏损: -294.83 总收益: 242.98 平均盈利: 34.71 typeA: 29.75 胜率: 85.71%
趋势多且增强-R-1-1-2 总交易次数: 5 盈利: 1508.8126129147838 亏损: -52.3508477421512 最大盈利: 877.91 最大亏损: -52.35 总收益: 1456.46 平均盈利: 291.29 typeA: 233.03 胜率: 80.00%
趋势空且增强-L-4-3-4 总交易次数: 8 盈利: 1391.741489843334 亏损: -1153.3976149864002 最大盈利: 598.59 最大亏损: -964.93 总收益: 238.34 平均盈利: 29.79 typeA: 22.34 胜率: 75.00%
趋势空且增强-L3-1-6 总交易次数: 4 盈利: 3297.3126485545663 亏损: -138.13704048394655 最大盈利: 2714.39 最大亏损: -138.14 总收益: 3159.18 平均盈利: 789.79 typeA: 592.35 胜率: 75.00%
趋势多且增强-L3-1-3 总交易次数: 3 盈利: 389.82090727085523 亏损: -69.91350617004453 最大盈利: 312.12 最大亏损: -69.91 总收益: 319.91 平均盈利: 106.64 typeA: 71.09 胜率: 66.67%
趋势多且增强-L3-1-4-1 总交易次数: 6 盈利: 726.413414114149 亏损: -253.20297506370514 最大盈利: 491.62 最大亏损: -171.23 总收益: 473.21 平均盈利: 78.87 typeA: 52.58 胜率: 66.67%
趋势空且增强-L2-1-3 总交易次数: 3 盈利: 148.015093254501 亏损: -673.6892458100556 最大盈利: 108.77 最大亏损: -673.69 总收益: -525.67 平均盈利: -175.22 typeA: -116.82 胜率: 66.67%
趋势多且增强-L3-1-5 总交易次数: 8 盈利: 271.0268357727781 亏损: -171.44874071160444 最大盈利: 133.21 最大亏损: -120.33 总收益: 99.58 平均盈利: 12.45 typeA: 7.78 胜率: 62.50%
趋势多且增强-L1-1-6 总交易次数: 5 盈利: 1107.7422267489585 亏损: -347.82479825004674 最大盈利: 712.76 最大亏损: -248.87 总收益: 759.92 平均盈利: 151.98 typeA: 91.19 胜率: 60.00%
趋势多且增强-L3-1-4-3 总交易次数: 12 盈利: 87.10296203686656 亏损: -497.1275073040241 最大盈利: 45.67 最大亏损: -335.73 总收益: -410.02 平均盈利: -34.17 typeA: -19.93 胜率: 58.33%
趋势空且增强-L-4-1-4 总交易次数: 6 盈利: 1007.5683824842725 亏损: -508.875190684729 最大盈利: 479.13 最大亏损: -215.66 总收益: 498.69 平均盈利: 83.12 typeA: 41.56 胜率: 50.00%
趋势空且增强-2 总交易次数: 2 盈利: 65.38222084559467 亏损: -117.51742851179259 最大盈利: 65.38 最大亏损: -117.52 总收益: -52.14 平均盈利: -26.07 typeA: -13.03 胜率: 50.00%
趋势多且增强-R-1-1-1 总交易次数: 2 盈利: 137.98366530544223 亏损: -694.3034254752507 最大盈利: 137.98 最大亏损: -694.30 总收益: -556.32 平均盈利: -278.16 typeA: -139.08 胜率: 50.00%
趋势多且增强-R-3-1 总交易次数: 2 盈利: 15.136630754162734 亏损: -35.87568641196385 最大盈利: 15.14 最大亏损: -35.88 总收益: -20.74 平均盈利: -10.37 typeA: -5.18 胜率: 50.00%
趋势空且增强-L-4-2-4 总交易次数: 3 盈利: 18.498235227143297 亏损: -946.5268218104179 最大盈利: 18.50 最大亏损: -856.90 总收益: -928.03 平均盈利: -309.34 typeA: -103.10 胜率: 33.33%
趋势多且增强-L1-2-2 总交易次数: 1 盈利: 0 亏损: -315.4508108108114 最大盈利: -315.45 最大亏损: -315.45 总收益: -315.45 平均盈利: -315.45 typeA: 0.00 胜率: 0.00%
趋势多且增强-11 总交易次数: 1 盈利: 0 亏损: -163.4882428067022 最大盈利: -163.49 最大亏损: -163.49 总收益: -163.49 平均盈利: -163.49 typeA: 0.00 胜率: 0.00%
趋势多且增强-L1-3-4 总交易次数: 1 盈利: 0 亏损: -27.094808899031584 最大盈利: -27.09 最大亏损: -27.09 总收益: -27.09 平均盈利: -27.09 typeA: 0.00 胜率: 0.00%
趋势多且增强-R-3-2 总交易次数: 2 盈利: 0 亏损: -75.8588080806393 最大盈利: -5.73 最大亏损: -70.13 总收益: -75.86 平均盈利: -37.93 typeA: 0.00 胜率: 0.00%
趋势空且增强-L-4-2-3 总交易次数: 1 盈利: 0 亏损: -38.89802371541534 最大盈利: -38.90 最大亏损: -38.90 总收益: -38.90 平均盈利: -38.90 typeA: 0.00 胜率: 0.00%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     91
      胜率:          54.95%
      总收益:        -507.78 USDT
      期末余额:      9310.22 USDT
      盈亏比:        0.93
      最大单笔盈利:  633.89
      最大单笔亏损:  -805.06
      手续费:       364.1790528462599
      =============================
    
profit: -689.775659193836
maxDrawdown 24.2%
startTime: 2022-11-22 00:00:00
趋势多且增强-L1-2-1 总交易次数: 1 盈利: 552.6168481375371 亏损: 0 最大盈利: 552.62 最大亏损: 552.62 总收益: 552.62 平均盈利: 552.62 typeA: 552.62 胜率: 100.00%
趋势多且增强-R-1-1-1 总交易次数: 1 盈利: 443.13356678339267 亏损: 0 最大盈利: 443.13 最大亏损: 443.13 总收益: 443.13 平均盈利: 443.13 typeA: 443.13 胜率: 100.00%
趋势空且增强-2 总交易次数: 1 盈利: 8.422697991663412 亏损: 0 最大盈利: 8.42 最大亏损: 8.42 总收益: 8.42 平均盈利: 8.42 typeA: 8.42 胜率: 100.00%
趋势空且增强-L-4-2-3 总交易次数: 3 盈利: 674.7523023158036 亏损: 0 最大盈利: 599.94 最大亏损: 24.89 总收益: 674.75 平均盈利: 224.92 typeA: 224.92 胜率: 100.00%
趋势多且增强-R-3-2 总交易次数: 1 盈利: 112.7971117424241 亏损: 0 最大盈利: 112.80 最大亏损: 112.80 总收益: 112.80 平均盈利: 112.80 typeA: 112.80 胜率: 100.00%
趋势多且增强-R-2-2 总交易次数: 3 盈利: 371.00455080824815 亏损: 0 最大盈利: 202.56 最大亏损: 14.21 总收益: 371.00 平均盈利: 123.67 typeA: 123.67 胜率: 100.00%
趋势空且增强-L2-3-4 总交易次数: 6 盈利: 332.15050442914526 亏损: -229.44613306315367 最大盈利: 218.74 最大亏损: -229.45 总收益: 102.70 平均盈利: 17.12 typeA: 14.26 胜率: 83.33%
趋势多且增强-R-3-1 总交易次数: 5 盈利: 401.7306513538988 亏损: -48.4036599920439 最大盈利: 194.78 最大亏损: -48.40 总收益: 353.33 平均盈利: 70.67 typeA: 56.53 胜率: 80.00%
趋势多且增强-L3-1-5 总交易次数: 5 盈利: 248.7529484491842 亏损: -18.469360860970497 最大盈利: 161.19 最大亏损: -18.47 总收益: 230.28 平均盈利: 46.06 typeA: 36.85 胜率: 80.00%
趋势多且增强-11 总交易次数: 3 盈利: 258.2916473684238 亏损: -92.33459632760132 最大盈利: 223.74 最大亏损: -92.33 总收益: 165.96 平均盈利: 55.32 typeA: 36.88 胜率: 66.67%
趋势空且增强-L2-3-5 总交易次数: 3 盈利: 661.5742980847017 亏损: -5.12757973733607 最大盈利: 633.89 最大亏损: -5.13 总收益: 656.45 平均盈利: 218.82 typeA: 145.88 胜率: 66.67%
趋势空且增强-11 总交易次数: 3 盈利: 175.42260280374245 亏损: -108.8222440461571 最大盈利: 153.65 最大亏损: -108.82 总收益: 66.60 平均盈利: 22.20 typeA: 14.80 胜率: 66.67%
趋势多且增强-L3-1-4-3 总交易次数: 16 盈利: 373.3153415093239 亏损: -1019.0867683480708 最大盈利: 100.23 最大亏损: -508.18 总收益: -645.77 平均盈利: -40.36 typeA: -25.23 胜率: 62.50%
趋势空且增强-L-4-3-4 总交易次数: 12 盈利: 1185.791043401622 亏损: -1253.4222581197205 最大盈利: 553.36 最大亏损: -471.35 总收益: -67.63 平均盈利: -5.64 typeA: -2.35 胜率: 41.67%
趋势空且增强-L2-3-3 总交易次数: 10 盈利: 644.3610237022259 亏损: -520.4902774169091 最大盈利: 507.87 最大亏损: -209.14 总收益: 123.87 平均盈利: 12.39 typeA: 4.95 胜率: 40.00%
趋势多且增强-L1-3-4 总交易次数: 3 盈利: 32.71862641072627 亏损: -45.50920861827453 最大盈利: 32.72 最大亏损: -27.74 总收益: -12.79 平均盈利: -4.26 typeA: -1.42 胜率: 33.33%
趋势多且增强-R-2-1 总交易次数: 4 盈利: 98.23322076825733 亏损: -312.08777351747307 最大盈利: 98.23 最大亏损: -293.10 总收益: -213.85 平均盈利: -53.46 typeA: -13.37 胜率: 25.00%
趋势多且增强-L1-3-1 总交易次数: 2 盈利: 0 亏损: -183.49070011198955 最大盈利: -64.79 最大亏损: -118.70 总收益: -183.49 平均盈利: -91.75 typeA: 0.00 胜率: 0.00%
趋势空且增强-L-4-2-4 总交易次数: 3 盈利: 0 亏损: -1204.3099557313285 最大盈利: -138.95 最大亏损: -616.29 总收益: -1204.31 平均盈利: -401.44 typeA: 0.00 胜率: 0.00%
趋势多且增强-L3-1-4-1 总交易次数: 2 盈利: 0 亏损: -859.6040882863849 最大盈利: -190.68 最大亏损: -668.93 总收益: -859.60 平均盈利: -429.80 typeA: 0.00 胜率: 0.00%
趋势多且增强-L1-2-5 总交易次数: 1 盈利: 0 亏损: -73.88308846514495 最大盈利: -73.88 最大亏损: -73.88 总收益: -73.88 平均盈利: -73.88 typeA: 0.00 胜率: 0.00%
趋势空且增强-L-4-1-4 总交易次数: 1 盈利: 0 亏损: -805.0573047858932 最大盈利: -805.06 最大亏损: -805.06 总收益: -805.06 平均盈利: -805.06 typeA: 0.00 胜率: 0.00%
趋势多且增强-R-1-1-2 总交易次数: 1 盈利: 0 亏损: -50.94842309006032 最大盈利: -50.95 最大亏损: -50.95 总收益: -50.95 平均盈利: -50.95 typeA: 0.00 胜率: 0.00%
趋势空且增强-L3-1-6 总交易次数: 1 盈利: 0 亏损: -252.35122473564405 最大盈利: -252.35 最大亏损: -252.35 总收益: -252.35 平均盈利: -252.35 typeA: 0.00 胜率: 0.00%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     89
      胜率:          57.30%
      总收益:        -405.17 USDT
      期末余额:      9414.83 USDT
      盈亏比:        0.91
      最大单笔盈利:  581.81
      最大单笔亏损:  -570.82
      手续费:       358.28013957252233
      =============================
    
profit: -585.1657648579385
maxDrawdown 12.4%
startTime: 2022-12-22 00:00:00
趋势空且增强-L2-3-4 总交易次数: 7 盈利: 637.3456320608024 亏损: 0 最大盈利: 349.59 最大亏损: 0.46 总收益: 637.35 平均盈利: 91.05 typeA: 91.05 胜率: 100.00%
趋势多且增强-R-3-1 总交易次数: 5 盈利: 294.51215238695204 亏损: 0 最大盈利: 118.90 最大亏损: 16.75 总收益: 294.51 平均盈利: 58.90 typeA: 58.90 胜率: 100.00%
趋势空且增强-L-4-2-3 总交易次数: 1 盈利: 6.765994741454941 亏损: 0 最大盈利: 6.77 最大亏损: 6.77 总收益: 6.77 平均盈利: 6.77 typeA: 6.77 胜率: 100.00%
趋势多且增强-R-2-1 总交易次数: 1 盈利: 86.32375264402168 亏损: 0 最大盈利: 86.32 最大亏损: 86.32 总收益: 86.32 平均盈利: 86.32 typeA: 86.32 胜率: 100.00%
趋势多且增强-L3-1-5 总交易次数: 8 盈利: 408.203088815869 亏损: -7.198492135707575 最大盈利: 207.44 最大亏损: -7.20 总收益: 401.00 平均盈利: 50.13 typeA: 43.86 胜率: 87.50%
趋势空且增强-L2-3-3 总交易次数: 8 盈利: 402.39233053871567 亏损: -627.802513218127 最大盈利: 199.85 最大亏损: -570.82 总收益: -225.41 平均盈利: -28.18 typeA: -17.61 胜率: 62.50%
趋势多且增强-L3-1-4-3 总交易次数: 15 盈利: 438.2517284095311 亏损: -181.7349621682921 最大盈利: 267.38 最大亏损: -87.44 总收益: 256.52 平均盈利: 17.10 typeA: 10.26 胜率: 60.00%
趋势多且增强-R-3-2 总交易次数: 5 盈利: 437.40647252976436 亏损: -63.33188279793178 最大盈利: 266.93 最大亏损: -56.90 总收益: 374.07 平均盈利: 74.81 typeA: 44.89 胜率: 60.00%
趋势多且增强-11 总交易次数: 4 盈利: 145.11278266806704 亏损: -594.8274162244808 最大盈利: 110.56 最大亏损: -552.19 总收益: -449.71 平均盈利: -112.43 typeA: -56.21 胜率: 50.00%
趋势多且增强-L3-1-3 总交易次数: 4 盈利: 56.5259639995531 亏损: -159.92759957357566 最大盈利: 38.87 最大亏损: -114.18 总收益: -103.40 平均盈利: -25.85 typeA: -12.93 胜率: 50.00%
趋势空且增强-L-4-3-4 总交易次数: 12 盈利: 1016.4163631404039 亏损: -1136.8509712735972 最大盈利: 581.81 最大亏损: -471.35 总收益: -120.43 平均盈利: -10.04 typeA: -4.18 胜率: 41.67%
趋势空且增强-L2-3-5 总交易次数: 9 盈利: 64.26222466739227 亏损: -958.2537618057986 最大盈利: 34.93 最大亏损: -255.02 总收益: -893.99 平均盈利: -99.33 typeA: -33.11 胜率: 33.33%
趋势多且增强-L1-3-4 总交易次数: 5 盈利: 45.147295423024545 亏损: -190.11036969742426 最大盈利: 45.15 最大亏损: -62.52 总收益: -144.96 平均盈利: -28.99 typeA: -5.80 胜率: 20.00%
趋势空且增强-L3-1-6 总交易次数: 2 盈利: 0 亏损: -296.2298011487633 最大盈利: -43.88 最大亏损: -252.35 总收益: -296.23 平均盈利: -148.11 typeA: 0.00 胜率: 0.00%
趋势多且增强-L1-3-2 总交易次数: 1 盈利: 0 亏损: -8.600211249010876 最大盈利: -8.60 最大亏损: -8.60 总收益: -8.60 平均盈利: -8.60 typeA: 0.00 胜率: 0.00%
趋势多且增强-L1-3-1 总交易次数: 2 盈利: 0 亏损: -218.9635655907839 最大盈利: -7.53 最大亏损: -211.43 总收益: -218.96 平均盈利: -109.48 typeA: 0.00 胜率: 0.00%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     88
      胜率:          60.23%
      总收益:        3963.38 USDT
      期末余额:      13787.38 USDT
      盈亏比:        2.01
      最大单笔盈利:  758.46
      最大单笔亏损:  -616.30
      手续费:       351.45601353015985
      =============================
    
profit: 3787.3839843338737
maxDrawdown 11.0%
startTime: 2023-01-21 00:00:00
趋势多且增强-L3-1-3 总交易次数: 2 盈利: 77.66036864558194 亏损: 0 最大盈利: 38.87 最大亏损: 38.80 总收益: 77.66 平均盈利: 38.83 typeA: 38.83 胜率: 100.00%
趋势多且增强-L3-1-5 总交易次数: 3 盈利: 128.39974620871453 亏损: 0 最大盈利: 61.69 最大亏损: 21.38 总收益: 128.40 平均盈利: 42.80 typeA: 42.80 胜率: 100.00%
趋势多且增强-L3-1-4-1 总交易次数: 1 盈利: 51.29545196778929 亏损: 0 最大盈利: 51.30 最大亏损: 51.30 总收益: 51.30 平均盈利: 51.30 typeA: 51.30 胜率: 100.00%
趋势多且增强-L1-2-2 总交易次数: 1 盈利: 44.4285876090166 亏损: 0 最大盈利: 44.43 最大亏损: 44.43 总收益: 44.43 平均盈利: 44.43 typeA: 44.43 胜率: 100.00%
趋势空且增强-L-4-4-4 总交易次数: 1 盈利: 582.764668769717 亏损: 0 最大盈利: 582.76 最大亏损: 582.76 总收益: 582.76 平均盈利: 582.76 typeA: 582.76 胜率: 100.00%
趋势多且增强-L1-3-1 总交易次数: 1 盈利: 8.439958231812607 亏损: 0 最大盈利: 8.44 最大亏损: 8.44 总收益: 8.44 平均盈利: 8.44 typeA: 8.44 胜率: 100.00%
趋势多且增强-R-1-1-2 总交易次数: 1 盈利: 16.79985897285314 亏损: 0 最大盈利: 16.80 最大亏损: 16.80 总收益: 16.80 平均盈利: 16.80 typeA: 16.80 胜率: 100.00%
趋势空且增强-L2-3-5 总交易次数: 5 盈利: 739.7484601707808 亏损: -172.52136850593195 最大盈利: 411.88 最大亏损: -172.52 总收益: 567.23 平均盈利: 113.45 typeA: 90.76 胜率: 80.00%
趋势多且增强-R-2-1 总交易次数: 7 盈利: 807.2173086500029 亏损: -279.80988791601715 最大盈利: 343.77 最大亏损: -242.00 总收益: 527.41 平均盈利: 75.34 typeA: 53.82 胜率: 71.43%
趋势空且增强-L2-3-4 总交易次数: 6 盈利: 687.17457979839 亏损: -249.05412624889345 最大盈利: 432.04 最大亏损: -149.71 总收益: 438.12 平均盈利: 73.02 typeA: 48.68 胜率: 66.67%
趋势空且增强-L2-3-3 总交易次数: 9 盈利: 421.9698393822077 亏损: -277.8303421226777 最大盈利: 231.65 最大亏损: -244.60 总收益: 144.14 平均盈利: 16.02 typeA: 10.68 胜率: 66.67%
趋势多且增强-L3-1-4-3 总交易次数: 11 盈利: 183.03966901279816 亏损: -273.8050671884732 最大盈利: 50.15 最大亏损: -188.37 总收益: -90.77 平均盈利: -8.25 typeA: -5.25 胜率: 63.64%
趋势空且增强-L-4-2-3 总交易次数: 5 盈利: 430.14799089032033 亏损: -218.47788943775603 最大盈利: 294.75 最大亏损: -213.23 总收益: 211.67 平均盈利: 42.33 typeA: 25.40 胜率: 60.00%
趋势空且增强-L-4-3-4 总交易次数: 12 盈利: 2606.706307007632 亏损: -644.1826610854283 最大盈利: 758.46 最大亏损: -247.86 总收益: 1962.52 平均盈利: 163.54 typeA: 95.40 胜率: 58.33%
趋势多且增强-11 总交易次数: 7 盈利: 488.10341001052893 亏损: -421.14339105939314 最大盈利: 205.93 最大亏损: -196.11 总收益: 66.96 平均盈利: 9.57 typeA: 5.47 胜率: 57.14%
趋势空且增强-L2-2-3 总交易次数: 2 盈利: 40.75320584926944 亏损: -300.81961668545654 最大盈利: 40.75 最大亏损: -300.82 总收益: -260.07 平均盈利: -130.03 typeA: -65.02 胜率: 50.00%
趋势空且增强-L-4-2-4 总交易次数: 3 盈利: 465.45581705150886 亏损: -725.8842376534999 最大盈利: 465.46 最大亏损: -616.30 总收益: -260.43 平均盈利: -86.81 typeA: -28.93 胜率: 33.33%
趋势多且增强-L1-3-4 总交易次数: 4 盈利: 121.10842549310199 亏损: -43.607285531379176 最大盈利: 121.11 最大亏损: -24.97 总收益: 77.50 平均盈利: 19.38 typeA: 4.84 胜率: 25.00%
趋势空且增强-L3-1-6 总交易次数: 1 盈利: 0 亏损: -43.878576413119234 最大盈利: -43.88 最大亏损: -43.88 总收益: -43.88 平均盈利: -43.88 typeA: 0.00 胜率: 0.00%
趋势多且增强-L-4-2-2 总交易次数: 2 盈利: 0 亏损: -41.9666189952761 最大盈利: -10.87 最大亏损: -31.10 总收益: -41.97 平均盈利: -20.98 typeA: 0.00 胜率: 0.00%
趋势多且增强-R-3-1 总交易次数: 2 盈利: 0 亏损: -88.9867825337748 最大盈利: -34.51 最大亏损: -54.48 总收益: -88.99 平均盈利: -44.49 typeA: 0.00 胜率: 0.00%
趋势多且增强-R-1-2-2 总交易次数: 1 盈利: 0 亏损: -110.67391304347802 最大盈利: -110.67 最大亏损: -110.67 总收益: -110.67 平均盈利: -110.67 typeA: 0.00 胜率: 0.00%
趋势多且增强-L1-3-9 总交易次数: 1 盈利: 0 亏损: -45.1879049676025 最大盈利: -45.19 最大亏损: -45.19 总收益: -45.19 平均盈利: -45.19 typeA: 0.00 胜率: 0.00%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     71
      胜率:          50.70%
      总收益:        -1353.32 USDT
      期末余额:      8502.68 USDT
      盈亏比:        0.71
      最大单笔盈利:  373.18
      最大单笔亏损:  -531.13
      手续费:       285.9985395438661
      =============================
    
profit: -1497.3225780178982
maxDrawdown 18.5%
startTime: 2023-02-20 00:00:00
趋势多且增强-L-4-2-2 总交易次数: 1 盈利: 43.6797094657921 亏损: 0 最大盈利: 43.68 最大亏损: 43.68 总收益: 43.68 平均盈利: 43.68 typeA: 43.68 胜率: 100.00%
趋势多且增强-L3-1-5 总交易次数: 2 盈利: 87.67602446304385 亏损: 0 最大盈利: 60.30 最大亏损: 27.37 总收益: 87.68 平均盈利: 43.84 typeA: 43.84 胜率: 100.00%
趋势多且增强-R-1-1-1 总交易次数: 1 盈利: 38.13649136892743 亏损: 0 最大盈利: 38.14 最大亏损: 38.14 总收益: 38.14 平均盈利: 38.14 typeA: 38.14 胜率: 100.00%
趋势多且增强-R-2-2 总交易次数: 1 盈利: 188.24257357974022 亏损: 0 最大盈利: 188.24 最大亏损: 188.24 总收益: 188.24 平均盈利: 188.24 typeA: 188.24 胜率: 100.00%
趋势空且增强-L-4-2-3 总交易次数: 1 盈利: 59.65616438356055 亏损: 0 最大盈利: 59.66 最大亏损: 59.66 总收益: 59.66 平均盈利: 59.66 typeA: 59.66 胜率: 100.00%
趋势空且增强-L2-3-3 总交易次数: 9 盈利: 787.2494096643113 亏损: -539.3485126111705 最大盈利: 226.93 最大亏损: -531.13 总收益: 247.90 平均盈利: 27.54 typeA: 21.42 胜率: 77.78%
趋势空且增强-L2-3-4 总交易次数: 3 盈利: 68.22271520803201 亏损: -357.0675052410902 最大盈利: 41.05 最大亏损: -357.07 总收益: -288.84 平均盈利: -96.28 typeA: -64.19 胜率: 66.67%
趋势空且增强-L-4-3-4 总交易次数: 10 盈利: 563.2753007463751 亏损: -1137.3086377555933 最大盈利: 240.35 最大亏损: -381.61 总收益: -574.03 平均盈利: -57.40 typeA: -34.44 胜率: 60.00%
趋势多且增强-R-3-1 总交易次数: 11 盈利: 572.6242794859493 亏损: -1099.575765582655 最大盈利: 196.57 最大亏损: -512.84 总收益: -526.95 平均盈利: -47.90 typeA: -26.13 胜率: 54.55%
趋势多且增强-L1-3-4 总交易次数: 2 盈利: 105.75470668485661 亏损: -63.71604938271532 最大盈利: 105.75 最大亏损: -63.72 总收益: 42.04 平均盈利: 21.02 typeA: 10.51 胜率: 50.00%
趋势多且增强-L3-1-4-3 总交易次数: 9 盈利: 107.29994437087923 亏损: -365.5408483619959 最大盈利: 68.31 最大亏损: -195.29 总收益: -258.24 平均盈利: -28.69 typeA: -12.75 胜率: 44.44%
趋势多且增强-L3-1-3 总交易次数: 5 盈利: 257.3825492092462 亏损: -133.37566024517912 最大盈利: 229.35 最大亏损: -128.16 总收益: 124.01 平均盈利: 24.80 typeA: 9.92 胜率: 40.00%
趋势多且增强-11 总交易次数: 3 盈利: 12.57788578371751 亏损: -29.426505889233255 最大盈利: 12.58 最大亏损: -19.33 总收益: -16.85 平均盈利: -5.62 typeA: -1.87 胜率: 33.33%
趋势空且增强-L2-3-5 总交易次数: 4 盈利: 373.17585372411946 亏损: -246.97411603852922 最大盈利: 373.18 最大亏损: -190.92 总收益: 126.20 平均盈利: 31.55 typeA: 7.89 胜率: 25.00%
趋势多且增强-R-3-2 总交易次数: 1 盈利: 0 亏损: -58.077527109559036 最大盈利: -58.08 最大亏损: -58.08 总收益: -58.08 平均盈利: -58.08 typeA: 0.00 胜率: 0.00%
趋势空且增强-L3-1-6 总交易次数: 3 盈利: 0 亏损: -100.7466980297419 最大盈利: -14.26 最大亏损: -65.81 总收益: -100.75 平均盈利: -33.58 typeA: 0.00 胜率: 0.00%
趋势多且增强-L1-3-2 总交易次数: 1 盈利: 0 亏损: -31.355517494493547 最大盈利: -31.36 最大亏损: -31.36 总收益: -31.36 平均盈利: -31.36 typeA: 0.00 胜率: 0.00%
趋势空且增强-11 总交易次数: 1 盈利: 0 亏损: -103.39902676399036 最大盈利: -103.40 最大亏损: -103.40 总收益: -103.40 平均盈利: -103.40 typeA: 0.00 胜率: 0.00%
趋势空且增强-L-4-4-4 总交易次数: 1 盈利: 0 亏损: -32.86622836441622 最大盈利: -32.87 最大亏损: -32.87 总收益: -32.87 平均盈利: -32.87 typeA: 0.00 胜率: 0.00%
趋势多且增强-R-1-1-2 总交易次数: 1 盈利: 0 亏损: -206.30322949414128 最大盈利: -206.30 最大亏损: -206.30 总收益: -206.30 平均盈利: -206.30 typeA: 0.00 胜率: 0.00%
趋势多且增强-R-2-1 总交易次数: 1 盈利: 0 亏损: -113.19435779194374 最大盈利: -113.19 最大亏损: -113.19 总收益: -113.19 平均盈利: -113.19 typeA: 0.00 胜率: 0.00%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     72
      胜率:          41.67%
      总收益:        -2215.93 USDT
      期末余额:      7638.07 USDT
      盈亏比:        0.58
      最大单笔盈利:  489.30
      最大单笔亏损:  -855.27
      手续费:       290.26189384722437
      =============================
    
profit: -2361.931895844704
maxDrawdown 27.0%
startTime: 2023-03-22 00:00:00
趋势多且增强-R-3-2 总交易次数: 1 盈利: 39.73441168797297 亏损: 0 最大盈利: 39.73 最大亏损: 39.73 总收益: 39.73 平均盈利: 39.73 typeA: 39.73 胜率: 100.00%
趋势多且增强-R-1-1-1 总交易次数: 1 盈利: 76.13670827015093 亏损: 0 最大盈利: 76.14 最大亏损: 76.14 总收益: 76.14 平均盈利: 76.14 typeA: 76.14 胜率: 100.00%
趋势空且增强-L-4-2-4 总交易次数: 1 盈利: 489.2989529962126 亏损: 0 最大盈利: 489.30 最大亏损: 489.30 总收益: 489.30 平均盈利: 489.30 typeA: 489.30 胜率: 100.00%
趋势多且增强-R-2-1 总交易次数: 4 盈利: 57.8676462653883 亏损: -186.00453800579893 最大盈利: 39.26 最大亏损: -186.00 总收益: -128.14 平均盈利: -32.03 typeA: -24.03 胜率: 75.00%
趋势多且增强-L3-1-4-3 总交易次数: 9 盈利: 166.12695855725855 亏损: -309.6709506507023 最大盈利: 97.67 最大亏损: -206.78 总收益: -143.54 平均盈利: -15.95 typeA: -8.86 胜率: 55.56%
趋势空且增强-L2-3-4 总交易次数: 6 盈利: 127.83095473713634 亏损: -184.41555528037122 最大盈利: 62.31 最大亏损: -122.84 总收益: -56.58 平均盈利: -9.43 typeA: -4.72 胜率: 50.00%
趋势多且增强-L3-1-5 总交易次数: 2 盈利: 3.3803309565467843 亏损: -41.18150263128464 最大盈利: 3.38 最大亏损: -41.18 总收益: -37.80 平均盈利: -18.90 typeA: -9.45 胜率: 50.00%
趋势多且增强-R-1-1-2 总交易次数: 2 盈利: 178.18987181114414 亏损: -119.11374018976231 最大盈利: 178.19 最大亏损: -119.11 总收益: 59.08 平均盈利: 29.54 typeA: 14.77 胜率: 50.00%
趋势多且增强-L1-3-4 总交易次数: 2 盈利: 15.648720211827818 亏损: -23.604321728691428 最大盈利: 15.65 最大亏损: -23.60 总收益: -7.96 平均盈利: -3.98 typeA: -1.99 胜率: 50.00%
趋势多且增强-R-1-2-2 总交易次数: 2 盈利: 161.03055924628626 亏损: -28.313673884435694 最大盈利: 161.03 最大亏损: -28.31 总收益: 132.72 平均盈利: 66.36 typeA: 33.18 胜率: 50.00%
趋势多且增强-11 总交易次数: 7 盈利: 642.1497418568782 亏损: -623.6414731017082 最大盈利: 260.87 最大亏损: -249.86 总收益: 18.51 平均盈利: 2.64 typeA: 1.13 胜率: 42.86%
趋势空且增强-L2-3-3 总交易次数: 5 盈利: 255.21981753823346 亏损: -441.48200636111636 最大盈利: 234.48 最大亏损: -153.48 总收益: -186.26 平均盈利: -37.25 typeA: -14.90 胜率: 40.00%
趋势空且增强-L-4-3-4 总交易次数: 12 盈利: 299.604265555706 亏损: -1977.7529455767785 最大盈利: 260.47 最大亏损: -855.27 总收益: -1678.15 平均盈利: -139.85 typeA: -46.61 胜率: 33.33%
趋势多且增强-R-3-1 总交易次数: 3 盈利: 2.916041794713997 亏损: -373.63855405305725 最大盈利: 2.92 最大亏损: -330.40 总收益: -370.72 平均盈利: -123.57 typeA: -41.19 胜率: 33.33%
趋势多且增强-L3-1-3 总交易次数: 3 盈利: 122.13138862102089 亏损: -58.8156840631808 最大盈利: 122.13 最大亏损: -54.18 总收益: 63.32 平均盈利: 21.11 typeA: 7.03 胜率: 33.33%
趋势空且增强-L3-1-6 总交易次数: 5 盈利: 428.9378278825764 亏损: -541.3561589255198 最大盈利: 428.94 最大亏损: -296.18 总收益: -112.42 平均盈利: -22.48 typeA: -4.50 胜率: 20.00%
趋势多且增强-L1-3-1 总交易次数: 1 盈利: 0 亏损: -93.18697068403809 最大盈利: -93.19 最大亏损: -93.19 总收益: -93.19 平均盈利: -93.19 typeA: 0.00 胜率: 0.00%
趋势多且增强-L3-1-4-1 总交易次数: 1 盈利: 0 亏损: -58.27392120075096 最大盈利: -58.27 最大亏损: -58.27 总收益: -58.27 平均盈利: -58.27 typeA: 0.00 胜率: 0.00%
趋势空且增强-L2-2-3 总交易次数: 1 盈利: 0 亏损: -8.007207207206546 最大盈利: -8.01 最大亏损: -8.01 总收益: -8.01 平均盈利: -8.01 typeA: 0.00 胜率: 0.00%
趋势空且增强-L-4-2-3 总交易次数: 2 盈利: 0 亏损: -86.08812510250566 最大盈利: -24.66 最大亏损: -61.43 总收益: -86.09 平均盈利: -43.04 typeA: 0.00 胜率: 0.00%
趋势多且增强-L1-3-2 总交易次数: 1 盈利: 0 亏损: -8.891211947157323 最大盈利: -8.89 最大亏损: -8.89 总收益: -8.89 平均盈利: -8.89 typeA: 0.00 胜率: 0.00%
趋势空且增强-L2-3-5 总交易次数: 1 盈利: 0 亏损: -118.69755323969224 最大盈利: -118.70 最大亏损: -118.70 总收益: -118.70 平均盈利: -118.70 typeA: 0.00 胜率: 0.00%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     68
      胜率:          61.76%
      总收益:        1163.00 USDT
      期末余额:      11027.00 USDT
      盈亏比:        1.73
      最大单笔盈利:  371.52
      最大单笔亏损:  -219.05
      手续费:       271.74991380091865
      =============================
    
profit: 1027.0023803950844
maxDrawdown 3.8%
startTime: 2023-04-21 00:00:00
趋势多且增强-R-2-2 总交易次数: 1 盈利: 175.42564766839328 亏损: 0 最大盈利: 175.43 最大亏损: 175.43 总收益: 175.43 平均盈利: 175.43 typeA: 175.43 胜率: 100.00%
趋势空且增强-L-4-2-3 总交易次数: 1 盈利: 1.7843359818391034 亏损: 0 最大盈利: 1.78 最大亏损: 1.78 总收益: 1.78 平均盈利: 1.78 typeA: 1.78 胜率: 100.00%
趋势空且增强-L2-2-3 总交易次数: 1 盈利: 55.06679654884411 亏损: 0 最大盈利: 55.07 最大亏损: 55.07 总收益: 55.07 平均盈利: 55.07 typeA: 55.07 胜率: 100.00%
趋势多且增强-L3-1-4-3 总交易次数: 7 盈利: 67.48451445123729 亏损: -22.05214600882436 最大盈利: 15.41 最大亏损: -22.05 总收益: 45.43 平均盈利: 6.49 typeA: 5.56 胜率: 85.71%
趋势空且增强-L2-3-4 总交易次数: 8 盈利: 508.7735467874396 亏损: -40.30136653456364 最大盈利: 278.37 最大亏损: -39.58 总收益: 468.47 平均盈利: 58.56 typeA: 43.92 胜率: 75.00%
趋势多且增强-11 总交易次数: 4 盈利: 149.38500175634724 亏损: -53.426169865764344 最大盈利: 94.51 最大亏损: -53.43 总收益: 95.96 平均盈利: 23.99 typeA: 17.99 胜率: 75.00%
趋势多且增强-R-3-1 总交易次数: 7 盈利: 184.42569891526796 亏损: -193.9222377745471 最大盈利: 76.11 最大亏损: -168.38 总收益: -9.50 平均盈利: -1.36 typeA: -0.97 胜率: 71.43%
趋势空且增强-L2-3-3 总交易次数: 8 盈利: 350.92008393501595 亏损: -216.46820230649635 最大盈利: 106.90 最大亏损: -180.80 总收益: 134.45 平均盈利: 16.81 typeA: 10.50 胜率: 62.50%
趋势空且增强-L-4-3-4 总交易次数: 15 盈利: 1058.2161554033637 亏损: -257.8534131539519 最大盈利: 371.52 最大亏损: -83.37 总收益: 800.36 平均盈利: 53.36 typeA: 32.01 胜率: 60.00%
趋势多且增强-L3-1-5 总交易次数: 6 盈利: 146.7872286156428 亏损: -230.87413030458487 最大盈利: 123.12 最大亏损: -219.05 总收益: -84.09 平均盈利: -14.01 typeA: -7.01 胜率: 50.00%
趋势多且增强-L3-1-3 总交易次数: 2 盈利: 10.505315822389353 亏损: -21.590202939118438 最大盈利: 10.51 最大亏损: -21.59 总收益: -11.08 平均盈利: -5.54 typeA: -2.77 胜率: 50.00%
趋势空且增强-L2-3-5 总交易次数: 3 盈利: 50.30425481340739 亏损: -307.59562834441874 最大盈利: 50.30 最大亏损: -161.73 总收益: -257.29 平均盈利: -85.76 typeA: -28.59 胜率: 33.33%
趋势多且增强-R-2-1 总交易次数: 1 盈利: 0 亏损: -186.00453800579893 最大盈利: -186.00 最大亏损: -186.00 总收益: -186.00 平均盈利: -186.00 typeA: 0.00 胜率: 0.00%
趋势多且增强-R-1-1-2 总交易次数: 1 盈利: 0 亏损: -14.855857014273223 最大盈利: -14.86 最大亏损: -14.86 总收益: -14.86 平均盈利: -14.86 typeA: 0.00 胜率: 0.00%
趋势多且增强-L1-3-1 总交易次数: 1 盈利: 0 亏损: -40.72379569111606 最大盈利: -40.72 最大亏损: -40.72 总收益: -40.72 平均盈利: -40.72 typeA: 0.00 胜率: 0.00%
趋势多且增强-R-3-2 总交易次数: 1 盈利: 0 亏损: -9.780544747082295 最大盈利: -9.78 最大亏损: -9.78 总收益: -9.78 平均盈利: -9.78 typeA: 0.00 胜率: 0.00%
趋势多且增强-L1-3-4 总交易次数: 1 盈利: 0 亏损: -0.6279676135589238 最大盈利: -0.63 最大亏损: -0.63 总收益: -0.63 平均盈利: -0.63 typeA: 0.00 胜率: 0.00%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     76
      胜率:          53.95%
      总收益:        721.46 USDT
      期末余额:      10567.46 USDT
      盈亏比:        1.28
      最大单笔盈利:  1197.14
      最大单笔亏损:  -285.18
      手续费:       305.72949487968884
      =============================
    
profit: 567.4557239934838
maxDrawdown 6.4%
startTime: 2023-05-21 00:00:00
趋势多且增强-L3-1-3 总交易次数: 4 盈利: 64.04090182587802 亏损: 0 最大盈利: 24.10 最大亏损: 2.84 总收益: 64.04 平均盈利: 16.01 typeA: 16.01 胜率: 100.00%
趋势空且增强-L-4-4-4 总交易次数: 2 盈利: 311.45942741757955 亏损: 0 最大盈利: 295.56 最大亏损: 15.90 总收益: 311.46 平均盈利: 155.73 typeA: 155.73 胜率: 100.00%
趋势空且增强-L3-1-6 总交易次数: 1 盈利: 1197.138011017686 亏损: 0 最大盈利: 1197.14 最大亏损: 1197.14 总收益: 1197.14 平均盈利: 1197.14 typeA: 1197.14 胜率: 100.00%
趋势多且增强-L3-1-5 总交易次数: 5 盈利: 40.87875230838638 亏损: -10.715385732965931 最大盈利: 11.73 最大亏损: -10.72 总收益: 30.16 平均盈利: 6.03 typeA: 4.83 胜率: 80.00%
趋势多且增强-L3-1-4-3 总交易次数: 12 盈利: 206.06824233399354 亏损: -168.7719399945238 最大盈利: 58.65 最大亏损: -140.94 总收益: 37.30 平均盈利: 3.11 typeA: 2.07 胜率: 66.67%
趋势空且增强-L2-3-4 总交易次数: 8 盈利: 279.5516874840881 亏损: -293.12356099158035 最大盈利: 217.28 最大亏损: -140.72 总收益: -13.57 平均盈利: -1.70 typeA: -1.06 胜率: 62.50%
趋势空且增强-L2-3-5 总交易次数: 5 盈利: 391.276403866818 亏损: -97.7930071419502 最大盈利: 187.68 最大亏损: -50.23 总收益: 293.48 平均盈利: 58.70 typeA: 35.22 胜率: 60.00%
趋势空且增强-L2-3-3 总交易次数: 9 盈利: 83.09587121910704 亏损: -228.32830208244584 最大盈利: 25.59 最大亏损: -131.73 总收益: -145.23 平均盈利: -16.14 typeA: -8.97 胜率: 55.56%
趋势多且增强-R-3-2 总交易次数: 2 盈利: 128.59356014580797 亏损: -9.44231055530661 最大盈利: 128.59 最大亏损: -9.44 总收益: 119.15 平均盈利: 59.58 typeA: 29.79 胜率: 50.00%
趋势多且增强-R-3-1 总交易次数: 8 盈利: 175.56346335748793 亏损: -376.99280447129394 最大盈利: 161.38 最大亏损: -285.18 总收益: -201.43 平均盈利: -25.18 typeA: -9.44 胜率: 37.50%
趋势空且增强-L-4-3-4 总交易次数: 16 盈利: 410.54055455340676 亏损: -1022.7391040463248 最大盈利: 240.09 最大亏损: -243.15 总收益: -612.20 平均盈利: -38.26 typeA: -11.96 胜率: 31.25%
趋势多且增强-L1-3-1 总交易次数: 1 盈利: 0 亏损: -101.35547984100032 最大盈利: -101.36 最大亏损: -101.36 总收益: -101.36 平均盈利: -101.36 typeA: 0.00 胜率: 0.00%
趋势多且增强-L1-3-4 总交易次数: 2 盈利: 0 亏损: -181.8804218522149 最大盈利: -32.79 最大亏损: -149.09 总收益: -181.88 平均盈利: -90.94 typeA: 0.00 胜率: 0.00%
趋势多且增强-11 总交易次数: 1 盈利: 0 亏损: -75.60883482714502 最大盈利: -75.61 最大亏损: -75.61 总收益: -75.61 平均盈利: -75.61 typeA: 0.00 胜率: 0.00%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     83
      胜率:          49.40%
      总收益:        -2679.16 USDT
      期末余额:      7152.84 USDT
      盈亏比:        0.56
      最大单笔盈利:  444.75
      最大单笔亏损:  -774.78
      手续费:       334.5084914580823
      =============================
    
profit: -2847.1635025969836
maxDrawdown 31.0%
startTime: 2023-06-20 00:00:00
趋势空且增强-L2-2-3 总交易次数: 2 盈利: 247.7179752069406 亏损: 0 最大盈利: 158.44 最大亏损: 89.27 总收益: 247.72 平均盈利: 123.86 typeA: 123.86 胜率: 100.00%
趋势空且增强-L2-3-5 总交易次数: 4 盈利: 285.4956588969216 亏损: -174.4734765453749 最大盈利: 259.08 最大亏损: -174.47 总收益: 111.02 平均盈利: 27.76 typeA: 20.82 胜率: 75.00%
趋势多且增强-R-2-1 总交易次数: 3 盈利: 336.16989554450356 亏损: -46.907920347358676 最大盈利: 219.63 最大亏损: -46.91 总收益: 289.26 平均盈利: 96.42 typeA: 64.28 胜率: 66.67%
趋势多且增强-R-3-1 总交易次数: 3 盈利: 107.37896739652032 亏损: -2 最大盈利: 77.91 最大亏损: -2.00 总收益: 105.38 平均盈利: 35.13 typeA: 23.42 胜率: 66.67%
趋势多且增强-L3-1-4-3 总交易次数: 16 盈利: 213.98570612707945 亏损: -267.79773368709425 最大盈利: 90.08 最大亏损: -186.52 总收益: -53.81 平均盈利: -3.36 typeA: -2.10 胜率: 62.50%
趋势多且增强-L3-1-5 总交易次数: 5 盈利: 150.32204232643286 亏损: -335.11620365610736 最大盈利: 107.97 最大亏损: -275.55 总收益: -184.79 平均盈利: -36.96 typeA: -22.18 胜率: 60.00%
趋势空且增强-L2-3-3 总交易次数: 11 盈利: 576.9665656827827 亏损: -1771.504466704771 最大盈利: 444.75 最大亏损: -774.78 总收益: -1194.54 平均盈利: -108.59 typeA: -59.24 胜率: 54.55%
趋势多且增强-11 总交易次数: 4 盈利: 329.91753614401034 亏损: -141.83974016496208 最大盈利: 184.45 最大亏损: -107.87 总收益: 188.08 平均盈利: 47.02 typeA: 23.51 胜率: 50.00%
趋势多且增强-L1-3-1 总交易次数: 2 盈利: 164.8490864623787 亏损: -31.823579545454805 最大盈利: 164.85 最大亏损: -31.82 总收益: 133.03 平均盈利: 66.51 typeA: 33.26 胜率: 50.00%
趋势空且增强-L2-3-4 总交易次数: 13 盈利: 593.5698569686523 亏损: -1143.4490620292363 最大盈利: 245.33 最大亏损: -366.45 总收益: -549.88 平均盈利: -42.30 typeA: -19.52 胜率: 46.15%
趋势多且增强-L1-3-4 总交易次数: 3 盈利: 13.702170188463588 亏损: -381.041572742741 最大盈利: 13.70 最大亏损: -324.38 总收益: -367.34 平均盈利: -122.45 typeA: -40.81 胜率: 33.33%
趋势空且增强-L-4-3-4 总交易次数: 11 盈利: 383.46774501586776 亏损: -1556.8249283946802 最大盈利: 325.91 最大亏损: -552.47 总收益: -1173.36 平均盈利: -106.67 typeA: -29.09 胜率: 27.27%
趋势多且增强-L1-3-2 总交易次数: 1 盈利: 0 亏损: -63.25689277899398 最大盈利: -63.26 最大亏损: -63.26 总收益: -63.26 平均盈利: -63.26 typeA: 0.00 胜率: 0.00%
趋势多且增强-L1-2-2 总交易次数: 1 盈利: 0 亏损: -70.19126396749357 最大盈利: -70.19 最大亏损: -70.19 总收益: -70.19 平均盈利: -70.19 typeA: 0.00 胜率: 0.00%
趋势多且增强-L3-1-3 总交易次数: 1 盈利: 0 亏损: -35.33171692680679 最大盈利: -35.33 最大亏损: -35.33 总收益: -35.33 平均盈利: -35.33 typeA: 0.00 胜率: 0.00%
趋势空且增强-L3-1-6 总交易次数: 2 盈利: 0 亏损: -55.027530102044174 最大盈利: -22.26 最大亏损: -32.77 总收益: -55.03 平均盈利: -27.51 typeA: 0.00 胜率: 0.00%
趋势多且增强-L3-1-4-1 总交易次数: 1 盈利: 0 亏损: -6.1206209644165925 最大盈利: -6.12 最大亏损: -6.12 总收益: -6.12 平均盈利: -6.12 typeA: 0.00 胜率: 0.00%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     89
      胜率:          47.19%
      总收益:        1125.02 USDT
      期末余额:      10945.02 USDT
      盈亏比:        1.28
      最大单笔盈利:  1148.20
      最大单笔亏损:  -545.36
      手续费:       358.25316154400866
      =============================
    
profit: 945.0240409273774
maxDrawdown 15.9%
startTime: 2023-07-20 00:00:00
趋势多且增强-L3-1-4-1 总交易次数: 1 盈利: 234.3463441451346 亏损: 0 最大盈利: 234.35 最大亏损: 234.35 总收益: 234.35 平均盈利: 234.35 typeA: 234.35 胜率: 100.00%
趋势空且增强-L3-1-6 总交易次数: 1 盈利: 197.25314046440832 亏损: 0 最大盈利: 197.25 最大亏损: 197.25 总收益: 197.25 平均盈利: 197.25 typeA: 197.25 胜率: 100.00%
趋势多且增强-L3-1-5 总交易次数: 3 盈利: 78.53748900482607 亏损: 0 最大盈利: 39.76 最大亏损: 15.73 总收益: 78.54 平均盈利: 26.18 typeA: 26.18 胜率: 100.00%
趋势多且增强-R-3-2 总交易次数: 1 盈利: 82.20186576833348 亏损: 0 最大盈利: 82.20 最大亏损: 82.20 总收益: 82.20 平均盈利: 82.20 typeA: 82.20 胜率: 100.00%
趋势多且增强-R-1-1-1 总交易次数: 1 盈利: 1148.19633460352 亏损: 0 最大盈利: 1148.20 最大亏损: 1148.20 总收益: 1148.20 平均盈利: 1148.20 typeA: 1148.20 胜率: 100.00%
趋势多且增强-11 总交易次数: 4 盈利: 131.84094856189304 亏损: -22.846538782318234 最大盈利: 73.45 最大亏损: -22.85 总收益: 108.99 平均盈利: 27.25 typeA: 20.44 胜率: 75.00%
趋势空且增强-L2-3-4 总交易次数: 13 盈利: 1047.689597563713 亏损: -640.4036196894176 最大盈利: 379.10 最大亏损: -197.62 总收益: 407.29 平均盈利: 31.33 typeA: 19.28 胜率: 61.54%
趋势多且增强-R-3-1 总交易次数: 10 盈利: 390.4283830881164 亏损: -350.84370773584124 最大盈利: 114.32 最大亏损: -121.59 总收益: 39.58 平均盈利: 3.96 typeA: 1.98 胜率: 50.00%
趋势多且增强-R-2-2 总交易次数: 2 盈利: 10.72729844413108 亏损: -6.22748414376353 最大盈利: 10.73 最大亏损: -6.23 总收益: 4.50 平均盈利: 2.25 typeA: 1.12 胜率: 50.00%
趋势多且增强-L3-1-4-3 总交易次数: 11 盈利: 179.97358437149734 亏损: -331.58980664014655 最大盈利: 143.00 最大亏损: -153.55 总收益: -151.62 平均盈利: -13.78 typeA: -6.26 胜率: 45.45%
趋势空且增强-L2-3-3 总交易次数: 7 盈利: 90.7824227033779 亏损: -208.9417244090191 最大盈利: 47.42 最大亏损: -116.98 总收益: -118.16 平均盈利: -16.88 typeA: -7.23 胜率: 42.86%
趋势多且增强-L1-3-4 总交易次数: 5 盈利: 187.37869308509306 亏损: -385.64827158560104 最大盈利: 123.98 最大亏损: -324.38 总收益: -198.27 平均盈利: -39.65 typeA: -15.86 胜率: 40.00%
趋势空且增强-L-4-3-4 总交易次数: 20 盈利: 1264.2543575372292 亏损: -1400.6327616702004 最大盈利: 465.27 最大亏损: -545.36 总收益: -136.38 平均盈利: -6.82 typeA: -2.39 胜率: 35.00%
趋势多且增强-L3-1-3 总交易次数: 3 盈利: 42.534521158129294 亏损: -49.97272124341919 最大盈利: 42.53 最大亏损: -37.40 总收益: -7.44 平均盈利: -2.48 typeA: -0.83 胜率: 33.33%
趋势空且增强-L2-3-5 总交易次数: 2 盈利: 0 亏损: -226.37118716548053 最大盈利: -15.27 最大亏损: -211.11 总收益: -226.37 平均盈利: -113.19 typeA: 0.00 胜率: 0.00%
趋势空且增强-L2-2-3 总交易次数: 1 盈利: 0 亏损: -18.114930182598698 最大盈利: -18.11 最大亏损: -18.11 总收益: -18.11 平均盈利: -18.11 typeA: 0.00 胜率: 0.00%
趋势空且增强-L-4-2-3 总交易次数: 1 盈利: 0 亏损: -176.7768069896746 最大盈利: -176.78 最大亏损: -176.78 总收益: -176.78 平均盈利: -176.78 typeA: 0.00 胜率: 0.00%
趋势多且增强-L1-3-2 总交易次数: 1 盈利: 0 亏损: -80.83634953464316 最大盈利: -80.84 最大亏损: -80.84 总收益: -80.84 平均盈利: -80.84 typeA: 0.00 胜率: 0.00%
趋势多且增强-L1-3-1 总交易次数: 1 盈利: 0 亏损: -26.898518241813687 最大盈利: -26.90 最大亏损: -26.90 总收益: -26.90 平均盈利: -26.90 typeA: 0.00 胜率: 0.00%
趋势多且增强-R-2-1 总交易次数: 1 盈利: 0 亏损: -35.016511558090365 最大盈利: -35.02 最大亏损: -35.02 总收益: -35.02 平均盈利: -35.02 typeA: 0.00 胜率: 0.00%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     68
      胜率:          47.06%
      总收益:        -394.38 USDT
      期末余额:      9469.62 USDT
      盈亏比:        0.81
      最大单笔盈利:  371.48
      最大单笔亏损:  -296.01
      手续费:       271.85310526443806
      =============================
    
profit: -530.3789186268186
maxDrawdown 10.0%
startTime: 2023-08-19 00:00:00
趋势多且增强-R-3-1 总交易次数: 4 盈利: 190.24274767052552 亏损: 0 最大盈利: 82.95 最大亏损: 10.99 总收益: 190.24 平均盈利: 47.56 typeA: 47.56 胜率: 100.00%
趋势多且增强-L1-3-4 总交易次数: 1 盈利: 9.052747946936295 亏损: 0 最大盈利: 9.05 最大亏损: 9.05 总收益: 9.05 平均盈利: 9.05 typeA: 9.05 胜率: 100.00%
趋势空且增强-L2-3-4 总交易次数: 5 盈利: 230.3113071179199 亏损: 0 最大盈利: 108.07 最大亏损: 13.83 总收益: 230.31 平均盈利: 46.06 typeA: 46.06 胜率: 100.00%
趋势空且增强-L3-1-6 总交易次数: 1 盈利: 84.68078960038498 亏损: 0 最大盈利: 84.68 最大亏损: 84.68 总收益: 84.68 平均盈利: 84.68 typeA: 84.68 胜率: 100.00%
趋势多且增强-L3-1-4-3 总交易次数: 10 盈利: 103.8123320360601 亏损: -355.23780671744936 最大盈利: 29.25 最大亏损: -266.28 总收益: -251.43 平均盈利: -25.14 typeA: -17.60 胜率: 70.00%
趋势空且增强-L2-3-5 总交易次数: 6 盈利: 518.3855723761911 亏损: -100.99322189554107 最大盈利: 371.48 最大亏损: -92.47 总收益: 417.39 平均盈利: 69.57 typeA: 46.38 胜率: 66.67%
趋势多且增强-L1-3-2 总交易次数: 2 盈利: 40.45101431042716 亏损: -296.01470367591946 最大盈利: 40.45 最大亏损: -296.01 总收益: -255.56 平均盈利: -127.78 typeA: -63.89 胜率: 50.00%
趋势多且增强-L3-1-5 总交易次数: 8 盈利: 64.12551133076697 亏损: -233.87618199419154 最大盈利: 34.53 最大亏损: -115.74 总收益: -169.75 平均盈利: -21.22 typeA: -10.61 胜率: 50.00%
趋势空且增强-L-4-3-4 总交易次数: 16 盈利: 459.81719500190144 亏损: -651.5419243856613 最大盈利: 225.53 最大亏损: -151.96 总收益: -191.72 平均盈利: -11.98 typeA: -3.00 胜率: 25.00%
趋势空且增强-L2-3-3 总交易次数: 12 盈利: 29.35914720175666 亏损: -411.99733800698783 最大盈利: 29.36 最大亏损: -104.30 总收益: -382.64 平均盈利: -31.89 typeA: -2.66 胜率: 8.33%
趋势多且增强-L3-1-3 总交易次数: 3 盈利: 0 亏损: -74.95610654393603 最大盈利: -3.57 最大亏损: -67.74 总收益: -74.96 平均盈利: -24.99 typeA: 0.00 胜率: 0.00%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     72
      胜率:          48.61%
      总收益:        590.91 USDT
      期末余额:      10446.91 USDT
      盈亏比:        1.43
      最大单笔盈利:  306.89
      最大单笔亏损:  -181.41
      手续费:       287.8834413689721
      =============================
    
profit: 446.90649237377147
maxDrawdown 4.2%
startTime: 2023-09-18 00:00:00
趋势多且增强-L3-1-5 总交易次数: 6 盈利: 59.17478596642401 亏损: -15.74968259772072 最大盈利: 20.69 最大亏损: -10.40 总收益: 43.43 平均盈利: 7.24 typeA: 4.83 胜率: 66.67%
趋势空且增强-L2-3-5 总交易次数: 3 盈利: 19.436247372892904 亏损: -61.06692913385813 最大盈利: 11.60 最大亏损: -61.07 总收益: -41.63 平均盈利: -13.88 typeA: -9.25 胜率: 66.67%
趋势多且增强-L3-1-4-3 总交易次数: 18 盈利: 258.76510743710503 亏损: -239.9440827912679 最大盈利: 86.78 最大亏损: -76.87 总收益: 18.82 平均盈利: 1.05 typeA: 0.64 胜率: 61.11%
趋势空且增强-L2-3-3 总交易次数: 6 盈利: 55.61380547059896 亏损: -93.4886273482329 最大盈利: 23.66 最大亏损: -71.62 总收益: -37.87 平均盈利: -6.31 typeA: -3.16 胜率: 50.00%
趋势多且增强-R-3-1 总交易次数: 2 盈利: 71.02548287615632 亏损: -30.925459496255364 最大盈利: 71.03 最大亏损: -30.93 总收益: 40.10 平均盈利: 20.05 typeA: 10.03 胜率: 50.00%
趋势空且增强-L2-3-4 总交易次数: 9 盈利: 563.4544839920848 亏损: -149.56559539756546 最大盈利: 306.89 最大亏损: -59.86 总收益: 413.89 平均盈利: 45.99 typeA: 20.44 胜率: 44.44%
趋势空且增强-L-4-3-4 总交易次数: 19 盈利: 898.4049893143309 亏损: -450.1853844338654 最大盈利: 275.04 最大亏损: -102.60 总收益: 448.22 平均盈利: 23.59 typeA: 9.93 胜率: 42.11%
趋势多且增强-L3-1-3 总交易次数: 4 盈利: 5.918580706477822 亏损: -92.2815424771304 最大盈利: 5.92 最大亏损: -67.74 总收益: -86.36 平均盈利: -21.59 typeA: -5.40 胜率: 25.00%
趋势空且增强-L3-1-6 总交易次数: 5 盈利: 34.139366827253085 亏损: -241.81905391365478 最大盈利: 34.14 最大亏损: -181.41 总收益: -207.68 平均盈利: -41.54 typeA: -8.31 胜率: 20.00%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     82
      胜率:          60.98%
      总收益:        2468.50 USDT
      期末余额:      12302.50 USDT
      盈亏比:        1.55
      最大单笔盈利:  649.32
      最大单笔亏损:  -821.13
      手续费:       330.3298358432393
      =============================
    
profit: 2302.497452060419
maxDrawdown 10.8%
startTime: 2023-10-18 00:00:00
趋势空且增强-L3-1-6 总交易次数: 1 盈利: 461.30031993323126 亏损: 0 最大盈利: 461.30 最大亏损: 461.30 总收益: 461.30 平均盈利: 461.30 typeA: 461.30 胜率: 100.00%
趋势多且增强-R-3-2 总交易次数: 1 盈利: 17.215552927260678 亏损: 0 最大盈利: 17.22 最大亏损: 17.22 总收益: 17.22 平均盈利: 17.22 typeA: 17.22 胜率: 100.00%
趋势多且增强-L3-1-5 总交易次数: 1 盈利: 14.069257744009201 亏损: 0 最大盈利: 14.07 最大亏损: 14.07 总收益: 14.07 平均盈利: 14.07 typeA: 14.07 胜率: 100.00%
趋势多且增强-L3-1-3 总交易次数: 3 盈利: 204.67728168324797 亏损: 0 最大盈利: 150.36 最大亏损: 2.04 总收益: 204.68 平均盈利: 68.23 typeA: 68.23 胜率: 100.00%
趋势多且增强-L1-3-2 总交易次数: 1 盈利: 24.16951265112824 亏损: 0 最大盈利: 24.17 最大亏损: 24.17 总收益: 24.17 平均盈利: 24.17 typeA: 24.17 胜率: 100.00%
趋势多且增强-L3-1-4-3 总交易次数: 16 盈利: 595.0840978946901 亏损: -360.96380662904585 最大盈利: 248.76 最大亏损: -190.53 总收益: 234.12 平均盈利: 14.63 typeA: 12.80 胜率: 87.50%
趋势多且增强-R-3-1 总交易次数: 4 盈利: 566.4943959706965 亏损: -56.00270067516867 最大盈利: 248.57 最大亏损: -56.00 总收益: 510.49 平均盈利: 127.62 typeA: 95.72 胜率: 75.00%
趋势空且增强-L2-3-4 总交易次数: 9 盈利: 563.0787750188474 亏损: -824.834627071166 最大盈利: 265.88 最大亏损: -541.90 总收益: -261.76 平均盈利: -29.08 typeA: -19.39 胜率: 66.67%
趋势空且增强-L2-3-5 总交易次数: 6 盈利: 72.26397442555667 亏损: -81.10147472794503 最大盈利: 25.53 最大亏损: -58.90 总收益: -8.84 平均盈利: -1.47 typeA: -0.98 胜率: 66.67%
趋势空且增强-L2-3-3 总交易次数: 7 盈利: 1130.420032190432 亏损: -552.1028100849963 最大盈利: 552.11 最大亏损: -355.01 总收益: 578.32 平均盈利: 82.62 typeA: 47.21 胜率: 57.14%
趋势多且增强-L1-3-1 总交易次数: 2 盈利: 113.10077274877914 亏损: -33.51232091690515 最大盈利: 113.10 最大亏损: -33.51 总收益: 79.59 平均盈利: 39.79 typeA: 19.90 胜率: 50.00%
趋势多且增强-11 总交易次数: 4 盈利: 764.5608512556225 亏损: -138.55981851122257 最大盈利: 532.77 最大亏损: -107.47 总收益: 626.00 平均盈利: 156.50 typeA: 78.25 胜率: 50.00%
趋势多且增强-R-2-1 总交易次数: 2 盈利: 274.1878453038665 亏损: -76.37252042006952 最大盈利: 274.19 最大亏损: -76.37 总收益: 197.82 平均盈利: 98.91 typeA: 49.45 胜率: 50.00%
趋势空且增强-L-4-2-3 总交易次数: 2 盈利: 267.9684002633324 亏损: -309.4555524785377 最大盈利: 267.97 最大亏损: -309.46 总收益: -41.49 平均盈利: -20.74 typeA: -10.37 胜率: 50.00%
趋势多且增强-L1-3-4 总交易次数: 2 盈利: 299.1075599262438 亏损: -30.647564469913778 最大盈利: 299.11 最大亏损: -30.65 总收益: 268.46 平均盈利: 134.23 typeA: 67.11 胜率: 50.00%
趋势空且增强-L-4-3-4 总交易次数: 16 盈利: 1613.335859983956 亏损: -1611.8141622439089 最大盈利: 649.32 最大亏损: -821.13 总收益: 1.52 平均盈利: 0.10 typeA: 0.04 胜率: 37.50%
趋势空且增强-L-4-4-4 总交易次数: 1 盈利: 0 亏损: -0.36032786885309465 最大盈利: -0.36 最大亏损: -0.36 总收益: -0.36 平均盈利: -0.36 typeA: 0.00 胜率: 0.00%
趋势空且增强-L-4-2-4 总交易次数: 2 盈利: 0 亏损: -324.7760066790448 最大盈利: -140.26 最大亏损: -184.52 总收益: -324.78 平均盈利: -162.39 typeA: 0.00 胜率: 0.00%
趋势多且增强-L-4-2-2 总交易次数: 1 盈利: 0 亏损: -38.13251238120633 最大盈利: -38.13 最大亏损: -38.13 总收益: -38.13 平均盈利: -38.13 typeA: 0.00 胜率: 0.00%
趋势多且增强-L3-1-4-1 总交易次数: 1 盈利: 0 亏损: -73.90083270249825 最大盈利: -73.90 最大亏损: -73.90 总收益: -73.90 平均盈利: -73.90 typeA: 0.00 胜率: 0.00%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     90
      胜率:          55.56%
      总收益:        3513.67 USDT
      期末余额:      13333.67 USDT
      盈亏比:        1.80
      最大单笔盈利:  1053.58
      最大单笔亏损:  -572.64
      手续费:       360.137494860903
      =============================
    
profit: 3333.666727756221
maxDrawdown 16.0%
startTime: 2023-11-17 00:00:00
趋势空且增强-11 总交易次数: 1 盈利: 109.46731780616102 亏损: 0 最大盈利: 109.47 最大亏损: 109.47 总收益: 109.47 平均盈利: 109.47 typeA: 109.47 胜率: 100.00%
趋势空且增强-L-4-2-3 总交易次数: 3 盈利: 263.40029613624625 亏损: 0 最大盈利: 211.51 最大亏损: 6.25 总收益: 263.40 平均盈利: 87.80 typeA: 87.80 胜率: 100.00%
趋势多且增强-R-2-1 总交易次数: 2 盈利: 449.1223963280444 亏损: 0 最大盈利: 302.66 最大亏损: 146.46 总收益: 449.12 平均盈利: 224.56 typeA: 224.56 胜率: 100.00%
趋势多且增强-L3-1-5 总交易次数: 3 盈利: 276.53186868976064 亏损: 0 最大盈利: 198.26 最大亏损: 15.27 总收益: 276.53 平均盈利: 92.18 typeA: 92.18 胜率: 100.00%
趋势空且增强-L1-1-2 总交易次数: 1 盈利: 327.36368038740926 亏损: 0 最大盈利: 327.36 最大亏损: 327.36 总收益: 327.36 平均盈利: 327.36 typeA: 327.36 胜率: 100.00%
趋势多且增强-L1-3-9 总交易次数: 1 盈利: 155.10563665855594 亏损: 0 最大盈利: 155.11 最大亏损: 155.11 总收益: 155.11 平均盈利: 155.11 typeA: 155.11 胜率: 100.00%
趋势多且增强-R-1-2-2 总交易次数: 1 盈利: 51.47107618423972 亏损: 0 最大盈利: 51.47 最大亏损: 51.47 总收益: 51.47 平均盈利: 51.47 typeA: 51.47 胜率: 100.00%
趋势多且增强-L3-1-4-3 总交易次数: 14 盈利: 228.22744940808823 亏损: -388.6708619514589 最大盈利: 35.89 最大亏损: -179.55 总收益: -160.44 平均盈利: -11.46 typeA: -8.19 胜率: 71.43%
趋势空且增强-L2-3-5 总交易次数: 3 盈利: 339.6956301911009 亏损: -276.7132999594088 最大盈利: 319.45 最大亏损: -276.71 总收益: 62.98 平均盈利: 20.99 typeA: 14.00 胜率: 66.67%
趋势多且增强-L1-3-1 总交易次数: 3 盈利: 1072.2067843606028 亏损: -20.672338659472878 最大盈利: 1053.58 最大亏损: -20.67 总收益: 1051.53 平均盈利: 350.51 typeA: 233.69 胜率: 66.67%
趋势多且增强-R-1-1-2 总交易次数: 3 盈利: 263.97879320142175 亏损: -23.099504062466167 最大盈利: 231.10 最大亏损: -23.10 总收益: 240.88 平均盈利: 80.29 typeA: 53.53 胜率: 66.67%
趋势空且增强-L-4-2-4 总交易次数: 5 盈利: 1208.7083465058774 亏损: -555.3074454334893 最大盈利: 497.41 最大亏损: -445.43 总收益: 653.40 平均盈利: 130.68 typeA: 78.41 胜率: 60.00%
趋势空且增强-L2-3-3 总交易次数: 7 盈利: 120.91026000616608 亏损: -371.33484010500484 最大盈利: 63.96 最大亏损: -198.85 总收益: -250.42 平均盈利: -35.77 typeA: -20.44 胜率: 57.14%
趋势多且增强-R-3-1 总交易次数: 2 盈利: 23.50167807759373 亏损: -49.06437659033196 最大盈利: 23.50 最大亏损: -49.06 总收益: -25.56 平均盈利: -12.78 typeA: -6.39 胜率: 50.00%
趋势多且增强-L3-1-3 总交易次数: 2 盈利: 11.785956724649047 亏损: -4.555072834141611 最大盈利: 11.79 最大亏损: -4.56 总收益: 7.23 平均盈利: 3.62 typeA: 1.81 胜率: 50.00%
趋势空且增强-L2-3-4 总交易次数: 7 盈利: 391.2958687667431 亏损: -757.493483837384 最大盈利: 359.10 最大亏损: -330.42 总收益: -366.20 平均盈利: -52.31 typeA: -22.42 胜率: 42.86%
趋势空且增强-L-4-3-4 总交易次数: 19 盈利: 2144.6432856322335 亏损: -1359.8289785831828 最大盈利: 657.93 最大亏损: -572.64 总收益: 784.81 平均盈利: 41.31 typeA: 17.39 胜率: 42.11%
趋势多且增强-L1-3-4 总交易次数: 4 盈利: 455.9141395232737 亏损: -106.813482369691 最大盈利: 455.91 最大亏损: -46.95 总收益: 349.10 平均盈利: 87.28 typeA: 21.82 胜率: 25.00%
趋势多且增强-11 总交易次数: 4 盈利: 23.806413183758202 亏损: -74.77038960190664 最大盈利: 23.81 最大亏损: -41.94 总收益: -50.96 平均盈利: -12.74 typeA: -3.19 胜率: 25.00%
趋势多且增强-L-4-2-2 总交易次数: 1 盈利: 0 亏损: -19.753932014204388 最大盈利: -19.75 最大亏损: -19.75 总收益: -19.75 平均盈利: -19.75 typeA: 0.00 胜率: 0.00%
趋势多且增强-L3-1-4-1 总交易次数: 1 盈利: 0 亏损: -107.60872008090756 最大盈利: -107.61 最大亏损: -107.61 总收益: -107.61 平均盈利: -107.61 typeA: 0.00 胜率: 0.00%
趋势空且增强-L-4-1-4 总交易次数: 1 盈利: 0 亏损: -140.46656848306418 最大盈利: -140.47 最大亏损: -140.47 总收益: -140.47 平均盈利: -140.47 typeA: 0.00 胜率: 0.00%
趋势多且增强-L1-2-5 总交易次数: 1 盈利: 0 亏损: -110.44237846213537 最大盈利: -110.44 最大亏损: -110.44 总收益: -110.44 平均盈利: -110.44 typeA: 0.00 胜率: 0.00%
趋势空且增强-2 总交易次数: 1 盈利: 0 亏损: -36.874476987448006 最大盈利: -36.87 最大亏损: -36.87 总收益: -36.87 平均盈利: -36.87 typeA: 0.00 胜率: 0.00%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     102
      胜率:          56.86%
      总收益:        481.77 USDT
      期末余额:      10275.77 USDT
      盈亏比:        1.09
      最大单笔盈利:  568.78
      最大单笔亏损:  -897.70
      手续费:       409.8438148338377
      =============================
    
profit: 275.7699224710159
maxDrawdown 10.4%
startTime: 2023-12-17 00:00:00
趋势空且增强-L3-1-6 总交易次数: 2 盈利: 484.837395189385 亏损: 0 最大盈利: 388.67 最大亏损: 96.16 总收益: 484.84 平均盈利: 242.42 typeA: 242.42 胜率: 100.00%
趋势多且增强-R-2-1 总交易次数: 1 盈利: 76.2537232307858 亏损: 0 最大盈利: 76.25 最大亏损: 76.25 总收益: 76.25 平均盈利: 76.25 typeA: 76.25 胜率: 100.00%
趋势多且增强-L1-3-1 总交易次数: 1 盈利: 118.09284709447027 亏损: 0 最大盈利: 118.09 最大亏损: 118.09 总收益: 118.09 平均盈利: 118.09 typeA: 118.09 胜率: 100.00%
趋势空且增强-L-4-2-4 总交易次数: 1 盈利: 182.0597808743746 亏损: 0 最大盈利: 182.06 最大亏损: 182.06 总收益: 182.06 平均盈利: 182.06 typeA: 182.06 胜率: 100.00%
趋势多且增强-R-2-2 总交易次数: 1 盈利: 228.32596319343378 亏损: 0 最大盈利: 228.33 最大亏损: 228.33 总收益: 228.33 平均盈利: 228.33 typeA: 228.33 胜率: 100.00%
趋势空且增强-L2-2-3 总交易次数: 1 盈利: 74.82027649769451 亏损: 0 最大盈利: 74.82 最大亏损: 74.82 总收益: 74.82 平均盈利: 74.82 typeA: 74.82 胜率: 100.00%
趋势多且增强-L3-1-4-1 总交易次数: 1 盈利: 39.72682433286923 亏损: 0 最大盈利: 39.73 最大亏损: 39.73 总收益: 39.73 平均盈利: 39.73 typeA: 39.73 胜率: 100.00%
趋势多且增强-L3-1-5 总交易次数: 6 盈利: 442.6397790255561 亏损: -5.297130922282319 最大盈利: 229.34 最大亏损: -5.30 总收益: 437.34 平均盈利: 72.89 typeA: 60.74 胜率: 83.33%
趋势多且增强-L3-1-4-3 总交易次数: 13 盈利: 272.5689022294089 亏损: -368.91709771315044 最大盈利: 54.75 最大亏损: -323.96 总收益: -96.35 平均盈利: -7.41 typeA: -5.70 胜率: 76.92%
趋势多且增强-R-1-1-2 总交易次数: 3 盈利: 471.0348306998088 亏损: -172.06335510908326 最大盈利: 279.89 最大亏损: -172.06 总收益: 298.97 平均盈利: 99.66 typeA: 66.44 胜率: 66.67%
趋势空且增强-L2-3-3 总交易次数: 9 盈利: 767.8194385989623 亏损: -93.17206036170072 最大盈利: 233.42 最大亏损: -50.15 总收益: 674.65 平均盈利: 74.96 typeA: 49.98 胜率: 66.67%
趋势空且增强-L-4-2-3 总交易次数: 3 盈利: 588.5342418223494 亏损: -80.50530335171729 最大盈利: 568.78 最大亏损: -80.51 总收益: 508.03 平均盈利: 169.34 typeA: 112.90 胜率: 66.67%
趋势空且增强-L-4-3-4 总交易次数: 13 盈利: 951.6442640606692 亏损: -467.1180737265759 最大盈利: 285.96 最大亏损: -217.44 总收益: 484.53 平均盈利: 37.27 typeA: 20.07 胜率: 53.85%
趋势空且增强-11 总交易次数: 2 盈利: 327.07662629943235 亏损: -897.701492537314 最大盈利: 327.08 最大亏损: -897.70 总收益: -570.62 平均盈利: -285.31 typeA: -142.66 胜率: 50.00%
趋势多且增强-L-4-2-2 总交易次数: 2 盈利: 137.55565895079593 亏损: -13.89079900529776 最大盈利: 137.56 最大亏损: -13.89 总收益: 123.66 平均盈利: 61.83 typeA: 30.92 胜率: 50.00%
趋势多且增强-L1-3-2 总交易次数: 2 盈利: 24.908170954892906 亏损: -157.5963645418328 最大盈利: 24.91 最大亏损: -157.60 总收益: -132.69 平均盈利: -66.34 typeA: -33.17 胜率: 50.00%
趋势空且增强-L2-3-4 总交易次数: 15 盈利: 235.4475228284362 亏损: -683.3838361186436 最大盈利: 116.30 最大亏损: -163.64 总收益: -447.94 平均盈利: -29.86 typeA: -13.94 胜率: 46.67%
趋势多且增强-R-3-1 总交易次数: 7 盈利: 329.05669608071014 亏损: -1201.575514800339 最大盈利: 240.02 最大亏损: -837.68 总收益: -872.52 平均盈利: -124.65 typeA: -53.42 胜率: 42.86%
趋势多且增强-11 总交易次数: 6 盈利: 205.63912096333624 亏损: -323.8281494910452 最大盈利: 142.18 最大亏损: -215.01 总收益: -118.19 平均盈利: -19.70 typeA: -6.57 胜率: 33.33%
趋势多且增强-L1-3-4 总交易次数: 7 盈利: 28.97612105242299 亏损: -279.256741769461 最大盈利: 15.90 最大亏损: -90.25 总收益: -250.28 平均盈利: -35.75 typeA: -10.22 胜率: 28.57%
趋势空且增强-L2-3-5 总交易次数: 6 盈利: 15.366736946544382 亏损: -776.3090790068785 最大盈利: 15.37 最大亏损: -249.17 总收益: -760.94 平均盈利: -126.82 typeA: -21.14 胜率: 16.67%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     59
      胜率:          40.68%
      总收益:        515.75 USDT
      期末余额:      10397.75 USDT
      盈亏比:        1.20
      最大单笔盈利:  959.93
      最大单笔亏损:  -253.43
      手续费:       235.99882389272145
      =============================
    
profit: 397.7472349687123
maxDrawdown 10.3%
startTime: 2024-01-16 00:00:00
趋势空且增强-L-4-2-4 总交易次数: 1 盈利: 959.9284980011417 亏损: 0 最大盈利: 959.93 最大亏损: 959.93 总收益: 959.93 平均盈利: 959.93 typeA: 959.93 胜率: 100.00%
趋势空且增强-L2-3-3 总交易次数: 1 盈利: 102.43653289722117 亏损: 0 最大盈利: 102.44 最大亏损: 102.44 总收益: 102.44 平均盈利: 102.44 typeA: 102.44 胜率: 100.00%
趋势多且增强-L3-1-5 总交易次数: 3 盈利: 438.54674870189586 亏损: 0 最大盈利: 400.73 最大亏损: 18.21 总收益: 438.55 平均盈利: 146.18 typeA: 146.18 胜率: 100.00%
趋势空且增强-L3-1-6 总交易次数: 6 盈利: 773.4589728692958 亏损: -293.78097843861303 最大盈利: 266.23 最大亏损: -252.33 总收益: 479.68 平均盈利: 79.95 typeA: 53.30 胜率: 66.67%
趋势多且增强-L3-1-3 总交易次数: 5 盈利: 117.3738760704276 亏损: -43.62863090352166 最大盈利: 86.25 最大亏损: -34.26 总收益: 73.75 平均盈利: 14.75 typeA: 8.85 胜率: 60.00%
趋势多且增强-L3-1-4-1 总交易次数: 2 盈利: 149.72981714143535 亏损: -119.20445925755742 最大盈利: 149.73 最大亏损: -119.20 总收益: 30.53 平均盈利: 15.26 typeA: 7.63 胜率: 50.00%
趋势多且增强-L3-1-4-3 总交易次数: 9 盈利: 228.85351600220253 亏损: -109.74534989791852 最大盈利: 203.48 最大亏损: -30.96 总收益: 119.11 平均盈利: 13.23 typeA: 5.88 胜率: 44.44%
趋势空且增强-L2-3-5 总交易次数: 7 盈利: 243.09972830062958 亏损: -248.89140814495727 最大盈利: 228.33 最大亏损: -105.44 总收益: -5.79 平均盈利: -0.83 typeA: -0.35 胜率: 42.86%
趋势空且增强-L2-3-4 总交易次数: 3 盈利: 17.185421994886347 亏损: -208.56813592650843 最大盈利: 17.19 最大亏损: -201.43 总收益: -191.38 平均盈利: -63.79 typeA: -21.26 胜率: 33.33%
趋势多且增强-R-3-1 总交易次数: 5 盈利: 1.869195046438128 亏损: -349.5668180278339 最大盈利: 1.87 最大亏损: -253.43 总收益: -347.70 平均盈利: -69.54 typeA: -13.91 胜率: 20.00%
趋势空且增强-L-4-3-4 总交易次数: 16 盈利: 7.389909420241441 亏损: -1100.3812806867215 最大盈利: 5.60 最大亏损: -210.90 总收益: -1092.99 平均盈利: -68.31 typeA: -8.54 胜率: 12.50%
趋势多且增强-L1-3-4 总交易次数: 1 盈利: 0 亏损: -50.35792019347008 最大盈利: -50.36 最大亏损: -50.36 总收益: -50.36 平均盈利: -50.36 typeA: 0.00 胜率: 0.00%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     93
      胜率:          48.39%
      总收益:        3888.72 USDT
      期末余额:      13700.72 USDT
      盈亏比:        1.39
      最大单笔盈利:  2533.05
      最大单笔亏损:  -997.84
      手续费:       374.46599603852064
      =============================
    
profit: 3700.718400751659
maxDrawdown 25.6%
startTime: 2024-02-15 00:00:00
趋势空且增强-L2-3-5 总交易次数: 2 盈利: 244.2719048171752 亏损: 0 最大盈利: 228.33 最大亏损: 15.94 总收益: 244.27 平均盈利: 122.14 typeA: 122.14 胜率: 100.00%
趋势空且增强-11 总交易次数: 1 盈利: 73.88950800236964 亏损: 0 最大盈利: 73.89 最大亏损: 73.89 总收益: 73.89 平均盈利: 73.89 typeA: 73.89 胜率: 100.00%
趋势多且增强-R-3-1 总交易次数: 2 盈利: 107.96723280232678 亏损: 0 最大盈利: 103.96 最大亏损: 4.00 总收益: 107.97 平均盈利: 53.98 typeA: 53.98 胜率: 100.00%
趋势多且增强-R-2-1 总交易次数: 1 盈利: 169.65994992249873 亏损: 0 最大盈利: 169.66 最大亏损: 169.66 总收益: 169.66 平均盈利: 169.66 typeA: 169.66 胜率: 100.00%
趋势多且增强-L1-3-2 总交易次数: 1 盈利: 782.6190636577984 亏损: 0 最大盈利: 782.62 最大亏损: 782.62 总收益: 782.62 平均盈利: 782.62 typeA: 782.62 胜率: 100.00%
趋势空且增强-L1-1-2 总交易次数: 1 盈利: 182.87507270729665 亏损: 0 最大盈利: 182.88 最大亏损: 182.88 总收益: 182.88 平均盈利: 182.88 typeA: 182.88 胜率: 100.00%
趋势空且增强-L3-1-6 总交易次数: 2 盈利: 3983.9619990066008 亏损: 0 最大盈利: 2533.05 最大亏损: 1450.91 总收益: 3983.96 平均盈利: 1991.98 typeA: 1991.98 胜率: 100.00%
趋势多且增强-R-1-2-2 总交易次数: 1 盈利: 133.77988868274568 亏损: 0 最大盈利: 133.78 最大亏损: 133.78 总收益: 133.78 平均盈利: 133.78 typeA: 133.78 胜率: 100.00%
趋势空且增强-L2-2-3 总交易次数: 1 盈利: 562.1186420053541 亏损: 0 最大盈利: 562.12 最大亏损: 562.12 总收益: 562.12 平均盈利: 562.12 typeA: 562.12 胜率: 100.00%
趋势多且增强-L3-1-3 总交易次数: 4 盈利: 514.0236868968142 亏损: -155.3061508973691 最大盈利: 429.86 最大亏损: -155.31 总收益: 358.72 平均盈利: 89.68 typeA: 67.26 胜率: 75.00%
趋势多且增强-L3-1-4-3 总交易次数: 4 盈利: 184.51247672017098 亏损: -29.545999041685928 最大盈利: 138.64 最大亏损: -29.55 总收益: 154.97 平均盈利: 38.74 typeA: 29.06 胜率: 75.00%
趋势多且增强-11 总交易次数: 9 盈利: 1704.437273282099 亏损: -352.62278212308314 最大盈利: 489.36 最大亏损: -229.51 总收益: 1351.81 平均盈利: 150.20 typeA: 100.14 胜率: 66.67%
趋势多且增强-L3-1-4-1 总交易次数: 9 盈利: 1333.7021773016775 亏损: -816.4753469105573 最大盈利: 603.27 最大亏损: -439.62 总收益: 517.23 平均盈利: 57.47 typeA: 38.32 胜率: 66.67%
趋势空且增强-L2-3-4 总交易次数: 11 盈利: 1351.5155148591746 亏损: -984.768194929698 最大盈利: 463.16 最大亏损: -428.73 总收益: 366.75 平均盈利: 33.34 typeA: 18.19 胜率: 54.55%
趋势多且增强-L3-1-5 总交易次数: 2 盈利: 71.81919683054258 亏损: -32.381954184198335 最大盈利: 71.82 最大亏损: -32.38 总收益: 39.44 平均盈利: 19.72 typeA: 9.86 胜率: 50.00%
趋势多且增强-L1-1-6 总交易次数: 2 盈利: 361.6097066463914 亏损: -225.3210812033482 最大盈利: 361.61 最大亏损: -225.32 总收益: 136.29 平均盈利: 68.14 typeA: 34.07 胜率: 50.00%
趋势空且增强-L-4-2-3 总交易次数: 3 盈利: 53.164426059978666 亏损: -386.9595803515416 最大盈利: 53.16 最大亏损: -301.40 总收益: -333.80 平均盈利: -111.27 typeA: -37.08 胜率: 33.33%
趋势空且增强-L2-3-3 总交易次数: 7 盈利: 627.658528503478 亏损: -976.7221235091451 最大盈利: 443.73 最大亏损: -412.65 总收益: -349.06 平均盈利: -49.87 typeA: -14.25 胜率: 28.57%
趋势多且增强-L1-3-4 总交易次数: 4 盈利: 47.96675964667594 亏损: -139.85325722690123 最大盈利: 47.97 最大亏损: -95.74 总收益: -91.89 平均盈利: -22.97 typeA: -5.74 胜率: 25.00%
趋势空且增强-L-4-1-4 总交易次数: 8 盈利: 713.8597782752267 亏损: -2093.485933524791 最大盈利: 377.74 最大亏损: -997.84 总收益: -1379.63 平均盈利: -172.45 typeA: -43.11 胜率: 25.00%
趋势多且增强-R-1-1-2 总交易次数: 4 盈利: 548.6220033691853 亏损: -406.4286434681884 最大盈利: 548.62 最大亏损: -275.00 总收益: 142.19 平均盈利: 35.55 typeA: 8.89 胜率: 25.00%
趋势空且增强-L-4-3-4 总交易次数: 5 盈利: 0 亏损: -791.5796020489257 最大盈利: -9.69 最大亏损: -299.79 总收益: -791.58 平均盈利: -158.32 typeA: 0.00 胜率: 0.00%
趋势多且增强-L1-3-1 总交易次数: 1 盈利: 0 亏损: -482.6199580064103 最大盈利: -482.62 最大亏损: -482.62 总收益: -482.62 平均盈利: -482.62 typeA: 0.00 胜率: 0.00%
趋势空且增强-L-4-4-4 总交易次数: 1 盈利: 0 亏损: -35.01768450836932 最大盈利: -35.02 最大亏损: -35.02 总收益: -35.02 平均盈利: -35.02 typeA: 0.00 胜率: 0.00%
趋势多且增强-L1-2-5 总交易次数: 2 盈利: 0 亏损: -210.2224644594503 最大盈利: -82.82 最大亏损: -127.40 总收益: -210.22 平均盈利: -105.11 typeA: 0.00 胜率: 0.00%
趋势空且增强-2 总交易次数: 4 盈利: 0 亏损: -1533.8019377001392 最大盈利: -33.79 最大亏损: -643.03 总收益: -1533.80 平均盈利: -383.45 typeA: 0.00 胜率: 0.00%
趋势空且增强-L-4-2-4 总交易次数: 1 盈利: 0 亏损: -212.20369515011572 最大盈利: -212.20 最大亏损: -212.20 总收益: -212.20 平均盈利: -212.20 typeA: 0.00 胜率: 0.00%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     113
      胜率:          46.02%
      总收益:        -565.20 USDT
      期末余额:      9206.80 USDT
      盈亏比:        0.95
      最大单笔盈利:  717.97
      最大单笔亏损:  -865.30
      手续费:       453.81981055800463
      =============================
    
profit: -793.2000978861743
maxDrawdown 31.6%
startTime: 2024-03-16 00:00:00
趋势空且增强-L2-3-4 总交易次数: 2 盈利: 452.5447196352574 亏损: 0 最大盈利: 390.06 最大亏损: 62.49 总收益: 452.54 平均盈利: 226.27 typeA: 226.27 胜率: 100.00%
趋势空且增强-L2-2-3 总交易次数: 2 盈利: 331.21703696883856 亏损: 0 最大盈利: 179.23 最大亏损: 151.99 总收益: 331.22 平均盈利: 165.61 typeA: 165.61 胜率: 100.00%
趋势多且增强-L1-2-2 总交易次数: 1 盈利: 37.65109176277439 亏损: 0 最大盈利: 37.65 最大亏损: 37.65 总收益: 37.65 平均盈利: 37.65 typeA: 37.65 胜率: 100.00%
趋势多且增强-R-1-1-1 总交易次数: 3 盈利: 380.6255500725343 亏损: 0 最大盈利: 279.12 最大亏损: 4.96 总收益: 380.63 平均盈利: 126.88 typeA: 126.88 胜率: 100.00%
趋势空且增强-L2-1-3 总交易次数: 1 盈利: 37.755889481338585 亏损: 0 最大盈利: 37.76 最大亏损: 37.76 总收益: 37.76 平均盈利: 37.76 typeA: 37.76 胜率: 100.00%
趋势多且增强-L3-1-4-1 总交易次数: 8 盈利: 899.2363425053403 亏损: -64.2867711476688 最大盈利: 639.21 最大亏损: -64.29 总收益: 834.95 平均盈利: 104.37 typeA: 91.32 胜率: 87.50%
趋势多且增强-L1-1-6 总交易次数: 3 盈利: 527.9179292561093 亏损: -110.87864724532386 最大盈利: 458.04 最大亏损: -110.88 总收益: 417.04 平均盈利: 139.01 typeA: 92.68 胜率: 66.67%
趋势空且增强-L2-3-3 总交易次数: 6 盈利: 799.9782717954323 亏损: -229.1241430557953 最大盈利: 530.58 最大亏损: -135.05 总收益: 570.85 平均盈利: 95.14 typeA: 63.43 胜率: 66.67%
趋势空且增强-11 总交易次数: 5 盈利: 674.2928839304774 亏损: -196.46883494448144 最大盈利: 253.32 最大亏损: -182.68 总收益: 477.82 平均盈利: 95.56 typeA: 57.34 胜率: 60.00%
趋势空且增强-2 总交易次数: 10 盈利: 730.5234632009058 亏损: -1084.274029430891 最大盈利: 475.16 最大亏损: -400.57 总收益: -353.75 平均盈利: -35.38 typeA: -17.69 胜率: 50.00%
趋势多且增强-R-1-1-2 总交易次数: 10 盈利: 550.5315699957883 亏损: -1769.6074920252545 最大盈利: 230.69 最大亏损: -865.30 总收益: -1219.08 平均盈利: -121.91 typeA: -60.95 胜率: 50.00%
趋势空且增强-L2-3-5 总交易次数: 2 盈利: 717.9680592524018 亏损: -337.00251773861334 最大盈利: 717.97 最大亏损: -337.00 总收益: 380.97 平均盈利: 190.48 typeA: 95.24 胜率: 50.00%
趋势空且增强-L1-1-2 总交易次数: 2 盈利: 151.95377769705794 亏损: -21.214380460138305 最大盈利: 151.95 最大亏损: -21.21 总收益: 130.74 平均盈利: 65.37 typeA: 32.68 胜率: 50.00%
趋势多且增强-L1-3-9 总交易次数: 2 盈利: 578.4952543038565 亏损: -418.0905473706848 最大盈利: 578.50 最大亏损: -418.09 总收益: 160.40 平均盈利: 80.20 typeA: 40.10 胜率: 50.00%
趋势多且增强-L1-2-5 总交易次数: 12 盈利: 1121.440837682758 亏损: -494.9243411257266 最大盈利: 441.53 最大亏损: -136.61 总收益: 626.52 平均盈利: 52.21 typeA: 21.76 胜率: 41.67%
趋势多且增强-L3-1-5 总交易次数: 5 盈利: 69.57640019434163 亏损: -176.62619304081352 最大盈利: 43.91 最大亏损: -157.27 总收益: -107.05 平均盈利: -21.41 typeA: -8.56 胜率: 40.00%
趋势多且增强-11 总交易次数: 8 盈利: 1022.5011416344921 亏损: -955.1650443896693 最大盈利: 661.69 最大亏损: -336.23 总收益: 67.34 平均盈利: 8.42 typeA: 3.16 胜率: 37.50%
趋势空且增强-L-4-2-4 总交易次数: 6 盈利: 660.1962065366074 亏损: -1207.619926888377 最大盈利: 640.76 最大亏损: -521.53 总收益: -547.42 平均盈利: -91.24 typeA: -30.41 胜率: 33.33%
趋势空且增强-L-4-1-4 总交易次数: 11 盈利: 251.0551273572105 亏损: -1439.1153710098815 最大盈利: 156.31 最大亏损: -709.57 总收益: -1188.06 平均盈利: -108.01 typeA: -19.64 胜率: 18.18%
趋势多且增强-R-1-2-2 总交易次数: 3 盈利: 0 亏损: -252.28200264419405 最大盈利: -77.29 最大亏损: -88.52 总收益: -252.28 平均盈利: -84.09 typeA: 0.00 胜率: 0.00%
趋势多且增强-L3-1-3 总交易次数: 5 盈利: 0 亏损: -1438.2583174160704 最大盈利: -8.56 最大亏损: -695.46 总收益: -1438.26 平均盈利: -287.65 typeA: 0.00 胜率: 0.00%
趋势多且增强-L3-1-4-3 总交易次数: 1 盈利: 0 亏损: -136.86032065313873 最大盈利: -136.86 最大亏损: -136.86 总收益: -136.86 平均盈利: -136.86 typeA: 0.00 胜率: 0.00%
趋势空且增强-L-4-3-4 总交易次数: 1 盈利: 0 亏损: -62.83589179169295 最大盈利: -62.84 最大亏损: -62.84 总收益: -62.84 平均盈利: -62.84 typeA: 0.00 胜率: 0.00%
趋势多且增强-L1-3-4 总交易次数: 3 盈利: 0 亏损: -119.03615625230147 最大盈利: -14.91 最大亏损: -64.17 总收益: -119.04 平均盈利: -39.68 typeA: 0.00 胜率: 0.00%
趋势空且增强-L-4-2-3 总交易次数: 1 盈利: 0 亏损: -46.9907225189764 最大盈利: -46.99 最大亏损: -46.99 总收益: -46.99 平均盈利: -46.99 typeA: 0.00 胜率: 0.00%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     102
      胜率:          47.06%
      总收益:        1802.60 USDT
      期末余额:      11598.60 USDT
      盈亏比:        1.34
      最大单笔盈利:  778.29
      最大单笔亏损:  -443.63
      手续费:       407.5910729511439
      =============================
    
profit: 1598.596009060322
maxDrawdown 11.5%
startTime: 2024-04-15 00:00:00
趋势多且增强-11 总交易次数: 4 盈利: 325.77404395082755 亏损: 0 最大盈利: 152.12 最大亏损: 17.65 总收益: 325.77 平均盈利: 81.44 typeA: 81.44 胜率: 100.00%
趋势空且增强-L2-3-3 总交易次数: 4 盈利: 533.2400046842006 亏损: 0 最大盈利: 239.92 最大亏损: 29.58 总收益: 533.24 平均盈利: 133.31 typeA: 133.31 胜率: 100.00%
趋势空且增强-L2-3-5 总交易次数: 4 盈利: 228.80524355731188 亏损: 0 最大盈利: 130.69 最大亏损: 23.09 总收益: 228.81 平均盈利: 57.20 typeA: 57.20 胜率: 100.00%
趋势多且增强-L1-2-1 总交易次数: 1 盈利: 766.7169887009416 亏损: 0 最大盈利: 766.72 最大亏损: 766.72 总收益: 766.72 平均盈利: 766.72 typeA: 766.72 胜率: 100.00%
趋势空且增强-11 总交易次数: 7 盈利: 963.3877900962558 亏损: -290.0576000000003 最大盈利: 361.82 最大亏损: -290.06 总收益: 673.33 平均盈利: 96.19 typeA: 82.44 胜率: 85.71%
趋势多且增强-L3-1-4-1 总交易次数: 6 盈利: 303.22701765334284 亏损: -70.02780762030875 最大盈利: 216.08 最大亏损: -38.47 总收益: 233.20 平均盈利: 38.87 typeA: 25.91 胜率: 66.67%
趋势多且增强-L3-1-5 总交易次数: 5 盈利: 135.57784197142905 亏损: -445.9479743482118 最大盈利: 50.80 最大亏损: -390.73 总收益: -310.37 平均盈利: -62.07 typeA: -37.24 胜率: 60.00%
趋势空且增强-L2-3-4 总交易次数: 5 盈利: 790.2332605569594 亏损: -334.1747762184518 最大盈利: 506.21 最大亏损: -233.08 总收益: 456.06 平均盈利: 91.21 typeA: 54.73 胜率: 60.00%
趋势多且增强-R-1-1-2 总交易次数: 10 盈利: 987.4357831148507 亏损: -525.1746585410045 最大盈利: 778.29 最大亏损: -204.38 总收益: 462.26 平均盈利: 46.23 typeA: 23.11 胜率: 50.00%
趋势空且增强-L-4-2-4 总交易次数: 10 盈利: 1219.3374874397057 亏损: -676.5537950723822 最大盈利: 640.76 最大亏损: -266.57 总收益: 542.78 平均盈利: 54.28 typeA: 21.71 胜率: 40.00%
趋势空且增强-L-4-1-4 总交易次数: 6 盈利: 319.850335722179 亏损: -343.25805926724365 最大盈利: 250.27 最大亏损: -137.52 总收益: -23.41 平均盈利: -3.90 typeA: -1.30 胜率: 33.33%
趋势空且增强-L3-1-6 总交易次数: 3 盈利: 399.05625535843666 亏损: -125.75472032462751 最大盈利: 399.06 最大亏损: -93.96 总收益: 273.30 平均盈利: 91.10 typeA: 30.36 胜率: 33.33%
趋势多且增强-R-1-2-2 总交易次数: 3 盈利: 20.616711437861373 亏损: -260.64003953715616 最大盈利: 20.62 最大亏损: -248.06 总收益: -240.02 平均盈利: -80.01 typeA: -26.67 胜率: 33.33%
趋势多且增强-L3-1-4-3 总交易次数: 7 盈利: 43.00073845590789 亏损: -522.240819106059 最大盈利: 25.68 最大亏损: -443.63 总收益: -479.24 平均盈利: -68.46 typeA: -19.56 胜率: 28.57%
趋势多且增强-L1-2-5 总交易次数: 4 盈利: 0.3260178363708599 亏损: -254.30499177166863 最大盈利: 0.33 最大亏损: -216.74 总收益: -253.98 平均盈利: -63.49 typeA: -15.87 胜率: 25.00%
趋势空且增强-L-4-3-4 总交易次数: 8 盈利: 54.418599105387756 亏损: -467.88135916984083 最大盈利: 45.96 最大亏损: -195.18 总收益: -413.46 平均盈利: -51.68 typeA: -12.92 胜率: 25.00%
趋势多且增强-L1-3-4 总交易次数: 5 盈利: 20.628944215151577 亏损: -209.93599613575347 最大盈利: 20.63 最大亏损: -86.43 总收益: -189.31 平均盈利: -37.86 typeA: -7.57 胜率: 20.00%
趋势空且增强-2 总交易次数: 3 盈利: 0 亏损: -291.80864312070116 最大盈利: -27.00 最大亏损: -207.23 总收益: -291.81 平均盈利: -97.27 typeA: 0.00 胜率: 0.00%
趋势多且增强-L1-3-1 总交易次数: 1 盈利: 0 亏损: -40.1979295045606 最大盈利: -40.20 最大亏损: -40.20 总收益: -40.20 平均盈利: -40.20 typeA: 0.00 胜率: 0.00%
趋势多且增强-L1-3-2 总交易次数: 1 盈利: 0 亏损: -60.70189484921401 最大盈利: -60.70 最大亏损: -60.70 总收益: -60.70 平均盈利: -60.70 typeA: 0.00 胜率: 0.00%
趋势多且增强-R-2-1 总交易次数: 2 盈利: 0 亏损: -122.8554520302221 最大盈利: -26.35 最大亏损: -96.51 总收益: -122.86 平均盈利: -61.43 typeA: 0.00 胜率: 0.00%
趋势多且增强-R-2-2 总交易次数: 1 盈利: 0 亏损: -162.39204076012112 最大盈利: -162.39 最大亏损: -162.39 总收益: -162.39 平均盈利: -162.39 typeA: 0.00 胜率: 0.00%
趋势空且增强-L2-1-3 总交易次数: 1 盈利: 0 亏损: -55.0237779683491 最大盈利: -55.02 最大亏损: -55.02 总收益: -55.02 平均盈利: -55.02 typeA: 0.00 胜率: 0.00%
趋势多且增强-R-3-1 总交易次数: 1 盈利: 0 亏损: -50.104719450931434 最大盈利: -50.10 最大亏损: -50.10 总收益: -50.10 平均盈利: -50.10 typeA: 0.00 胜率: 0.00%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     106
      胜率:          51.89%
      总收益:        43.42 USDT
      期末余额:      9831.42 USDT
      盈亏比:        1.01
      最大单笔盈利:  467.95
      最大单笔亏损:  -627.56
      手续费:       424.2084629026449
      =============================
    
profit: -168.57572021073975
maxDrawdown 15.8%
startTime: 2024-05-15 00:00:00
趋势多且增强-L3-1-3 总交易次数: 2 盈利: 25.736162423632848 亏损: 0 最大盈利: 13.41 最大亏损: 12.33 总收益: 25.74 平均盈利: 12.87 typeA: 12.87 胜率: 100.00%
趋势多且增强-L1-2-1 总交易次数: 1 盈利: 40.90461010299204 亏损: 0 最大盈利: 40.90 最大亏损: 40.90 总收益: 40.90 平均盈利: 40.90 typeA: 40.90 胜率: 100.00%
趋势空且增强-2 总交易次数: 1 盈利: 463.79668780831537 亏损: 0 最大盈利: 463.80 最大亏损: 463.80 总收益: 463.80 平均盈利: 463.80 typeA: 463.80 胜率: 100.00%
趋势多且增强-R-1-1-1 总交易次数: 1 盈利: 38.04539385847891 亏损: 0 最大盈利: 38.05 最大亏损: 38.05 总收益: 38.05 平均盈利: 38.05 typeA: 38.05 胜率: 100.00%
趋势空且增强-L2-3-5 总交易次数: 6 盈利: 455.5060204236146 亏损: -627.5554999060914 最大盈利: 224.81 最大亏损: -627.56 总收益: -172.05 平均盈利: -28.67 typeA: -23.89 胜率: 83.33%
趋势多且增强-R-1-1-2 总交易次数: 4 盈利: 274.1629863864641 亏损: -572.4718553660738 最大盈利: 167.91 最大亏损: -572.47 总收益: -298.31 平均盈利: -74.58 typeA: -55.93 胜率: 75.00%
趋势空且增强-L-4-2-3 总交易次数: 4 盈利: 245.5631112681366 亏损: -45.86211358734719 最大盈利: 198.06 最大亏损: -45.86 总收益: 199.70 平均盈利: 49.93 typeA: 37.44 胜率: 75.00%
趋势空且增强-L2-3-3 总交易次数: 7 盈利: 743.1452015228687 亏损: -302.7186440121893 最大盈利: 467.95 最大亏损: -188.50 总收益: 440.43 平均盈利: 62.92 typeA: 44.94 胜率: 71.43%
趋势空且增强-L-4-3-4 总交易次数: 10 盈利: 1242.1563272476226 亏损: -414.82637285590874 最大盈利: 342.26 最大亏损: -254.74 总收益: 827.33 平均盈利: 82.73 typeA: 57.91 胜率: 70.00%
趋势多且增强-11 总交易次数: 10 盈利: 278.13011048221483 亏损: -282.05036575144885 最大盈利: 93.00 最大亏损: -124.89 总收益: -3.92 平均盈利: -0.39 typeA: -0.24 胜率: 60.00%
趋势多且增强-R-2-1 总交易次数: 5 盈利: 497.6515882022246 亏损: -59.38661324733617 最大盈利: 226.27 最大亏损: -36.75 总收益: 438.26 平均盈利: 87.65 typeA: 52.59 胜率: 60.00%
趋势多且增强-L3-1-4-3 总交易次数: 13 盈利: 583.4832428353293 亏损: -368.64135781759126 最大盈利: 443.08 最大亏损: -186.22 总收益: 214.84 平均盈利: 16.53 typeA: 8.90 胜率: 53.85%
趋势多且增强-L3-1-5 总交易次数: 4 盈利: 260.1216016157327 亏损: -133.56674352242416 最大盈利: 236.05 最大亏损: -109.14 总收益: 126.55 平均盈利: 31.64 typeA: 15.82 胜率: 50.00%
趋势空且增强-L2-1-3 总交易次数: 2 盈利: 58.596578759801666 亏损: -4.455683771175085 最大盈利: 58.60 最大亏损: -4.46 总收益: 54.14 平均盈利: 27.07 typeA: 13.54 胜率: 50.00%
趋势多且增强-L1-3-9 总交易次数: 2 盈利: 118.75025793530325 亏损: -46.21250149396383 最大盈利: 118.75 最大亏损: -46.21 总收益: 72.54 平均盈利: 36.27 typeA: 18.13 胜率: 50.00%
趋势多且增强-L1-2-5 总交易次数: 2 盈利: 20.141240157480265 亏损: -29.19048721212812 最大盈利: 20.14 最大亏损: -29.19 总收益: -9.05 平均盈利: -4.52 typeA: -2.26 胜率: 50.00%
趋势多且增强-L1-3-4 总交易次数: 6 盈利: 328.29109949922895 亏损: -245.99730330667734 最大盈利: 165.69 最大亏损: -107.91 总收益: 82.29 平均盈利: 13.72 typeA: 4.57 胜率: 33.33%
趋势空且增强-11 总交易次数: 3 盈利: 240.59274842222536 亏损: -715.4922357250817 最大盈利: 240.59 最大亏损: -532.71 总收益: -474.90 平均盈利: -158.30 typeA: -52.76 胜率: 33.33%
趋势多且增强-L3-1-4-1 总交易次数: 3 盈利: 21.221971123666616 亏损: -114.6949835420686 最大盈利: 21.22 最大亏损: -64.50 总收益: -93.47 平均盈利: -31.16 typeA: -10.38 胜率: 33.33%
趋势空且增强-L-4-2-4 总交易次数: 5 盈利: 157.14227792112106 亏损: -381.13917813996886 最大盈利: 157.14 最大亏损: -154.64 总收益: -224.00 平均盈利: -44.80 typeA: -8.96 胜率: 20.00%
趋势空且增强-L2-3-4 总交易次数: 7 盈利: 14.349302150132669 亏损: -762.1131321061835 最大盈利: 14.35 最大亏损: -201.24 总收益: -747.76 平均盈利: -106.82 typeA: -15.27 胜率: 14.29%
趋势空且增强-L3-1-6 总交易次数: 3 盈利: 0 亏损: -596.8436432562388 最大盈利: -41.97 最大亏损: -386.36 总收益: -596.84 平均盈利: -198.95 typeA: 0.00 胜率: 0.00%
趋势空且增强-L-4-1-4 总交易次数: 2 盈利: 0 亏损: -263.26130560697834 最大盈利: -24.05 最大亏损: -239.21 总收益: -263.26 平均盈利: -131.63 typeA: 0.00 胜率: 0.00%
趋势多且增强-L-4-2-2 总交易次数: 1 盈利: 0 亏损: -13.736916898362418 最大盈利: -13.74 最大亏损: -13.74 总收益: -13.74 平均盈利: -13.74 typeA: 0.00 胜率: 0.00%
趋势多且增强-R-3-1 总交易次数: 1 盈利: 0 亏损: -9.531707985207436 最大盈利: -9.53 最大亏损: -9.53 总收益: -9.53 平均盈利: -9.53 typeA: 0.00 胜率: 0.00%
趋势多且增强-R-1-2-2 总交易次数: 1 盈利: 0 亏损: -74.31559524688232 最大盈利: -74.32 最大亏损: -74.32 总收益: -74.32 平均盈利: -74.32 typeA: 0.00 胜率: 0.00%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     88
      胜率:          51.14%
      总收益:        59.57 USDT
      期末余额:      9881.57 USDT
      盈亏比:        1.01
      最大单笔盈利:  518.15
      最大单笔亏损:  -912.30
      手续费:       353.8745021782517
      =============================
    
profit: -118.43327685244913
maxDrawdown 15.5%
startTime: 2024-06-14 00:00:00
趋势多且增强-R-1-1-1 总交易次数: 1 盈利: 38.04539385847891 亏损: 0 最大盈利: 38.05 最大亏损: 38.05 总收益: 38.05 平均盈利: 38.05 typeA: 38.05 胜率: 100.00%
趋势空且增强-11 总交易次数: 3 盈利: 522.1760228487443 亏损: 0 最大盈利: 374.46 最大亏损: 13.57 总收益: 522.18 平均盈利: 174.06 typeA: 174.06 胜率: 100.00%
趋势多且增强-R-3-1 总交易次数: 2 盈利: 125.84840180266018 亏损: 0 最大盈利: 113.99 最大亏损: 11.86 总收益: 125.85 平均盈利: 62.92 typeA: 62.92 胜率: 100.00%
趋势多且增强-L1-3-1 总交易次数: 1 盈利: 229.50688952303267 亏损: 0 最大盈利: 229.51 最大亏损: 229.51 总收益: 229.51 平均盈利: 229.51 typeA: 229.51 胜率: 100.00%
趋势多且增强-L1-3-2 总交易次数: 2 盈利: 241.23062591478327 亏损: 0 最大盈利: 132.75 最大亏损: 108.48 总收益: 241.23 平均盈利: 120.62 typeA: 120.62 胜率: 100.00%
趋势多且增强-R-2-2 总交易次数: 1 盈利: 33.37922318645124 亏损: 0 最大盈利: 33.38 最大亏损: 33.38 总收益: 33.38 平均盈利: 33.38 typeA: 33.38 胜率: 100.00%
趋势多且增强-R-1-2-2 总交易次数: 1 盈利: 297.8647987965399 亏损: 0 最大盈利: 297.86 最大亏损: 297.86 总收益: 297.86 平均盈利: 297.86 typeA: 297.86 胜率: 100.00%
趋势空且增强-L3-1-6 总交易次数: 1 盈利: 201.43050847457624 亏损: 0 最大盈利: 201.43 最大亏损: 201.43 总收益: 201.43 平均盈利: 201.43 typeA: 201.43 胜率: 100.00%
趋势多且增强-R-1-1-2 总交易次数: 9 盈利: 669.0753623492126 亏损: -500.44975650772585 最大盈利: 337.76 最大亏损: -441.88 总收益: 168.63 平均盈利: 18.74 typeA: 14.57 胜率: 77.78%
趋势空且增强-L-4-2-3 总交易次数: 6 盈利: 804.4617827095173 亏损: -211.5101162637721 最大盈利: 491.90 最大亏损: -204.96 总收益: 592.95 平均盈利: 98.83 typeA: 65.89 胜率: 66.67%
趋势空且增强-L2-3-4 总交易次数: 6 盈利: 639.7501701169823 亏损: -136.18932744453852 最大盈利: 518.15 最大亏损: -64.05 总收益: 503.56 平均盈利: 83.93 typeA: 41.96 胜率: 50.00%
趋势空且增强-L2-3-5 总交易次数: 4 盈利: 597.47215712174 亏损: -560.8650514330764 最大盈利: 351.91 最大亏损: -497.48 总收益: 36.61 平均盈利: 9.15 typeA: 4.58 胜率: 50.00%
趋势多且增强-R-2-1 总交易次数: 4 盈利: 322.1077062516905 亏损: -959.8859194146589 最大盈利: 212.65 最大亏损: -912.30 总收益: -637.78 平均盈利: -159.44 typeA: -79.72 胜率: 50.00%
趋势多且增强-L-4-2-2 总交易次数: 2 盈利: 58.47731646961853 亏损: -6.023663876368993 最大盈利: 58.48 最大亏损: -6.02 总收益: 52.45 平均盈利: 26.23 typeA: 13.11 胜率: 50.00%
趋势多且增强-L3-1-4-3 总交易次数: 8 盈利: 145.98769330177905 亏损: -458.46837944882213 最大盈利: 62.39 最大亏损: -352.68 总收益: -312.48 平均盈利: -39.06 typeA: -19.53 胜率: 50.00%
趋势多且增强-L3-1-4-1 总交易次数: 2 盈利: 160.39746609274653 亏损: -37.56741373176784 最大盈利: 160.40 最大亏损: -37.57 总收益: 122.83 平均盈利: 61.42 typeA: 30.71 胜率: 50.00%
趋势多且增强-11 总交易次数: 5 盈利: 45.35271665360463 亏损: -270.53807325502794 最大盈利: 24.04 最大亏损: -98.36 总收益: -225.19 平均盈利: -45.04 typeA: -18.01 胜率: 40.00%
趋势空且增强-L-4-3-4 总交易次数: 12 盈利: 623.7819525316777 亏损: -712.7686440333921 最大盈利: 350.39 最大亏损: -238.32 总收益: -88.99 平均盈利: -7.42 typeA: -2.47 胜率: 33.33%
趋势空且增强-L2-3-3 总交易次数: 7 盈利: 474.6378225574164 亏损: -1449.6118103603949 最大盈利: 436.49 最大亏损: -575.08 总收益: -974.97 平均盈利: -139.28 typeA: -39.79 胜率: 28.57%
趋势多且增强-L1-3-4 总交易次数: 7 盈利: 51.524460033228465 亏损: -122.99542459687359 最大盈利: 51.52 最大亏损: -32.71 总收益: -71.47 平均盈利: -10.21 typeA: -1.46 胜率: 14.29%
趋势多且增强-L3-1-5 总交易次数: 2 盈利: 0 亏损: -352.8541603219124 最大盈利: -92.99 最大亏损: -259.86 总收益: -352.85 平均盈利: -176.43 typeA: 0.00 胜率: 0.00%
趋势空且增强-L-4-2-4 总交易次数: 2 盈利: 0 亏损: -443.2140067585971 最大盈利: -219.91 最大亏损: -223.31 总收益: -443.21 平均盈利: -221.61 typeA: 0.00 胜率: 0.00%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     91
      胜率:          50.55%
      总收益:        838.99 USDT
      期末余额:      10656.99 USDT
      盈亏比:        1.11
      最大单笔盈利:  702.32
      最大单笔亏损:  -682.62
      手续费:       363.9231233455281
      =============================
    
profit: 656.9919530824573
maxDrawdown 21.2%
startTime: 2024-07-14 00:00:00
趋势多且增强-R-1-1-1 总交易次数: 1 盈利: 63.54208481709222 亏损: 0 最大盈利: 63.54 最大亏损: 63.54 总收益: 63.54 平均盈利: 63.54 typeA: 63.54 胜率: 100.00%
趋势空且增强-11 总交易次数: 2 盈利: 496.42889329955494 亏损: 0 最大盈利: 421.46 最大亏损: 74.97 总收益: 496.43 平均盈利: 248.21 typeA: 248.21 胜率: 100.00%
趋势多且增强-11 总交易次数: 6 盈利: 535.6953019787265 亏损: -6.734349843735995 最大盈利: 228.78 最大亏损: -6.73 总收益: 528.96 平均盈利: 88.16 typeA: 73.46 胜率: 83.33%
趋势多且增强-L3-1-3 总交易次数: 4 盈利: 415.95288121345175 亏损: -223.6266005121646 最大盈利: 191.39 最大亏损: -223.63 总收益: 192.33 平均盈利: 48.08 typeA: 36.06 胜率: 75.00%
趋势多且增强-L3-1-4-3 总交易次数: 4 盈利: 57.67725195268322 亏损: -298.51583876595447 最大盈利: 34.08 最大亏损: -298.52 总收益: -240.84 平均盈利: -60.21 typeA: -45.16 胜率: 75.00%
趋势空且增强-L-4-2-3 总交易次数: 7 盈利: 743.2539618236478 亏损: -210.1170264897913 最大盈利: 305.86 最大亏损: -196.06 总收益: 533.14 平均盈利: 76.16 typeA: 54.40 胜率: 71.43%
趋势多且增强-L3-1-4-1 总交易次数: 3 盈利: 377.19955714783384 亏损: -24.8806577386003 最大盈利: 231.72 最大亏损: -24.88 总收益: 352.32 平均盈利: 117.44 typeA: 78.30 胜率: 66.67%
趋势多且增强-L3-1-5 总交易次数: 3 盈利: 42.566983340054875 亏损: -192.2942598187314 最大盈利: 25.49 最大亏损: -192.29 总收益: -149.73 平均盈利: -49.91 typeA: -33.27 胜率: 66.67%
趋势空且增强-L2-3-5 总交易次数: 4 盈利: 523.7836580682961 亏损: -843.0321674479104 最大盈利: 299.46 最大亏损: -572.57 总收益: -319.25 平均盈利: -79.81 typeA: -39.91 胜率: 50.00%
趋势空且增强-2 总交易次数: 2 盈利: 83.32863501483716 亏损: -275.4649523661998 最大盈利: 83.33 最大亏损: -275.46 总收益: -192.14 平均盈利: -96.07 typeA: -48.03 胜率: 50.00%
趋势多且增强-R-1-2-2 总交易次数: 2 盈利: 250.91630231105506 亏损: -335.34631931166354 最大盈利: 250.92 最大亏损: -335.35 总收益: -84.43 平均盈利: -42.22 typeA: -21.11 胜率: 50.00%
趋势多且增强-L1-3-1 总交易次数: 2 盈利: 35.09259545524874 亏损: -32.31924278625225 最大盈利: 35.09 最大亏损: -32.32 总收益: 2.77 平均盈利: 1.39 typeA: 0.69 胜率: 50.00%
趋势多且增强-R-2-1 总交易次数: 2 盈利: 20.168514412416283 亏损: -119.42186026575311 最大盈利: 20.17 最大亏损: -119.42 总收益: -99.25 平均盈利: -49.63 typeA: -24.81 胜率: 50.00%
趋势空且增强-L2-3-4 总交易次数: 2 盈利: 214.0897424060575 亏损: -96.99598550866529 最大盈利: 214.09 最大亏损: -97.00 总收益: 117.09 平均盈利: 58.55 typeA: 29.27 胜率: 50.00%
趋势多且增强-R-1-1-2 总交易次数: 13 盈利: 960.9130604741792 亏损: -1020.5385626466131 最大盈利: 440.01 最大亏损: -682.62 总收益: -59.63 平均盈利: -4.59 typeA: -2.12 胜率: 46.15%
趋势空且增强-L2-3-3 总交易次数: 7 盈利: 1386.1061906731281 亏损: -1106.9576427519582 最大盈利: 605.04 最大亏损: -430.48 总收益: 279.15 平均盈利: 39.88 typeA: 17.09 胜率: 42.86%
趋势多且增强-L1-3-4 总交易次数: 5 盈利: 63.575710165263615 亏损: -137.88001910100442 最大盈利: 63.57 最大亏损: -76.72 总收益: -74.30 平均盈利: -14.86 typeA: -5.94 胜率: 40.00%
趋势空且增强-L-4-3-4 总交易次数: 12 盈利: 1543.2382821431609 亏损: -1296.857218160918 最大盈利: 702.32 最大亏损: -290.03 总收益: 246.38 平均盈利: 20.53 typeA: 6.84 胜率: 33.33%
趋势空且增强-L3-1-6 总交易次数: 3 盈利: 339.61608300907875 亏损: -63.627781458671976 最大盈利: 339.62 最大亏损: -40.72 总收益: 275.99 平均盈利: 92.00 typeA: 30.66 胜率: 33.33%
趋势多且增强-L1-2-5 总交易次数: 2 盈利: 0 亏损: -207.540283623718 最大盈利: -47.43 最大亏损: -160.11 总收益: -207.54 平均盈利: -103.77 typeA: 0.00 胜率: 0.00%
趋势空且增强-L-4-2-4 总交易次数: 3 盈利: 0 亏损: -433.26027232124227 最大盈利: -14.70 最大亏损: -294.18 总收益: -433.26 平均盈利: -144.42 typeA: 0.00 胜率: 0.00%
趋势空且增强-L-4-1-4 总交易次数: 2 盈利: 0 亏损: -388.7426957037736 最大盈利: -192.39 最大亏损: -196.36 总收益: -388.74 平均盈利: -194.37 typeA: 0.00 胜率: 0.00%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     83
      胜率:          43.37%
      总收益:        -2171.07 USDT
      期末余额:      7662.93 USDT
      盈亏比:        0.60
      最大单笔盈利:  425.59
      最大单笔亏损:  -624.36
      手续费:       332.0761990559247
      =============================
    
profit: -2337.066879590964
maxDrawdown 27.6%
startTime: 2024-08-13 00:00:00
趋势空且增强-L2-1-3 总交易次数: 1 盈利: 4.493600445186479 亏损: 0 最大盈利: 4.49 最大亏损: 4.49 总收益: 4.49 平均盈利: 4.49 typeA: 4.49 胜率: 100.00%
趋势多且增强-L3-1-4-1 总交易次数: 1 盈利: 79.86693961105479 亏损: 0 最大盈利: 79.87 最大亏损: 79.87 总收益: 79.87 平均盈利: 79.87 typeA: 79.87 胜率: 100.00%
趋势多且增强-R-1-2-2 总交易次数: 1 盈利: 270.8760626398223 亏损: 0 最大盈利: 270.88 最大亏损: 270.88 总收益: 270.88 平均盈利: 270.88 typeA: 270.88 胜率: 100.00%
趋势多且增强-L1-3-2 总交易次数: 1 盈利: 48.55748194014493 亏损: 0 最大盈利: 48.56 最大亏损: 48.56 总收益: 48.56 平均盈利: 48.56 typeA: 48.56 胜率: 100.00%
趋势多且增强-R-2-1 总交易次数: 4 盈利: 124.56639571233308 亏损: -302.12757973733596 最大盈利: 83.98 最大亏损: -302.13 总收益: -177.56 平均盈利: -44.39 typeA: -33.29 胜率: 75.00%
趋势空且增强-11 总交易次数: 3 盈利: 126.12785629889093 亏损: -321.9184852374847 最大盈利: 90.14 最大亏损: -321.92 总收益: -195.79 平均盈利: -65.26 typeA: -43.51 胜率: 66.67%
趋势多且增强-L3-1-5 总交易次数: 5 盈利: 79.01540957334781 亏损: -207.6235152109553 最大盈利: 31.77 最大亏损: -184.64 总收益: -128.61 平均盈利: -25.72 typeA: -15.43 胜率: 60.00%
趋势空且增强-L-4-2-3 总交易次数: 2 盈利: 271.6841699585697 亏损: -38.503649635036034 最大盈利: 271.68 最大亏损: -38.50 总收益: 233.18 平均盈利: 116.59 typeA: 58.30 胜率: 50.00%
趋势多且增强-L3-1-4-3 总交易次数: 8 盈利: 116.28630601639512 亏损: -69.29067471573353 最大盈利: 58.46 最大亏损: -50.75 总收益: 47.00 平均盈利: 5.87 typeA: 2.94 胜率: 50.00%
趋势多且增强-L3-1-3 总交易次数: 4 盈利: 14.490102855994548 亏损: -60.88105866566301 最大盈利: 7.43 最大亏损: -33.56 总收益: -46.39 平均盈利: -11.60 typeA: -5.80 胜率: 50.00%
趋势空且增强-L-4-3-4 总交易次数: 17 盈利: 1362.2480346842146 亏损: -714.4764994597233 最大盈利: 363.84 最大亏损: -186.11 总收益: 647.77 平均盈利: 38.10 typeA: 17.93 胜率: 47.06%
趋势多且增强-11 总交易次数: 5 盈利: 73.73541865983219 亏损: -163.4248839534083 最大盈利: 54.20 最大亏损: -98.98 总收益: -89.69 平均盈利: -17.94 typeA: -7.18 胜率: 40.00%
趋势空且增强-L3-1-6 总交易次数: 5 盈利: 489.9549057768612 亏损: -763.5319251990601 最大盈利: 425.59 最大亏损: -624.36 总收益: -273.58 平均盈利: -54.72 typeA: -21.89 胜率: 40.00%
趋势多且增强-L1-3-4 总交易次数: 6 盈利: 12.167595530470159 亏损: -410.0260462450033 最大盈利: 6.34 最大亏损: -128.69 总收益: -397.86 平均盈利: -66.31 typeA: -22.10 胜率: 33.33%
趋势多且增强-R-3-1 总交易次数: 3 盈利: 117.1251063829783 亏损: -421.765041803524 最大盈利: 117.13 最大亏损: -404.84 总收益: -304.64 平均盈利: -101.55 typeA: -33.85 胜率: 33.33%
趋势空且增强-L2-3-4 总交易次数: 4 盈利: 39.24088541666725 亏损: -550.6917681228789 最大盈利: 39.24 最大亏损: -410.92 总收益: -511.45 平均盈利: -127.86 typeA: -31.97 胜率: 25.00%
趋势空且增强-L2-3-3 总交易次数: 8 盈利: 45.17034521788346 亏损: -510.0766187011949 最大盈利: 45.17 最大亏损: -264.53 总收益: -464.91 平均盈利: -58.11 typeA: -7.26 胜率: 12.50%
趋势空且增强-L2-2-3 总交易次数: 1 盈利: 0 亏损: -375.86340562990296 最大盈利: -375.86 最大亏损: -375.86 总收益: -375.86 平均盈利: -375.86 typeA: 0.00 胜率: 0.00%
趋势空且增强-L-4-2-4 总交易次数: 1 盈利: 0 亏损: -99.97229085774795 最大盈利: -99.97 最大亏损: -99.97 总收益: -99.97 平均盈利: -99.97 typeA: 0.00 胜率: 0.00%
趋势多且增强-R-3-2 总交易次数: 1 盈利: 0 亏损: -157.60303183425972 最大盈利: -157.60 最大亏损: -157.60 总收益: -157.60 平均盈利: -157.60 typeA: 0.00 胜率: 0.00%
趋势空且增强-L2-3-5 总交易次数: 1 盈利: 0 亏损: -243.11673363014438 最大盈利: -243.12 最大亏损: -243.12 总收益: -243.12 平均盈利: -243.12 typeA: 0.00 胜率: 0.00%
趋势多且增强-L1-3-1 总交易次数: 1 盈利: 0 亏损: -35.78028767255556 最大盈利: -35.78 最大亏损: -35.78 总收益: -35.78 平均盈利: -35.78 typeA: 0.00 胜率: 0.00%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     86
      胜率:          51.16%
      总收益:        1642.64 USDT
      期末余额:      11470.64 USDT
      盈亏比:        1.38
      最大单笔盈利:  649.75
      最大单笔亏损:  -694.14
      手续费:       344.11055875522345
      =============================
    
profit: 1470.6419408964593
maxDrawdown 14.4%
startTime: 2024-09-12 00:00:00
趋势多且增强-L3-1-4-1 总交易次数: 2 盈利: 376.9819225658108 亏损: 0 最大盈利: 262.29 最大亏损: 114.69 总收益: 376.98 平均盈利: 188.49 typeA: 188.49 胜率: 100.00%
趋势多且增强-R-1-2-2 总交易次数: 2 盈利: 166.3889253467245 亏损: 0 最大盈利: 154.48 最大亏损: 11.91 总收益: 166.39 平均盈利: 83.19 typeA: 83.19 胜率: 100.00%
趋势多且增强-L3-1-3 总交易次数: 3 盈利: 35.01448507313326 亏损: 0 最大盈利: 18.19 最大亏损: 3.97 总收益: 35.01 平均盈利: 11.67 typeA: 11.67 胜率: 100.00%
趋势空且增强-L2-3-5 总交易次数: 1 盈利: 6.465111905210338 亏损: 0 最大盈利: 6.47 最大亏损: 6.47 总收益: 6.47 平均盈利: 6.47 typeA: 6.47 胜率: 100.00%
趋势多且增强-R-2-2 总交易次数: 1 盈利: 6.538730890768029 亏损: 0 最大盈利: 6.54 最大亏损: 6.54 总收益: 6.54 平均盈利: 6.54 typeA: 6.54 胜率: 100.00%
趋势多且增强-L3-1-4-3 总交易次数: 6 盈利: 73.06798854653843 亏损: -34.33379067032642 最大盈利: 34.54 最大亏损: -34.33 总收益: 38.73 平均盈利: 6.46 typeA: 5.38 胜率: 83.33%
趋势空且增强-L2-3-4 总交易次数: 7 盈利: 1375.8866570272958 亏损: -711.9616120533101 最大盈利: 530.71 最大亏损: -694.14 总收益: 663.93 平均盈利: 94.85 typeA: 67.75 胜率: 71.43%
趋势多且增强-R-1-1-2 总交易次数: 3 盈利: 362.138886945022 亏损: -240.62869541632793 最大盈利: 197.55 最大亏损: -240.63 总收益: 121.51 平均盈利: 40.50 typeA: 27.00 胜率: 66.67%
趋势多且增强-L1-3-4 总交易次数: 8 盈利: 185.42989369583967 亏损: -283.4702211305348 最大盈利: 158.41 最大亏损: -206.06 总收益: -98.04 平均盈利: -12.26 typeA: -6.13 胜率: 50.00%
趋势空且增强-L2-3-3 总交易次数: 6 盈利: 125.90748676263462 亏损: -143.83342172450557 最大盈利: 67.94 最大亏损: -75.45 总收益: -17.93 平均盈利: -2.99 typeA: -1.49 胜率: 50.00%
趋势空且增强-L-4-2-3 总交易次数: 4 盈利: 38.465668288317936 亏损: -64.11032941203712 最大盈利: 34.62 最大亏损: -39.82 总收益: -25.64 平均盈利: -6.41 typeA: -3.21 胜率: 50.00%
趋势空且增强-11 总交易次数: 2 盈利: 222.47579352356502 亏损: -1.0496009122010528 最大盈利: 222.48 最大亏损: -1.05 总收益: 221.43 平均盈利: 110.71 typeA: 55.36 胜率: 50.00%
趋势空且增强-L3-1-6 总交易次数: 2 盈利: 113.05594336839943 亏损: -207.76926179911226 最大盈利: 113.06 最大亏损: -207.77 总收益: -94.71 平均盈利: -47.36 typeA: -23.68 胜率: 50.00%
趋势多且增强-R-3-1 总交易次数: 2 盈利: 244.54442525427012 亏损: -8.56529080675428 最大盈利: 244.54 最大亏损: -8.57 总收益: 235.98 平均盈利: 117.99 typeA: 58.99 胜率: 50.00%
趋势多且增强-L3-1-5 总交易次数: 2 盈利: 29.848185844147423 亏损: -150.42261528742944 最大盈利: 29.85 最大亏损: -150.42 总收益: -120.57 平均盈利: -60.29 typeA: -30.14 胜率: 50.00%
趋势多且增强-L1-3-2 总交易次数: 2 盈利: 233.57439703153867 亏损: -32.53921480549878 最大盈利: 233.57 最大亏损: -32.54 总收益: 201.04 平均盈利: 100.52 typeA: 50.26 胜率: 50.00%
趋势空且增强-L-4-3-4 总交易次数: 18 盈利: 1674.2220812572893 亏损: -1356.8854811935262 最大盈利: 649.75 最大亏损: -309.35 总收益: 317.34 平均盈利: 17.63 typeA: 6.86 胜率: 38.89%
趋势空且增强-L-4-2-4 总交易次数: 3 盈利: 169.36389319238066 亏损: -477.79836860756797 最大盈利: 169.36 最大亏损: -460.18 总收益: -308.43 平均盈利: -102.81 typeA: -34.27 胜率: 33.33%
趋势多且增强-11 总交易次数: 6 盈利: 549.7878979168545 亏损: -208.5532534980873 最大盈利: 549.79 最大亏损: -69.97 总收益: 341.23 平均盈利: 56.87 typeA: 9.48 胜率: 16.67%
趋势多且增强-L1-3-1 总交易次数: 1 盈利: 0 亏损: -39.03323910712597 最大盈利: -39.03 最大亏损: -39.03 总收益: -39.03 平均盈利: -39.03 typeA: 0.00 胜率: 0.00%
趋势多且增强-L1-3-9 总交易次数: 2 盈利: 0 亏损: -119.05901822619822 最大盈利: -50.31 最大亏损: -68.75 总收益: -119.06 平均盈利: -59.53 typeA: 0.00 胜率: 0.00%
趋势多且增强-L-4-2-2 总交易次数: 1 盈利: 0 亏损: -45.17401690555054 最大盈利: -45.17 最大亏损: -45.17 总收益: -45.17 平均盈利: -45.17 typeA: 0.00 胜率: 0.00%
趋势空且增强-L2-2-3 总交易次数: 1 盈利: 0 亏损: -189.6494767606303 最大盈利: -189.65 最大亏损: -189.65 总收益: -189.65 平均盈利: -189.65 typeA: 0.00 胜率: 0.00%
趋势空且增强-L-4-4-4 总交易次数: 1 盈利: 0 亏损: -31.679525222551653 最大盈利: -31.68 最大亏损: -31.68 总收益: -31.68 平均盈利: -31.68 typeA: 0.00 胜率: 0.00%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     84
      胜率:          45.24%
      总收益:        586.29 USDT
      期末余额:      10416.29 USDT
      盈亏比:        1.09
      最大单笔盈利:  783.20
      最大单笔亏损:  -501.58
      手续费:       339.3521087617926
      =============================
    
profit: 416.29446873722554
maxDrawdown 20.0%
startTime: 2024-10-12 00:00:00
趋势多且增强-R-3-1 总交易次数: 2 盈利: 366.5844276776031 亏损: 0 最大盈利: 193.05 最大亏损: 173.54 总收益: 366.58 平均盈利: 183.29 typeA: 183.29 胜率: 100.00%
趋势多且增强-L1-3-2 总交易次数: 1 盈利: 176.95455730298082 亏损: 0 最大盈利: 176.95 最大亏损: 176.95 总收益: 176.95 平均盈利: 176.95 typeA: 176.95 胜率: 100.00%
趋势多且增强-R-2-1 总交易次数: 1 盈利: 276.97688014881743 亏损: 0 最大盈利: 276.98 最大亏损: 276.98 总收益: 276.98 平均盈利: 276.98 typeA: 276.98 胜率: 100.00%
趋势多且增强-L1-3-1 总交易次数: 2 盈利: 876.5065026351251 亏损: 0 最大盈利: 783.20 最大亏损: 93.30 总收益: 876.51 平均盈利: 438.25 typeA: 438.25 胜率: 100.00%
趋势多且增强-L3-1-5 总交易次数: 2 盈利: 113.99600049924223 亏损: 0 最大盈利: 76.15 最大亏损: 37.85 总收益: 114.00 平均盈利: 57.00 typeA: 57.00 胜率: 100.00%
趋势空且增强-L2-3-5 总交易次数: 2 盈利: 157.09213269869144 亏损: 0 最大盈利: 80.82 最大亏损: 76.27 总收益: 157.09 平均盈利: 78.55 typeA: 78.55 胜率: 100.00%
趋势空且增强-11 总交易次数: 1 盈利: 438.9735468778115 亏损: 0 最大盈利: 438.97 最大亏损: 438.97 总收益: 438.97 平均盈利: 438.97 typeA: 438.97 胜率: 100.00%
趋势多且增强-L1-2-2 总交易次数: 1 盈利: 149.56589976814678 亏损: 0 最大盈利: 149.57 最大亏损: 149.57 总收益: 149.57 平均盈利: 149.57 typeA: 149.57 胜率: 100.00%
趋势多且增强-R-1-1-2 总交易次数: 4 盈利: 305.9556132981625 亏损: -106.11151387332748 最大盈利: 258.26 最大亏损: -106.11 总收益: 199.84 平均盈利: 49.96 typeA: 37.47 胜率: 75.00%
趋势多且增强-L3-1-4-1 总交易次数: 7 盈利: 699.2762803955223 亏损: -24.679646302303368 最大盈利: 414.76 最大亏损: -19.94 总收益: 674.60 平均盈利: 96.37 typeA: 68.84 胜率: 71.43%
趋势空且增强-L2-3-4 总交易次数: 3 盈利: 535.7662365759659 亏损: -426.39967312044297 最大盈利: 390.45 最大亏损: -426.40 总收益: 109.37 平均盈利: 36.46 typeA: 24.30 胜率: 66.67%
趋势多且增强-L1-3-4 总交易次数: 11 盈利: 1265.2026028122255 亏损: -309.69920718628964 最大盈利: 660.58 最大亏损: -131.63 总收益: 955.50 平均盈利: 86.86 typeA: 47.38 胜率: 54.55%
趋势多且增强-L1-2-5 总交易次数: 4 盈利: 371.85069993363777 亏损: -44.61518854630913 最大盈利: 232.07 最大亏损: -22.94 总收益: 327.24 平均盈利: 81.81 typeA: 40.90 胜率: 50.00%
趋势多且增强-11 总交易次数: 2 盈利: 144.4076742364904 亏损: -182.01162953622085 最大盈利: 144.41 最大亏损: -182.01 总收益: -37.60 平均盈利: -18.80 typeA: -9.40 胜率: 50.00%
趋势多且增强-L3-1-3 总交易次数: 3 盈利: 11.681313668845595 亏损: -103.4083855860662 最大盈利: 11.68 最大亏损: -62.60 总收益: -91.73 平均盈利: -30.58 typeA: -10.19 胜率: 33.33%
趋势空且增强-2 总交易次数: 3 盈利: 68.94929681717151 亏损: -819.6378852889725 最大盈利: 68.95 最大亏损: -459.12 总收益: -750.69 平均盈利: -250.23 typeA: -83.40 胜率: 33.33%
趋势空且增强-L-4-1-4 总交易次数: 11 盈利: 863.8755525644252 亏损: -1129.8200013855526 最大盈利: 352.59 最大亏损: -501.58 总收益: -265.94 平均盈利: -24.18 typeA: -6.59 胜率: 27.27%
趋势空且增强-L-4-3-4 总交易次数: 11 盈利: 196.35149940012602 亏损: -1226.2319500029637 最大盈利: 192.07 最大亏损: -245.50 总收益: -1029.88 平均盈利: -93.63 typeA: -17.02 胜率: 18.18%
趋势空且增强-L-4-4-4 总交易次数: 1 盈利: 0 亏损: -31.679525222551653 最大盈利: -31.68 最大亏损: -31.68 总收益: -31.68 平均盈利: -31.68 typeA: 0.00 胜率: 0.00%
趋势空且增强-L-4-2-3 总交易次数: 4 盈利: 0 亏损: -518.2768794364359 最大盈利: -28.28 最大亏损: -225.05 总收益: -518.28 平均盈利: -129.57 typeA: 0.00 胜率: 0.00%
趋势空且增强-L-4-2-4 总交易次数: 2 盈利: 0 亏损: -423.3820173847603 最大盈利: -177.40 最大亏损: -245.98 总收益: -423.38 平均盈利: -211.69 typeA: 0.00 胜率: 0.00%
趋势空且增强-L3-1-6 总交易次数: 2 盈利: 0 亏损: -229.09630911988984 最大盈利: -71.04 最大亏损: -158.06 总收益: -229.10 平均盈利: -114.55 typeA: 0.00 胜率: 0.00%
趋势多且增强-L1-1-6 总交易次数: 1 盈利: 0 亏损: -149.38327316486155 最大盈利: -149.38 最大亏损: -149.38 总收益: -149.38 平均盈利: -149.38 typeA: 0.00 胜率: 0.00%
趋势空且增强-L2-1-3 总交易次数: 1 盈利: 0 亏损: -73.41698142494916 最大盈利: -73.42 最大亏损: -73.42 总收益: -73.42 平均盈利: -73.42 typeA: 0.00 胜率: 0.00%
趋势多且增强-L1-2-1 总交易次数: 1 盈利: 0 亏损: -165.7060339889244 最大盈利: -165.71 最大亏损: -165.71 总收益: -165.71 平均盈利: -165.71 typeA: 0.00 胜率: 0.00%
趋势空且增强-L1-1-2 总交易次数: 1 盈利: 0 亏损: -470.11614800294035 最大盈利: -470.12 最大亏损: -470.12 总收益: -470.12 平均盈利: -470.12 typeA: 0.00 胜率: 0.00%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     2
      胜率:          100.00%
      总收益:        366.72 USDT
      期末余额:      10360.72 USDT
      盈亏比:        Infinity
      最大单笔盈利:  328.88
      最大单笔亏损:  37.85
      手续费:       9.941809292762867
      =============================
    
profit: 360.72391650915597
maxDrawdown 0.0%
startTime: 2024-11-11 00:00:00
趋势空且增强-L1-1-2 总交易次数: 1 盈利: 328.87579291999134 亏损: 0 最大盈利: 328.88 最大亏损: 328.88 总收益: 328.88 平均盈利: 328.88 typeA: 328.88 胜率: 100.00%
趋势多且增强-L3-1-5 总交易次数: 1 盈利: 37.84812358916549 亏损: 0 最大盈利: 37.85 最大亏损: 37.85 总收益: 37.85 平均盈利: 37.85 typeA: 37.85 胜率: 100.00%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     107
      胜率:          50.47%
      总收益:        6462.60 USDT
      期末余额:      16246.60 USDT
      盈亏比:        2.26
      最大单笔盈利:  1261.70
      最大单笔亏损:  -631.27
      手续费:       430.1576918353325
      =============================
    
profit: 6246.597098444063
maxDrawdown 8.7%
startTime: 2024-12-11 00:00:00
趋势多且增强-L1-1-6 总交易次数: 4 盈利: 914.5761118457921 亏损: 0 最大盈利: 577.65 最大亏损: 7.34 总收益: 914.58 平均盈利: 228.64 typeA: 228.64 胜率: 100.00%
趋势空且增强-L2-2-3 总交易次数: 3 盈利: 181.98283563091005 亏损: 0 最大盈利: 108.24 最大亏损: 32.26 总收益: 181.98 平均盈利: 60.66 typeA: 60.66 胜率: 100.00%
趋势多且增强-L1-3-9 总交易次数: 1 盈利: 3.4008897362568633 亏损: 0 最大盈利: 3.40 最大亏损: 3.40 总收益: 3.40 平均盈利: 3.40 typeA: 3.40 胜率: 100.00%
趋势空且增强-L-4-2-3 总交易次数: 1 盈利: 20.385008195689192 亏损: 0 最大盈利: 20.39 最大亏损: 20.39 总收益: 20.39 平均盈利: 20.39 typeA: 20.39 胜率: 100.00%
趋势多且增强-L1-3-4 总交易次数: 2 盈利: 97.16348595120563 亏损: 0 最大盈利: 83.34 最大亏损: 13.82 总收益: 97.16 平均盈利: 48.58 typeA: 48.58 胜率: 100.00%
趋势空且增强-L2-3-4 总交易次数: 3 盈利: 761.841882955621 亏损: 0 最大盈利: 544.56 最大亏损: 21.20 总收益: 761.84 平均盈利: 253.95 typeA: 253.95 胜率: 100.00%
趋势空且增强-L-4-3-4 总交易次数: 1 盈利: 344.5622077424291 亏损: 0 最大盈利: 344.56 最大亏损: 344.56 总收益: 344.56 平均盈利: 344.56 typeA: 344.56 胜率: 100.00%
趋势多且增强-L3-1-4-1 总交易次数: 8 盈利: 133.85608842987673 亏损: -402.7006518871533 最大盈利: 53.85 最大亏损: -348.77 总收益: -268.84 平均盈利: -33.61 typeA: -25.20 胜率: 75.00%
趋势多且增强-L3-1-5 总交易次数: 3 盈利: 356.3358053790184 亏损: -86.72626739189198 最大盈利: 279.12 最大亏损: -86.73 总收益: 269.61 平均盈利: 89.87 typeA: 59.92 胜率: 66.67%
趋势空且增强-L2-1-3 总交易次数: 4 盈利: 904.2204762668962 亏损: -210.74271803557917 最大盈利: 832.57 最大亏损: -158.06 总收益: 693.48 平均盈利: 173.37 typeA: 86.68 胜率: 50.00%
趋势空且增强-L-4-1-4 总交易次数: 18 盈利: 2643.1468373620282 亏损: -905.3338557603753 最大盈利: 1040.93 最大亏损: -631.27 总收益: 1737.81 平均盈利: 96.55 typeA: 48.27 胜率: 50.00%
趋势多且增强-R-1-1-2 总交易次数: 16 盈利: 2433.7534968542 亏损: -656.9721596382337 最大盈利: 920.53 最大亏损: -162.10 总收益: 1776.78 平均盈利: 111.05 typeA: 55.52 胜率: 50.00%
趋势多且增强-R-1-2-2 总交易次数: 6 盈利: 326.3675281041075 亏损: -125.10384946655637 最大盈利: 178.97 最大亏损: -84.35 总收益: 201.26 平均盈利: 33.54 typeA: 16.77 胜率: 50.00%
趋势多且增强-L3-1-3 总交易次数: 2 盈利: 245.11034566110774 亏损: -191.91299019607962 最大盈利: 245.11 最大亏损: -191.91 总收益: 53.20 平均盈利: 26.60 typeA: 13.30 胜率: 50.00%
趋势空且增强-2 总交易次数: 10 盈利: 406.32069009964755 亏损: -285.97724730651777 最大盈利: 276.70 最大亏损: -109.85 总收益: 120.34 平均盈利: 12.03 typeA: 4.81 胜率: 40.00%
趋势空且增强-L3-1-6 总交易次数: 3 盈利: 277.2983868872895 亏损: -257.5297156581373 最大盈利: 277.30 最大亏损: -175.00 总收益: 19.77 平均盈利: 6.59 typeA: 2.20 胜率: 33.33%
趋势多且增强-11 总交易次数: 6 盈利: 1426.0244724967636 亏损: -308.79210920478397 最大盈利: 1261.70 最大亏损: -192.02 总收益: 1117.23 平均盈利: 186.21 typeA: 62.06 胜率: 33.33%
趋势空且增强-L2-3-3 总交易次数: 4 盈利: 120.58015679913409 亏损: -500.2702059273861 最大盈利: 120.58 最大亏损: -295.16 总收益: -379.69 平均盈利: -94.92 typeA: -23.73 胜率: 25.00%
趋势多且增强-L1-2-5 总交易次数: 5 盈利: 0 亏损: -417.4268691523423 最大盈利: -37.54 最大亏损: -256.30 总收益: -417.43 平均盈利: -83.49 typeA: 0.00 胜率: 0.00%
趋势空且增强-L-4-2-4 总交易次数: 4 盈利: 0 亏损: -429.8475758897427 最大盈利: -16.24 最大亏损: -287.12 总收益: -429.85 平均盈利: -107.46 typeA: 0.00 胜率: 0.00%
趋势空且增强-11 总交易次数: 2 盈利: 0 亏损: -231.90052699264152 最大盈利: -9.81 最大亏损: -222.09 总收益: -231.90 平均盈利: -115.95 typeA: 0.00 胜率: 0.00%
趋势多且增强-R-1-1-1 总交易次数: 1 盈利: 0 亏损: -123.09286544648366 最大盈利: -123.09 最大亏损: -123.09 总收益: -123.09 平均盈利: -123.09 typeA: 0.00 胜率: 0.00%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     109
      胜率:          44.95%
      总收益:        1232.09 USDT
      期末余额:      11012.09 USDT
      盈亏比:        1.15
      最大单笔盈利:  1134.96
      最大单笔亏损:  -601.55
      手续费:       438.14567596507175
      =============================
    
profit: 1012.0885980594448
maxDrawdown 13.8%
startTime: 2025-01-10 00:00:00
趋势多且增强-L1-3-9 总交易次数: 1 盈利: 117.75445425961813 亏损: 0 最大盈利: 117.75 最大亏损: 117.75 总收益: 117.75 平均盈利: 117.75 typeA: 117.75 胜率: 100.00%
趋势多且增强-L3-1-4-3 总交易次数: 2 盈利: 148.43350591266798 亏损: 0 最大盈利: 129.14 最大亏损: 19.30 总收益: 148.43 平均盈利: 74.22 typeA: 74.22 胜率: 100.00%
趋势空且增强-L2-3-4 总交易次数: 4 盈利: 580.2042043097559 亏损: -474.8696104464948 最大盈利: 493.16 最大亏损: -474.87 总收益: 105.33 平均盈利: 26.33 typeA: 19.75 胜率: 75.00%
趋势空且增强-L2-1-3 总交易次数: 6 盈利: 1695.15989389267 亏损: -210.05916785924717 最大盈利: 982.63 最大亏损: -180.29 总收益: 1485.10 平均盈利: 247.52 typeA: 165.02 胜率: 66.67%
趋势空且增强-11 总交易次数: 3 盈利: 393.5034504751798 亏损: -72.32656249999876 最大盈利: 344.93 最大亏损: -72.33 总收益: 321.18 平均盈利: 107.06 typeA: 71.38 胜率: 66.67%
趋势多且增强-L3-1-4-1 总交易次数: 11 盈利: 1416.2247722342909 亏损: -1091.8607380194608 最大盈利: 1134.96 最大亏损: -457.89 总收益: 324.36 平均盈利: 29.49 typeA: 16.09 胜率: 54.55%
趋势空且增强-L2-3-5 总交易次数: 4 盈利: 603.6027114761162 亏损: -435.0295631217349 最大盈利: 587.95 最大亏损: -318.61 总收益: 168.57 平均盈利: 42.14 typeA: 21.07 胜率: 50.00%
趋势多且增强-11 总交易次数: 6 盈利: 672.062947230058 亏损: -475.3455549490021 最大盈利: 634.65 最大亏损: -202.53 总收益: 196.72 平均盈利: 32.79 typeA: 16.39 胜率: 50.00%
趋势多且增强-R-1-1-2 总交易次数: 16 盈利: 1522.9496383569913 亏损: -599.1713334155859 最大盈利: 470.07 最大亏损: -179.88 总收益: 923.78 平均盈利: 57.74 typeA: 28.87 胜率: 50.00%
趋势空且增强-L2-3-3 总交易次数: 4 盈利: 168.8889961778871 亏损: -49.195876695630716 最大盈利: 119.28 最大亏损: -27.91 总收益: 119.69 平均盈利: 29.92 typeA: 14.96 胜率: 50.00%
趋势空且增强-L1-1-2 总交易次数: 4 盈利: 285.63114459072887 亏损: -545.8197443967216 最大盈利: 144.53 最大亏损: -537.07 总收益: -260.19 平均盈利: -65.05 typeA: -32.52 胜率: 50.00%
趋势多且增强-R-1-1-1 总交易次数: 2 盈利: 111.74160847037534 亏损: -306.7556727294261 最大盈利: 111.74 最大亏损: -306.76 总收益: -195.01 平均盈利: -97.51 typeA: -48.75 胜率: 50.00%
趋势空且增强-L3-1-6 总交易次数: 2 盈利: 260.5859241236362 亏损: -109.8085555929806 最大盈利: 260.59 最大亏损: -109.81 总收益: 150.78 平均盈利: 75.39 typeA: 37.69 胜率: 50.00%
趋势多且增强-L1-3-4 总交易次数: 2 盈利: 153.14205820960177 亏损: -13.300697665354969 最大盈利: 153.14 最大亏损: -13.30 总收益: 139.84 平均盈利: 69.92 typeA: 34.96 胜率: 50.00%
趋势多且增强-L3-1-5 总交易次数: 5 盈利: 124.63569907012995 亏损: -619.2668904885024 最大盈利: 65.90 最大亏损: -395.22 总收益: -494.63 平均盈利: -98.93 typeA: -39.57 胜率: 40.00%
趋势空且增强-L-4-3-4 总交易次数: 6 盈利: 272.9437054089333 亏损: -319.0823348284607 最大盈利: 160.59 最大亏损: -175.35 总收益: -46.14 平均盈利: -7.69 typeA: -2.56 胜率: 33.33%
趋势多且增强-R-1-2-2 总交易次数: 3 盈利: 3.5967656663042598 亏损: -58.49484676836917 最大盈利: 3.60 最大亏损: -50.57 总收益: -54.90 平均盈利: -18.30 typeA: -6.10 胜率: 33.33%
趋势多且增强-L1-2-5 总交易次数: 7 盈利: 190.2556210715457 亏损: -145.7968167955504 最大盈利: 141.52 最大亏损: -61.78 总收益: 44.46 平均盈利: 6.35 typeA: 1.81 胜率: 28.57%
趋势空且增强-L-4-1-4 总交易次数: 8 盈利: 195.3314592838003 亏损: -974.276799000372 最大盈利: 192.20 最大亏损: -365.30 总收益: -778.95 平均盈利: -97.37 typeA: -24.34 胜率: 25.00%
趋势空且增强-2 总交易次数: 5 盈利: 11.057441253263587 亏损: -372.01847556207747 最大盈利: 11.06 最大亏损: -133.94 总收益: -360.96 平均盈利: -72.19 typeA: -14.44 胜率: 20.00%
趋势空且增强-L-4-2-4 总交易次数: 5 盈利: 354.7655411321325 亏损: -1000.1883723423747 最大盈利: 354.77 最大亏损: -601.55 总收益: -645.42 平均盈利: -129.08 typeA: -25.82 胜率: 20.00%
趋势多且增强-L1-2-2 总交易次数: 1 盈利: 0 亏损: -50.630554941410125 最大盈利: -50.63 最大亏损: -50.63 总收益: -50.63 平均盈利: -50.63 typeA: 0.00 胜率: 0.00%
趋势多且增强-L3-1-3 总交易次数: 1 盈利: 0 亏损: -23.617600808715967 最大盈利: -23.62 最大亏损: -23.62 总收益: -23.62 平均盈利: -23.62 typeA: 0.00 胜率: 0.00%
趋势多且增强-L1-1-6 总交易次数: 1 盈利: 0 亏损: -103.46717561877122 最大盈利: -103.47 最大亏损: -103.47 总收益: -103.47 平均盈利: -103.47 typeA: 0.00 胜率: 0.00%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     111
      胜率:          46.85%
      总收益:        -2334.48 USDT
      期末余额:      7441.52 USDT
      盈亏比:        0.73
      最大单笔盈利:  631.77
      最大单笔亏损:  -856.23
      手续费:       445.33828541002276
      =============================
    
profit: -2558.481350440924
maxDrawdown 32.1%
startTime: 2025-02-09 00:00:00
趋势空且增强-L-4-2-3 总交易次数: 1 盈利: 43.069942400375545 亏损: 0 最大盈利: 43.07 最大亏损: 43.07 总收益: 43.07 平均盈利: 43.07 typeA: 43.07 胜率: 100.00%
趋势空且增强-L1-1-2 总交易次数: 1 盈利: 82.71732463612868 亏损: 0 最大盈利: 82.72 最大亏损: 82.72 总收益: 82.72 平均盈利: 82.72 typeA: 82.72 胜率: 100.00%
趋势空且增强-L2-3-5 总交易次数: 4 盈利: 782.2974213804107 亏损: -70.21518621088683 最大盈利: 419.16 最大亏损: -70.22 总收益: 712.08 平均盈利: 178.02 typeA: 133.52 胜率: 75.00%
趋势多且增强-L3-1-5 总交易次数: 4 盈利: 147.05939551292835 亏损: -387.574144189858 最大盈利: 59.51 最大亏损: -387.57 总收益: -240.51 平均盈利: -60.13 typeA: -45.10 胜率: 75.00%
趋势空且增强-L-4-2-4 总交易次数: 7 盈利: 1773.359176373273 亏损: -517.278271305225 最大盈利: 631.77 最大亏损: -438.40 总收益: 1256.08 平均盈利: 179.44 typeA: 128.17 胜率: 71.43%
趋势空且增强-11 总交易次数: 3 盈利: 202.5251268230813 亏损: -94.51692575911642 最大盈利: 138.72 最大亏损: -94.52 总收益: 108.01 平均盈利: 36.00 typeA: 24.00 胜率: 66.67%
趋势多且增强-R-1-1-2 总交易次数: 17 盈利: 1174.9746023772973 亏损: -914.9266067262031 最大盈利: 380.79 最大亏损: -328.81 总收益: 260.05 平均盈利: 15.30 typeA: 9.90 胜率: 64.71%
趋势多且增强-L1-3-4 总交易次数: 6 盈利: 242.88176463955216 亏损: -151.31681225276355 最大盈利: 148.48 最大亏损: -121.08 总收益: 91.56 平均盈利: 15.26 typeA: 7.63 胜率: 50.00%
趋势空且增强-L-4-3-4 总交易次数: 4 盈利: 123.63230098353921 亏损: -542.0910296885937 最大盈利: 112.35 最大亏损: -399.53 总收益: -418.46 平均盈利: -104.61 typeA: -52.31 胜率: 50.00%
趋势空且增强-L2-1-3 总交易次数: 2 盈利: 102.63770752786037 亏损: -9.200287953927912 最大盈利: 102.64 最大亏损: -9.20 总收益: 93.44 平均盈利: 46.72 typeA: 23.36 胜率: 50.00%
趋势空且增强-2 总交易次数: 6 盈利: 64.56927520276341 亏损: -79.0644960748499 最大盈利: 45.98 最大亏损: -58.59 总收益: -14.50 平均盈利: -2.42 typeA: -1.21 胜率: 50.00%
趋势空且增强-L2-3-3 总交易次数: 2 盈利: 194.71848405764354 亏损: -82.43600115573423 最大盈利: 194.72 最大亏损: -82.44 总收益: 112.28 平均盈利: 56.14 typeA: 28.07 胜率: 50.00%
趋势多且增强-L1-3-9 总交易次数: 2 盈利: 74.03491212861483 亏损: -42.13996693694485 最大盈利: 74.03 最大亏损: -42.14 总收益: 31.89 平均盈利: 15.95 typeA: 7.97 胜率: 50.00%
趋势多且增强-L1-1-6 总交易次数: 4 盈利: 325.60457705993076 亏损: -242.76230569770667 最大盈利: 202.95 最大亏损: -197.32 总收益: 82.84 平均盈利: 20.71 typeA: 10.36 胜率: 50.00%
趋势空且增强-L2-2-3 总交易次数: 2 盈利: 99.59085417692042 亏损: -178.77590079093764 最大盈利: 99.59 最大亏损: -178.78 总收益: -79.19 平均盈利: -39.59 typeA: -19.80 胜率: 50.00%
趋势空且增强-L3-1-6 总交易次数: 2 盈利: 260.1511260182081 亏损: -346.2842489397384 最大盈利: 260.15 最大亏损: -346.28 总收益: -86.13 平均盈利: -43.07 typeA: -21.53 胜率: 50.00%
趋势多且增强-L3-1-4-1 总交易次数: 11 盈利: 256.467619692965 亏损: -2083.320068687471 最大盈利: 169.78 最大亏损: -856.23 总收益: -1826.85 平均盈利: -166.08 typeA: -75.48 胜率: 45.45%
趋势多且增强-R-1-2-2 总交易次数: 5 盈利: 58.928072471067125 亏损: -828.4722895512244 最大盈利: 33.34 最大亏损: -531.37 总收益: -769.54 平均盈利: -153.91 typeA: -61.56 胜率: 40.00%
趋势空且增强-L2-3-4 总交易次数: 6 盈利: 258.93686746498383 亏损: -747.2939733605788 最大盈利: 187.50 最大亏损: -270.90 总收益: -488.36 平均盈利: -81.39 typeA: -27.13 胜率: 33.33%
趋势多且增强-L1-2-5 总交易次数: 8 盈利: 5.202593452332735 亏损: -266.9788584952207 最大盈利: 5.20 最大亏损: -62.73 总收益: -261.78 平均盈利: -32.72 typeA: -4.09 胜率: 12.50%
趋势空且增强-L-4-1-4 总交易次数: 10 盈利: 21.5091364015471 亏损: -742.2911842794458 最大盈利: 21.51 最大亏损: -165.49 总收益: -720.78 平均盈利: -72.08 typeA: -7.21 胜率: 10.00%
趋势多且增强-L3-1-3 总交易次数: 1 盈利: 0 亏损: -16.536202384412473 最大盈利: -16.54 最大亏损: -16.54 总收益: -16.54 平均盈利: -16.54 typeA: 0.00 胜率: 0.00%
趋势多且增强-11 总交易次数: 1 盈利: 0 亏损: -163.70893647142162 最大盈利: -163.71 最大亏损: -163.71 总收益: -163.71 平均盈利: -163.71 typeA: 0.00 胜率: 0.00%
趋势多且增强-R-1-1-1 总交易次数: 1 盈利: 0 亏损: -17.733181798312682 最大盈利: -17.73 最大亏损: -17.73 总收益: -17.73 平均盈利: -17.73 typeA: 0.00 胜率: 0.00%
趋势空且增强-L-4-4-4 总交易次数: 1 盈利: 0 亏损: -104.43275251177018 最大盈利: -104.43 最大亏损: -104.43 总收益: -104.43 平均盈利: -104.43 typeA: 0.00 胜率: 0.00%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     99
      胜率:          47.47%
      总收益:        -3109.82 USDT
      期末余额:      6690.18 USDT
      盈亏比:        0.62
      最大单笔盈利:  424.68
      最大单笔亏损:  -919.69
      手续费:       398.75164102375766
      =============================
    
profit: -3309.81556136579
maxDrawdown 34.2%
startTime: 2025-03-11 00:00:00
趋势多且增强-R-2-1 总交易次数: 1 盈利: 74.47472769550858 亏损: 0 最大盈利: 74.47 最大亏损: 74.47 总收益: 74.47 平均盈利: 74.47 typeA: 74.47 胜率: 100.00%
趋势空且增强-L2-3-5 总交易次数: 2 盈利: 44.62193378599292 亏损: 0 最大盈利: 28.80 最大亏损: 15.82 总收益: 44.62 平均盈利: 22.31 typeA: 22.31 胜率: 100.00%
趋势空且增强-L2-1-3 总交易次数: 1 盈利: 25.988931036627445 亏损: 0 最大盈利: 25.99 最大亏损: 25.99 总收益: 25.99 平均盈利: 25.99 typeA: 25.99 胜率: 100.00%
趋势多且增强-L3-1-4-1 总交易次数: 6 盈利: 284.15117413521085 亏损: -11.346108903949139 最大盈利: 100.31 最大亏损: -11.35 总收益: 272.81 平均盈利: 45.47 typeA: 37.89 胜率: 83.33%
趋势空且增强-11 总交易次数: 5 盈利: 863.8437933517655 亏损: -70.87930409568698 最大盈利: 292.83 最大亏损: -70.88 总收益: 792.96 平均盈利: 158.59 typeA: 126.87 胜率: 80.00%
趋势多且增强-L3-1-4-3 总交易次数: 4 盈利: 313.446541032874 亏损: -2 最大盈利: 242.61 最大亏损: -2.00 总收益: 311.45 平均盈利: 77.86 typeA: 58.40 胜率: 75.00%
趋势多且增强-L3-1-5 总交易次数: 7 盈利: 302.7030455476777 亏损: -209.81987826009072 最大盈利: 115.84 最大亏损: -144.94 总收益: 92.88 平均盈利: 13.27 typeA: 9.48 胜率: 71.43%
趋势多且增强-R-1-2-2 总交易次数: 9 盈利: 602.9704717251237 亏损: -940.8221828636877 最大盈利: 261.12 最大亏损: -478.64 总收益: -337.85 平均盈利: -37.54 typeA: -25.03 胜率: 66.67%
趋势多且增强-R-1-1-2 总交易次数: 6 盈利: 588.9071814733627 亏损: -65.35598334363125 最大盈利: 424.68 最大亏损: -36.68 总收益: 523.55 平均盈利: 87.26 typeA: 58.18 胜率: 66.67%
趋势空且增强-L2-2-3 总交易次数: 2 盈利: 86.99514136861332 亏损: -185.08399770393416 最大盈利: 87.00 最大亏损: -185.08 总收益: -98.09 平均盈利: -49.04 typeA: -24.52 胜率: 50.00%
趋势多且增强-L1-1-6 总交易次数: 2 盈利: 55.583873290137774 亏损: -197.31662366384174 最大盈利: 55.58 最大亏损: -197.32 总收益: -141.73 平均盈利: -70.87 typeA: -35.43 胜率: 50.00%
趋势空且增强-L2-3-4 总交易次数: 4 盈利: 124.04678797413757 亏损: -237.9691672014182 最大盈利: 80.21 最大亏损: -230.69 总收益: -113.92 平均盈利: -28.48 typeA: -14.24 胜率: 50.00%
趋势多且增强-L3-1-3 总交易次数: 2 盈利: 31.008047320999264 亏损: -153.25662272441906 最大盈利: 31.01 最大亏损: -153.26 总收益: -122.25 平均盈利: -61.12 typeA: -30.56 胜率: 50.00%
趋势空且增强-L-4-2-4 总交易次数: 10 盈利: 507.1107291558239 亏损: -2026.661811286721 最大盈利: 246.67 最大亏损: -919.69 总收益: -1519.55 平均盈利: -151.96 typeA: -60.78 胜率: 40.00%
趋势空且增强-L-4-2-3 总交易次数: 5 盈利: 171.55098351945838 亏损: -764.1063868161062 最大盈利: 140.48 最大亏损: -324.94 总收益: -592.56 平均盈利: -118.51 typeA: -47.40 胜率: 40.00%
趋势多且增强-L1-3-4 总交易次数: 9 盈利: 649.6916852060281 亏损: -271.17952445326 最大盈利: 412.02 最大亏损: -79.69 总收益: 378.51 平均盈利: 42.06 typeA: 14.02 胜率: 33.33%
趋势空且增强-2 总交易次数: 4 盈利: 17.623789086449232 亏损: -315.09879631334803 最大盈利: 17.62 最大亏损: -181.85 总收益: -297.48 平均盈利: -74.37 typeA: -18.59 胜率: 25.00%
趋势空且增强-L-4-3-4 总交易次数: 6 盈利: 316.63949402670414 亏损: -772.9828698557764 最大盈利: 316.64 最大亏损: -280.02 总收益: -456.34 平均盈利: -76.06 typeA: -12.68 胜率: 16.67%
趋势空且增强-L3-1-6 总交易次数: 2 盈利: 0 亏损: -337.5262350607288 最大盈利: -10.55 最大亏损: -326.98 总收益: -337.53 平均盈利: -168.76 typeA: 0.00 胜率: 0.00%
趋势空且增强-L-4-1-4 总交易次数: 2 盈利: 0 亏损: -739.077071723967 最大盈利: -30.70 最大亏损: -708.38 总收益: -739.08 平均盈利: -369.54 typeA: 0.00 胜率: 0.00%
趋势多且增强-L1-2-5 总交易次数: 4 盈利: 0 亏损: -142.67844539753148 最大盈利: -25.74 最大亏损: -46.40 总收益: -142.68 平均盈利: -35.67 typeA: 0.00 胜率: 0.00%
趋势多且增强-L1-3-2 总交易次数: 1 盈利: 0 亏损: -25.95080338883983 最大盈利: -25.95 最大亏损: -25.95 总收益: -25.95 平均盈利: -25.95 typeA: 0.00 胜率: 0.00%
趋势多且增强-11 总交易次数: 3 盈利: 0 亏损: -512.6648539180545 最大盈利: -106.85 最大亏损: -271.20 总收益: -512.66 平均盈利: -170.89 typeA: 0.00 胜率: 0.00%
趋势空且增强-L2-3-3 总交易次数: 1 盈利: 0 亏损: -132.33738971706666 最大盈利: -132.34 最大亏损: -132.34 总收益: -132.34 平均盈利: -132.34 typeA: 0.00 胜率: 0.00%
趋势多且增强-R-2-2 总交易次数: 1 盈利: 0 亏损: -57.05983540622498 最大盈利: -57.06 最大亏损: -57.06 总收益: -57.06 平均盈利: -57.06 typeA: 0.00 胜率: 0.00%
tradeNumTotal 4469
profitTotal 139081.7150692545
maxLossTotal -2061.77
winRateTotal 2763.4399999999987
period month 53
avgRate 52.14
maxDrawdownTotal 34.2
趋势空且增强-11 总交易次数: 92 盈利: 12143.85972011224 亏损: -5840.232189745758 最大盈利: 892.06 最大亏损: -897.70 总收益: 6303.63 平均盈利: 68.52 typeA: 48.41 胜率: 70.65%
趋势多且增强-R-1-1-1 总交易次数: 34 盈利: 4907.429210512164 亏损: -1682.5991224617235 最大盈利: 1148.20 最大亏损: -694.30 总收益: 3224.83 平均盈利: 94.85 typeA: 66.95 胜率: 70.59%
趋势多且增强-L3-1-5 总交易次数: 203 盈利: 9495.711958555972 亏损: -6933.519152665326 最大盈利: 714.46 最大亏损: -395.22 总收益: 2562.19 平均盈利: 12.62 typeA: 8.64 胜率: 68.47%
趋势多且增强-L3-1-4-1 总交易次数: 201 盈利: 18838.270776382793 亏损: -12021.993153289988 最大盈利: 1343.85 最大亏损: -1830.26 总收益: 6816.28 平均盈利: 33.91 typeA: 23.11 胜率: 68.16%
趋势多且增强-R-2-2 总交易次数: 23 盈利: 2065.323624484191 亏损: -767.6799062384537 最大盈利: 369.72 最大亏损: -277.05 总收益: 1297.64 平均盈利: 56.42 typeA: 36.80 胜率: 65.22%
趋势多且增强-L3-1-4-3 总交易次数: 373 盈利: 11702.617061006975 亏损: -11905.597701192855 最大盈利: 1173.14 最大亏损: -521.42 总收益: -202.98 平均盈利: -0.54 typeA: -0.35 胜率: 65.15%
趋势空且增强-L1-1-2 总交易次数: 36 盈利: 5917.209608990149 亏损: -3768.569829967331 最大盈利: 2068.45 最大亏损: -808.06 总收益: 2148.64 平均盈利: 59.68 typeA: 38.13 胜率: 63.89%
趋势空且增强-L2-1-3 总交易次数: 52 盈利: 13272.703127975921 亏损: -2596.9135994388025 最大盈利: 4307.54 最大亏损: -673.69 总收益: 10675.79 平均盈利: 205.30 typeA: 130.29 胜率: 63.46%
趋势多且增强-R-1-2-2 总交易次数: 72 盈利: 7413.508445869265 亏损: -4792.24720589423 最大盈利: 1403.49 最大亏损: -830.33 总收益: 2621.26 平均盈利: 36.41 typeA: 22.25 胜率: 61.11%
趋势空且增强-L2-2-3 总交易次数: 33 盈利: 3652.7727730062866 亏损: -2009.9563550656896 最大盈利: 1011.20 最大亏损: -375.86 总收益: 1642.82 平均盈利: 49.78 typeA: 30.17 胜率: 60.61%
趋势空且增强-L2-3-5 总交易次数: 175 盈利: 14167.404125153264 亏损: -12274.474129512906 最大盈利: 717.97 最大亏损: -937.86 总收益: 1892.93 平均盈利: 10.82 typeA: 6.55 胜率: 60.57%
趋势空且增强-L2-3-4 总交易次数: 299 盈利: 25098.764175017324 亏损: -19747.8835006765 最大盈利: 1290.39 最大亏损: -694.14 总收益: 5350.88 平均盈利: 17.90 typeA: 10.65 胜率: 59.53%
趋势多且增强-R-2-1 总交易次数: 88 盈利: 5846.716345149981 亏损: -4976.041594634451 最大盈利: 343.77 最大亏损: -912.30 总收益: 870.67 平均盈利: 9.89 typeA: 5.85 胜率: 59.09%
趋势多且增强-R-3-1 总交易次数: 137 盈利: 8424.948300636475 亏损: -6955.473358438449 最大盈利: 1253.97 最大亏损: -837.68 总收益: 1469.47 平均盈利: 10.73 typeA: 6.26 胜率: 58.39%
趋势多且增强-L1-2-1 总交易次数: 7 盈利: 1627.3069541363727 亏损: -350.4566031446385 最大盈利: 766.72 最大亏损: -165.71 总收益: 1276.85 平均盈利: 182.41 typeA: 104.23 胜率: 57.14%
趋势多且增强-L3-1-3 总交易次数: 135 盈利: 10604.810099708653 亏损: -4944.222465119026 最大盈利: 2591.16 最大亏损: -695.46 总收益: 5660.59 平均盈利: 41.93 typeA: 23.92 胜率: 57.04%
趋势多且增强-R-1-1-2 总交易次数: 262 盈利: 30372.021974906515 亏损: -20717.266333926524 最大盈利: 2358.53 最大亏损: -2061.77 总收益: 9654.76 平均盈利: 36.85 typeA: 20.96 胜率: 56.87%
趋势空且增强-L-4-2-3 总交易次数: 90 盈利: 7526.182259545476 亏损: -4464.4345165821605 最大盈利: 887.22 最大亏损: -347.81 总收益: 3061.75 平均盈利: 34.02 typeA: 18.52 胜率: 54.44%
趋势多且增强-L1-3-9 总交易次数: 30 盈利: 4031.4106367795 亏损: -2297.6567580523238 最大盈利: 1115.35 最大亏损: -462.86 总收益: 1733.75 平均盈利: 57.79 typeA: 30.82 胜率: 53.33%
趋势空且增强-L2-3-3 总交易次数: 307 盈利: 22018.822017443712 亏损: -20153.953419816167 最大盈利: 836.27 最大亏损: -774.78 总收益: 1864.87 平均盈利: 6.07 typeA: 3.19 胜率: 52.44%
趋势多且增强-R-3-2 总交易次数: 27 盈利: 1440.7887485268834 亏损: -566.2214381222441 最大盈利: 266.93 最大亏损: -157.60 总收益: 874.57 平均盈利: 32.39 typeA: 16.79 胜率: 51.85%
趋势多且增强-11 总交易次数: 214 盈利: 24039.351772002163 亏损: -15633.202481356244 最大盈利: 2423.17 最大亏损: -866.85 总收益: 8406.15 平均盈利: 39.28 typeA: 18.36 胜率: 46.73%
趋势多且增强-L1-1-6 总交易次数: 58 盈利: 16516.366688991056 亏损: -4446.3206242141205 最大盈利: 8558.15 最大亏损: -324.21 总收益: 12070.05 平均盈利: 208.10 typeA: 96.87 胜率: 46.55%
趋势空且增强-2 总交易次数: 127 盈利: 19248.57189279513 亏损: -13064.28687359909 最大盈利: 3130.79 最大亏损: -818.35 总收益: 6184.29 平均盈利: 48.70 typeA: 22.62 胜率: 46.46%
趋势多且增强-L1-2-2 总交易次数: 11 盈利: 10909.42298622277 亏损: -731.8088541712134 最大盈利: 7106.66 最大亏损: -315.45 总收益: 10177.61 平均盈利: 925.24 typeA: 420.52 胜率: 45.45%
趋势多且增强-L1-3-2 总交易次数: 32 盈利: 2803.6024955972202 亏损: -1274.551861631983 最大盈利: 782.62 最大亏损: -296.01 总收益: 1529.05 平均盈利: 47.78 typeA: 20.90 胜率: 43.75%
趋势空且增强-L-4-3-4 总交易次数: 505 盈利: 36721.945189328406 亏损: -43526.78711099901 最大盈利: 758.46 最大亏损: -964.93 总收益: -6804.84 平均盈利: -13.47 typeA: -5.36 胜率: 39.80%
趋势多且增强-L1-3-1 总交易次数: 42 盈利: 46413.180572114834 亏损: -2071.03552466537 最大盈利: 41166.13 最大亏损: -482.62 总收益: 44342.15 平均盈利: 1055.77 typeA: 402.25 胜率: 38.10%
趋势空且增强-L-4-2-4 总交易次数: 150 盈利: 15814.02567881845 亏损: -19684.728120074557 最大盈利: 959.93 最大亏损: -919.69 总收益: -3870.70 平均盈利: -25.80 typeA: -9.46 胜率: 36.67%
趋势空且增强-L-4-4-4 总交易次数: 11 盈利: 1090.3141472471764 亏损: -1073.0909948427895 最大盈利: 582.76 最大亏损: -837.05 总收益: 17.22 平均盈利: 1.57 typeA: 0.57 胜率: 36.36%
趋势空且增强-L-4-1-4 总交易次数: 204 盈利: 21011.432473484478 亏损: -22447.488052842393 最大盈利: 1285.54 最大亏损: -999.95 总收益: -1436.06 平均盈利: -7.04 typeA: -2.48 胜率: 35.29%
趋势空且增强-L3-1-6 总交易次数: 114 盈利: 17394.19902459019 亏损: -12334.070650405381 最大盈利: 2714.39 最大亏损: -727.25 总收益: 5060.13 平均盈利: 44.39 typeA: 15.58 胜率: 35.09%
趋势多且增强-L1-3-4 总交易次数: 207 盈利: 8839.856141687033 亏损: -9824.095760661057 最大盈利: 660.58 最大亏损: -562.16 总收益: -984.24 平均盈利: -4.75 typeA: -1.63 胜率: 34.30%
趋势多且增强-L-4-2-2 总交易次数: 17 盈利: 583.4107169203153 亏损: -301.273625489095 最大盈利: 197.33 最大亏损: -50.76 总收益: 282.14 平均盈利: 16.60 typeA: 4.88 胜率: 29.41%
趋势多且增强-L1-2-5 总交易次数: 101 盈利: 7472.658181350938 亏损: -5165.07196685779 最大盈利: 1183.30 最大亏损: -393.70 总收益: 2307.59 平均盈利: 22.85 typeA: 5.88 胜率: 25.74%
^C
root@iZj6c630isgmtl3542rbfrZ:~/web/okex-node-sdk-sample/server# git pull 
remote: Enumerating objects: 9, done.
remote: Counting objects: 100% (9/9), done.
remote: Compressing objects: 100% (5/5), done.
remote: Total 5 (delta 4), reused 0 (delta 0), pack-reused 0 (from 0)
Unpacking objects: 100% (5/5), 428 bytes | 53.00 KiB/s, done.
From https://gitee.com/pphxiong/okex-node-sdk-sample
   bb3f6b58..07dbe6fd  develop    -> origin/develop
Updating bb3f6b58..07dbe6fd
Fast-forward
 server/app/swapApiDSTest.js | 18 +++++++++---------
 1 file changed, 9 insertions(+), 9 deletions(-)
root@iZj6c630isgmtl3542rbfrZ:~/web/okex-node-sdk-sample/server# npm run start:test

> @ali/topSdk@2.0.0 start:test
> node startTest.js --env=manul

8092 server start
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     51
      胜率:          76.47%
      总收益:        59427.43 USDT
      期末余额:      69323.43 USDT
      盈亏比:        20.74
      最大单笔盈利:  41166.13
      最大单笔亏损:  -907.40
      手续费:       213.67601237338835
      =============================
    
profit: 59323.43445631406
maxDrawdown 3.8%
startTime: 2021-01-01 00:00:00
趋势多且增强-R-3-1 总交易次数: 2 盈利: 1339.199095041599 亏损: 0 最大盈利: 1253.97 最大亏损: 85.23 总收益: 1339.20 平均盈利: 669.60 typeA: 669.60 胜率: 100.00%
趋势多且增强-R-2-1 总交易次数: 1 盈利: 1699.5985299708511 亏损: 0 最大盈利: 1699.60 最大亏损: 1699.60 总收益: 1699.60 平均盈利: 1699.60 typeA: 1699.60 胜率: 100.00%
趋势多且增强-L3-1-3 总交易次数: 1 盈利: 26.27955215085412 亏损: 0 最大盈利: 26.28 最大亏损: 26.28 总收益: 26.28 平均盈利: 26.28 typeA: 26.28 胜率: 100.00%
趋势多且增强-L1-3-1 总交易次数: 1 盈利: 41166.13172492735 亏损: 0 最大盈利: 41166.13 最大亏损: 41166.13 总收益: 41166.13 平均盈利: 41166.13 typeA: 41166.13 胜率: 100.00%
趋势空且增强-L2-1-3 总交易次数: 1 盈利: 859.9070408163257 亏损: 0 最大盈利: 859.91 最大亏损: 859.91 总收益: 859.91 平均盈利: 859.91 typeA: 859.91 胜率: 100.00%
趋势空且增强-2 总交易次数: 1 盈利: 4403.101297572069 亏损: 0 最大盈利: 4403.10 最大亏损: 4403.10 总收益: 4403.10 平均盈利: 4403.10 typeA: 4403.10 胜率: 100.00%
趋势多且增强-R-1-1-2 总交易次数: 1 盈利: 748.207093608299 亏损: 0 最大盈利: 748.21 最大亏损: 748.21 总收益: 748.21 平均盈利: 748.21 typeA: 748.21 胜率: 100.00%
趋势空且增强-11 总交易次数: 1 盈利: 610.3596563936394 亏损: 0 最大盈利: 610.36 最大亏损: 610.36 总收益: 610.36 平均盈利: 610.36 typeA: 610.36 胜率: 100.00%
趋势多且增强-L1-2-5 总交易次数: 1 盈利: 1027.778426791277 亏损: 0 最大盈利: 1027.78 最大亏损: 1027.78 总收益: 1027.78 平均盈利: 1027.78 typeA: 1027.78 胜率: 100.00%
趋势空且增强-L2-3-3 总交易次数: 13 盈利: 3646.739499287422 亏损: -515.4075996886476 最大盈利: 1862.45 最大亏损: -385.36 总收益: 3131.33 平均盈利: 240.87 typeA: 203.83 胜率: 84.62%
趋势多且增强-L3-1-4-3 总交易次数: 10 盈利: 3787.1674194338375 亏损: -247.7492055324964 最大盈利: 2081.23 最大亏损: -212.05 总收益: 3539.42 平均盈利: 353.94 typeA: 283.15 胜率: 80.00%
趋势空且增强-L2-3-4 总交易次数: 6 盈利: 744.7335646832167 亏损: -601.4613034593362 最大盈利: 277.55 最大亏损: -579.49 总收益: 143.27 平均盈利: 23.88 typeA: 15.92 胜率: 66.67%
趋势空且增强-L2-3-5 总交易次数: 3 盈利: 1367.9408716382777 亏损: -95.04186046511651 最大盈利: 1298.29 最大亏损: -95.04 总收益: 1272.90 平均盈利: 424.30 typeA: 282.88 胜率: 66.67%
趋势多且增强-L3-1-5 总交易次数: 5 盈利: 761.6665706684764 亏损: -367.7120754032773 最大盈利: 603.78 最大亏损: -346.55 总收益: 393.95 平均盈利: 78.79 typeA: 47.27 胜率: 60.00%
趋势空且增强-L3-1-6 总交易次数: 2 盈利: 249.31204739960504 亏损: -143.54320844449668 最大盈利: 249.31 最大亏损: -143.54 总收益: 105.77 平均盈利: 52.88 typeA: 26.44 胜率: 50.00%
趋势多且增强-L3-1-4-1 总交易次数: 1 盈利: 0 亏损: -132.37763486959653 最大盈利: -132.38 最大亏损: -132.38 总收益: -132.38 平均盈利: -132.38 typeA: 0.00 胜率: 0.00%
趋势多且增强-11 总交易次数: 1 盈利: 0 亏损: -907.3950462060732 最大盈利: -907.40 最大亏损: -907.40 总收益: -907.40 平均盈利: -907.40 typeA: 0.00 胜率: 0.00%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     66
      胜率:          60.61%
      总收益:        6837.74 USDT
      期末余额:      16703.74 USDT
      盈亏比:        1.80
      最大单笔盈利:  3125.26
      最大单笔亏损:  -1830.26
      手续费:       266.8715614770235
      =============================
    
profit: 6703.735921330655
maxDrawdown 21.2%
startTime: 2021-01-31 00:00:00
趋势多且增强-L1-2-5 总交易次数: 1 盈利: 1027.778426791277 亏损: 0 最大盈利: 1027.78 最大亏损: 1027.78 总收益: 1027.78 平均盈利: 1027.78 typeA: 1027.78 胜率: 100.00%
趋势多且增强-L1-2-2 总交易次数: 1 盈利: 3125.2588546929187 亏损: 0 最大盈利: 3125.26 最大亏损: 3125.26 总收益: 3125.26 平均盈利: 3125.26 typeA: 3125.26 胜率: 100.00%
趋势空且增强-L2-2-3 总交易次数: 2 盈利: 207.0650945684061 亏损: 0 最大盈利: 176.55 最大亏损: 30.51 总收益: 207.07 平均盈利: 103.53 typeA: 103.53 胜率: 100.00%
趋势多且增强-L1-3-9 总交易次数: 2 盈利: 1620.963021440421 亏损: 0 最大盈利: 1115.35 最大亏损: 505.61 总收益: 1620.96 平均盈利: 810.48 typeA: 810.48 胜率: 100.00%
趋势空且增强-L2-1-3 总交易次数: 3 盈利: 447.82261302013075 亏损: 0 最大盈利: 217.40 最大亏损: 49.90 总收益: 447.82 平均盈利: 149.27 typeA: 149.27 胜率: 100.00%
趋势多且增强-R-1-2-2 总交易次数: 1 盈利: 187.52745282213303 亏损: 0 最大盈利: 187.53 最大亏损: 187.53 总收益: 187.53 平均盈利: 187.53 typeA: 187.53 胜率: 100.00%
趋势多且增强-L1-3-2 总交易次数: 1 盈利: 110.59676367731632 亏损: 0 最大盈利: 110.60 最大亏损: 110.60 总收益: 110.60 平均盈利: 110.60 typeA: 110.60 胜率: 100.00%
趋势多且增强-L3-1-4-1 总交易次数: 5 盈利: 1147.5440184226889 亏损: -1830.2636752207823 最大盈利: 391.77 最大亏损: -1830.26 总收益: -682.72 平均盈利: -136.54 typeA: -109.24 胜率: 80.00%
趋势空且增强-L2-3-5 总交易次数: 4 盈利: 713.4414655902629 亏损: -511.18683258000095 最大盈利: 371.89 最大亏损: -511.19 总收益: 202.25 平均盈利: 50.56 typeA: 37.92 胜率: 75.00%
趋势多且增强-L3-1-4-3 总交易次数: 4 盈利: 214.1037450415048 亏损: -141.77322013293826 最大盈利: 105.07 最大亏损: -141.77 总收益: 72.33 平均盈利: 18.08 typeA: 13.56 胜率: 75.00%
趋势空且增强-L2-3-4 总交易次数: 8 盈利: 1141.6870742044189 亏损: -815.6076844269513 最大盈利: 688.10 最大亏损: -647.04 总收益: 326.08 平均盈利: 40.76 typeA: 25.47 胜率: 62.50%
趋势空且增强-11 总交易次数: 5 盈利: 534.269996197823 亏损: -712.1297673344837 最大盈利: 252.80 最大亏损: -572.34 总收益: -177.86 平均盈利: -35.57 typeA: -21.34 胜率: 60.00%
趋势多且增强-L3-1-3 总交易次数: 2 盈利: 314.6232981156729 亏损: -5.738168999038598 最大盈利: 314.62 最大亏损: -5.74 总收益: 308.89 平均盈利: 154.44 typeA: 77.22 胜率: 50.00%
趋势多且增强-L1-3-4 总交易次数: 4 盈利: 1246.8132205803188 亏损: -277.4218306864636 最大盈利: 868.82 最大亏损: -238.28 总收益: 969.39 平均盈利: 242.35 typeA: 121.17 胜率: 50.00%
趋势空且增强-2 总交易次数: 6 盈利: 2317.7291914528905 亏损: -975.5920109116896 最大盈利: 1750.26 最大亏损: -720.61 总收益: 1342.14 平均盈利: 223.69 typeA: 111.84 胜率: 50.00%
趋势多且增强-R-2-1 总交易次数: 4 盈利: 325.031645752954 亏损: -214.55557243800789 最大盈利: 175.18 最大亏损: -172.02 总收益: 110.48 平均盈利: 27.62 typeA: 13.81 胜率: 50.00%
趋势多且增强-L3-1-5 总交易次数: 2 盈利: 16.347789132072144 亏损: -2.692358297843565 最大盈利: 16.35 最大亏损: -2.69 总收益: 13.66 平均盈利: 6.83 typeA: 3.41 胜率: 50.00%
趋势多且增强-L1-3-1 总交易次数: 2 盈利: 429.99408108907915 亏损: -79.40413449360571 最大盈利: 429.99 最大亏损: -79.40 总收益: 350.59 平均盈利: 175.29 typeA: 87.65 胜率: 50.00%
趋势多且增强-R-1-1-2 总交易次数: 3 盈利: 211.99362530511922 亏损: -568.4589181007295 最大盈利: 211.99 最大亏损: -317.10 总收益: -356.47 平均盈利: -118.82 typeA: -39.60 胜率: 33.33%
趋势多且增强-11 总交易次数: 4 盈利: 0 亏损: -1267.1934720181869 最大盈利: -6.28 最大亏损: -907.40 总收益: -1267.19 平均盈利: -316.80 typeA: 0.00 胜率: 0.00%
趋势空且增强-L1-1-2 总交易次数: 1 盈利: 0 亏损: -808.0563264081609 最大盈利: -808.06 最大亏损: -808.06 总收益: -808.06 平均盈利: -808.06 typeA: 0.00 胜率: 0.00%
趋势空且增强-L2-3-3 总交易次数: 1 盈利: 0 亏损: -292.7814845178776 最大盈利: -292.78 最大亏损: -292.78 总收益: -292.78 平均盈利: -292.78 typeA: 0.00 胜率: 0.00%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     54
      胜率:          70.37%
      总收益:        3144.59 USDT
      期末余额:      13036.59 USDT
      盈亏比:        2.50
      最大单笔盈利:  1285.64
      最大单笔亏损:  -418.12
      手续费:       216.18092242608284
      =============================
    
profit: 3036.5858263050486
maxDrawdown 5.6%
startTime: 2021-03-02 00:00:00
趋势多且增强-L3-1-4-1 总交易次数: 2 盈利: 319.4632160244804 亏损: 0 最大盈利: 293.26 最大亏损: 26.21 总收益: 319.46 平均盈利: 159.73 typeA: 159.73 胜率: 100.00%
趋势空且增强-L-4-2-3 总交易次数: 5 盈利: 335.2014377338139 亏损: 0 最大盈利: 106.69 最大亏损: 17.56 总收益: 335.20 平均盈利: 67.04 typeA: 67.04 胜率: 100.00%
趋势空且增强-L2-3-3 总交易次数: 4 盈利: 176.49810405183823 亏损: 0 最大盈利: 57.18 最大亏损: 32.06 总收益: 176.50 平均盈利: 44.12 typeA: 44.12 胜率: 100.00%
趋势多且增强-L1-3-2 总交易次数: 1 盈利: 633.3127783964358 亏损: 0 最大盈利: 633.31 最大亏损: 633.31 总收益: 633.31 平均盈利: 633.31 typeA: 633.31 胜率: 100.00%
趋势多且增强-L3-1-4-3 总交易次数: 11 盈利: 371.32571351721356 亏损: -273.6807621161669 最大盈利: 191.89 最大亏损: -273.68 总收益: 97.64 平均盈利: 8.88 typeA: 8.07 胜率: 90.91%
趋势空且增强-L2-3-5 总交易次数: 6 盈利: 115.7548344119622 亏损: -63.28332162921386 最大盈利: 50.97 最大亏损: -63.28 总收益: 52.47 平均盈利: 8.75 typeA: 7.29 胜率: 83.33%
趋势多且增强-R-3-1 总交易次数: 6 盈利: 681.8047413563766 亏损: -571.5914230777005 最大盈利: 325.93 最大亏损: -301.10 总收益: 110.21 平均盈利: 18.37 typeA: 12.25 胜率: 66.67%
趋势空且增强-L2-3-4 总交易次数: 5 盈利: 375.69762578017037 亏损: -152.71528971339143 最大盈利: 222.73 最大亏损: -107.32 总收益: 222.98 平均盈利: 44.60 typeA: 26.76 胜率: 60.00%
趋势空且增强-11 总交易次数: 2 盈利: 119.69335068879488 亏损: -220.95708492221934 最大盈利: 119.69 最大亏损: -220.96 总收益: -101.26 平均盈利: -50.63 typeA: -25.32 胜率: 50.00%
趋势空且增强-L3-1-6 总交易次数: 2 盈利: 475.1441725603902 亏损: -34.72170434165655 最大盈利: 475.14 最大亏损: -34.72 总收益: 440.42 平均盈利: 220.21 typeA: 110.11 胜率: 50.00%
趋势多且增强-L1-3-4 总交易次数: 2 盈利: 357.7827665896341 亏损: -12.248052480524388 最大盈利: 357.78 最大亏损: -12.25 总收益: 345.53 平均盈利: 172.77 typeA: 86.38 胜率: 50.00%
趋势多且增强-L3-1-3 总交易次数: 4 盈利: 1285.6352296702078 亏损: -520.2131071792185 最大盈利: 1285.64 最大亏损: -418.12 总收益: 765.42 平均盈利: 191.36 typeA: 47.84 胜率: 25.00%
趋势多且增强-11 总交易次数: 2 盈利: 0 亏损: -228.3072762107749 最大盈利: -113.87 最大亏损: -114.44 总收益: -228.31 平均盈利: -114.15 typeA: 0.00 胜率: 0.00%
趋势多且增强-L3-1-5 总交易次数: 2 盈利: 0 亏损: -25.010122805403938 最大盈利: -10.44 最大亏损: -14.57 总收益: -25.01 平均盈利: -12.51 typeA: 0.00 胜率: 0.00%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     76
      胜率:          52.63%
      总收益:        37945.60 USDT
      期末余额:      47793.60 USDT
      盈亏比:        6.37
      最大单笔盈利:  8558.15
      最大单笔亏损:  -754.03
      手续费:       308.06694942821593
      =============================
    
profit: 37793.60351135087
maxDrawdown 17.4%
startTime: 2021-04-01 00:00:00
趋势空且增强-11 总交易次数: 1 盈利: 311.9625620915039 亏损: 0 最大盈利: 311.96 最大亏损: 311.96 总收益: 311.96 平均盈利: 311.96 typeA: 311.96 胜率: 100.00%
趋势多且增强-L1-2-2 总交易次数: 1 盈利: 7106.6643783272675 亏损: 0 最大盈利: 7106.66 最大亏损: 7106.66 总收益: 7106.66 平均盈利: 7106.66 typeA: 7106.66 胜率: 100.00%
趋势空且增强-L1-1-2 总交易次数: 3 盈利: 2529.655163571467 亏损: 0 最大盈利: 2068.45 最大亏损: 5.19 总收益: 2529.66 平均盈利: 843.22 typeA: 843.22 胜率: 100.00%
趋势多且增强-L3-1-5 总交易次数: 1 盈利: 866.1467440259388 亏损: 0 最大盈利: 866.15 最大亏损: 866.15 总收益: 866.15 平均盈利: 866.15 typeA: 866.15 胜率: 100.00%
趋势多且增强-L3-1-4-1 总交易次数: 7 盈利: 1638.7468228064702 亏损: -0.5262382075477414 最大盈利: 632.65 最大亏损: -0.53 总收益: 1638.22 平均盈利: 234.03 typeA: 200.59 胜率: 85.71%
趋势空且增强-2 总交易次数: 13 盈利: 9527.318525558878 亏损: -941.2490187093669 最大盈利: 3130.79 最大亏损: -690.41 总收益: 8586.07 平均盈利: 660.47 typeA: 508.03 胜率: 76.92%
趋势多且增强-R-1-1-2 总交易次数: 7 盈利: 7572.705722995651 亏损: -275.6047071660821 最大盈利: 2358.53 最大亏损: -188.01 总收益: 7297.10 平均盈利: 1042.44 typeA: 744.62 胜率: 71.43%
趋势多且增强-L3-1-4-3 总交易次数: 3 盈利: 1729.9968632633445 亏损: -19.239509262365814 最大盈利: 1285.64 最大亏损: -19.24 总收益: 1710.76 平均盈利: 570.25 typeA: 380.19 胜率: 66.67%
趋势多且增强-L1-1-6 总交易次数: 7 盈利: 10120.126178091934 亏损: -745.8424153503765 最大盈利: 8558.15 最大亏损: -274.27 总收益: 9374.28 平均盈利: 1339.18 typeA: 765.21 胜率: 57.14%
趋势多且增强-L3-1-3 总交易次数: 2 盈利: 2591.160619748811 亏损: -28.055393939394772 最大盈利: 2591.16 最大亏损: -28.06 总收益: 2563.11 平均盈利: 1281.55 typeA: 640.78 胜率: 50.00%
趋势多且增强-L1-2-5 总交易次数: 4 盈利: 194.27835895824762 亏损: -352.3646458781369 最大盈利: 175.98 最大亏损: -300.52 总收益: -158.09 平均盈利: -39.52 typeA: -19.76 胜率: 50.00%
趋势空且增强-L2-3-3 总交易次数: 5 盈利: 296.516514243012 亏损: -911.0060320015883 最大盈利: 231.99 最大亏损: -537.67 总收益: -614.49 平均盈利: -122.90 typeA: -49.16 胜率: 40.00%
趋势多且增强-L1-3-9 总交易次数: 3 盈利: 429.40364993338966 亏损: -62.935266651722806 最大盈利: 429.40 最大亏损: -48.34 总收益: 366.47 平均盈利: 122.16 typeA: 40.71 胜率: 33.33%
趋势多且增强-L1-3-4 总交易次数: 4 盈利: 91.14953794031875 亏损: -259.43628273436616 最大盈利: 91.15 最大亏损: -185.87 总收益: -168.29 平均盈利: -42.07 typeA: -10.52 胜率: 25.00%
趋势多且增强-R-3-2 总交易次数: 1 盈利: 0 亏损: -53.812430273148706 最大盈利: -53.81 最大亏损: -53.81 总收益: -53.81 平均盈利: -53.81 typeA: 0.00 胜率: 0.00%
趋势空且增强-L2-3-4 总交易次数: 1 盈利: 0 亏损: -47.22765901293223 最大盈利: -47.23 最大亏损: -47.23 总收益: -47.23 平均盈利: -47.23 typeA: 0.00 胜率: 0.00%
趋势多且增强-11 总交易次数: 3 盈利: 0 亏损: -1105.4203021036587 最大盈利: -56.90 最大亏损: -754.03 总收益: -1105.42 平均盈利: -368.47 typeA: 0.00 胜率: 0.00%
趋势多且增强-L1-3-2 总交易次数: 2 盈利: 0 亏损: -232.71219641385258 最大盈利: -40.20 最大亏损: -192.51 总收益: -232.71 平均盈利: -116.36 typeA: 0.00 胜率: 0.00%
趋势空且增强-L-4-2-3 总交易次数: 1 盈利: 0 亏损: -586.536618098161 最大盈利: -586.54 最大亏损: -586.54 总收益: -586.54 平均盈利: -586.54 typeA: 0.00 胜率: 0.00%
趋势空且增强-L3-1-6 总交易次数: 2 盈利: 0 亏损: -887.7156467802707 最大盈利: -160.46 最大亏损: -727.25 总收益: -887.72 平均盈利: -443.86 typeA: 0.00 胜率: 0.00%
趋势空且增强-L2-3-5 总交易次数: 1 盈利: 0 亏损: -172.78728800915155 最大盈利: -172.79 最大亏损: -172.79 总收益: -172.79 平均盈利: -172.79 typeA: 0.00 胜率: 0.00%
趋势空且增强-L2-2-3 总交易次数: 1 盈利: 0 亏损: -105.83588853533904 最大盈利: -105.84 最大亏损: -105.84 总收益: -105.84 平均盈利: -105.84 typeA: 0.00 胜率: 0.00%
趋势多且增强-L1-3-1 总交易次数: 2 盈利: 0 亏损: -86.06432894145084 最大盈利: -9.96 最大亏损: -76.11 总收益: -86.06 平均盈利: -43.03 typeA: 0.00 胜率: 0.00%
趋势空且增强-L2-1-3 总交易次数: 1 盈利: 0 亏损: -185.8562621364377 最大盈利: -185.86 最大亏损: -185.86 总收益: -185.86 平均盈利: -185.86 typeA: 0.00 胜率: 0.00%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     87
      胜率:          60.92%
      总收益:        12994.66 USDT
      期末余额:      22820.66 USDT
      盈亏比:        2.59
      最大单笔盈利:  1403.49
      最大单笔亏损:  -904.79
      手续费:       348.9910475047013
      =============================
    
profit: 12820.661034047767
maxDrawdown 6.5%
startTime: 2021-05-01 00:00:00
趋势空且增强-11 总交易次数: 3 盈利: 1663.2595372969854 亏损: 0 最大盈利: 892.06 最大亏损: 298.27 总收益: 1663.26 平均盈利: 554.42 typeA: 554.42 胜率: 100.00%
趋势空且增强-L2-1-3 总交易次数: 4 盈利: 959.0699653134435 亏损: 0 最大盈利: 436.97 最大亏损: 82.72 总收益: 959.07 平均盈利: 239.77 typeA: 239.77 胜率: 100.00%
趋势空且增强-L2-2-3 总交易次数: 1 盈利: 1.7971556230476005 亏损: 0 最大盈利: 1.80 最大亏损: 1.80 总收益: 1.80 平均盈利: 1.80 typeA: 1.80 胜率: 100.00%
趋势多且增强-L3-1-4-3 总交易次数: 1 盈利: 3.8424179463025663 亏损: 0 最大盈利: 3.84 最大亏损: 3.84 总收益: 3.84 平均盈利: 3.84 typeA: 3.84 胜率: 100.00%
趋势空且增强-2 总交易次数: 14 盈利: 2487.2441978034562 亏损: -1292.2834636364814 最大盈利: 867.74 最大亏损: -659.30 总收益: 1194.96 平均盈利: 85.35 typeA: 67.06 胜率: 78.57%
趋势多且增强-L3-1-5 总交易次数: 4 盈利: 1622.6102224141011 亏损: -116.01091770922451 最大盈利: 1373.52 最大亏损: -116.01 总收益: 1506.60 平均盈利: 376.65 typeA: 282.49 胜率: 75.00%
趋势空且增强-L2-3-3 总交易次数: 6 盈利: 825.1547824526999 亏损: -353.42997568224587 最大盈利: 462.16 最大亏损: -219.22 总收益: 471.72 平均盈利: 78.62 typeA: 52.42 胜率: 66.67%
趋势多且增强-R-1-1-1 总交易次数: 3 盈利: 632.2413296191328 亏损: -1.7791717283266706 最大盈利: 563.84 最大亏损: -1.78 总收益: 630.46 平均盈利: 210.15 typeA: 140.11 胜率: 66.67%
趋势多且增强-R-1-2-2 总交易次数: 3 盈利: 2544.2751812680026 亏损: -76.3661311686997 最大盈利: 1403.49 最大亏损: -76.37 总收益: 2467.91 平均盈利: 822.64 typeA: 548.45 胜率: 66.67%
趋势多且增强-L1-1-6 总交易次数: 11 盈利: 2997.552339929313 亏损: -747.6297288396213 最大盈利: 963.19 最大亏损: -285.49 总收益: 2249.92 平均盈利: 204.54 typeA: 111.58 胜率: 54.55%
趋势多且增强-L3-1-4-1 总交易次数: 12 盈利: 2911.4451803007237 亏损: -1751.4135361041028 最大盈利: 975.29 最大亏损: -904.79 总收益: 1160.03 平均盈利: 96.67 typeA: 48.33 胜率: 50.00%
趋势空且增强-L2-3-4 总交易次数: 4 盈利: 706.0097978253963 亏损: -360.15201942987517 最大盈利: 544.81 最大亏损: -194.05 总收益: 345.86 平均盈利: 86.46 typeA: 43.23 胜率: 50.00%
趋势多且增强-R-1-1-2 总交易次数: 8 盈利: 1449.53365896394 亏损: -1610.1671086257297 最大盈利: 1006.97 最大亏损: -602.56 总收益: -160.63 平均盈利: -20.08 typeA: -10.04 胜率: 50.00%
趋势多且增强-L3-1-3 总交易次数: 2 盈利: 266.7041146287154 亏损: -71.69467625326254 最大盈利: 266.70 最大亏损: -71.69 总收益: 195.01 平均盈利: 97.50 typeA: 48.75 胜率: 50.00%
趋势空且增强-L1-1-2 总交易次数: 2 盈利: 165.66500103708924 亏损: -39.039208480564746 最大盈利: 165.67 最大亏损: -39.04 总收益: 126.63 平均盈利: 63.31 typeA: 31.66 胜率: 50.00%
趋势多且增强-L1-2-5 总交易次数: 2 盈利: 1183.2986955803844 亏损: -76.7170998721672 最大盈利: 1183.30 最大亏损: -76.72 总收益: 1106.58 平均盈利: 553.29 typeA: 276.65 胜率: 50.00%
趋势多且增强-11 总交易次数: 3 盈利: 747.8384603505887 亏损: -520.6358999366578 最大盈利: 747.84 最大亏损: -282.42 总收益: 227.20 平均盈利: 75.73 typeA: 25.24 胜率: 33.33%
趋势空且增强-L2-3-5 总交易次数: 1 盈利: 0 亏损: -113.28862517727524 最大盈利: -113.29 最大亏损: -113.29 总收益: -113.29 平均盈利: -113.29 typeA: 0.00 胜率: 0.00%
趋势空且增强-L3-1-6 总交易次数: 2 盈利: 0 亏损: -615.9784244666224 最大盈利: -235.62 最大亏损: -380.36 总收益: -615.98 平均盈利: -307.99 typeA: 0.00 胜率: 0.00%
趋势多且增强-L1-3-9 总交易次数: 1 盈利: 0 亏损: -426.29501719470187 最大盈利: -426.30 最大亏损: -426.30 总收益: -426.30 平均盈利: -426.30 typeA: 0.00 胜率: 0.00%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     90
      胜率:          55.56%
      总收益:        2312.04 USDT
      期末余额:      12130.04 USDT
      盈亏比:        1.29
      最大单笔盈利:  2423.17
      最大单笔亏损:  -1818.29
      手续费:       361.6176888633663
      =============================
    
profit: 2130.0396870298264
maxDrawdown 24.6%
startTime: 2021-05-31 00:00:00
趋势多且增强-L3-1-4-3 总交易次数: 1 盈利: 3.8424179463025663 亏损: 0 最大盈利: 3.84 最大亏损: 3.84 总收益: 3.84 平均盈利: 3.84 typeA: 3.84 胜率: 100.00%
趋势空且增强-L1-1-2 总交易次数: 3 盈利: 459.6346747737031 亏损: 0 最大盈利: 179.73 最大亏损: 108.57 总收益: 459.63 平均盈利: 153.21 typeA: 153.21 胜率: 100.00%
趋势多且增强-R-1-2-2 总交易次数: 2 盈利: 262.5951226750388 亏损: 0 最大盈利: 216.85 最大亏损: 45.74 总收益: 262.60 平均盈利: 131.30 typeA: 131.30 胜率: 100.00%
趋势空且增强-L2-1-3 总交易次数: 3 盈利: 309.5589907973954 亏损: 0 最大盈利: 162.14 最大亏损: 11.03 总收益: 309.56 平均盈利: 103.19 typeA: 103.19 胜率: 100.00%
趋势多且增强-L3-1-5 总交易次数: 2 盈利: 193.1171341293117 亏损: 0 最大盈利: 125.93 最大亏损: 67.18 总收益: 193.12 平均盈利: 96.56 typeA: 96.56 胜率: 100.00%
趋势空且增强-L2-3-4 总交易次数: 3 盈利: 625.4418587944054 亏损: 0 最大盈利: 563.08 最大亏损: 11.00 总收益: 625.44 平均盈利: 208.48 typeA: 208.48 胜率: 100.00%
趋势空且增强-L2-2-3 总交易次数: 1 盈利: 4.381879087574844 亏损: 0 最大盈利: 4.38 最大亏损: 4.38 总收益: 4.38 平均盈利: 4.38 typeA: 4.38 胜率: 100.00%
趋势空且增强-L2-3-3 总交易次数: 4 盈利: 879.6865310311239 亏损: -66.33927586840558 最大盈利: 552.98 最大亏损: -66.34 总收益: 813.35 平均盈利: 203.34 typeA: 152.50 胜率: 75.00%
趋势多且增强-L3-1-3 总交易次数: 3 盈利: 381.1762799744609 亏损: -113.59075205952728 最大盈利: 280.52 最大亏损: -113.59 总收益: 267.59 平均盈利: 89.20 typeA: 59.47 胜率: 66.67%
趋势多且增强-11 总交易次数: 6 盈利: 2909.220094096537 亏损: -161.2687885445589 最大盈利: 2423.17 最大亏损: -119.67 总收益: 2747.95 平均盈利: 457.99 typeA: 305.34 胜率: 66.67%
趋势空且增强-11 总交易次数: 6 盈利: 127.97841420120385 亏损: -1121.167285591799 最大盈利: 70.69 最大亏损: -633.65 总收益: -993.19 平均盈利: -165.53 typeA: -110.36 胜率: 66.67%
趋势空且增强-2 总交易次数: 17 盈利: 2470.3860727800443 亏损: -1427.4480648295416 最大盈利: 756.36 最大亏损: -818.35 总收益: 1042.94 平均盈利: 61.35 typeA: 36.09 胜率: 58.82%
趋势多且增强-L1-3-9 总交易次数: 4 盈利: 540.0976045349489 亏损: -163.93388491024635 最大盈利: 352.37 最大亏损: -99.31 总收益: 376.16 平均盈利: 94.04 typeA: 47.02 胜率: 50.00%
趋势多且增强-R-1-1-2 总交易次数: 12 盈利: 695.2842044145727 亏损: -2513.7332524199232 最大盈利: 328.83 最大亏损: -1818.29 总收益: -1818.45 平均盈利: -151.54 typeA: -75.77 胜率: 50.00%
趋势多且增强-L3-1-4-1 总交易次数: 8 盈利: 21.521162650317173 亏损: -990.2855077622077 最大盈利: 15.84 最大亏损: -635.08 总收益: -968.76 平均盈利: -121.10 typeA: -30.27 胜率: 25.00%
趋势多且增强-L1-2-5 总交易次数: 5 盈利: 279.17092768444064 亏损: -229.3288596258557 最大盈利: 279.17 最大亏损: -80.66 总收益: 49.84 平均盈利: 9.97 typeA: 1.99 胜率: 20.00%
趋势多且增强-L1-1-6 总交易次数: 5 盈利: 9.385322648671128 亏损: -616.2779007263587 最大盈利: 9.39 最大亏损: -324.21 总收益: -606.89 平均盈利: -121.38 typeA: -24.28 胜率: 20.00%
趋势多且增强-R-1-1-1 总交易次数: 2 盈利: 0 亏损: -212.43861365874162 最大盈利: -4.23 最大亏损: -208.20 总收益: -212.44 平均盈利: -106.22 typeA: 0.00 胜率: 0.00%
趋势多且增强-L1-3-4 总交易次数: 2 盈利: 0 亏损: -108.5598748538 最大盈利: -14.64 最大亏损: -93.92 总收益: -108.56 平均盈利: -54.28 typeA: 0.00 胜率: 0.00%
趋势空且增强-L3-1-6 总交易次数: 1 盈利: 0 亏损: -136.06694433926498 最大盈利: -136.07 最大亏损: -136.07 总收益: -136.07 平均盈利: -136.07 typeA: 0.00 胜率: 0.00%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     101
      胜率:          59.41%
      总收益:        3147.06 USDT
      期末余额:      12945.06 USDT
      盈亏比:        1.53
      最大单笔盈利:  771.86
      最大单笔亏损:  -542.23
      手续费:       403.4465695243354
      =============================
    
profit: 2945.063941061151
maxDrawdown 7.2%
startTime: 2021-06-30 00:00:00
趋势空且增强-L-4-2-3 总交易次数: 2 盈利: 36.15011702632993 亏损: 0 最大盈利: 19.31 最大亏损: 16.84 总收益: 36.15 平均盈利: 18.08 typeA: 18.08 胜率: 100.00%
趋势空且增强-L2-3-5 总交易次数: 2 盈利: 482.402541552568 亏损: 0 最大盈利: 480.99 最大亏损: 1.42 总收益: 482.40 平均盈利: 241.20 typeA: 241.20 胜率: 100.00%
趋势多且增强-L3-1-4-3 总交易次数: 1 盈利: 9.930787589498912 亏损: 0 最大盈利: 9.93 最大亏损: 9.93 总收益: 9.93 平均盈利: 9.93 typeA: 9.93 胜率: 100.00%
趋势空且增强-L1-1-2 总交易次数: 1 盈利: 252.851167618059 亏损: 0 最大盈利: 252.85 最大亏损: 252.85 总收益: 252.85 平均盈利: 252.85 typeA: 252.85 胜率: 100.00%
趋势空且增强-L2-3-4 总交易次数: 7 盈利: 1110.3525781666206 亏损: -298.17830940988944 最大盈利: 451.44 最大亏损: -298.18 总收益: 812.17 平均盈利: 116.02 typeA: 99.44 胜率: 85.71%
趋势空且增强-L2-1-3 总交易次数: 6 盈利: 545.6182981218296 亏损: -8.562453866972586 最大盈利: 290.22 最大亏损: -8.56 总收益: 537.06 平均盈利: 89.51 typeA: 74.59 胜率: 83.33%
趋势空且增强-11 总交易次数: 6 盈利: 1015.5347859231383 亏损: -293.3681320932521 最大盈利: 390.00 最大亏损: -293.37 总收益: 722.17 平均盈利: 120.36 typeA: 100.30 胜率: 83.33%
趋势多且增强-R-1-1-2 总交易次数: 15 盈利: 1016.9804829782428 亏损: -653.5450517744189 最大盈利: 328.83 最大亏损: -250.84 总收益: 363.44 平均盈利: 24.23 typeA: 16.15 胜率: 66.67%
趋势多且增强-11 总交易次数: 6 盈利: 622.0896435050814 亏损: -472.3076774876502 最大盈利: 348.99 最大亏损: -344.89 总收益: 149.78 平均盈利: 24.96 typeA: 16.64 胜率: 66.67%
趋势多且增强-L3-1-4-1 总交易次数: 12 盈利: 456.71955421637483 亏损: -310.9417283860326 最大盈利: 234.77 最大亏损: -104.41 总收益: 145.78 平均盈利: 12.15 typeA: 8.10 胜率: 66.67%
趋势多且增强-R-1-1-1 总交易次数: 3 盈利: 289.20759610260643 亏损: -209.27999640223075 最大盈利: 241.97 最大亏损: -209.28 总收益: 79.93 平均盈利: 26.64 typeA: 17.76 胜率: 66.67%
趋势多且增强-L3-1-3 总交易次数: 3 盈利: 815.642843132606 亏损: -33.3431167651066 最大盈利: 654.93 最大亏损: -33.34 总收益: 782.30 平均盈利: 260.77 typeA: 173.85 胜率: 66.67%
趋势空且增强-L2-3-3 总交易次数: 4 盈利: 489.0521546850005 亏损: -239.2726862175346 最大盈利: 390.56 最大亏损: -172.06 总收益: 249.78 平均盈利: 62.44 typeA: 31.22 胜率: 50.00%
趋势空且增强-2 总交易次数: 6 盈利: 799.1062465374366 亏损: -778.8541643298632 最大盈利: 771.86 最大亏损: -542.23 总收益: 20.25 平均盈利: 3.38 typeA: 1.69 胜率: 50.00%
趋势多且增强-L1-3-4 总交易次数: 7 盈利: 571.688302350964 亏损: -292.60247353077324 最大盈利: 316.68 最大亏损: -91.98 总收益: 279.09 平均盈利: 39.87 typeA: 17.09 胜率: 42.86%
趋势多且增强-L3-1-5 总交易次数: 5 盈利: 106.02330196154 亏损: -703.1984788388248 最大盈利: 99.16 最大亏损: -333.66 总收益: -597.18 平均盈利: -119.44 typeA: -47.77 胜率: 40.00%
趋势空且增强-L3-1-6 总交易次数: 7 盈利: 463.7470656585755 亏损: -595.4358098564626 最大盈利: 342.48 最大亏损: -213.19 总收益: -131.69 平均盈利: -18.81 typeA: -5.37 胜率: 28.57%
趋势多且增强-L1-1-6 总交易次数: 2 盈利: 0 亏损: -380.4736979853717 最大盈利: -153.95 最大亏损: -226.52 总收益: -380.47 平均盈利: -190.24 typeA: 0.00 胜率: 0.00%
趋势多且增强-R-2-2 总交易次数: 1 盈利: 0 亏损: -106.89059221513212 最大盈利: -106.89 最大亏损: -106.89 总收益: -106.89 平均盈利: -106.89 typeA: 0.00 胜率: 0.00%
趋势空且增强-L2-2-3 总交易次数: 1 盈利: 0 亏损: -6.7003887725893545 最大盈利: -6.70 最大亏损: -6.70 总收益: -6.70 平均盈利: -6.70 typeA: 0.00 胜率: 0.00%
趋势多且增强-L1-2-5 总交易次数: 1 盈利: 0 亏损: -164.35338041473625 最大盈利: -164.35 最大亏损: -164.35 总收益: -164.35 平均盈利: -164.35 typeA: 0.00 胜率: 0.00%
趋势多且增强-L1-3-9 总交易次数: 1 盈利: 0 亏损: -204.87663921225771 最大盈利: -204.88 最大亏损: -204.88 总收益: -204.88 平均盈利: -204.88 typeA: 0.00 胜率: 0.00%
趋势多且增强-L1-3-1 总交易次数: 1 盈利: 0 亏损: -5.238293540626248 最大盈利: -5.24 最大亏损: -5.24 总收益: -5.24 平均盈利: -5.24 typeA: 0.00 胜率: 0.00%
趋势多且增强-R-2-1 总交易次数: 1 盈利: 0 亏损: -178.6104549655951 最大盈利: -178.61 最大亏损: -178.61 总收益: -178.61 平均盈利: -178.61 typeA: 0.00 胜率: 0.00%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     78
      胜率:          55.13%
      总收益:        3493.64 USDT
      期末余额:      13335.64 USDT
      盈亏比:        1.49
      最大单笔盈利:  1855.48
      最大单笔亏损:  -813.44
      手续费:       314.88622085004874
      =============================
    
profit: 3335.63838425016
maxDrawdown 14.4%
startTime: 2021-07-30 00:00:00
趋势多且增强-R-1-1-1 总交易次数: 1 盈利: 241.9654610290366 亏损: 0 最大盈利: 241.97 最大亏损: 241.97 总收益: 241.97 平均盈利: 241.97 typeA: 241.97 胜率: 100.00%
趋势多且增强-L3-1-4-1 总交易次数: 7 盈利: 2299.5324243725336 亏损: 0 最大盈利: 1855.48 最大亏损: 6.19 总收益: 2299.53 平均盈利: 328.50 typeA: 328.50 胜率: 100.00%
趋势多且增强-L1-2-5 总交易次数: 2 盈利: 291.2758814956498 亏损: 0 最大盈利: 183.21 最大亏损: 108.07 总收益: 291.28 平均盈利: 145.64 typeA: 145.64 胜率: 100.00%
趋势空且增强-L2-3-4 总交易次数: 2 盈利: 45.60342450782831 亏损: 0 最大盈利: 31.68 最大亏损: 13.92 总收益: 45.60 平均盈利: 22.80 typeA: 22.80 胜率: 100.00%
趋势空且增强-L-4-2-3 总交易次数: 1 盈利: 18.221379833207557 亏损: 0 最大盈利: 18.22 最大亏损: 18.22 总收益: 18.22 平均盈利: 18.22 typeA: 18.22 胜率: 100.00%
趋势空且增强-L1-1-2 总交易次数: 2 盈利: 276.1656544695295 亏损: 0 最大盈利: 218.26 最大亏损: 57.91 总收益: 276.17 平均盈利: 138.08 typeA: 138.08 胜率: 100.00%
趋势多且增强-R-1-2-2 总交易次数: 1 盈利: 628.2127705011391 亏损: 0 最大盈利: 628.21 最大亏损: 628.21 总收益: 628.21 平均盈利: 628.21 typeA: 628.21 胜率: 100.00%
趋势多且增强-L3-1-3 总交易次数: 4 盈利: 1208.4743952596202 亏损: -98.81100661790333 最大盈利: 629.49 最大亏损: -98.81 总收益: 1109.66 平均盈利: 277.42 typeA: 208.06 胜率: 75.00%
趋势多且增强-L3-1-5 总交易次数: 5 盈利: 736.5064443662255 亏损: -321.5428686508322 最大盈利: 350.23 最大亏损: -290.29 总收益: 414.96 平均盈利: 82.99 typeA: 49.80 胜率: 60.00%
趋势空且增强-L2-3-5 总交易次数: 5 盈利: 634.6410171653487 亏损: -86.57850138728541 最大盈利: 437.23 最大亏损: -58.00 总收益: 548.06 平均盈利: 109.61 typeA: 65.77 胜率: 60.00%
趋势多且增强-R-1-1-2 总交易次数: 6 盈利: 626.1529724658014 亏损: -333.25972413715 最大盈利: 408.84 最大亏损: -241.27 总收益: 292.89 平均盈利: 48.82 typeA: 24.41 胜率: 50.00%
趋势多且增强-L1-1-6 总交易次数: 2 盈利: 149.63387440563946 亏损: -214.55105810675082 最大盈利: 149.63 最大亏损: -214.55 总收益: -64.92 平均盈利: -32.46 typeA: -16.23 胜率: 50.00%
趋势多且增强-L1-3-9 总交易次数: 2 盈利: 194.50473093924856 亏损: -311.5535790696261 最大盈利: 194.50 最大亏损: -311.55 总收益: -117.05 平均盈利: -58.52 typeA: -29.26 胜率: 50.00%
趋势多且增强-11 总交易次数: 9 盈利: 442.60331973478986 亏损: -1495.9685836903266 最大盈利: 165.36 最大亏损: -457.27 总收益: -1053.37 平均盈利: -117.04 typeA: -52.01 胜率: 44.44%
趋势空且增强-L2-3-3 总交易次数: 7 盈利: 173.7539185866113 亏损: -701.0393431118467 最大盈利: 104.27 最大亏损: -230.39 总收益: -527.29 平均盈利: -75.33 typeA: -32.28 胜率: 42.86%
趋势空且增强-2 总交易次数: 10 盈利: 2141.6400974917815 亏损: -1626.7585988441838 最大盈利: 1654.31 最大亏损: -675.22 总收益: 514.88 平均盈利: 51.49 typeA: 20.60 胜率: 40.00%
趋势空且增强-11 总交易次数: 6 盈利: 464.91997194528165 亏损: -1445.6960831134754 最大盈利: 278.94 最大亏损: -813.44 总收益: -980.78 平均盈利: -163.46 typeA: -54.48 胜率: 33.33%
趋势空且增强-L2-1-3 总交易次数: 1 盈利: 0 亏损: -194.7308649202391 最大盈利: -194.73 最大亏损: -194.73 总收益: -194.73 平均盈利: -194.73 typeA: 0.00 胜率: 0.00%
趋势多且增强-L3-1-4-3 总交易次数: 2 盈利: 0 亏损: -74.21575093690846 最大盈利: -0.49 最大亏损: -73.73 总收益: -74.22 平均盈利: -37.11 typeA: 0.00 胜率: 0.00%
趋势多且增强-L1-3-4 总交易次数: 1 盈利: 0 亏损: -12.953438573776108 最大盈利: -12.95 最大亏损: -12.95 总收益: -12.95 平均盈利: -12.95 typeA: 0.00 胜率: 0.00%
趋势空且增强-L3-1-6 总交易次数: 2 盈利: 0 亏损: -162.5099531588114 最大盈利: -56.99 最大亏损: -105.52 总收益: -162.51 平均盈利: -81.25 typeA: 0.00 胜率: 0.00%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     76
      胜率:          61.84%
      总收益:        2967.29 USDT
      期末余额:      12815.29 USDT
      盈亏比:        2.16
      最大单笔盈利:  547.59
      最大单笔亏损:  -293.10
      手续费:       304.1958456652633
      =============================
    
profit: 2815.292343342069
maxDrawdown 4.1%
startTime: 2021-08-29 00:00:00
趋势空且增强-L2-1-3 总交易次数: 2 盈利: 203.54680098706046 亏损: 0 最大盈利: 133.40 最大亏损: 70.15 总收益: 203.55 平均盈利: 101.77 typeA: 101.77 胜率: 100.00%
趋势多且增强-L1-3-9 总交易次数: 1 盈利: 112.16086766142355 亏损: 0 最大盈利: 112.16 最大亏损: 112.16 总收益: 112.16 平均盈利: 112.16 typeA: 112.16 胜率: 100.00%
趋势多且增强-R-1-2-2 总交易次数: 3 盈利: 97.9187531823319 亏损: 0 最大盈利: 64.94 最大亏损: 14.77 总收益: 97.92 平均盈利: 32.64 typeA: 32.64 胜率: 100.00%
趋势空且增强-L-4-2-3 总交易次数: 2 盈利: 14.107713841656189 亏损: 0 最大盈利: 8.18 最大亏损: 5.92 总收益: 14.11 平均盈利: 7.05 typeA: 7.05 胜率: 100.00%
趋势多且增强-L3-1-4-3 总交易次数: 1 盈利: 14.872227579555895 亏损: 0 最大盈利: 14.87 最大亏损: 14.87 总收益: 14.87 平均盈利: 14.87 typeA: 14.87 胜率: 100.00%
趋势多且增强-L3-1-4-1 总交易次数: 7 盈利: 402.2446733144302 亏损: -138.73239615800426 最大盈利: 303.65 最大亏损: -138.73 总收益: 263.51 平均盈利: 37.64 typeA: 32.27 胜率: 85.71%
趋势空且增强-11 总交易次数: 4 盈利: 526.2205030193522 亏损: -221.22381248703437 最大盈利: 279.18 最大亏损: -221.22 总收益: 305.00 平均盈利: 76.25 typeA: 57.19 胜率: 75.00%
趋势多且增强-L3-1-5 总交易次数: 4 盈利: 91.18493961422871 亏损: -223.31510687695058 最大盈利: 36.33 最大亏损: -223.32 总收益: -132.13 平均盈利: -33.03 typeA: -24.77 胜率: 75.00%
趋势空且增强-2 总交易次数: 6 盈利: 211.40433728438217 亏损: -121.92203852145619 最大盈利: 94.10 最大亏损: -117.87 总收益: 89.48 平均盈利: 14.91 typeA: 9.94 胜率: 66.67%
趋势空且增强-L2-3-5 总交易次数: 5 盈利: 120.63737769564847 亏损: -176.27820804791057 最大盈利: 98.64 最大亏损: -118.28 总收益: -55.64 平均盈利: -11.13 typeA: -6.68 胜率: 60.00%
趋势多且增强-R-1-1-2 总交易次数: 12 盈利: 1366.6601680100105 亏损: -503.91423750373843 最大盈利: 457.37 最大亏损: -293.10 总收益: 862.75 平均盈利: 71.90 typeA: 41.94 胜率: 58.33%
趋势多且增强-11 总交易次数: 2 盈利: 363.86896575555636 亏损: -231.6893430256475 最大盈利: 363.87 最大亏损: -231.69 总收益: 132.18 平均盈利: 66.09 typeA: 33.04 胜率: 50.00%
趋势多且增强-L1-2-5 总交易次数: 6 盈利: 994.525212772941 亏损: -208.68897831697066 最大盈利: 547.59 最大亏损: -112.41 总收益: 785.84 平均盈利: 130.97 typeA: 65.49 胜率: 50.00%
趋势空且增强-L2-3-4 总交易次数: 4 盈利: 95.0971226054429 亏损: -60.408112830158174 最大盈利: 61.25 最大亏损: -45.43 总收益: 34.69 平均盈利: 8.67 typeA: 4.34 胜率: 50.00%
趋势多且增强-R-1-1-1 总交易次数: 2 盈利: 49.94223572403533 亏损: -102.46828994061958 最大盈利: 49.94 最大亏损: -102.47 总收益: -52.53 平均盈利: -26.26 typeA: -13.13 胜率: 50.00%
趋势空且增强-L3-1-6 总交易次数: 2 盈利: 445.21244451683907 亏损: -12.600953895071958 最大盈利: 445.21 最大亏损: -12.60 总收益: 432.61 平均盈利: 216.31 typeA: 108.15 胜率: 50.00%
趋势多且增强-L1-3-4 总交易次数: 4 盈利: 215.21943362051098 亏损: -81.04398036676758 最大盈利: 205.97 最大亏损: -52.54 总收益: 134.18 平均盈利: 33.54 typeA: 16.77 胜率: 50.00%
趋势多且增强-L1-1-6 总交易次数: 3 盈利: 105.62367237584928 亏损: -301.99630117513163 最大盈利: 105.62 最大亏损: -223.79 总收益: -196.37 平均盈利: -65.46 typeA: -21.82 胜率: 33.33%
趋势空且增强-L2-3-3 总交易次数: 3 盈利: 89.76146788990772 亏损: -99.21068472672506 最大盈利: 89.76 最大亏损: -72.59 总收益: -9.45 平均盈利: -3.15 typeA: -1.05 胜率: 33.33%
趋势多且增强-L3-1-3 总交易次数: 1 盈利: 0 亏损: -1.282731903292202 最大盈利: -1.28 最大亏损: -1.28 总收益: -1.28 平均盈利: -1.28 typeA: 0.00 胜率: 0.00%
趋势多且增强-L1-2-1 总交易次数: 1 盈利: 0 亏损: -42.9372035513038 最大盈利: -42.94 最大亏损: -42.94 总收益: -42.94 平均盈利: -42.94 typeA: 0.00 胜率: 0.00%
趋势多且增强-R-2-1 总交易次数: 1 盈利: 0 亏损: -25.204194782309067 最大盈利: -25.20 最大亏损: -25.20 总收益: -25.20 平均盈利: -25.20 typeA: 0.00 胜率: 0.00%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     88
      胜率:          46.59%
      总收益:        3304.37 USDT
      期末余额:      13126.37 USDT
      盈亏比:        1.57
      最大单笔盈利:  2299.54
      最大单笔亏损:  -731.06
      手续费:       354.9130600874171
      =============================
    
profit: 3126.373882429114
maxDrawdown 18.4%
startTime: 2021-09-28 00:00:00
趋势多且增强-L3-1-4-3 总交易次数: 1 盈利: 7.563720161746075 亏损: 0 最大盈利: 7.56 最大亏损: 7.56 总收益: 7.56 平均盈利: 7.56 typeA: 7.56 胜率: 100.00%
趋势多且增强-L3-1-3 总交易次数: 2 盈利: 120.8477168727185 亏损: 0 最大盈利: 103.63 最大亏损: 17.22 总收益: 120.85 平均盈利: 60.42 typeA: 60.42 胜率: 100.00%
趋势空且增强-L2-3-3 总交易次数: 4 盈利: 166.27719184932576 亏损: -219.06167356414647 最大盈利: 71.68 最大亏损: -219.06 总收益: -52.78 平均盈利: -13.20 typeA: -9.90 胜率: 75.00%
趋势空且增强-L2-1-3 总交易次数: 7 盈利: 1760.9517235598735 亏损: -55.75624737063563 最大盈利: 1220.97 最大亏损: -53.76 总收益: 1705.20 平均盈利: 243.60 typeA: 174.00 胜率: 71.43%
趋势多且增强-L3-1-4-1 总交易次数: 13 盈利: 840.8458112307605 亏损: -236.21013597417883 最大盈利: 453.01 最大亏损: -78.23 总收益: 604.64 平均盈利: 46.51 typeA: 32.20 胜率: 69.23%
趋势空且增强-L-4-2-3 总交易次数: 3 盈利: 63.64400020301472 亏损: -0.36795300644592954 最大盈利: 33.83 最大亏损: -0.37 总收益: 63.28 平均盈利: 21.09 typeA: 14.06 胜率: 66.67%
趋势多且增强-L3-1-5 总交易次数: 3 盈利: 218.10451165051492 亏损: -39.19494047619051 最大盈利: 151.29 最大亏损: -39.19 总收益: 178.91 平均盈利: 59.64 typeA: 39.76 胜率: 66.67%
趋势空且增强-L2-3-5 总交易次数: 4 盈利: 189.7337677622809 亏损: -101.92404142263696 最大盈利: 166.14 最大亏损: -55.21 总收益: 87.81 平均盈利: 21.95 typeA: 10.98 胜率: 50.00%
趋势多且增强-L1-1-6 总交易次数: 2 盈利: 417.31773774996185 亏损: -26.48252677014939 最大盈利: 417.32 最大亏损: -26.48 总收益: 390.84 平均盈利: 195.42 typeA: 97.71 胜率: 50.00%
趋势多且增强-11 总交易次数: 9 盈利: 3027.2436237459956 亏损: -534.0467966721012 最大盈利: 2299.54 最大亏损: -174.70 总收益: 2493.20 平均盈利: 277.02 typeA: 123.11 胜率: 44.44%
趋势多且增强-R-1-1-2 总交易次数: 7 盈利: 1153.849539206455 亏损: -309.6387641305333 最大盈利: 880.68 最大亏损: -117.46 总收益: 844.21 平均盈利: 120.60 typeA: 51.69 胜率: 42.86%
趋势空且增强-L2-3-4 总交易次数: 3 盈利: 14.84422210114316 亏损: -72.10950162298 最大盈利: 14.84 最大亏损: -37.68 总收益: -57.27 平均盈利: -19.09 typeA: -6.36 胜率: 33.33%
趋势空且增强-L1-1-2 总交易次数: 6 盈利: 205.56105144527083 亏损: -1087.8180463188235 最大盈利: 153.33 最大亏损: -731.06 总收益: -882.26 平均盈利: -147.04 typeA: -49.01 胜率: 33.33%
趋势空且增强-L3-1-6 总交易次数: 4 盈利: 243.5077010606745 亏损: -431.41693627844757 最大盈利: 243.51 最大亏损: -215.92 总收益: -187.91 平均盈利: -46.98 typeA: -11.74 胜率: 25.00%
趋势多且增强-L1-2-5 总交易次数: 4 盈利: 311.7711289076794 亏损: -424.0760866849688 最大盈利: 311.77 最大亏损: -188.65 总收益: -112.30 平均盈利: -28.08 typeA: -7.02 胜率: 25.00%
趋势空且增强-2 总交易次数: 10 盈利: 378.29115913188656 亏损: -1374.2944209657753 最大盈利: 362.58 最大亏损: -538.14 总收益: -996.00 平均盈利: -99.60 typeA: -19.92 胜率: 20.00%
趋势空且增强-11 总交易次数: 1 盈利: 0 亏损: -306.1771451976245 最大盈利: -306.18 最大亏损: -306.18 总收益: -306.18 平均盈利: -306.18 typeA: 0.00 胜率: 0.00%
趋势多且增强-L1-3-4 总交易次数: 1 盈利: 0 亏损: -301.55251912948466 最大盈利: -301.55 最大亏损: -301.55 总收益: -301.55 平均盈利: -301.55 typeA: 0.00 胜率: 0.00%
趋势多且增强-L1-2-2 总交易次数: 3 盈利: 0 亏损: -295.5362244514983 最大盈利: -42.74 最大亏损: -128.39 总收益: -295.54 平均盈利: -98.51 typeA: 0.00 胜率: 0.00%
趋势多且增强-L1-3-9 总交易次数: 1 盈利: 0 亏损: -0.31676417357581377 最大盈利: -0.32 最大亏损: -0.32 总收益: -0.32 平均盈利: -0.32 typeA: 0.00 胜率: 0.00%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     80
      胜率:          57.50%
      总收益:        2139.88 USDT
      期末余额:      11979.88 USDT
      盈亏比:        1.55
      最大单笔盈利:  2299.54
      最大单笔亏损:  -731.06
      手续费:       320.28470059773576
      =============================
    
profit: 1979.882519566434
maxDrawdown 9.1%
startTime: 2021-10-28 00:00:00
趋势空且增强-L3-1-6 总交易次数: 1 盈利: 137.5143183651515 亏损: 0 最大盈利: 137.51 最大亏损: 137.51 总收益: 137.51 平均盈利: 137.51 typeA: 137.51 胜率: 100.00%
趋势空且增强-11 总交易次数: 4 盈利: 446.9400761016708 亏损: 0 最大盈利: 172.15 最大亏损: 31.36 总收益: 446.94 平均盈利: 111.74 typeA: 111.74 胜率: 100.00%
趋势多且增强-L3-1-5 总交易次数: 2 盈利: 265.08526188983194 亏损: 0 最大盈利: 179.45 最大亏损: 85.63 总收益: 265.09 平均盈利: 132.54 typeA: 132.54 胜率: 100.00%
趋势多且增强-L1-3-9 总交易次数: 1 盈利: 161.2326530612247 亏损: 0 最大盈利: 161.23 最大亏损: 161.23 总收益: 161.23 平均盈利: 161.23 typeA: 161.23 胜率: 100.00%
趋势多且增强-L1-3-4 总交易次数: 3 盈利: 444.71464128448656 亏损: 0 最大盈利: 245.89 最大亏损: 69.81 总收益: 444.71 平均盈利: 148.24 typeA: 148.24 胜率: 100.00%
趋势多且增强-L1-2-1 总交易次数: 1 盈利: 267.068507194902 亏损: 0 最大盈利: 267.07 最大亏损: 267.07 总收益: 267.07 平均盈利: 267.07 typeA: 267.07 胜率: 100.00%
趋势多且增强-L3-1-4-1 总交易次数: 7 盈利: 275.98382359215327 亏损: -180.15847302436995 最大盈利: 168.06 最大亏损: -180.16 总收益: 95.83 平均盈利: 13.69 typeA: 11.73 胜率: 85.71%
趋势空且增强-L2-3-5 总交易次数: 5 盈利: 503.6309871973208 亏损: -241.83399428202574 最大盈利: 376.08 最大亏损: -241.83 总收益: 261.80 平均盈利: 52.36 typeA: 41.89 胜率: 80.00%
趋势空且增强-L2-1-3 总交易次数: 4 盈利: 249.44640097952276 亏损: -5.802318950769397 最大盈利: 104.51 最大亏损: -5.80 总收益: 243.64 平均盈利: 60.91 typeA: 45.68 胜率: 75.00%
趋势空且增强-L2-3-3 总交易次数: 4 盈利: 125.89820820081745 亏损: -44.410695742471816 最大盈利: 54.02 最大亏损: -44.41 总收益: 81.49 平均盈利: 20.37 typeA: 15.28 胜率: 75.00%
趋势多且增强-R-1-1-2 总交易次数: 8 盈利: 312.93172609832123 亏损: -388.75392533951015 最大盈利: 224.15 最大亏损: -184.53 总收益: -75.82 平均盈利: -9.48 typeA: -5.92 胜率: 62.50%
趋势空且增强-2 总交易次数: 10 盈利: 286.7283162477914 亏损: -455.3172641424905 最大盈利: 112.65 最大亏损: -304.60 总收益: -168.59 平均盈利: -16.86 typeA: -8.43 胜率: 50.00%
趋势空且增强-L1-1-2 总交易次数: 2 盈利: 111.3711161488197 亏损: -731.0591322155371 最大盈利: 111.37 最大亏损: -731.06 总收益: -619.69 平均盈利: -309.84 typeA: -154.92 胜率: 50.00%
趋势多且增强-R-2-1 总交易次数: 2 盈利: 7.66812362201787 亏损: -54.94337087532139 最大盈利: 7.67 最大亏损: -54.94 总收益: -47.28 平均盈利: -23.64 typeA: -11.82 胜率: 50.00%
趋势多且增强-R-1-2-2 总交易次数: 2 盈利: 25.559264271036678 亏损: -323.3284231670569 最大盈利: 25.56 最大亏损: -323.33 总收益: -297.77 平均盈利: -148.88 typeA: -74.44 胜率: 50.00%
趋势空且增强-L2-3-4 总交易次数: 7 盈利: 130.35975134022772 亏损: -146.73418770647734 最大盈利: 72.71 最大亏损: -89.88 总收益: -16.37 平均盈利: -2.34 typeA: -1.00 胜率: 42.86%
趋势多且增强-11 总交易次数: 3 盈利: 2299.539285151946 亏损: -101.05937839407156 最大盈利: 2299.54 最大亏损: -63.22 总收益: 2198.48 平均盈利: 732.83 typeA: 244.25 胜率: 33.33%
趋势多且增强-L1-2-5 总交易次数: 7 盈利: 0.6777624732175735 亏损: -517.1677117294512 最大盈利: 0.68 最大亏损: -271.43 总收益: -516.49 平均盈利: -73.78 typeA: -10.54 胜率: 14.29%
趋势多且增强-L3-1-3 总交易次数: 2 盈利: 0 亏损: -164.0282322847723 最大盈利: -19.83 最大亏损: -144.20 总收益: -164.03 平均盈利: -82.01 typeA: 0.00 胜率: 0.00%
趋势多且增强-L1-1-6 总交易次数: 2 盈利: 0 亏损: -444.6188464813258 最大盈利: -62.96 最大亏损: -381.66 总收益: -444.62 平均盈利: -222.31 typeA: 0.00 胜率: 0.00%
趋势空且增强-L-4-2-3 总交易次数: 1 盈利: 0 亏损: -4.311799375939154 最大盈利: -4.31 最大亏损: -4.31 总收益: -4.31 平均盈利: -4.31 typeA: 0.00 胜率: 0.00%
趋势多且增强-L3-1-4-3 总交易次数: 1 盈利: 0 亏损: -69.31168888692004 最大盈利: -69.31 最大亏损: -69.31 总收益: -69.31 平均盈利: -69.31 typeA: 0.00 胜率: 0.00%
趋势多且增强-L1-3-2 总交易次数: 1 盈利: 0 亏损: -39.62826105551244 最大盈利: -39.63 最大亏损: -39.63 总收益: -39.63 平均盈利: -39.63 typeA: 0.00 胜率: 0.00%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     77
      胜率:          55.84%
      总收益:        -1422.36 USDT
      期末余额:      8423.64 USDT
      盈亏比:        0.77
      最大单笔盈利:  471.30
      最大单笔亏损:  -2061.77
      手续费:       307.7924849806848
      =============================
    
profit: -1576.3578832529365
maxDrawdown 31.7%
startTime: 2021-11-27 00:00:00
趋势多且增强-L3-1-5 总交易次数: 2 盈利: 228.95544080754684 亏损: 0 最大盈利: 222.19 最大亏损: 6.77 总收益: 228.96 平均盈利: 114.48 typeA: 114.48 胜率: 100.00%
趋势多且增强-L1-3-1 总交易次数: 1 盈利: 84.85142632965285 亏损: 0 最大盈利: 84.85 最大亏损: 84.85 总收益: 84.85 平均盈利: 84.85 typeA: 84.85 胜率: 100.00%
趋势空且增强-2 总交易次数: 4 盈利: 36.656110268382996 亏损: 0 最大盈利: 13.74 最大亏损: 4.66 总收益: 36.66 平均盈利: 9.16 typeA: 9.16 胜率: 100.00%
趋势多且增强-R-1-1-1 总交易次数: 2 盈利: 576.9973225909112 亏损: 0 最大盈利: 471.30 最大亏损: 105.70 总收益: 577.00 平均盈利: 288.50 typeA: 288.50 胜率: 100.00%
趋势多且增强-R-1-1-2 总交易次数: 12 盈利: 995.6839917373096 亏损: -2144.317720330137 最大盈利: 321.57 最大亏损: -2061.77 总收益: -1148.63 平均盈利: -95.72 typeA: -71.79 胜率: 75.00%
趋势空且增强-11 总交易次数: 4 盈利: 740.5934226313506 亏损: -222.1969659595455 最大盈利: 402.53 最大亏损: -222.20 总收益: 518.40 平均盈利: 129.60 typeA: 97.20 胜率: 75.00%
趋势空且增强-L2-1-3 总交易次数: 4 盈利: 625.7545960844839 亏损: -13.320882852292346 最大盈利: 444.75 最大亏损: -13.32 总收益: 612.43 平均盈利: 153.11 typeA: 114.83 胜率: 75.00%
趋势多且增强-L3-1-3 总交易次数: 3 盈利: 60.643124787865936 亏损: -11.301005872434065 最大盈利: 59.23 最大亏损: -11.30 总收益: 49.34 平均盈利: 16.45 typeA: 10.97 胜率: 66.67%
趋势空且增强-L2-3-3 总交易次数: 3 盈利: 152.1577801716515 亏损: -769.004461895414 最大盈利: 107.02 最大亏损: -769.00 总收益: -616.85 平均盈利: -205.62 typeA: -137.08 胜率: 66.67%
趋势空且增强-L2-3-4 总交易次数: 7 盈利: 362.1050328069996 亏损: -896.9864509101561 最大盈利: 268.85 最大亏损: -470.02 总收益: -534.88 平均盈利: -76.41 typeA: -43.66 胜率: 57.14%
趋势多且增强-L3-1-4-1 总交易次数: 6 盈利: 122.30671247604336 亏损: -287.4125637416155 最大盈利: 70.88 最大亏损: -143.35 总收益: -165.11 平均盈利: -27.52 typeA: -13.76 胜率: 50.00%
趋势空且增强-L2-3-5 总交易次数: 2 盈利: 15.753979054493504 亏损: -119.03845540130735 最大盈利: 15.75 最大亏损: -119.04 总收益: -103.28 平均盈利: -51.64 typeA: -25.82 胜率: 50.00%
趋势多且增强-L1-3-4 总交易次数: 7 盈利: 27.412296292841518 亏损: -413.20641873009896 最大盈利: 11.19 最大亏损: -204.46 总收益: -385.79 平均盈利: -55.11 typeA: -23.62 胜率: 42.86%
趋势空且增强-L-4-2-3 总交易次数: 5 盈利: 31.22424939900529 亏损: -102.31350621145873 最大盈利: 20.94 最大亏损: -71.37 总收益: -71.09 平均盈利: -14.22 typeA: -5.69 胜率: 40.00%
趋势多且增强-L3-1-4-3 总交易次数: 3 盈利: 196.93167625811037 亏损: -193.8137893150421 最大盈利: 196.93 最大亏损: -137.29 总收益: 3.12 平均盈利: 1.04 typeA: 0.35 胜率: 33.33%
趋势空且增强-L3-1-6 总交易次数: 5 盈利: 393.2648713455683 亏损: -364.0472213629863 最大盈利: 393.26 最大亏损: -138.31 总收益: 29.22 平均盈利: 5.84 typeA: 1.17 胜率: 20.00%
趋势多且增强-L1-1-6 总交易次数: 1 盈利: 0 亏损: -62.95751475854112 最大盈利: -62.96 最大亏损: -62.96 总收益: -62.96 平均盈利: -62.96 typeA: 0.00 胜率: 0.00%
趋势多且增强-L1-2-5 总交易次数: 1 盈利: 0 亏损: -41.569284231865204 最大盈利: -41.57 最大亏损: -41.57 总收益: -41.57 平均盈利: -41.57 typeA: 0.00 胜率: 0.00%
趋势多且增强-11 总交易次数: 4 盈利: 0 亏损: -376.0433276749557 最大盈利: -48.84 最大亏损: -209.34 总收益: -376.04 平均盈利: -94.01 typeA: 0.00 胜率: 0.00%
趋势空且增强-L1-1-2 总交易次数: 1 盈利: 0 亏损: -56.12034704730023 最大盈利: -56.12 最大亏损: -56.12 总收益: -56.12 平均盈利: -56.12 typeA: 0.00 胜率: 0.00%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     99
      胜率:          53.54%
      总收益:        1827.73 USDT
      期末余额:      11629.73 USDT
      盈亏比:        1.32
      最大单笔盈利:  1343.85
      最大单笔亏损:  -562.16
      手续费:       395.96866799908884
      =============================
    
profit: 1629.7279402378463
maxDrawdown 21.4%
startTime: 2021-12-27 00:00:00
趋势多且增强-R-1-1-1 总交易次数: 2 盈利: 272.0645014362815 亏损: 0 最大盈利: 239.63 最大亏损: 32.44 总收益: 272.06 平均盈利: 136.03 typeA: 136.03 胜率: 100.00%
趋势空且增强-L2-2-3 总交易次数: 1 盈利: 215.369151826139 亏损: 0 最大盈利: 215.37 最大亏损: 215.37 总收益: 215.37 平均盈利: 215.37 typeA: 215.37 胜率: 100.00%
趋势多且增强-L3-1-4-3 总交易次数: 6 盈利: 943.0133552641875 亏损: -207.5663551401867 最大盈利: 813.43 最大亏损: -207.57 总收益: 735.45 平均盈利: 122.57 typeA: 102.14 胜率: 83.33%
趋势空且增强-L2-3-3 总交易次数: 7 盈利: 496.915852653954 亏损: -53.80804554193412 最大盈利: 275.24 最大亏损: -32.57 总收益: 443.11 平均盈利: 63.30 typeA: 45.22 胜率: 71.43%
趋势空且增强-L2-3-4 总交易次数: 10 盈利: 292.8592592061385 亏损: -141.69608663844377 最大盈利: 78.32 最大亏损: -110.71 总收益: 151.16 平均盈利: 15.12 typeA: 10.58 胜率: 70.00%
趋势空且增强-L-4-2-3 总交易次数: 6 盈利: 80.28362596622901 亏损: -61.03239811196892 最大盈利: 34.40 最大亏损: -49.72 总收益: 19.25 平均盈利: 3.21 typeA: 2.14 胜率: 66.67%
趋势空且增强-2 总交易次数: 5 盈利: 265.6312256755506 亏损: -248.86625028795 最大盈利: 168.88 最大亏损: -176.97 总收益: 16.76 平均盈利: 3.35 typeA: 2.01 胜率: 60.00%
趋势空且增强-11 总交易次数: 5 盈利: 756.2634112038082 亏损: -271.65443192538373 最大盈利: 459.86 最大亏损: -181.95 总收益: 484.61 平均盈利: 96.92 typeA: 58.15 胜率: 60.00%
趋势多且增强-R-1-1-2 总交易次数: 10 盈利: 238.6546111263028 亏损: -534.8898449611944 最大盈利: 130.94 最大亏损: -165.67 总收益: -296.24 平均盈利: -29.62 typeA: -14.81 胜率: 50.00%
趋势多且增强-L3-1-5 总交易次数: 4 盈利: 801.0272672693686 亏损: -316.6741695273865 最大盈利: 714.46 最大亏损: -220.76 总收益: 484.35 平均盈利: 121.09 typeA: 60.54 胜率: 50.00%
趋势多且增强-11 总交易次数: 4 盈利: 114.91165959166449 亏损: -340.3275011728331 最大盈利: 113.54 最大亏损: -190.77 总收益: -225.42 平均盈利: -56.35 typeA: -28.18 胜率: 50.00%
趋势多且增强-R-2-1 总交易次数: 4 盈利: 39.88688583746762 亏损: -547.8513382176201 最大盈利: 22.20 最大亏损: -498.07 总收益: -507.96 平均盈利: -126.99 typeA: -63.50 胜率: 50.00%
趋势多且增强-R-1-2-2 总交易次数: 4 盈利: 391.2122828961769 亏损: -173.60148002100547 最大盈利: 361.87 最大亏损: -128.87 总收益: 217.61 平均盈利: 54.40 typeA: 27.20 胜率: 50.00%
趋势多且增强-L3-1-4-1 总交易次数: 8 盈利: 1427.1042067851602 亏损: -236.40598682491117 最大盈利: 1343.85 最大亏损: -107.62 总收益: 1190.70 平均盈利: 148.84 typeA: 74.42 胜率: 50.00%
趋势多且增强-L1-3-4 总交易次数: 9 盈利: 872.3526834627314 亏损: -1226.9392922617556 最大盈利: 428.77 最大亏损: -562.16 总收益: -354.59 平均盈利: -39.40 typeA: -17.51 胜率: 44.44%
趋势空且增强-L3-1-6 总交易次数: 4 盈利: 221.42129870129781 亏损: -376.6895748618143 最大盈利: 221.42 最大亏损: -181.67 总收益: -155.27 平均盈利: -38.82 typeA: -9.70 胜率: 25.00%
趋势空且增强-L2-3-5 总交易次数: 5 盈利: 27.27725103404492 亏损: -191.7360856830889 最大盈利: 27.28 最大亏损: -69.54 总收益: -164.46 平均盈利: -32.89 typeA: -6.58 胜率: 20.00%
趋势多且增强-L1-3-9 总交易次数: 2 盈利: 0 亏损: -492.48318395500536 最大盈利: -29.63 最大亏损: -462.86 总收益: -492.48 平均盈利: -246.24 typeA: 0.00 胜率: 0.00%
趋势多且增强-L1-2-5 总交易次数: 2 盈利: 0 亏损: -199.1569034073296 最大盈利: -90.88 最大亏损: -108.27 总收益: -199.16 平均盈利: -99.58 typeA: 0.00 胜率: 0.00%
趋势空且增强-L2-1-3 总交易次数: 1 盈利: 0 亏损: -7.141661158844586 最大盈利: -7.14 最大亏损: -7.14 总收益: -7.14 平均盈利: -7.14 typeA: 0.00 胜率: 0.00%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     75
      胜率:          48.00%
      总收益:        -1346.01 USDT
      期末余额:      8503.99 USDT
      盈亏比:        0.71
      最大单笔盈利:  438.25
      最大单笔亏损:  -830.33
      手续费:       300.06126788268585
      =============================
    
profit: -1496.0061238560338
maxDrawdown 21.8%
startTime: 2022-01-26 00:00:00
趋势空且增强-L2-1-3 总交易次数: 1 盈利: 125.58911833110004 亏损: 0 最大盈利: 125.59 最大亏损: 125.59 总收益: 125.59 平均盈利: 125.59 typeA: 125.59 胜率: 100.00%
趋势多且增强-L1-3-9 总交易次数: 1 盈利: 178.84402267371385 亏损: 0 最大盈利: 178.84 最大亏损: 178.84 总收益: 178.84 平均盈利: 178.84 typeA: 178.84 胜率: 100.00%
趋势多且增强-L3-1-4-1 总交易次数: 2 盈利: 122.04753411558534 亏损: 0 最大盈利: 64.94 最大亏损: 57.11 总收益: 122.05 平均盈利: 61.02 typeA: 61.02 胜率: 100.00%
趋势多且增强-L3-1-4-3 总交易次数: 5 盈利: 90.47676716774728 亏损: -51.03614619725937 最大盈利: 47.48 最大亏损: -51.04 总收益: 39.44 平均盈利: 7.89 typeA: 6.31 胜率: 80.00%
趋势多且增强-L3-1-3 总交易次数: 5 盈利: 479.56890197549444 亏损: -22.088824222269274 最大盈利: 210.03 最大亏损: -22.09 总收益: 457.48 平均盈利: 91.50 typeA: 73.20 胜率: 80.00%
趋势多且增强-R-1-2-2 总交易次数: 5 盈利: 791.5551586988009 亏损: -830.3333605686737 最大盈利: 234.67 最大亏损: -830.33 总收益: -38.78 平均盈利: -7.76 typeA: -6.20 胜率: 80.00%
趋势多且增强-L3-1-5 总交易次数: 6 盈利: 101.05093532522653 亏损: -42.109157474397364 最大盈利: 31.77 最大亏损: -25.24 总收益: 58.94 平均盈利: 9.82 typeA: 6.55 胜率: 66.67%
趋势多且增强-R-2-1 总交易次数: 3 盈利: 129.33470548080368 亏损: -137.62584304108074 最大盈利: 100.69 最大亏损: -137.63 总收益: -8.29 平均盈利: -2.76 typeA: -1.84 胜率: 66.67%
趋势空且增强-L-4-2-3 总交易次数: 4 盈利: 51.87544943229095 亏损: -16.265584045694162 最大盈利: 28.79 最大亏损: -11.21 总收益: 35.61 平均盈利: 8.90 typeA: 4.45 胜率: 50.00%
趋势多且增强-R-1-1-2 总交易次数: 2 盈利: 32.85959501139819 亏损: -98.45129411764775 最大盈利: 32.86 最大亏损: -98.45 总收益: -65.59 平均盈利: -32.80 typeA: -16.40 胜率: 50.00%
趋势多且增强-R-2-2 总交易次数: 2 盈利: 23.752870179569413 亏损: -38.80679646017647 最大盈利: 23.75 最大亏损: -38.81 总收益: -15.05 平均盈利: -7.53 typeA: -3.76 胜率: 50.00%
趋势多且增强-11 总交易次数: 7 盈利: 483.9176612535743 亏损: -865.3558613200491 最大盈利: 438.25 最大亏损: -437.57 总收益: -381.44 平均盈利: -54.49 typeA: -23.35 胜率: 42.86%
趋势空且增强-2 总交易次数: 5 盈利: 215.35580291007258 亏损: -171.52091283162468 最大盈利: 115.21 最大亏损: -71.89 总收益: 43.83 平均盈利: 8.77 typeA: 3.51 胜率: 40.00%
趋势空且增强-L2-3-4 总交易次数: 5 盈利: 256.04572856611844 亏损: -480.1786731412244 最大盈利: 230.38 最大亏损: -388.87 总收益: -224.13 平均盈利: -44.83 typeA: -17.93 胜率: 40.00%
趋势空且增强-L2-3-3 总交易次数: 6 盈利: 85.46302098832518 亏损: -435.9091233088566 最大盈利: 62.68 最大亏损: -178.92 总收益: -350.45 平均盈利: -58.41 typeA: -19.47 胜率: 33.33%
趋势空且增强-11 总交易次数: 4 盈利: 204.88357738525272 亏损: -451.3291488698371 最大盈利: 204.88 最大亏损: -383.21 总收益: -246.45 平均盈利: -61.61 typeA: -15.40 胜率: 25.00%
趋势多且增强-L1-2-5 总交易次数: 3 盈利: 0 亏损: -128.01607262412568 最大盈利: -8.96 最大亏损: -108.27 总收益: -128.02 平均盈利: -42.67 typeA: 0.00 胜率: 0.00%
趋势空且增强-L1-1-2 总交易次数: 1 盈利: 0 亏损: -9.326496637144503 最大盈利: -9.33 最大亏损: -9.33 总收益: -9.33 平均盈利: -9.33 typeA: 0.00 胜率: 0.00%
趋势多且增强-L1-3-4 总交易次数: 3 盈利: 0 亏损: -504.7400106540762 最大盈利: -15.97 最大亏损: -284.31 总收益: -504.74 平均盈利: -168.25 typeA: 0.00 胜率: 0.00%
趋势空且增强-L2-3-5 总交易次数: 3 盈利: 0 亏损: -183.97512190719561 最大盈利: -7.10 最大亏损: -154.49 总收益: -183.98 平均盈利: -61.33 typeA: 0.00 胜率: 0.00%
趋势多且增强-R-3-1 总交易次数: 1 盈利: 0 亏损: -212.2650003359534 最大盈利: -212.27 最大亏损: -212.27 总收益: -212.27 平均盈利: -212.27 typeA: 0.00 胜率: 0.00%
趋势多且增强-L1-3-2 总交易次数: 1 盈利: 0 亏损: -39.29354559381902 最大盈利: -39.29 最大亏损: -39.29 总收益: -39.29 平均盈利: -39.29 typeA: 0.00 胜率: 0.00%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     74
      胜率:          56.76%
      总收益:        2142.39 USDT
      期末余额:      11994.39 USDT
      盈亏比:        1.69
      最大单笔盈利:  962.15
      最大单笔亏损:  -484.32
      手续费:       296.08320579037985
      =============================
    
profit: 1994.3881455157825
maxDrawdown 9.0%
startTime: 2022-02-25 00:00:00
趋势多且增强-L3-1-4-1 总交易次数: 1 盈利: 64.93829152214225 亏损: 0 最大盈利: 64.94 最大亏损: 64.94 总收益: 64.94 平均盈利: 64.94 typeA: 64.94 胜率: 100.00%
趋势多且增强-R-2-1 总交易次数: 3 盈利: 452.39476520280675 亏损: 0 最大盈利: 196.96 最大亏损: 126.80 总收益: 452.39 平均盈利: 150.80 typeA: 150.80 胜率: 100.00%
趋势多且增强-R-1-1-2 总交易次数: 1 盈利: 27.367241246037832 亏损: 0 最大盈利: 27.37 最大亏损: 27.37 总收益: 27.37 平均盈利: 27.37 typeA: 27.37 胜率: 100.00%
趋势空且增强-L2-1-3 总交易次数: 1 盈利: 44.76480589402054 亏损: 0 最大盈利: 44.76 最大亏损: 44.76 总收益: 44.76 平均盈利: 44.76 typeA: 44.76 胜率: 100.00%
趋势空且增强-L2-3-4 总交易次数: 6 盈利: 554.8692878184515 亏损: -217.59947350405938 最大盈利: 312.65 最大亏损: -207.95 总收益: 337.27 平均盈利: 56.21 typeA: 37.48 胜率: 66.67%
趋势多且增强-L3-1-5 总交易次数: 3 盈利: 31.63206485249312 亏损: -237.6117829457376 最大盈利: 17.34 最大亏损: -237.61 总收益: -205.98 平均盈利: -68.66 typeA: -45.78 胜率: 66.67%
趋势空且增强-L2-3-3 总交易次数: 12 盈利: 555.0342184990322 亏损: -271.76274727897624 最大盈利: 276.53 最大亏损: -137.10 总收益: 283.27 平均盈利: 23.61 typeA: 15.74 胜率: 66.67%
趋势多且增强-L3-1-3 总交易次数: 3 盈利: 249.45207875372537 亏损: -2 最大盈利: 204.26 最大亏损: -2.00 总收益: 247.45 平均盈利: 82.48 typeA: 54.99 胜率: 66.67%
趋势多且增强-L1-3-4 总交易次数: 3 盈利: 297.76755712533816 亏损: -83.94423463238304 最大盈利: 295.26 最大亏损: -83.94 总收益: 213.82 平均盈利: 71.27 typeA: 47.52 胜率: 66.67%
趋势空且增强-L-4-2-3 总交易次数: 5 盈利: 327.06591674562964 亏损: -23.804442148186425 最大盈利: 307.56 最大亏损: -16.52 总收益: 303.26 平均盈利: 60.65 typeA: 36.39 胜率: 60.00%
趋势空且增强-2 总交易次数: 4 盈利: 117.5069601784635 亏损: -236.08720033712805 最大盈利: 115.21 最大亏损: -156.19 总收益: -118.58 平均盈利: -29.65 typeA: -14.82 胜率: 50.00%
趋势多且增强-L3-1-4-3 总交易次数: 8 盈利: 36.713484637021125 亏损: -514.7354250458774 最大盈利: 16.87 最大亏损: -438.99 总收益: -478.02 平均盈利: -59.75 typeA: -29.88 胜率: 50.00%
趋势空且增强-L2-2-3 总交易次数: 2 盈利: 20.96245278826962 亏损: -6.378775939059146 最大盈利: 20.96 最大亏损: -6.38 总收益: 14.58 平均盈利: 7.29 typeA: 3.65 胜率: 50.00%
趋势空且增强-11 总交易次数: 2 盈利: 219.51065759637098 亏损: -69.7607409313094 最大盈利: 219.51 最大亏损: -69.76 总收益: 149.75 平均盈利: 74.87 typeA: 37.44 胜率: 50.00%
趋势多且增强-11 总交易次数: 9 盈利: 2027.9469023512065 亏损: -1068.4498997103867 最大盈利: 962.15 最大亏损: -484.32 总收益: 959.50 平均盈利: 106.61 typeA: 47.38 胜率: 44.44%
趋势空且增强-L2-3-5 总交易次数: 5 盈利: 29.18008449648991 亏损: -180.0923599346032 最大盈利: 15.53 最大亏损: -168.30 总收益: -150.91 平均盈利: -30.18 typeA: -12.07 胜率: 40.00%
趋势多且增强-R-3-1 总交易次数: 3 盈利: 188.63231642426382 亏损: -38.963585449848864 最大盈利: 188.63 最大亏损: -30.63 总收益: 149.67 平均盈利: 49.89 typeA: 16.63 胜率: 33.33%
趋势多且增强-L1-3-1 总交易次数: 2 盈利: 0 亏损: -124.33575804332973 最大盈利: -18.21 最大亏损: -106.13 总收益: -124.34 平均盈利: -62.17 typeA: 0.00 胜率: 0.00%
趋势多且增强-L1-3-9 总交易次数: 1 盈利: 0 亏损: -27.824514715092725 最大盈利: -27.82 最大亏损: -27.82 总收益: -27.82 平均盈利: -27.82 typeA: 0.00 胜率: 0.00%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     88
      胜率:          68.18%
      总收益:        2317.52 USDT
      期末余额:      12139.52 USDT
      盈亏比:        1.65
      最大单笔盈利:  1142.40
      最大单笔亏损:  -521.42
      手续费:       353.48629356871027
      =============================
    
profit: 2139.520719893988
maxDrawdown 9.4%
startTime: 2022-03-27 00:00:00
趋势多且增强-L1-3-1 总交易次数: 1 盈利: 129.6866540532678 亏损: 0 最大盈利: 129.69 最大亏损: 129.69 总收益: 129.69 平均盈利: 129.69 typeA: 129.69 胜率: 100.00%
趋势空且增强-L2-1-3 总交易次数: 2 盈利: 196.29705439523923 亏损: 0 最大盈利: 151.53 最大亏损: 44.76 总收益: 196.30 平均盈利: 98.15 typeA: 98.15 胜率: 100.00%
趋势多且增强-L1-3-2 总交易次数: 1 盈利: 20.123918728625824 亏损: 0 最大盈利: 20.12 最大亏损: 20.12 总收益: 20.12 平均盈利: 20.12 typeA: 20.12 胜率: 100.00%
趋势多且增强-L3-1-5 总交易次数: 6 盈利: 182.49282380862482 亏损: 0 最大盈利: 58.20 最大亏损: 10.52 总收益: 182.49 平均盈利: 30.42 typeA: 30.42 胜率: 100.00%
趋势空且增强-L2-3-4 总交易次数: 4 盈利: 81.22068438748502 亏损: 0 最大盈利: 30.18 最大亏损: 3.11 总收益: 81.22 平均盈利: 20.31 typeA: 20.31 胜率: 100.00%
趋势多且增强-R-1-2-2 总交易次数: 4 盈利: 114.44824879708457 亏损: 0 最大盈利: 39.43 最大亏损: 7.89 总收益: 114.45 平均盈利: 28.61 typeA: 28.61 胜率: 100.00%
趋势空且增强-2 总交易次数: 5 盈利: 507.43907391565756 亏损: 0 最大盈利: 267.07 最大亏损: 13.98 总收益: 507.44 平均盈利: 101.49 typeA: 101.49 胜率: 100.00%
趋势空且增强-L2-2-3 总交易次数: 1 盈利: 1142.4047127414065 亏损: 0 最大盈利: 1142.40 最大亏损: 1142.40 总收益: 1142.40 平均盈利: 1142.40 typeA: 1142.40 胜率: 100.00%
趋势多且增强-L1-3-9 总交易次数: 1 盈利: 219.91497355970125 亏损: 0 最大盈利: 219.91 最大亏损: 219.91 总收益: 219.91 平均盈利: 219.91 typeA: 219.91 胜率: 100.00%
趋势多且增强-R-2-2 总交易次数: 1 盈利: 161.1945063637013 亏损: 0 最大盈利: 161.19 最大亏损: 161.19 总收益: 161.19 平均盈利: 161.19 typeA: 161.19 胜率: 100.00%
趋势多且增强-R-3-1 总交易次数: 1 盈利: 94.65332733812842 亏损: 0 最大盈利: 94.65 最大亏损: 94.65 总收益: 94.65 平均盈利: 94.65 typeA: 94.65 胜率: 100.00%
趋势多且增强-R-2-1 总交易次数: 1 盈利: 54.69496731511368 亏损: 0 最大盈利: 54.69 最大亏损: 54.69 总收益: 54.69 平均盈利: 54.69 typeA: 54.69 胜率: 100.00%
趋势空且增强-L1-1-2 总交易次数: 1 盈利: 270.64954778318946 亏损: 0 最大盈利: 270.65 最大亏损: 270.65 总收益: 270.65 平均盈利: 270.65 typeA: 270.65 胜率: 100.00%
趋势多且增强-L1-2-5 总交易次数: 1 盈利: 21.77050616279744 亏损: 0 最大盈利: 21.77 最大亏损: 21.77 总收益: 21.77 平均盈利: 21.77 typeA: 21.77 胜率: 100.00%
趋势多且增强-L3-1-4-3 总交易次数: 8 盈利: 106.5107838811381 亏损: -645.6522926012028 最大盈利: 35.08 最大亏损: -521.42 总收益: -539.14 平均盈利: -67.39 typeA: -50.54 胜率: 75.00%
趋势多且增强-11 总交易次数: 4 盈利: 176.21591052426476 亏损: -228.47597608160402 最大盈利: 87.26 最大亏损: -228.48 总收益: -52.26 平均盈利: -13.07 typeA: -9.80 胜率: 75.00%
趋势空且增强-L2-3-5 总交易次数: 7 盈利: 607.9127226116929 亏损: -26.773092552062508 最大盈利: 439.39 最大亏损: -17.42 总收益: 581.14 平均盈利: 83.02 typeA: 59.30 胜率: 71.43%
趋势空且增强-L2-3-3 总交易次数: 12 盈利: 140.49208787789627 亏损: -440.19168312090426 最大盈利: 47.92 最大亏损: -217.92 总收益: -299.70 平均盈利: -24.97 typeA: -14.57 胜率: 58.33%
趋势空且增强-11 总交易次数: 4 盈利: 188.96792036899032 亏损: -112.97495613472705 最大盈利: 108.20 最大亏损: -89.72 总收益: 75.99 平均盈利: 19.00 typeA: 9.50 胜率: 50.00%
趋势多且增强-R-1-1-2 总交易次数: 7 盈利: 69.03857614004485 亏损: -318.4526124388192 最大盈利: 29.49 最大亏损: -110.30 总收益: -249.41 平均盈利: -35.63 typeA: -15.27 胜率: 42.86%
趋势多且增强-L1-3-4 总交易次数: 6 盈利: 1110.727131749805 亏损: -918.3224991158165 最大盈利: 853.89 最大亏损: -498.00 总收益: 192.40 平均盈利: 32.07 typeA: 10.69 胜率: 33.33%
趋势多且增强-L3-1-3 总交易次数: 3 盈利: 268.16355959727167 亏损: -251.26194166468792 最大盈利: 268.16 最大亏损: -237.37 总收益: 16.90 平均盈利: 5.63 typeA: 1.88 胜率: 33.33%
趋势空且增强-L-4-2-3 总交易次数: 4 盈利: 18.693793103447913 亏损: -122.86212650454925 最大盈利: 18.69 最大亏损: -50.70 总收益: -104.17 平均盈利: -26.04 typeA: -6.51 胜率: 25.00%
趋势多且增强-L3-1-4-1 总交易次数: 2 盈利: 0 亏损: -497.1157089003772 最大盈利: -192.02 最大亏损: -305.09 总收益: -497.12 平均盈利: -248.56 typeA: 0.00 胜率: 0.00%
趋势多且增强-R-3-2 总交易次数: 1 盈利: 0 亏损: -4.109876195835836 最大盈利: -4.11 最大亏损: -4.11 总收益: -4.11 平均盈利: -4.11 typeA: 0.00 胜率: 0.00%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     95
      胜率:          67.37%
      总收益:        2038.10 USDT
      期末余额:      11846.10 USDT
      盈亏比:        1.39
      最大单笔盈利:  1020.85
      最大单笔亏损:  -1562.82
      手续费:       381.44434082234767
      =============================
    
profit: 1846.0973918080217
maxDrawdown 13.2%
startTime: 2022-04-26 00:00:00
趋势多且增强-L1-2-5 总交易次数: 1 盈利: 21.77050616279744 亏损: 0 最大盈利: 21.77 最大亏损: 21.77 总收益: 21.77 平均盈利: 21.77 typeA: 21.77 胜率: 100.00%
趋势空且增强-11 总交易次数: 4 盈利: 406.12597489097254 亏损: 0 最大盈利: 260.86 最大亏损: 19.29 总收益: 406.13 平均盈利: 101.53 typeA: 101.53 胜率: 100.00%
趋势空且增强-L2-3-5 总交易次数: 4 盈利: 535.9323297058963 亏损: 0 最大盈利: 305.54 最大亏损: 5.17 总收益: 535.93 平均盈利: 133.98 typeA: 133.98 胜率: 100.00%
趋势多且增强-L3-1-5 总交易次数: 3 盈利: 200.3616086180155 亏损: 0 最大盈利: 132.64 最大亏损: 33.77 总收益: 200.36 平均盈利: 66.79 typeA: 66.79 胜率: 100.00%
趋势空且增强-L2-3-3 总交易次数: 9 盈利: 612.4253099007648 亏损: 0 最大盈利: 341.58 最大亏损: 6.43 总收益: 612.43 平均盈利: 68.05 typeA: 68.05 胜率: 100.00%
趋势多且增强-L3-1-3 总交易次数: 1 盈利: 15.805877114870155 亏损: 0 最大盈利: 15.81 最大亏损: 15.81 总收益: 15.81 平均盈利: 15.81 typeA: 15.81 胜率: 100.00%
趋势多且增强-R-2-2 总交易次数: 1 盈利: 369.71712093146425 亏损: 0 最大盈利: 369.72 最大亏损: 369.72 总收益: 369.72 平均盈利: 369.72 typeA: 369.72 胜率: 100.00%
趋势空且增强-L2-3-4 总交易次数: 10 盈利: 1300.337619711121 亏损: -477.01487942276117 最大盈利: 1020.85 最大亏损: -409.81 总收益: 823.32 平均盈利: 82.33 typeA: 65.87 胜率: 80.00%
趋势多且增强-L3-1-4-3 总交易次数: 8 盈利: 143.01985618355076 亏损: -38.14133174750459 最大盈利: 68.19 最大亏损: -30.70 总收益: 104.88 平均盈利: 13.11 typeA: 9.83 胜率: 75.00%
趋势多且增强-R-2-1 总交易次数: 6 盈利: 363.35059722417174 亏损: -172.87753859387476 最大盈利: 164.22 最大亏损: -119.85 总收益: 190.47 平均盈利: 31.75 typeA: 21.16 胜率: 66.67%
趋势空且增强-L3-1-6 总交易次数: 3 盈利: 582.3498242767894 亏损: -145.78635408603446 最大盈利: 566.91 最大亏损: -145.79 总收益: 436.56 平均盈利: 145.52 typeA: 97.02 胜率: 66.67%
趋势多且增强-L3-1-4-1 总交易次数: 3 盈利: 93.91753618349432 亏损: -62.4872951270497 最大盈利: 55.50 最大亏损: -62.49 总收益: 31.43 平均盈利: 10.48 typeA: 6.98 胜率: 66.67%
趋势空且增强-L-4-2-3 总交易次数: 7 盈利: 133.93620671637257 亏损: -356.0283291977897 最大盈利: 52.87 最大亏损: -206.68 总收益: -222.09 平均盈利: -31.73 typeA: -18.13 胜率: 57.14%
趋势多且增强-R-1-1-2 总交易次数: 10 盈利: 1741.6754615191462 亏损: -1984.7133248690027 最大盈利: 704.29 最大亏损: -1562.82 总收益: -243.04 平均盈利: -24.30 typeA: -12.15 胜率: 50.00%
趋势多且增强-R-1-2-2 总交易次数: 2 盈利: 7.894111825828883 亏损: -176.64697002372333 最大盈利: 7.89 最大亏损: -176.65 总收益: -168.75 平均盈利: -84.38 typeA: -42.19 胜率: 50.00%
趋势空且增强-2 总交易次数: 4 盈利: 71.4361584455871 亏损: -242.29446673311816 最大盈利: 36.82 最大亏损: -123.42 总收益: -170.86 平均盈利: -42.71 typeA: -21.36 胜率: 50.00%
趋势多且增强-R-1-1-1 总交易次数: 2 盈利: 299.5509167394236 亏损: -14.747905282331624 最大盈利: 299.55 最大亏损: -14.75 总收益: 284.80 平均盈利: 142.40 typeA: 71.20 胜率: 50.00%
趋势多且增强-R-3-1 总交易次数: 7 盈利: 192.17992164459713 亏损: -534.9786864093035 最大盈利: 178.91 最大亏损: -194.74 总收益: -342.80 平均盈利: -48.97 typeA: -20.99 胜率: 42.86%
趋势多且增强-L1-3-4 总交易次数: 5 盈利: 114.41872027190225 亏损: -339.7948954699468 最大盈利: 105.73 最大亏损: -240.51 总收益: -225.38 平均盈利: -45.08 typeA: -18.03 胜率: 40.00%
趋势多且增强-11 总交易次数: 3 盈利: 112.13923295030618 亏损: -303.2365576317487 最大盈利: 112.14 最大亏损: -281.30 总收益: -191.10 平均盈利: -63.70 typeA: -21.23 胜率: 33.33%
趋势多且增强-L1-3-1 总交易次数: 1 盈利: 0 亏损: -215.8711438364867 最大盈利: -215.87 最大亏损: -215.87 总收益: -215.87 平均盈利: -215.87 typeA: 0.00 胜率: 0.00%
趋势多且增强-L1-3-9 总交易次数: 1 盈利: 0 亏损: -215.62782077837164 最大盈利: -215.63 最大亏损: -215.63 总收益: -215.63 平均盈利: -215.63 typeA: 0.00 胜率: 0.00%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     79
      胜率:          59.49%
      总收益:        620.34 USDT
      期末余额:      10460.34 USDT
      盈亏比:        1.13
      最大单笔盈利:  836.27
      最大单笔亏损:  -637.02
      手续费:       318.2155125559043
      =============================
    
profit: 460.33637642695066
maxDrawdown 15.8%
startTime: 2022-05-26 00:00:00
趋势多且增强-11 总交易次数: 2 盈利: 230.27707854231693 亏损: 0 最大盈利: 153.84 最大亏损: 76.43 总收益: 230.28 平均盈利: 115.14 typeA: 115.14 胜率: 100.00%
趋势多且增强-R-3-2 总交易次数: 2 盈利: 117.83537086558465 亏损: 0 最大盈利: 93.66 最大亏损: 24.17 总收益: 117.84 平均盈利: 58.92 typeA: 58.92 胜率: 100.00%
趋势多且增强-R-1-1-1 总交易次数: 1 盈利: 69.87304986234508 亏损: 0 最大盈利: 69.87 最大亏损: 69.87 总收益: 69.87 平均盈利: 69.87 typeA: 69.87 胜率: 100.00%
趋势多且增强-L1-3-1 总交易次数: 1 盈利: 295.1251303441078 亏损: 0 最大盈利: 295.13 最大亏损: 295.13 总收益: 295.13 平均盈利: 295.13 typeA: 295.13 胜率: 100.00%
趋势多且增强-L3-1-4-1 总交易次数: 1 盈利: 51.71658831430504 亏损: 0 最大盈利: 51.72 最大亏损: 51.72 总收益: 51.72 平均盈利: 51.72 typeA: 51.72 胜率: 100.00%
趋势多且增强-L1-3-2 总交易次数: 1 盈利: 303.5204240723423 亏损: 0 最大盈利: 303.52 最大亏损: 303.52 总收益: 303.52 平均盈利: 303.52 typeA: 303.52 胜率: 100.00%
趋势空且增强-L-4-2-3 总交易次数: 5 盈利: 92.42367753974415 亏损: -28.37503662467032 最大盈利: 46.37 最大亏损: -28.38 总收益: 64.05 平均盈利: 12.81 typeA: 10.25 胜率: 80.00%
趋势多且增强-R-3-1 总交易次数: 3 盈利: 208.6782533146319 亏损: -216.94071661237768 最大盈利: 197.03 最大亏损: -216.94 总收益: -8.26 平均盈利: -2.75 typeA: -1.84 胜率: 66.67%
趋势空且增强-L2-3-3 总交易次数: 12 盈利: 1604.2609579716957 亏损: -992.7720272417304 最大盈利: 836.27 最大亏损: -635.34 总收益: 611.49 平均盈利: 50.96 typeA: 33.97 胜率: 66.67%
趋势多且增强-L3-1-3 总交易次数: 3 盈利: 10.009951670572395 亏损: -89.14016364283127 最大盈利: 7.04 最大亏损: -89.14 总收益: -79.13 平均盈利: -26.38 typeA: -17.59 胜率: 66.67%
趋势多且增强-R-1-1-2 总交易次数: 6 盈利: 887.7072012905911 亏损: -108.99142222496533 最大盈利: 576.53 最大亏损: -63.18 总收益: 778.72 平均盈利: 129.79 typeA: 86.53 胜率: 66.67%
趋势空且增强-11 总交易次数: 3 盈利: 258.65874972552257 亏损: -81.59151193633848 最大盈利: 145.77 最大亏损: -81.59 总收益: 177.07 平均盈利: 59.02 typeA: 39.35 胜率: 66.67%
趋势空且增强-L2-3-5 总交易次数: 3 盈利: 33.25379026648131 亏损: -22.064192577734122 最大盈利: 22.06 最大亏损: -22.06 总收益: 11.19 平均盈利: 3.73 typeA: 2.49 胜率: 66.67%
趋势多且增强-L3-1-4-3 总交易次数: 10 盈利: 383.8350356110302 亏损: -884.9278964398853 最大盈利: 176.54 最大亏损: -480.41 总收益: -501.09 平均盈利: -50.11 typeA: -30.07 胜率: 60.00%
趋势多且增强-R-2-2 总交易次数: 2 盈利: 369.71712093146425 亏损: -111.40882823066543 最大盈利: 369.72 最大亏损: -111.41 总收益: 258.31 平均盈利: 129.15 typeA: 64.58 胜率: 50.00%
趋势多且增强-L1-3-4 总交易次数: 8 盈利: 529.0416837781871 亏损: -490.701418570128 最大盈利: 316.84 最大亏损: -289.79 总收益: 38.34 平均盈利: 4.79 typeA: 2.40 胜率: 50.00%
趋势多且增强-R-2-1 总交易次数: 5 盈利: 9.441261737225958 亏损: -510.20159060102463 最大盈利: 5.46 最大亏损: -203.70 总收益: -500.76 平均盈利: -100.15 typeA: -40.06 胜率: 40.00%
趋势空且增强-L2-3-4 总交易次数: 3 盈利: 91.30565209438512 亏损: -76.64546422602997 最大盈利: 91.31 最大亏损: -47.48 总收益: 14.66 平均盈利: 4.89 typeA: 1.63 胜率: 33.33%
趋势多且增强-L3-1-5 总交易次数: 3 盈利: 7.833292353087119 亏损: -75.18808244091426 最大盈利: 7.83 最大亏损: -47.00 总收益: -67.35 平均盈利: -22.45 typeA: -7.48 胜率: 33.33%
趋势空且增强-L3-1-6 总交易次数: 3 盈利: 0 亏损: -791.7032097155837 最大盈利: -37.95 最大亏损: -637.02 总收益: -791.70 平均盈利: -263.90 typeA: 0.00 胜率: 0.00%
趋势多且增强-R-1-2-2 总交易次数: 1 盈利: 0 亏损: -157.23960113960024 最大盈利: -157.24 最大亏损: -157.24 总收益: -157.24 平均盈利: -157.24 typeA: 0.00 胜率: 0.00%
趋势空且增强-L2-2-3 总交易次数: 1 盈利: 0 亏损: -296.2867316341833 最大盈利: -296.29 最大亏损: -296.29 总收益: -296.29 平均盈利: -296.29 typeA: 0.00 胜率: 0.00%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     82
      胜率:          48.78%
      总收益:        -1138.55 USDT
      期末余额:      8697.45 USDT
      盈亏比:        0.74
      最大单笔盈利:  447.35
      最大单笔亏损:  -398.54
      手续费:       327.4655746313188
      =============================
    
profit: -1302.5539903824465
maxDrawdown 14.8%
startTime: 2022-06-25 00:00:00
趋势多且增强-L3-1-5 总交易次数: 5 盈利: 164.55556686353125 亏损: 0 最大盈利: 41.94 最大亏损: 23.76 总收益: 164.56 平均盈利: 32.91 typeA: 32.91 胜率: 100.00%
趋势多且增强-R-2-2 总交易次数: 1 盈利: 42.211954864287684 亏损: 0 最大盈利: 42.21 最大亏损: 42.21 总收益: 42.21 平均盈利: 42.21 typeA: 42.21 胜率: 100.00%
趋势空且增强-L2-3-5 总交易次数: 3 盈利: 273.13164161382883 亏损: 0 最大盈利: 247.98 最大亏损: 11.85 总收益: 273.13 平均盈利: 91.04 typeA: 91.04 胜率: 100.00%
趋势空且增强-11 总交易次数: 4 盈利: 703.2136921188393 亏损: -16.93331121433308 最大盈利: 447.35 最大亏损: -16.93 总收益: 686.28 平均盈利: 171.57 typeA: 128.68 胜率: 75.00%
趋势多且增强-R-2-1 总交易次数: 4 盈利: 98.27988479128058 亏损: -140.5861386138605 最大盈利: 52.59 最大亏损: -140.59 总收益: -42.31 平均盈利: -10.58 typeA: -7.93 胜率: 75.00%
趋势多且增强-11 总交易次数: 3 盈利: 87.12972982532438 亏损: -61.9470605440178 最大盈利: 53.59 最大亏损: -61.95 总收益: 25.18 平均盈利: 8.39 typeA: 5.60 胜率: 66.67%
趋势空且增强-L2-3-4 总交易次数: 11 盈利: 732.7569808064796 亏损: -405.3858126023458 最大盈利: 352.18 最大亏损: -208.60 总收益: 327.37 平均盈利: 29.76 typeA: 16.23 胜率: 54.55%
趋势空且增强-L-4-2-3 总交易次数: 4 盈利: 28.07510195103324 亏损: -111.86958049197789 最大盈利: 27.13 最大亏损: -83.49 总收益: -83.79 平均盈利: -20.95 typeA: -10.47 胜率: 50.00%
趋势多且增强-L3-1-3 总交易次数: 4 盈利: 36.40673369223156 亏损: -35.301639768979776 最大盈利: 34.02 最大亏损: -30.38 总收益: 1.11 平均盈利: 0.28 typeA: 0.14 胜率: 50.00%
趋势多且增强-R-1-1-2 总交易次数: 4 盈利: 110.38243348200547 亏损: -221.00681303571122 最大盈利: 107.73 最大亏损: -163.68 总收益: -110.62 平均盈利: -27.66 typeA: -13.83 胜率: 50.00%
趋势多且增强-R-3-2 总交易次数: 2 盈利: 17.66026319769948 亏损: -29.029738660258275 最大盈利: 17.66 最大亏损: -29.03 总收益: -11.37 平均盈利: -5.68 typeA: -2.84 胜率: 50.00%
趋势空且增强-L2-3-3 总交易次数: 7 盈利: 176.2308747549181 亏损: -419.49797233155977 最大盈利: 97.48 最大亏损: -337.55 总收益: -243.27 平均盈利: -34.75 typeA: -14.89 胜率: 42.86%
趋势多且增强-R-3-1 总交易次数: 5 盈利: 207.53065191387623 亏损: -214.45029293906106 最大盈利: 182.62 最大亏损: -125.10 总收益: -6.92 平均盈利: -1.38 typeA: -0.55 胜率: 40.00%
趋势多且增强-L1-3-2 总交易次数: 3 盈利: 167.6063176367371 亏损: -179.34466477012228 最大盈利: 167.61 最大亏损: -142.75 总收益: -11.74 平均盈利: -3.91 typeA: -1.30 胜率: 33.33%
趋势多且增强-L3-1-4-3 总交易次数: 10 盈利: 419.05424799386674 亏损: -1132.883661759369 最大盈利: 288.92 最大亏损: -378.69 总收益: -713.83 平均盈利: -71.38 typeA: -21.41 胜率: 30.00%
趋势多且增强-L1-3-4 总交易次数: 8 盈利: 17.989849277146284 亏损: -1031.4990484233726 最大盈利: 17.99 最大亏损: -398.54 总收益: -1013.51 平均盈利: -126.69 typeA: -15.84 胜率: 12.50%
趋势多且增强-L1-3-1 总交易次数: 1 盈利: 0 亏损: -106.18811747191675 最大盈利: -106.19 最大亏损: -106.19 总收益: -106.19 平均盈利: -106.19 typeA: 0.00 胜率: 0.00%
趋势空且增强-L2-2-3 总交易次数: 1 盈利: 0 亏损: -127.88856485034556 最大盈利: -127.89 最大亏损: -127.89 总收益: -127.89 平均盈利: -127.89 typeA: 0.00 胜率: 0.00%
趋势空且增强-L3-1-6 总交易次数: 1 盈利: 0 亏损: -45.14413208389091 最大盈利: -45.14 最大亏损: -45.14 总收益: -45.14 平均盈利: -45.14 typeA: 0.00 胜率: 0.00%
趋势多且增强-L1-2-1 总交易次数: 1 盈利: 0 亏损: -141.81336560441028 最大盈利: -141.81 最大亏损: -141.81 总收益: -141.81 平均盈利: -141.81 typeA: 0.00 胜率: 0.00%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     71
      胜率:          52.11%
      总收益:        795.83 USDT
      期末余额:      10651.83 USDT
      盈亏比:        1.24
      最大单笔盈利:  452.25
      最大单笔亏损:  -357.34
      手续费:       285.89077176702654
      =============================
    
profit: 651.8301760531103
maxDrawdown 10.9%
startTime: 2022-07-25 00:00:00
趋势空且增强-L-4-2-3 总交易次数: 2 盈利: 46.247225103167914 亏损: 0 最大盈利: 45.29 最大亏损: 0.96 总收益: 46.25 平均盈利: 23.12 typeA: 23.12 胜率: 100.00%
趋势空且增强-L2-3-4 总交易次数: 5 盈利: 146.94602197961544 亏损: -0.5577505407359591 最大盈利: 56.64 最大亏损: -0.56 总收益: 146.39 平均盈利: 29.28 typeA: 23.42 胜率: 80.00%
趋势空且增强-L2-3-5 总交易次数: 4 盈利: 25.965362763127487 亏损: -112.91585127201613 最大盈利: 13.30 最大亏损: -112.92 总收益: -86.95 平均盈利: -21.74 typeA: -16.30 胜率: 75.00%
趋势空且增强-11 总交易次数: 4 盈利: 231.57414891637194 亏损: -2 最大盈利: 132.82 最大亏损: -2.00 总收益: 229.57 平均盈利: 57.39 typeA: 43.05 胜率: 75.00%
趋势多且增强-R-3-1 总交易次数: 3 盈利: 317.15872296756186 亏损: -37.55131727816356 最大盈利: 182.62 最大亏损: -37.55 总收益: 279.61 平均盈利: 93.20 typeA: 62.14 胜率: 66.67%
趋势多且增强-L3-1-4-3 总交易次数: 8 盈利: 795.2577639848676 亏损: -250.76485766996896 最大盈利: 382.05 最大亏损: -162.19 总收益: 544.49 平均盈利: 68.06 typeA: 42.54 胜率: 62.50%
趋势多且增强-11 总交易次数: 5 盈利: 438.58238501744904 亏损: -71.58818873210176 最大盈利: 259.08 最大亏损: -59.82 总收益: 366.99 平均盈利: 73.40 typeA: 44.04 胜率: 60.00%
趋势空且增强-L2-3-3 总交易次数: 5 盈利: 140.09304702023184 亏损: -199.31122662395842 最大盈利: 84.60 最大亏损: -141.66 总收益: -59.22 平均盈利: -11.84 typeA: -7.11 胜率: 60.00%
趋势多且增强-R-2-1 总交易次数: 6 盈利: 640.5857470601176 亏损: -194.51008024790033 最大盈利: 299.35 最大亏损: -140.59 总收益: 446.08 平均盈利: 74.35 typeA: 37.17 胜率: 50.00%
趋势多且增强-R-1-1-2 总交易次数: 2 盈利: 8.853908188585706 亏损: -132.7953950811095 最大盈利: 8.85 最大亏损: -132.80 总收益: -123.94 平均盈利: -61.97 typeA: -30.99 胜率: 50.00%
趋势多且增强-L3-1-3 总交易次数: 4 盈利: 46.28417687434621 亏损: -389.8516968642042 最大盈利: 36.99 最大亏损: -322.87 总收益: -343.57 平均盈利: -85.89 typeA: -42.95 胜率: 50.00%
趋势多且增强-L3-1-5 总交易次数: 4 盈利: 261.93969579949277 亏损: -360.78120974445767 最大盈利: 243.62 最大亏损: -357.34 总收益: -98.84 平均盈利: -24.71 typeA: -12.36 胜率: 50.00%
趋势空且增强-L3-1-6 总交易次数: 7 盈利: 823.0767900100525 亏损: -411.0383248008126 最大盈利: 452.25 最大亏损: -186.93 总收益: 412.04 平均盈利: 58.86 typeA: 25.23 胜率: 42.86%
趋势多且增强-L1-3-4 总交易次数: 4 盈利: 151.1885900570491 亏损: -359.95174100967455 最大盈利: 151.19 最大亏损: -262.62 总收益: -208.76 平均盈利: -52.19 typeA: -13.05 胜率: 25.00%
趋势多且增强-L1-3-2 总交易次数: 1 盈利: 0 亏损: -27.478339079598783 最大盈利: -27.48 最大亏损: -27.48 总收益: -27.48 平均盈利: -27.48 typeA: 0.00 胜率: 0.00%
趋势多且增强-L3-1-4-1 总交易次数: 2 盈利: 0 亏损: -152.84408585014825 最大盈利: -72.97 最大亏损: -79.88 总收益: -152.84 平均盈利: -76.42 typeA: 0.00 胜率: 0.00%
趋势多且增强-L1-3-1 总交易次数: 1 盈利: 0 亏损: -55.60101580135516 最大盈利: -55.60 最大亏损: -55.60 总收益: -55.60 平均盈利: -55.60 typeA: 0.00 胜率: 0.00%
趋势多且增强-L1-2-5 总交易次数: 1 盈利: 0 亏损: -135.17634119515992 最大盈利: -135.18 最大亏损: -135.18 总收益: -135.18 平均盈利: -135.18 typeA: 0.00 胜率: 0.00%
趋势多且增强-R-2-2 总交易次数: 2 盈利: 0 亏损: -284.8943290223702 最大盈利: -7.84 最大亏损: -277.05 总收益: -284.89 平均盈利: -142.45 typeA: 0.00 胜率: 0.00%
趋势多且增强-R-3-2 总交易次数: 1 盈利: 0 亏损: -98.31165887519478 最大盈利: -98.31 最大亏损: -98.31 总收益: -98.31 平均盈利: -98.31 typeA: 0.00 胜率: 0.00%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     56
      胜率:          58.93%
      总收益:        561.84 USDT
      期末余额:      10447.84 USDT
      盈亏比:        1.28
      最大单笔盈利:  234.02
      最大单笔亏损:  -235.95
      手续费:       225.92702999175802
      =============================
    
profit: 447.8409514491814
maxDrawdown 5.5%
startTime: 2022-08-24 00:00:00
趋势空且增强-11 总交易次数: 1 盈利: 107.69935483870967 亏损: 0 最大盈利: 107.70 最大亏损: 107.70 总收益: 107.70 平均盈利: 107.70 typeA: 107.70 胜率: 100.00%
趋势多且增强-R-2-1 总交易次数: 1 盈利: 55.066210045662615 亏损: 0 最大盈利: 55.07 最大亏损: 55.07 总收益: 55.07 平均盈利: 55.07 typeA: 55.07 胜率: 100.00%
趋势多且增强-L3-1-3 总交易次数: 1 盈利: 2.7791586998091535 亏损: 0 最大盈利: 2.78 最大亏损: 2.78 总收益: 2.78 平均盈利: 2.78 typeA: 2.78 胜率: 100.00%
趋势多且增强-L3-1-4-1 总交易次数: 1 盈利: 50.41207307386767 亏损: 0 最大盈利: 50.41 最大亏损: 50.41 总收益: 50.41 平均盈利: 50.41 typeA: 50.41 胜率: 100.00%
趋势多且增强-R-3-2 总交易次数: 2 盈利: 244.44408602355975 亏损: 0 最大盈利: 126.03 最大亏损: 118.42 总收益: 244.44 平均盈利: 122.22 typeA: 122.22 胜率: 100.00%
趋势空且增强-L2-3-5 总交易次数: 1 盈利: 234.02079207920804 亏损: 0 最大盈利: 234.02 最大亏损: 234.02 总收益: 234.02 平均盈利: 234.02 typeA: 234.02 胜率: 100.00%
趋势多且增强-L3-1-5 总交易次数: 8 盈利: 226.8857309938776 亏损: -37.446473861445824 最大盈利: 74.32 最大亏损: -27.56 总收益: 189.44 平均盈利: 23.68 typeA: 17.76 胜率: 75.00%
趋势空且增强-L2-3-3 总交易次数: 13 盈利: 652.9503393942687 亏损: -127.37912716208854 最大盈利: 182.25 最大亏损: -57.21 总收益: 525.57 平均盈利: 40.43 typeA: 27.99 胜率: 69.23%
趋势多且增强-L3-1-4-3 总交易次数: 6 盈利: 206.02668892902057 亏损: -316.1662508081672 最大盈利: 180.71 最大亏损: -135.48 总收益: -110.14 平均盈利: -18.36 typeA: -9.18 胜率: 50.00%
趋势多且增强-R-3-1 总交易次数: 6 盈利: 295.89868810276175 亏损: -381.3915081445178 最大盈利: 171.01 最大亏损: -204.48 总收益: -85.49 平均盈利: -14.25 typeA: -7.12 胜率: 50.00%
趋势空且增强-L2-3-4 总交易次数: 4 盈利: 189.82680606139542 亏损: -286.97443105472865 最大盈利: 157.32 最大亏损: -220.31 总收益: -97.15 平均盈利: -24.29 typeA: -12.14 胜率: 50.00%
趋势多且增强-L1-3-4 总交易次数: 4 盈利: 282.93872911340884 亏损: -151.56574195395092 最大盈利: 153.02 最大亏损: -102.57 总收益: 131.37 平均盈利: 32.84 typeA: 16.42 胜率: 50.00%
趋势多且增强-11 总交易次数: 3 盈利: 1.402995234853503 亏损: -334.8349734623166 最大盈利: 1.40 最大亏损: -235.95 总收益: -333.43 平均盈利: -111.14 typeA: -37.04 胜率: 33.33%
趋势空且增强-L3-1-6 总交易次数: 3 盈利: 0 亏损: -294.7308610290625 最大盈利: -65.24 最大亏损: -148.49 总收益: -294.73 平均盈利: -98.24 typeA: 0.00 胜率: 0.00%
趋势多且增强-L1-3-1 总交易次数: 1 盈利: 0 亏损: -17.754806177119896 最大盈利: -17.75 最大亏损: -17.75 总收益: -17.75 平均盈利: -17.75 typeA: 0.00 胜率: 0.00%
趋势多且增强-R-1-2-2 总交易次数: 1 盈利: 0 亏损: -40.2665274878227 最大盈利: -40.27 最大亏损: -40.27 总收益: -40.27 平均盈利: -40.27 typeA: 0.00 胜率: 0.00%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     52
      胜率:          63.46%
      总收益:        1223.05 USDT
      期末余额:      11119.05 USDT
      盈亏比:        1.83
      最大单笔盈利:  589.63
      最大单笔亏损:  -633.58
      手续费:       208.42491535524633
      =============================
    
profit: 1119.0475221520373
maxDrawdown 5.9%
startTime: 2022-09-23 00:00:00
趋势空且增强-11 总交易次数: 2 盈利: 117.31521636810632 亏损: 0 最大盈利: 96.27 最大亏损: 21.04 总收益: 117.32 平均盈利: 58.66 typeA: 58.66 胜率: 100.00%
趋势多且增强-R-3-1 总交易次数: 7 盈利: 553.580262953061 亏损: 0 最大盈利: 226.37 最大亏损: 4.82 总收益: 553.58 平均盈利: 79.08 typeA: 79.08 胜率: 100.00%
趋势空且增强-L2-2-3 总交易次数: 2 盈利: 134.77301489537587 亏损: 0 最大盈利: 89.84 最大亏损: 44.93 总收益: 134.77 平均盈利: 67.39 typeA: 67.39 胜率: 100.00%
趋势多且增强-L3-1-5 总交易次数: 2 盈利: 37.80758335809607 亏损: 0 最大盈利: 31.42 最大亏损: 6.39 总收益: 37.81 平均盈利: 18.90 typeA: 18.90 胜率: 100.00%
趋势多且增强-L3-1-4-3 总交易次数: 10 盈利: 640.631931200741 亏损: -83.43362677922886 最大盈利: 589.63 最大亏损: -71.04 总收益: 557.20 平均盈利: 55.72 typeA: 39.00 胜率: 70.00%
趋势空且增强-L2-3-4 总交易次数: 6 盈利: 104.00295251992179 亏损: -95.96767021274152 最大盈利: 62.93 最大亏损: -84.22 总收益: 8.04 平均盈利: 1.34 typeA: 0.89 胜率: 66.67%
趋势多且增强-L1-3-4 总交易次数: 2 盈利: 410.2886597938152 亏损: -123.4394218942188 最大盈利: 410.29 最大亏损: -123.44 总收益: 286.85 平均盈利: 143.42 typeA: 71.71 胜率: 50.00%
趋势空且增强-L2-3-3 总交易次数: 6 盈利: 52.56710594998981 亏损: -126.05136185540178 最大盈利: 32.84 最大亏损: -95.13 总收益: -73.48 平均盈利: -12.25 typeA: -6.12 胜率: 50.00%
趋势多且增强-L3-1-3 总交易次数: 6 盈利: 84.11906943130882 亏损: -64.78325868560545 最大盈利: 73.36 最大亏损: -29.55 总收益: 19.34 平均盈利: 3.22 typeA: 1.61 胜率: 50.00%
趋势多且增强-R-3-2 总交易次数: 2 盈利: 242.90005363847598 亏损: -6.863628993027768 最大盈利: 242.90 最大亏损: -6.86 总收益: 236.04 平均盈利: 118.02 typeA: 59.01 胜率: 50.00%
趋势空且增强-L3-1-6 总交易次数: 3 盈利: 318.1042225201064 亏损: -252.68587462198724 最大盈利: 318.10 最大亏损: -171.68 总收益: 65.42 平均盈利: 21.81 typeA: 7.27 胜率: 33.33%
趋势空且增强-L2-3-5 总交易次数: 3 盈利: 0 亏损: -694.6894853594017 最大盈利: -22.05 最大亏损: -633.58 总收益: -694.69 平均盈利: -231.56 typeA: 0.00 胜率: 0.00%
趋势多且增强-L1-3-2 总交易次数: 1 盈利: 0 亏损: -25.12822207534605 最大盈利: -25.13 最大亏损: -25.13 总收益: -25.13 平均盈利: -25.13 typeA: 0.00 胜率: 0.00%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     88
      胜率:          68.18%
      总收益:        6843.62 USDT
      期末余额:      16665.62 USDT
      盈亏比:        2.45
      最大单笔盈利:  1689.60
      最大单笔亏损:  -694.30
      手续费:       353.7700209403732
      =============================
    
profit: 6665.621096189167
maxDrawdown 5.5%
startTime: 2022-10-23 00:00:00
趋势多且增强-L1-3-1 总交易次数: 1 盈利: 1689.5961188599133 亏损: 0 最大盈利: 1689.60 最大亏损: 1689.60 总收益: 1689.60 平均盈利: 1689.60 typeA: 1689.60 胜率: 100.00%
趋势空且增强-L1-1-2 总交易次数: 2 盈利: 286.23943920440877 亏损: 0 最大盈利: 227.59 最大亏损: 58.65 总收益: 286.24 平均盈利: 143.12 typeA: 143.12 胜率: 100.00%
趋势空且增强-2 总交易次数: 4 盈利: 330.48678709387224 亏损: 0 最大盈利: 129.96 最大亏损: 18.85 总收益: 330.49 平均盈利: 82.62 typeA: 82.62 胜率: 100.00%
趋势多且增强-R-1-2-2 总交易次数: 2 盈利: 17.50293631981069 亏损: 0 最大盈利: 15.47 最大亏损: 2.03 总收益: 17.50 平均盈利: 8.75 typeA: 8.75 胜率: 100.00%
趋势空且增强-L2-3-4 总交易次数: 2 盈利: 70.66795481594477 亏损: 0 最大盈利: 57.32 最大亏损: 13.34 总收益: 70.67 平均盈利: 35.33 typeA: 35.33 胜率: 100.00%
趋势空且增强-11 总交易次数: 3 盈利: 634.8257018093345 亏损: 0 最大盈利: 231.84 最大亏损: 199.06 总收益: 634.83 平均盈利: 211.61 typeA: 211.61 胜率: 100.00%
趋势多且增强-L1-3-4 总交易次数: 1 盈利: 140.58414147176282 亏损: 0 最大盈利: 140.58 最大亏损: 140.58 总收益: 140.58 平均盈利: 140.58 typeA: 140.58 胜率: 100.00%
趋势多且增强-R-2-2 总交易次数: 1 盈利: 85.08606344253822 亏损: 0 最大盈利: 85.09 最大亏损: 85.09 总收益: 85.09 平均盈利: 85.09 typeA: 85.09 胜率: 100.00%
趋势空且增强-L-4-2-3 总交易次数: 1 盈利: 42.804743083003046 亏损: 0 最大盈利: 42.80 最大亏损: 42.80 总收益: 42.80 平均盈利: 42.80 typeA: 42.80 胜率: 100.00%
趋势空且增强-L2-3-3 总交易次数: 8 盈利: 402.2953207880398 亏损: -294.82841140529484 最大盈利: 199.39 最大亏损: -294.83 总收益: 107.47 平均盈利: 13.43 typeA: 11.75 胜率: 87.50%
趋势空且增强-L2-3-5 总交易次数: 7 盈利: 194.02648369051292 亏损: -2 最大盈利: 67.62 最大亏损: -2.00 总收益: 192.03 平均盈利: 27.43 typeA: 23.51 胜率: 85.71%
趋势多且增强-R-1-1-2 总交易次数: 5 盈利: 1508.8126129147838 亏损: -52.3508477421512 最大盈利: 877.91 最大亏损: -52.35 总收益: 1456.46 平均盈利: 291.29 typeA: 233.03 胜率: 80.00%
趋势多且增强-L3-1-4-1 总交易次数: 6 盈利: 726.413414114149 亏损: -253.20297506370514 最大盈利: 491.62 最大亏损: -171.23 总收益: 473.21 平均盈利: 78.87 typeA: 52.58 胜率: 66.67%
趋势空且增强-L2-1-3 总交易次数: 3 盈利: 215.98836753672475 亏损: -673.6892458100556 最大盈利: 108.77 最大亏损: -673.69 总收益: -457.70 平均盈利: -152.57 typeA: -101.72 胜率: 66.67%
趋势空且增强-L3-1-6 总交易次数: 6 盈利: 3336.8880442593963 亏损: -530.2450487922773 最大盈利: 1566.67 最大亏损: -392.11 总收益: 2806.64 平均盈利: 467.77 typeA: 311.86 胜率: 66.67%
趋势多且增强-L1-1-6 总交易次数: 5 盈利: 1107.7422267489585 亏损: -394.80928280919875 最大盈利: 712.76 最大亏损: -248.87 总收益: 712.93 平均盈利: 142.59 typeA: 85.55 胜率: 60.00%
趋势多且增强-L3-1-4-3 总交易次数: 12 盈利: 85.7473654602587 亏损: -507.51649874554016 最大盈利: 45.67 最大亏损: -335.73 总收益: -421.77 平均盈利: -35.15 typeA: -17.57 胜率: 50.00%
趋势多且增强-L3-1-5 总交易次数: 8 盈利: 230.95459731573555 亏损: -176.95476058302492 最大盈利: 133.21 最大亏损: -120.33 总收益: 54.00 平均盈利: 6.75 typeA: 3.37 胜率: 50.00%
趋势多且增强-R-1-1-1 总交易次数: 2 盈利: 137.98366530544223 亏损: -694.3034254752507 最大盈利: 137.98 最大亏损: -694.30 总收益: -556.32 平均盈利: -278.16 typeA: -139.08 胜率: 50.00%
趋势多且增强-R-3-1 总交易次数: 2 盈利: 15.136630754162734 亏损: -35.87568641196385 最大盈利: 15.14 最大亏损: -35.88 总收益: -20.74 平均盈利: -10.37 typeA: -5.18 胜率: 50.00%
趋势多且增强-L3-1-3 总交易次数: 3 盈利: 312.1202872531415 亏损: -557.7077615161152 最大盈利: 312.12 最大亏损: -487.79 总收益: -245.59 平均盈利: -81.86 typeA: -27.28 胜率: 33.33%
趋势多且增强-L1-2-2 总交易次数: 1 盈利: 0 亏损: -315.4508108108114 最大盈利: -315.45 最大亏损: -315.45 总收益: -315.45 平均盈利: -315.45 typeA: 0.00 胜率: 0.00%
趋势多且增强-11 总交易次数: 1 盈利: 0 亏损: -163.4882428067022 最大盈利: -163.49 最大亏损: -163.49 总收益: -163.49 平均盈利: -163.49 typeA: 0.00 胜率: 0.00%
趋势多且增强-R-3-2 总交易次数: 2 盈利: 0 亏损: -75.8588080806393 最大盈利: -5.73 最大亏损: -70.13 总收益: -75.86 平均盈利: -37.93 typeA: 0.00 胜率: 0.00%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     86
      胜率:          56.98%
      总收益:        328.23 USDT
      期末余额:      10156.23 USDT
      盈亏比:        1.08
      最大单笔盈利:  633.89
      最大单笔亏损:  -668.93
      手续费:       343.9014684094466
      =============================
    
profit: 156.23148876691994
maxDrawdown 18.1%
startTime: 2022-11-22 00:00:00
趋势多且增强-L1-2-1 总交易次数: 1 盈利: 552.6168481375371 亏损: 0 最大盈利: 552.62 最大亏损: 552.62 总收益: 552.62 平均盈利: 552.62 typeA: 552.62 胜率: 100.00%
趋势多且增强-R-1-1-1 总交易次数: 1 盈利: 443.13356678339267 亏损: 0 最大盈利: 443.13 最大亏损: 443.13 总收益: 443.13 平均盈利: 443.13 typeA: 443.13 胜率: 100.00%
趋势空且增强-2 总交易次数: 1 盈利: 8.422697991663412 亏损: 0 最大盈利: 8.42 最大亏损: 8.42 总收益: 8.42 平均盈利: 8.42 typeA: 8.42 胜率: 100.00%
趋势多且增强-R-3-2 总交易次数: 1 盈利: 112.7971117424241 亏损: 0 最大盈利: 112.80 最大亏损: 112.80 总收益: 112.80 平均盈利: 112.80 typeA: 112.80 胜率: 100.00%
趋势多且增强-R-2-2 总交易次数: 3 盈利: 371.00455080824815 亏损: 0 最大盈利: 202.56 最大亏损: 14.21 总收益: 371.00 平均盈利: 123.67 typeA: 123.67 胜率: 100.00%
趋势空且增强-11 总交易次数: 6 盈利: 581.3848755271438 亏损: -108.8222440461571 最大盈利: 234.97 最大亏损: -108.82 总收益: 472.56 平均盈利: 78.76 typeA: 65.63 胜率: 83.33%
趋势多且增强-R-3-1 总交易次数: 5 盈利: 401.7306513538988 亏损: -48.4036599920439 最大盈利: 194.78 最大亏损: -48.40 总收益: 353.33 平均盈利: 70.67 typeA: 56.53 胜率: 80.00%
趋势空且增强-L-4-2-3 总交易次数: 6 盈利: 157.62453964834958 亏损: -123.6292200643583 最大盈利: 70.11 最大亏损: -118.68 总收益: 34.00 平均盈利: 5.67 typeA: 3.78 胜率: 66.67%
趋势多且增强-11 总交易次数: 3 盈利: 484.0275360531179 亏损: -92.33459632760132 最大盈利: 449.47 最大亏损: -92.33 总收益: 391.69 平均盈利: 130.56 typeA: 87.05 胜率: 66.67%
趋势空且增强-L2-3-5 总交易次数: 3 盈利: 661.5742980847017 亏损: -5.12757973733607 最大盈利: 633.89 最大亏损: -5.13 总收益: 656.45 平均盈利: 218.82 typeA: 145.88 胜率: 66.67%
趋势多且增强-L3-1-5 总交易次数: 5 盈利: 86.52478851058996 亏损: -53.89433627886559 最大盈利: 57.90 最大亏损: -35.42 总收益: 32.63 平均盈利: 6.53 typeA: 3.92 胜率: 60.00%
趋势多且增强-L3-1-4-3 总交易次数: 16 盈利: 298.1684507449007 亏损: -1146.210725439848 最大盈利: 100.23 最大亏损: -508.18 总收益: -848.04 平均盈利: -53.00 typeA: -29.81 胜率: 56.25%
趋势空且增强-L2-3-3 总交易次数: 13 盈利: 235.67328342413302 亏损: -380.22239707000483 最大盈利: 58.57 最大亏损: -209.14 总收益: -144.55 平均盈利: -11.12 typeA: -5.99 胜率: 53.85%
趋势空且增强-L2-3-4 总交易次数: 8 盈利: 113.40994533154822 亏损: -467.44224029137376 最大盈利: 45.67 最大亏损: -229.45 总收益: -354.03 平均盈利: -44.25 typeA: -22.13 胜率: 50.00%
趋势多且增强-L1-3-4 总交易次数: 3 盈利: 32.71862641072627 亏损: -53.39173547350235 最大盈利: 32.72 最大亏损: -27.74 总收益: -20.67 平均盈利: -6.89 typeA: -2.30 胜率: 33.33%
趋势多且增强-R-2-1 总交易次数: 4 盈利: 98.23322076825733 亏损: -312.08777351747307 最大盈利: 98.23 最大亏损: -293.10 总收益: -213.85 平均盈利: -53.46 typeA: -13.37 胜率: 25.00%
趋势多且增强-L1-3-1 总交易次数: 2 盈利: 0 亏损: -183.49070011198955 最大盈利: -64.79 最大亏损: -118.70 总收益: -183.49 平均盈利: -91.75 typeA: 0.00 胜率: 0.00%
趋势多且增强-L3-1-4-1 总交易次数: 2 盈利: 0 亏损: -859.6040882863849 最大盈利: -190.68 最大亏损: -668.93 总收益: -859.60 平均盈利: -429.80 typeA: 0.00 胜率: 0.00%
趋势多且增强-L1-2-5 总交易次数: 1 盈利: 0 亏损: -172.8525580910704 最大盈利: -172.85 最大亏损: -172.85 总收益: -172.85 平均盈利: -172.85 typeA: 0.00 胜率: 0.00%
趋势多且增强-R-1-1-2 总交易次数: 1 盈利: 0 亏损: -50.94842309006032 最大盈利: -50.95 最大亏损: -50.95 总收益: -50.95 平均盈利: -50.95 typeA: 0.00 胜率: 0.00%
趋势空且增强-L3-1-6 总交易次数: 1 盈利: 0 亏损: -252.35122473564405 最大盈利: -252.35 最大亏损: -252.35 总收益: -252.35 平均盈利: -252.35 typeA: 0.00 胜率: 0.00%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     81
      胜率:          59.26%
      总收益:        451.38 USDT
      期末余额:      10289.38 USDT
      盈亏比:        1.14
      最大单笔盈利:  349.59
      最大单笔亏损:  -570.82
      手续费:       324.09792413372367
      =============================
    
profit: 289.38442319770365
maxDrawdown 11.3%
startTime: 2022-12-22 00:00:00
趋势空且增强-L2-3-4 总交易次数: 8 盈利: 483.23992016863497 亏损: 0 最大盈利: 349.59 最大亏损: 6.61 总收益: 483.24 平均盈利: 60.40 typeA: 60.40 胜率: 100.00%
趋势多且增强-R-3-1 总交易次数: 5 盈利: 294.51215238695204 亏损: 0 最大盈利: 118.90 最大亏损: 16.75 总收益: 294.51 平均盈利: 58.90 typeA: 58.90 胜率: 100.00%
趋势空且增强-L-4-2-3 总交易次数: 2 盈利: 309.4535806324302 亏损: 0 最大盈利: 302.69 最大亏损: 6.77 总收益: 309.45 平均盈利: 154.73 typeA: 154.73 胜率: 100.00%
趋势空且增强-11 总交易次数: 1 盈利: 288.8938746438739 亏损: 0 最大盈利: 288.89 最大亏损: 288.89 总收益: 288.89 平均盈利: 288.89 typeA: 288.89 胜率: 100.00%
趋势多且增强-R-2-1 总交易次数: 1 盈利: 86.32375264402168 亏损: 0 最大盈利: 86.32 最大亏损: 86.32 总收益: 86.32 平均盈利: 86.32 typeA: 86.32 胜率: 100.00%
趋势多且增强-L3-1-5 总交易次数: 8 盈利: 408.203088815869 亏损: -7.198492135707575 最大盈利: 207.44 最大亏损: -7.20 总收益: 401.00 平均盈利: 50.13 typeA: 43.86 胜率: 87.50%
趋势多且增强-L3-1-4-3 总交易次数: 15 盈利: 706.235032699211 亏损: -252.22283582875463 最大盈利: 285.65 最大亏损: -87.44 总收益: 454.01 平均盈利: 30.27 typeA: 18.16 胜率: 60.00%
趋势多且增强-R-3-2 总交易次数: 5 盈利: 437.40647252976436 亏损: -63.33188279793178 最大盈利: 266.93 最大亏损: -56.90 总收益: 374.07 平均盈利: 74.81 typeA: 44.89 胜率: 60.00%
趋势空且增强-L2-3-3 总交易次数: 11 盈利: 435.0054729389137 亏损: -673.9582076018445 最大盈利: 174.36 最大亏损: -570.82 总收益: -238.95 平均盈利: -21.72 typeA: -11.85 胜率: 54.55%
趋势多且增强-11 总交易次数: 4 盈利: 145.11278266806704 亏损: -594.8274162244808 最大盈利: 110.56 最大亏损: -552.19 总收益: -449.71 平均盈利: -112.43 typeA: -56.21 胜率: 50.00%
趋势多且增强-L3-1-3 总交易次数: 4 盈利: 38.86535092841331 亏损: -417.5155694983881 最大盈利: 38.87 最大亏损: -257.59 总收益: -378.65 平均盈利: -94.66 typeA: -23.67 胜率: 25.00%
趋势多且增强-L1-3-4 总交易次数: 4 盈利: 34.053814147017526 亏损: -140.14496891635915 最大盈利: 34.05 最大亏损: -62.52 总收益: -106.09 平均盈利: -26.52 typeA: -6.63 胜率: 25.00%
趋势空且增强-L2-3-5 总交易次数: 9 盈利: 61.66466088895073 亏损: -612.1262749977326 最大盈利: 34.93 最大亏损: -255.02 总收益: -550.46 平均盈利: -61.16 typeA: -13.59 胜率: 22.22%
趋势空且增强-L3-1-6 总交易次数: 2 盈利: 0 亏损: -296.2298011487633 最大盈利: -43.88 最大亏损: -252.35 总收益: -296.23 平均盈利: -148.11 typeA: 0.00 胜率: 0.00%
趋势多且增强-L1-3-2 总交易次数: 1 盈利: 0 亏损: -8.600211249010876 最大盈利: -8.60 最大亏损: -8.60 总收益: -8.60 平均盈利: -8.60 typeA: 0.00 胜率: 0.00%
趋势多且增强-L1-3-1 总交易次数: 1 盈利: 0 亏损: -211.4298724954472 最大盈利: -211.43 最大亏损: -211.43 总收益: -211.43 平均盈利: -211.43 typeA: 0.00 胜率: 0.00%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     80
      胜率:          61.25%
      总收益:        1995.65 USDT
      期末余额:      11835.65 USDT
      盈亏比:        1.75
      最大单笔盈利:  643.73
      最大单笔亏损:  -435.83
      手续费:       319.86796614162466
      =============================
    
profit: 1835.6501194576012
maxDrawdown 7.2%
startTime: 2023-01-21 00:00:00
趋势多且增强-L3-1-3 总交易次数: 2 盈利: 77.66036864558194 亏损: 0 最大盈利: 38.87 最大亏损: 38.80 总收益: 77.66 平均盈利: 38.83 typeA: 38.83 胜率: 100.00%
趋势多且增强-L3-1-5 总交易次数: 3 盈利: 128.39974620871453 亏损: 0 最大盈利: 61.69 最大亏损: 21.38 总收益: 128.40 平均盈利: 42.80 typeA: 42.80 胜率: 100.00%
趋势多且增强-L3-1-4-1 总交易次数: 1 盈利: 51.29545196778929 亏损: 0 最大盈利: 51.30 最大亏损: 51.30 总收益: 51.30 平均盈利: 51.30 typeA: 51.30 胜率: 100.00%
趋势多且增强-L1-2-2 总交易次数: 1 盈利: 44.4285876090166 亏损: 0 最大盈利: 44.43 最大亏损: 44.43 总收益: 44.43 平均盈利: 44.43 typeA: 44.43 胜率: 100.00%
趋势空且增强-11 总交易次数: 1 盈利: 189.52063387256578 亏损: 0 最大盈利: 189.52 最大亏损: 189.52 总收益: 189.52 平均盈利: 189.52 typeA: 189.52 胜率: 100.00%
趋势空且增强-L2-1-3 总交易次数: 1 盈利: 125.07361671811938 亏损: 0 最大盈利: 125.07 最大亏损: 125.07 总收益: 125.07 平均盈利: 125.07 typeA: 125.07 胜率: 100.00%
趋势多且增强-L1-3-1 总交易次数: 1 盈利: 8.439958231812607 亏损: 0 最大盈利: 8.44 最大亏损: 8.44 总收益: 8.44 平均盈利: 8.44 typeA: 8.44 胜率: 100.00%
趋势多且增强-R-1-1-2 总交易次数: 1 盈利: 16.79985897285314 亏损: 0 最大盈利: 16.80 最大亏损: 16.80 总收益: 16.80 平均盈利: 16.80 typeA: 16.80 胜率: 100.00%
趋势空且增强-L-4-2-3 总交易次数: 5 盈利: 526.8983983640682 亏损: -5.243541238785239 最大盈利: 329.47 最大亏损: -5.24 总收益: 521.65 平均盈利: 104.33 typeA: 83.46 胜率: 80.00%
趋势空且增强-L2-3-3 总交易次数: 11 盈利: 449.56915084337083 亏损: -46.209502285834205 最大盈利: 231.65 最大亏损: -21.49 总收益: 403.36 平均盈利: 36.67 typeA: 26.67 胜率: 72.73%
趋势多且增强-11 总交易次数: 7 盈利: 748.4283016372682 亏损: -540.2450469787942 最大盈利: 260.32 最大亏损: -435.83 总收益: 208.18 平均盈利: 29.74 typeA: 21.24 胜率: 71.43%
趋势多且增强-R-2-1 总交易次数: 7 盈利: 807.2173086500029 亏损: -279.80988791601715 最大盈利: 343.77 最大亏损: -242.00 总收益: 527.41 平均盈利: 75.34 typeA: 53.82 胜率: 71.43%
趋势多且增强-L3-1-4-3 总交易次数: 11 盈利: 151.920000275738 亏损: -411.38871108081327 最大盈利: 50.15 最大亏损: -188.37 总收益: -259.47 平均盈利: -23.59 typeA: -12.87 胜率: 54.55%
趋势空且增强-L2-3-5 总交易次数: 6 盈利: 334.9369653385634 亏损: -196.06101456430974 最大盈利: 319.91 最大亏损: -172.52 总收益: 138.88 平均盈利: 23.15 typeA: 11.57 胜率: 50.00%
趋势空且增强-L2-2-3 总交易次数: 2 盈利: 40.75320584926944 亏损: -300.81961668545654 最大盈利: 40.75 最大亏损: -300.82 总收益: -260.07 平均盈利: -130.03 typeA: -65.02 胜率: 50.00%
趋势空且增强-L2-3-4 总交易次数: 12 盈利: 743.8890885177074 亏损: -488.30355084078576 最大盈利: 643.73 最大亏损: -191.86 总收益: 255.59 平均盈利: 21.30 typeA: 8.88 胜率: 41.67%
趋势多且增强-L1-3-4 总交易次数: 3 盈利: 197.84514646754639 亏损: -90.61762016362506 最大盈利: 197.85 最大亏损: -71.82 总收益: 107.23 平均盈利: 35.74 typeA: 11.91 胜率: 33.33%
趋势空且增强-L3-1-6 总交易次数: 1 盈利: 0 亏损: -43.878576413119234 最大盈利: -43.88 最大亏损: -43.88 总收益: -43.88 平均盈利: -43.88 typeA: 0.00 胜率: 0.00%
趋势多且增强-R-3-1 总交易次数: 2 盈利: 0 亏损: -88.9867825337748 最大盈利: -34.51 最大亏损: -54.48 总收益: -88.99 平均盈利: -44.49 typeA: 0.00 胜率: 0.00%
趋势多且增强-R-1-2-2 总交易次数: 1 盈利: 0 亏损: -110.67391304347802 最大盈利: -110.67 最大亏损: -110.67 总收益: -110.67 平均盈利: -110.67 typeA: 0.00 胜率: 0.00%
趋势多且增强-L1-3-9 总交易次数: 1 盈利: 0 亏损: -45.1879049676025 最大盈利: -45.19 最大亏损: -45.19 总收益: -45.19 平均盈利: -45.19 typeA: 0.00 胜率: 0.00%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     66
      胜率:          48.48%
      总收益:        -1450.63 USDT
      期末余额:      8415.37 USDT
      盈亏比:        0.61
      最大单笔盈利:  300.08
      最大单笔亏损:  -553.20
      手续费:       265.8907044373307
      =============================
    
profit: -1584.6278961583466
maxDrawdown 17.0%
startTime: 2023-02-20 00:00:00
趋势多且增强-L3-1-5 总交易次数: 2 盈利: 98.69108138555491 亏损: 0 最大盈利: 60.30 最大亏损: 38.39 总收益: 98.69 平均盈利: 49.35 typeA: 49.35 胜率: 100.00%
趋势多且增强-R-1-1-1 总交易次数: 1 盈利: 38.13649136892743 亏损: 0 最大盈利: 38.14 最大亏损: 38.14 总收益: 38.14 平均盈利: 38.14 typeA: 38.14 胜率: 100.00%
趋势多且增强-R-2-2 总交易次数: 1 盈利: 188.24257357974022 亏损: 0 最大盈利: 188.24 最大亏损: 188.24 总收益: 188.24 平均盈利: 188.24 typeA: 188.24 胜率: 100.00%
趋势空且增强-L-4-2-3 总交易次数: 1 盈利: 59.65616438356055 亏损: 0 最大盈利: 59.66 最大亏损: 59.66 总收益: 59.66 平均盈利: 59.66 typeA: 59.66 胜率: 100.00%
趋势空且增强-L2-3-3 总交易次数: 11 盈利: 468.85080379306135 亏损: -16.040713463766348 最大盈利: 168.02 最大亏损: -8.22 总收益: 452.81 平均盈利: 41.16 typeA: 29.94 胜率: 72.73%
趋势空且增强-L2-3-4 总交易次数: 3 盈利: 68.22271520803201 亏损: -357.0675052410902 最大盈利: 41.05 最大亏损: -357.07 总收益: -288.84 平均盈利: -96.28 typeA: -64.19 胜率: 66.67%
趋势多且增强-R-3-1 总交易次数: 11 盈利: 572.6242794859493 亏损: -1099.575765582655 最大盈利: 196.57 最大亏损: -512.84 总收益: -526.95 平均盈利: -47.90 typeA: -26.13 胜率: 54.55%
趋势多且增强-L1-3-4 总交易次数: 2 盈利: 105.75470668485661 亏损: -63.71604938271532 最大盈利: 105.75 最大亏损: -63.72 总收益: 42.04 平均盈利: 21.02 typeA: 10.51 胜率: 50.00%
趋势多且增强-L3-1-4-3 总交易次数: 10 盈利: 98.66299494241782 亏损: -377.2895598817063 最大盈利: 62.20 最大亏损: -195.29 总收益: -278.63 平均盈利: -27.86 typeA: -11.15 胜率: 40.00%
趋势多且增强-L3-1-3 总交易次数: 5 盈利: 203.1210847857047 亏损: -349.2935664236685 最大盈利: 197.07 最大亏损: -217.92 总收益: -146.17 平均盈利: -29.23 typeA: -11.69 胜率: 40.00%
趋势空且增强-L3-1-6 总交易次数: 5 盈利: 396.83499160874135 亏损: -100.7466980297419 最大盈利: 300.08 最大亏损: -65.81 总收益: 296.09 平均盈利: 59.22 typeA: 23.69 胜率: 40.00%
趋势多且增强-11 总交易次数: 3 盈利: 12.57788578371751 亏损: -29.426505889233255 最大盈利: 12.58 最大亏损: -19.33 总收益: -16.85 平均盈利: -5.62 typeA: -1.87 胜率: 33.33%
趋势空且增强-L2-3-5 总交易次数: 4 盈利: 3.378865286367083 亏损: -121.54262509566014 最大盈利: 3.38 最大亏损: -65.49 总收益: -118.16 平均盈利: -29.54 typeA: -7.39 胜率: 25.00%
趋势多且增强-R-3-2 总交易次数: 1 盈利: 0 亏损: -58.077527109559036 最大盈利: -58.08 最大亏损: -58.08 总收益: -58.08 平均盈利: -58.08 typeA: 0.00 胜率: 0.00%
趋势空且增强-11 总交易次数: 3 盈利: 0 亏损: -841.7529135746013 最大盈利: -103.40 最大亏损: -553.20 总收益: -841.75 平均盈利: -280.58 typeA: 0.00 胜率: 0.00%
趋势多且增强-L1-3-2 总交易次数: 1 盈利: 0 亏损: -31.355517494493547 最大盈利: -31.36 最大亏损: -31.36 总收益: -31.36 平均盈利: -31.36 typeA: 0.00 胜率: 0.00%
趋势多且增强-R-1-1-2 总交易次数: 1 盈利: 0 亏损: -206.30322949414128 最大盈利: -206.30 最大亏损: -206.30 总收益: -206.30 平均盈利: -206.30 typeA: 0.00 胜率: 0.00%
趋势多且增强-R-2-1 总交易次数: 1 盈利: 0 亏损: -113.19435779194374 最大盈利: -113.19 最大亏损: -113.19 总收益: -113.19 平均盈利: -113.19 typeA: 0.00 胜率: 0.00%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     68
      胜率:          50.00%
      总收益:        1989.63 USDT
      期末余额:      11851.63 USDT
      盈亏比:        1.70
      最大单笔盈利:  675.21
      最大单笔亏损:  -330.40
      手续费:       273.6415406285845
      =============================
    
profit: 1851.6266000737069
maxDrawdown 9.8%
startTime: 2023-03-22 00:00:00
趋势多且增强-R-3-2 总交易次数: 1 盈利: 39.73441168797297 亏损: 0 最大盈利: 39.73 最大亏损: 39.73 总收益: 39.73 平均盈利: 39.73 typeA: 39.73 胜率: 100.00%
趋势空且增强-L1-1-2 总交易次数: 1 盈利: 254.6773243584348 亏损: 0 最大盈利: 254.68 最大亏损: 254.68 总收益: 254.68 平均盈利: 254.68 typeA: 254.68 胜率: 100.00%
趋势空且增强-L-4-2-3 总交易次数: 2 盈利: 53.42157041697973 亏损: 0 最大盈利: 39.24 最大亏损: 14.19 总收益: 53.42 平均盈利: 26.71 typeA: 26.71 胜率: 100.00%
趋势多且增强-R-1-1-1 总交易次数: 1 盈利: 76.13670827015093 亏损: 0 最大盈利: 76.14 最大亏损: 76.14 总收益: 76.14 平均盈利: 76.14 typeA: 76.14 胜率: 100.00%
趋势空且增强-2 总交易次数: 1 盈利: 675.2130610461938 亏损: 0 最大盈利: 675.21 最大亏损: 675.21 总收益: 675.21 平均盈利: 675.21 typeA: 675.21 胜率: 100.00%
趋势空且增强-L2-3-4 总交易次数: 7 盈利: 204.60347656651732 亏损: -62.80079324217623 最大盈利: 62.31 最大亏损: -58.36 总收益: 141.80 平均盈利: 20.26 typeA: 14.47 胜率: 71.43%
趋势多且增强-R-2-1 总交易次数: 5 盈利: 57.8676462653883 亏损: -232.84819456282625 最大盈利: 39.26 最大亏损: -186.00 总收益: -174.98 平均盈利: -35.00 typeA: -21.00 胜率: 60.00%
趋势多且增强-11 总交易次数: 7 盈利: 767.6337353457565 亏损: -563.3243271440306 最大盈利: 260.87 最大亏损: -249.86 总收益: 204.31 平均盈利: 29.19 typeA: 16.68 胜率: 57.14%
趋势多且增强-L3-1-4-3 总交易次数: 10 盈利: 160.19765005292993 亏损: -326.1317873218199 最大盈利: 97.67 最大亏损: -206.78 总收益: -165.93 平均盈利: -16.59 typeA: -8.30 胜率: 50.00%
趋势空且增强-L2-3-3 总交易次数: 6 盈利: 892.3709394036091 亏损: -160.54141027269196 最大盈利: 637.15 最大亏损: -147.77 总收益: 731.83 平均盈利: 121.97 typeA: 60.99 胜率: 50.00%
趋势多且增强-L3-1-3 总交易次数: 4 盈利: 601.4686079647175 亏损: -58.8156840631808 最大盈利: 479.34 最大亏损: -54.18 总收益: 542.65 平均盈利: 135.66 typeA: 67.83 胜率: 50.00%
趋势多且增强-L3-1-5 总交易次数: 2 盈利: 3.3803309565467843 亏损: -41.18150263128464 最大盈利: 3.38 最大亏损: -41.18 总收益: -37.80 平均盈利: -18.90 typeA: -9.45 胜率: 50.00%
趋势多且增强-R-1-1-2 总交易次数: 2 盈利: 178.18987181114414 亏损: -119.11374018976231 最大盈利: 178.19 最大亏损: -119.11 总收益: 59.08 平均盈利: 29.54 typeA: 14.77 胜率: 50.00%
趋势多且增强-R-1-2-2 总交易次数: 2 盈利: 161.03055924628626 亏损: -28.313673884435694 最大盈利: 161.03 最大亏损: -28.31 总收益: 132.72 平均盈利: 66.36 typeA: 33.18 胜率: 50.00%
趋势多且增强-R-3-1 总交易次数: 3 盈利: 2.916041794713997 亏损: -373.63855405305725 最大盈利: 2.92 最大亏损: -330.40 总收益: -370.72 平均盈利: -123.57 typeA: -41.19 胜率: 33.33%
趋势空且增强-L2-3-5 总交易次数: 3 盈利: 256.0182094081935 亏损: -42.22727407200418 最大盈利: 256.02 最大亏损: -31.16 总收益: 213.79 平均盈利: 71.26 typeA: 23.75 胜率: 33.33%
趋势空且增强-L3-1-6 总交易次数: 5 盈利: 428.9378278825764 亏损: -584.4914688985657 最大盈利: 428.94 最大亏损: -296.18 总收益: -155.55 平均盈利: -31.11 typeA: -6.22 胜率: 20.00%
趋势多且增强-L1-3-1 总交易次数: 1 盈利: 0 亏损: -124.45107491856632 最大盈利: -124.45 最大亏损: -124.45 总收益: -124.45 平均盈利: -124.45 typeA: 0.00 胜率: 0.00%
趋势多且增强-L3-1-4-1 总交易次数: 1 盈利: 0 亏损: -58.27392120075096 最大盈利: -58.27 最大亏损: -58.27 总收益: -58.27 平均盈利: -58.27 typeA: 0.00 胜率: 0.00%
趋势空且增强-L2-2-3 总交易次数: 1 盈利: 0 亏损: -8.007207207206546 最大盈利: -8.01 最大亏损: -8.01 总收益: -8.01 平均盈利: -8.01 typeA: 0.00 胜率: 0.00%
趋势多且增强-L1-3-4 总交易次数: 2 盈利: 0 亏损: -31.11954679488676 最大盈利: -7.52 最大亏损: -23.60 总收益: -31.12 平均盈利: -15.56 typeA: 0.00 胜率: 0.00%
趋势多且增强-L1-3-2 总交易次数: 1 盈利: 0 亏损: -8.891211947157323 最大盈利: -8.89 最大亏损: -8.89 总收益: -8.89 平均盈利: -8.89 typeA: 0.00 胜率: 0.00%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     57
      胜率:          61.40%
      总收益:        89.17 USDT
      期末余额:      9975.17 USDT
      盈亏比:        1.06
      最大单笔盈利:  250.66
      最大单笔亏损:  -281.54
      手续费:       227.86532448234837
      =============================
    
profit: -24.828377526198892
maxDrawdown 5.6%
startTime: 2023-04-21 00:00:00
趋势多且增强-R-2-2 总交易次数: 1 盈利: 175.42564766839328 亏损: 0 最大盈利: 175.43 最大亏损: 175.43 总收益: 175.43 平均盈利: 175.43 typeA: 175.43 胜率: 100.00%
趋势空且增强-L-4-2-3 总交易次数: 1 盈利: 1.7843359818391034 亏损: 0 最大盈利: 1.78 最大亏损: 1.78 总收益: 1.78 平均盈利: 1.78 typeA: 1.78 胜率: 100.00%
趋势空且增强-L2-2-3 总交易次数: 1 盈利: 55.06679654884411 亏损: 0 最大盈利: 55.07 最大亏损: 55.07 总收益: 55.07 平均盈利: 55.07 typeA: 55.07 胜率: 100.00%
趋势多且增强-L3-1-4-3 总交易次数: 7 盈利: 72.5790367442307 亏损: -22.05214600882436 最大盈利: 15.83 最大亏损: -22.05 总收益: 50.53 平均盈利: 7.22 typeA: 6.19 胜率: 85.71%
趋势空且增强-L2-3-4 总交易次数: 8 盈利: 111.20063627709108 亏损: -160.29344526198813 最大盈利: 28.34 最大亏损: -120.72 总收益: -49.09 平均盈利: -6.14 typeA: -4.60 胜率: 75.00%
趋势多且增强-11 总交易次数: 4 盈利: 149.38500175634724 亏损: -50.91757621377512 最大盈利: 94.51 最大亏损: -50.92 总收益: 98.47 平均盈利: 24.62 typeA: 18.46 胜率: 75.00%
趋势多且增强-R-3-1 总交易次数: 7 盈利: 184.42569891526796 亏损: -193.9222377745471 最大盈利: 76.11 最大亏损: -168.38 总收益: -9.50 平均盈利: -1.36 typeA: -0.97 胜率: 71.43%
趋势空且增强-L2-3-3 总交易次数: 12 盈利: 593.9567395955141 亏损: -100.64436990317469 最大盈利: 250.66 最大亏损: -54.63 总收益: 493.31 平均盈利: 41.11 typeA: 23.98 胜率: 58.33%
趋势多且增强-L3-1-5 总交易次数: 6 盈利: 146.7872286156428 亏损: -230.87413030458487 最大盈利: 123.12 最大亏损: -219.05 总收益: -84.09 平均盈利: -14.01 typeA: -7.01 胜率: 50.00%
趋势多且增强-L3-1-3 总交易次数: 2 盈利: 10.505315822389353 亏损: -21.590202939118438 最大盈利: 10.51 最大亏损: -21.59 总收益: -11.08 平均盈利: -5.54 typeA: -2.77 胜率: 50.00%
趋势空且增强-L2-3-5 总交易次数: 3 盈利: 50.30425481340739 亏损: -163.08003899080805 最大盈利: 50.30 最大亏损: -145.87 总收益: -112.78 平均盈利: -37.59 typeA: -12.53 胜率: 33.33%
趋势多且增强-R-2-1 总交易次数: 1 盈利: 0 亏损: -186.00453800579893 最大盈利: -186.00 最大亏损: -186.00 总收益: -186.00 平均盈利: -186.00 typeA: 0.00 胜率: 0.00%
趋势多且增强-R-1-1-2 总交易次数: 1 盈利: 0 亏损: -14.855857014273223 最大盈利: -14.86 最大亏损: -14.86 总收益: -14.86 平均盈利: -14.86 typeA: 0.00 胜率: 0.00%
趋势多且增强-L1-3-1 总交易次数: 1 盈利: 0 亏损: -281.5374001452424 最大盈利: -281.54 最大亏损: -281.54 总收益: -281.54 平均盈利: -281.54 typeA: 0.00 胜率: 0.00%
趋势多且增强-R-3-2 总交易次数: 1 盈利: 0 亏损: -9.780544747082295 最大盈利: -9.78 最大亏损: -9.78 总收益: -9.78 平均盈利: -9.78 typeA: 0.00 胜率: 0.00%
趋势多且增强-L1-3-4 总交易次数: 1 盈利: 0 亏损: -26.696582955948895 最大盈利: -26.70 最大亏损: -26.70 总收益: -26.70 平均盈利: -26.70 typeA: 0.00 胜率: 0.00%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     63
      胜率:          50.79%
      总收益:        499.85 USDT
      期末余额:      10371.85 USDT
      盈亏比:        1.28
      最大单笔盈利:  1197.14
      最大单笔亏损:  -285.18
      手续费:       253.77954849107064
      =============================
    
profit: 371.853527524996
maxDrawdown 6.1%
startTime: 2023-05-21 00:00:00
趋势空且增强-L3-1-6 总交易次数: 1 盈利: 1197.138011017686 亏损: 0 最大盈利: 1197.14 最大亏损: 1197.14 总收益: 1197.14 平均盈利: 1197.14 typeA: 1197.14 胜率: 100.00%
趋势空且增强-L-4-2-3 总交易次数: 1 盈利: 6.101409363356785 亏损: 0 最大盈利: 6.10 最大亏损: 6.10 总收益: 6.10 平均盈利: 6.10 typeA: 6.10 胜率: 100.00%
趋势多且增强-L3-1-5 总交易次数: 5 盈利: 40.87875230838638 亏损: -10.715385732965931 最大盈利: 11.73 最大亏损: -10.72 总收益: 30.16 平均盈利: 6.03 typeA: 4.83 胜率: 80.00%
趋势多且增强-L3-1-3 总交易次数: 4 盈利: 206.12245480467504 亏损: -152.0668173014849 最大盈利: 165.98 最大亏损: -152.07 总收益: 54.06 平均盈利: 13.51 typeA: 10.14 胜率: 75.00%
趋势多且增强-L3-1-4-3 总交易次数: 12 盈利: 206.06824233399354 亏损: -168.7719399945238 最大盈利: 58.65 最大亏损: -140.94 总收益: 37.30 平均盈利: 3.11 typeA: 2.07 胜率: 66.67%
趋势空且增强-L2-3-3 总交易次数: 10 盈利: 87.17930629549176 亏损: -238.3879314136306 最大盈利: 25.59 最大亏损: -131.73 总收益: -151.21 平均盈利: -15.12 typeA: -7.56 胜率: 50.00%
趋势多且增强-R-3-2 总交易次数: 2 盈利: 128.59356014580797 亏损: -9.44231055530661 最大盈利: 128.59 最大亏损: -9.44 总收益: 119.15 平均盈利: 59.58 typeA: 29.79 胜率: 50.00%
趋势空且增强-L2-3-5 总交易次数: 5 盈利: 203.5998888194075 亏损: -98.4185396416072 最大盈利: 102.47 最大亏损: -50.23 总收益: 105.18 平均盈利: 21.04 typeA: 8.41 胜率: 40.00%
趋势多且增强-R-3-1 总交易次数: 8 盈利: 175.56346335748793 亏损: -376.99280447129394 最大盈利: 161.38 最大亏损: -285.18 总收益: -201.43 平均盈利: -25.18 typeA: -9.44 胜率: 37.50%
趋势空且增强-L2-3-4 总交易次数: 11 盈利: 61.745378663828205 亏损: -410.83942371083435 最大盈利: 28.00 最大亏损: -140.72 总收益: -349.09 平均盈利: -31.74 typeA: -11.54 胜率: 36.36%
趋势多且增强-L1-3-1 总交易次数: 1 盈利: 0 亏损: -101.35547984100032 最大盈利: -101.36 最大亏损: -101.36 总收益: -101.36 平均盈利: -101.36 typeA: 0.00 胜率: 0.00%
趋势多且增强-L1-3-4 总交易次数: 2 盈利: 0 亏损: -170.53747209532665 最大盈利: -21.45 最大亏损: -149.09 总收益: -170.54 平均盈利: -85.27 typeA: 0.00 胜率: 0.00%
趋势多且增强-11 总交易次数: 1 盈利: 0 亏损: -75.60883482714502 最大盈利: -75.61 最大亏损: -75.61 总收益: -75.61 平均盈利: -75.61 typeA: 0.00 胜率: 0.00%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     72
      胜率:          48.61%
      总收益:        -2015.59 USDT
      期末余额:      7838.41 USDT
      盈亏比:        0.59
      最大单笔盈利:  341.14
      最大单笔亏损:  -774.78
      手续费:       290.310608770313
      =============================
    
profit: -2161.586023539079
maxDrawdown 25.1%
startTime: 2023-06-20 00:00:00
趋势多且增强-L1-3-4 总交易次数: 3 盈利: 354.8377814261246 亏损: -324.38280281107825 最大盈利: 341.14 最大亏损: -324.38 总收益: 30.45 平均盈利: 10.15 typeA: 6.77 胜率: 66.67%
趋势多且增强-R-3-1 总交易次数: 3 盈利: 107.37896739652032 亏损: -2 最大盈利: 77.91 最大亏损: -2.00 总收益: 105.38 平均盈利: 35.13 typeA: 23.42 胜率: 66.67%
趋势空且增强-L2-2-3 总交易次数: 3 盈利: 247.7179752069406 亏损: -22.032618025751248 最大盈利: 158.44 最大亏损: -22.03 总收益: 225.69 平均盈利: 75.23 typeA: 50.15 胜率: 66.67%
趋势空且增强-L2-3-5 总交易次数: 5 盈利: 285.4956588969216 亏损: -274.48862131152305 最大盈利: 259.08 最大亏损: -174.47 总收益: 11.01 平均盈利: 2.20 typeA: 1.32 胜率: 60.00%
趋势空且增强-L2-3-3 总交易次数: 11 盈利: 187.5976270132033 亏损: -1771.504466704771 最大盈利: 55.38 最大亏损: -774.78 总收益: -1583.91 平均盈利: -143.99 typeA: -78.55 胜率: 54.55%
趋势空且增强-L2-3-4 总交易次数: 13 盈利: 594.6630995850132 亏损: -972.9231896515248 最大盈利: 245.33 最大亏损: -366.45 总收益: -378.26 平均盈利: -29.10 typeA: -15.67 胜率: 53.85%
趋势多且增强-L3-1-4-3 总交易次数: 16 盈利: 509.1285140755265 亏损: -653.2400421518867 最大盈利: 327.06 最大亏损: -374.43 总收益: -144.11 平均盈利: -9.01 typeA: -4.50 胜率: 50.00%
趋势多且增强-R-2-1 总交易次数: 2 盈利: 219.63455582722085 亏损: -46.907920347358676 最大盈利: 219.63 最大亏损: -46.91 总收益: 172.73 平均盈利: 86.36 typeA: 43.18 胜率: 50.00%
趋势多且增强-L1-3-1 总交易次数: 2 盈利: 164.8490864623787 亏损: -31.823579545454805 最大盈利: 164.85 最大亏损: -31.82 总收益: 133.03 平均盈利: 66.51 typeA: 33.26 胜率: 50.00%
趋势多且增强-L3-1-5 总交易次数: 5 盈利: 42.35593055473388 亏损: -442.6242298154418 最大盈利: 26.15 最大亏损: -275.55 总收益: -400.27 平均盈利: -80.05 typeA: -32.02 胜率: 40.00%
趋势多且增强-11 总交易次数: 3 盈利: 184.45001528584513 亏损: -141.83974016496208 最大盈利: 184.45 最大亏损: -107.87 总收益: 42.61 平均盈利: 14.20 typeA: 4.73 胜率: 33.33%
趋势多且增强-L1-3-2 总交易次数: 1 盈利: 0 亏损: -63.25689277899398 最大盈利: -63.26 最大亏损: -63.26 总收益: -63.26 平均盈利: -63.26 typeA: 0.00 胜率: 0.00%
趋势多且增强-L1-2-2 总交易次数: 1 盈利: 0 亏损: -70.19126396749357 最大盈利: -70.19 最大亏损: -70.19 总收益: -70.19 平均盈利: -70.19 typeA: 0.00 胜率: 0.00%
趋势多且增强-L3-1-3 总交易次数: 1 盈利: 0 亏损: -35.33171692680679 最大盈利: -35.33 最大亏损: -35.33 总收益: -35.33 平均盈利: -35.33 typeA: 0.00 胜率: 0.00%
趋势空且增强-L3-1-6 总交易次数: 2 盈利: 0 亏损: -55.027530102044174 最大盈利: -22.26 最大亏损: -32.77 总收益: -55.03 平均盈利: -27.51 typeA: 0.00 胜率: 0.00%
趋势多且增强-L3-1-4-1 总交易次数: 1 盈利: 0 亏损: -6.1206209644165925 最大盈利: -6.12 最大亏损: -6.12 总收益: -6.12 平均盈利: -6.12 typeA: 0.00 胜率: 0.00%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     71
      胜率:          49.30%
      总收益:        1710.37 USDT
      期末余额:      11568.37 USDT
      盈亏比:        1.76
      最大单笔盈利:  1148.20
      最大单笔亏损:  -324.38
      手续费:       284.10301826910467
      =============================
    
profit: 1568.3684435375453
maxDrawdown 6.6%
startTime: 2023-07-20 00:00:00
趋势空且增强-L3-1-6 总交易次数: 2 盈利: 359.3571449137966 亏损: 0 最大盈利: 197.25 最大亏损: 162.10 总收益: 359.36 平均盈利: 179.68 typeA: 179.68 胜率: 100.00%
趋势多且增强-L3-1-4-1 总交易次数: 1 盈利: 234.3463441451346 亏损: 0 最大盈利: 234.35 最大亏损: 234.35 总收益: 234.35 平均盈利: 234.35 typeA: 234.35 胜率: 100.00%
趋势空且增强-L-4-2-3 总交易次数: 1 盈利: 19.185067513899057 亏损: 0 最大盈利: 19.19 最大亏损: 19.19 总收益: 19.19 平均盈利: 19.19 typeA: 19.19 胜率: 100.00%
趋势多且增强-L3-1-5 总交易次数: 3 盈利: 78.53748900482607 亏损: 0 最大盈利: 39.76 最大亏损: 15.73 总收益: 78.54 平均盈利: 26.18 typeA: 26.18 胜率: 100.00%
趋势多且增强-R-3-2 总交易次数: 1 盈利: 82.20186576833348 亏损: 0 最大盈利: 82.20 最大亏损: 82.20 总收益: 82.20 平均盈利: 82.20 typeA: 82.20 胜率: 100.00%
趋势多且增强-R-1-1-1 总交易次数: 1 盈利: 1148.19633460352 亏损: 0 最大盈利: 1148.20 最大亏损: 1148.20 总收益: 1148.20 平均盈利: 1148.20 typeA: 1148.20 胜率: 100.00%
趋势多且增强-11 总交易次数: 4 盈利: 131.84094856189304 亏损: -22.846538782318234 最大盈利: 73.45 最大亏损: -22.85 总收益: 108.99 平均盈利: 27.25 typeA: 20.44 胜率: 75.00%
趋势空且增强-L2-3-4 总交易次数: 13 盈利: 1001.6351467429472 亏损: -395.2161021189145 最大盈利: 379.10 最大亏损: -192.25 总收益: 606.42 平均盈利: 46.65 typeA: 25.12 胜率: 53.85%
趋势多且增强-L1-3-4 总交易次数: 4 盈利: 243.20670840098379 亏损: -472.2763650428375 最大盈利: 123.98 最大亏损: -324.38 总收益: -229.07 平均盈利: -57.27 typeA: -28.63 胜率: 50.00%
趋势多且增强-R-3-1 总交易次数: 10 盈利: 390.4283830881164 亏损: -350.84370773584124 最大盈利: 114.32 最大亏损: -121.59 总收益: 39.58 平均盈利: 3.96 typeA: 1.98 胜率: 50.00%
趋势多且增强-R-2-2 总交易次数: 2 盈利: 10.72729844413108 亏损: -6.22748414376353 最大盈利: 10.73 最大亏损: -6.23 总收益: 4.50 平均盈利: 2.25 typeA: 1.12 胜率: 50.00%
趋势多且增强-L3-1-4-3 总交易次数: 11 盈利: 175.23184465470592 亏损: -355.1633737338746 最大盈利: 143.00 最大亏损: -153.55 总收益: -179.93 平均盈利: -16.36 typeA: -5.95 胜率: 36.36%
趋势多且增强-L3-1-3 总交易次数: 3 盈利: 9.13363028953184 亏损: -49.97272124341919 最大盈利: 9.13 最大亏损: -37.40 总收益: -40.84 平均盈利: -13.61 typeA: -4.54 胜率: 33.33%
趋势空且增强-L2-3-5 总交易次数: 3 盈利: 3.362283876155793 亏损: -226.37118716548053 最大盈利: 3.36 最大亏损: -211.11 总收益: -223.01 平均盈利: -74.34 typeA: -24.78 胜率: 33.33%
趋势空且增强-L2-3-3 总交易次数: 8 盈利: 84.78828389959418 亏损: -215.8019113259757 最大盈利: 47.42 最大亏损: -116.98 总收益: -131.01 平均盈利: -16.38 typeA: -4.09 胜率: 25.00%
趋势空且增强-L2-2-3 总交易次数: 1 盈利: 0 亏损: -18.114930182598698 最大盈利: -18.11 最大亏损: -18.11 总收益: -18.11 平均盈利: -18.11 typeA: 0.00 胜率: 0.00%
趋势多且增强-L1-3-2 总交易次数: 1 盈利: 0 亏损: -80.83634953464316 最大盈利: -80.84 最大亏损: -80.84 总收益: -80.84 平均盈利: -80.84 typeA: 0.00 胜率: 0.00%
趋势多且增强-L1-3-1 总交易次数: 1 盈利: 0 亏损: -33.12314780226624 最大盈利: -33.12 最大亏损: -33.12 总收益: -33.12 平均盈利: -33.12 typeA: 0.00 胜率: 0.00%
趋势多且增强-R-2-1 总交易次数: 1 盈利: 0 亏损: -35.016511558090365 最大盈利: -35.02 最大亏损: -35.02 总收益: -35.02 平均盈利: -35.02 typeA: 0.00 胜率: 0.00%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     52
      胜率:          57.69%
      总收益:        -382.54 USDT
      期末余额:      9513.46 USDT
      盈亏比:        0.71
      最大单笔盈利:  131.84
      最大单笔亏损:  -296.01
      手续费:       207.86387886644266
      =============================
    
profit: -486.53821364898795
maxDrawdown 6.9%
startTime: 2023-08-19 00:00:00
趋势多且增强-R-3-1 总交易次数: 4 盈利: 190.24274767052552 亏损: 0 最大盈利: 82.95 最大亏损: 10.99 总收益: 190.24 平均盈利: 47.56 typeA: 47.56 胜率: 100.00%
趋势多且增强-L1-3-4 总交易次数: 1 盈利: 9.052747946936295 亏损: 0 最大盈利: 9.05 最大亏损: 9.05 总收益: 9.05 平均盈利: 9.05 typeA: 9.05 胜率: 100.00%
趋势空且增强-L3-1-6 总交易次数: 2 盈利: 150.7104816273695 亏损: 0 最大盈利: 131.84 最大亏损: 18.87 总收益: 150.71 平均盈利: 75.36 typeA: 75.36 胜率: 100.00%
趋势空且增强-L2-3-4 总交易次数: 5 盈利: 156.28660403003482 亏损: -5.16769596199622 最大盈利: 108.07 最大亏损: -5.17 总收益: 151.12 平均盈利: 30.22 typeA: 24.18 胜率: 80.00%
趋势多且增强-L3-1-4-3 总交易次数: 10 盈利: 103.8123320360601 亏损: -355.23780671744936 最大盈利: 29.25 最大亏损: -266.28 总收益: -251.43 平均盈利: -25.14 typeA: -17.60 胜率: 70.00%
趋势多且增强-L1-3-2 总交易次数: 2 盈利: 40.45101431042716 亏损: -296.01470367591946 最大盈利: 40.45 最大亏损: -296.01 总收益: -255.56 平均盈利: -127.78 typeA: -63.89 胜率: 50.00%
趋势空且增强-L2-3-5 总交易次数: 6 盈利: 146.9061332711026 亏损: -110.872534956829 最大盈利: 92.82 最大亏损: -92.47 总收益: 36.03 平均盈利: 6.01 typeA: 3.00 胜率: 50.00%
趋势多且增强-L3-1-5 总交易次数: 7 盈利: 29.5958846429204 亏损: -180.49018295375555 最大盈利: 15.76 最大亏损: -97.05 总收益: -150.89 平均盈利: -21.56 typeA: -9.24 胜率: 42.86%
趋势空且增强-L2-3-3 总交易次数: 12 盈利: 117.59903249542337 亏损: -304.4561608699004 最大盈利: 54.38 最大亏损: -104.30 总收益: -186.86 平均盈利: -15.57 typeA: -6.49 胜率: 41.67%
趋势多且增强-L3-1-3 总交易次数: 3 盈利: 0 亏损: -74.95610654393603 最大盈利: -3.57 最大亏损: -67.74 总收益: -74.96 平均盈利: -24.99 typeA: 0.00 胜率: 0.00%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     58
      胜率:          53.45%
      总收益:        -7.74 USDT
      期末余额:      9876.26 USDT
      盈亏比:        0.99
      最大单笔盈利:  307.26
      最大单笔亏损:  -181.41
      手续费:       232.00080702483615
      =============================
    
profit: -123.73925242043879
maxDrawdown 3.6%
startTime: 2023-09-18 00:00:00
趋势空且增强-L2-3-3 总交易次数: 9 盈利: 86.82502972488636 亏损: -114.64764875733772 最大盈利: 23.66 最大亏损: -69.93 总收益: -27.82 平均盈利: -3.09 typeA: -2.06 胜率: 66.67%
趋势多且增强-L3-1-5 总交易次数: 6 盈利: 59.17478596642401 亏损: -15.74968259772072 最大盈利: 20.69 最大亏损: -10.40 总收益: 43.43 平均盈利: 7.24 typeA: 4.83 胜率: 66.67%
趋势空且增强-L2-3-5 总交易次数: 3 盈利: 19.436247372892904 亏损: -21.68897637795309 最大盈利: 11.60 最大亏损: -21.69 总收益: -2.25 平均盈利: -0.75 typeA: -0.50 胜率: 66.67%
趋势多且增强-L3-1-4-3 总交易次数: 18 盈利: 210.84967641091296 亏损: -245.1327706314125 最大盈利: 80.21 最大亏损: -76.87 总收益: -34.28 平均盈利: -1.90 typeA: -1.06 胜率: 55.56%
趋势空且增强-L2-3-4 总交易次数: 10 盈利: 52.96999121537104 亏损: -140.11756971488737 最大盈利: 20.02 最大亏损: -59.86 总收益: -87.15 平均盈利: -8.71 typeA: -4.36 胜率: 50.00%
趋势多且增强-R-3-1 总交易次数: 2 盈利: 71.02548287615632 亏损: -30.925459496255364 最大盈利: 71.03 最大亏损: -30.93 总收益: 40.10 平均盈利: 20.05 typeA: 10.03 胜率: 50.00%
趋势空且增强-L3-1-6 总交易次数: 6 盈利: 355.16561830558345 亏损: -241.81905391365478 最大盈利: 307.26 最大亏损: -181.41 总收益: 113.35 平均盈利: 18.89 typeA: 6.30 胜率: 33.33%
趋势多且增强-L3-1-3 总交易次数: 4 盈利: 39.17661967368863 亏损: -92.2815424771304 最大盈利: 39.18 最大亏损: -67.74 总收益: -53.10 平均盈利: -13.28 typeA: -3.32 胜率: 25.00%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     73
      胜率:          67.12%
      总收益:        1943.37 USDT
      期末余额:      11797.37 USDT
      盈亏比:        1.67
      最大单笔盈利:  552.11
      最大单笔亏损:  -590.13
      手续费:       292.6470303616089
      =============================
    
profit: 1797.3665119659654
maxDrawdown 8.8%
startTime: 2023-10-18 00:00:00
趋势空且增强-L3-1-6 总交易次数: 1 盈利: 28.608429545138122 亏损: 0 最大盈利: 28.61 最大亏损: 28.61 总收益: 28.61 平均盈利: 28.61 typeA: 28.61 胜率: 100.00%
趋势多且增强-R-3-2 总交易次数: 1 盈利: 17.215552927260678 亏损: 0 最大盈利: 17.22 最大亏损: 17.22 总收益: 17.22 平均盈利: 17.22 typeA: 17.22 胜率: 100.00%
趋势多且增强-L3-1-5 总交易次数: 1 盈利: 14.069257744009201 亏损: 0 最大盈利: 14.07 最大亏损: 14.07 总收益: 14.07 平均盈利: 14.07 typeA: 14.07 胜率: 100.00%
趋势多且增强-L3-1-3 总交易次数: 3 盈利: 204.67728168324797 亏损: 0 最大盈利: 150.36 最大亏损: 2.04 总收益: 204.68 平均盈利: 68.23 typeA: 68.23 胜率: 100.00%
趋势多且增强-L1-3-4 总交易次数: 2 盈利: 647.3891436720107 亏损: 0 最大盈利: 348.28 最大亏损: 299.11 总收益: 647.39 平均盈利: 323.69 typeA: 323.69 胜率: 100.00%
趋势多且增强-L3-1-4-3 总交易次数: 16 盈利: 609.8449246663436 亏损: -360.96380662904585 最大盈利: 248.76 最大亏损: -190.53 总收益: 248.88 平均盈利: 15.56 typeA: 13.61 胜率: 87.50%
趋势多且增强-11 总交易次数: 4 盈利: 853.7883043103694 亏损: -107.47280449376531 最大盈利: 532.77 最大亏损: -107.47 总收益: 746.32 平均盈利: 186.58 typeA: 139.93 胜率: 75.00%
趋势多且增强-R-3-1 总交易次数: 4 盈利: 566.4943959706965 亏损: -56.00270067516867 最大盈利: 248.57 最大亏损: -56.00 总收益: 510.49 平均盈利: 127.62 typeA: 95.72 胜率: 75.00%
趋势空且增强-L2-3-5 总交易次数: 6 盈利: 72.26397442555667 亏损: -81.10147472794503 最大盈利: 25.53 最大亏损: -58.90 总收益: -8.84 平均盈利: -1.47 typeA: -0.98 胜率: 66.67%
趋势空且增强-L-4-2-3 总交易次数: 6 盈利: 152.60451811766035 亏损: -883.904172962423 最大盈利: 50.63 最大亏损: -590.13 总收益: -731.30 平均盈利: -121.88 typeA: -81.26 胜率: 66.67%
趋势空且增强-L2-3-3 总交易次数: 10 盈利: 775.0043886970228 亏损: -593.7156360602958 最大盈利: 552.11 最大亏损: -355.01 总收益: 181.29 平均盈利: 18.13 typeA: 9.06 胜率: 50.00%
趋势多且增强-L1-3-1 总交易次数: 2 盈利: 113.10077274877914 亏损: -33.51232091690515 最大盈利: 113.10 最大亏损: -33.51 总收益: 79.59 平均盈利: 39.79 typeA: 19.90 胜率: 50.00%
趋势多且增强-R-2-1 总交易次数: 2 盈利: 274.1878453038665 亏损: -76.37252042006952 最大盈利: 274.19 最大亏损: -76.37 总收益: 197.82 平均盈利: 98.91 typeA: 49.45 胜率: 50.00%
趋势空且增强-L2-3-4 总交易次数: 13 盈利: 507.41046896290436 亏损: -621.854142682586 最大盈利: 265.88 最大亏损: -164.05 总收益: -114.44 平均盈利: -8.80 typeA: -4.06 胜率: 46.15%
趋势多且增强-L1-3-2 总交易次数: 1 盈利: 0 亏损: -4.4923345382017015 最大盈利: -4.49 最大亏损: -4.49 总收益: -4.49 平均盈利: -4.49 typeA: 0.00 胜率: 0.00%
趋势多且增强-L3-1-4-1 总交易次数: 1 盈利: 0 亏损: -73.90083270249825 最大盈利: -73.90 最大亏损: -73.90 总收益: -73.90 平均盈利: -73.90 typeA: 0.00 胜率: 0.00%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     70
      胜率:          64.29%
      总收益:        4212.08 USDT
      期末余额:      14072.08 USDT
      盈亏比:        2.88
      最大单笔盈利:  1053.58
      最大单笔亏损:  -610.81
      手续费:       279.9455076126467
      =============================
    
profit: 4072.082141545512
maxDrawdown 5.2%
startTime: 2023-11-17 00:00:00
趋势空且增强-11 总交易次数: 4 盈利: 431.4749054939863 亏损: 0 最大盈利: 121.13 最大亏损: 96.90 总收益: 431.47 平均盈利: 107.87 typeA: 107.87 胜率: 100.00%
趋势多且增强-R-2-1 总交易次数: 2 盈利: 449.1223963280444 亏损: 0 最大盈利: 302.66 最大亏损: 146.46 总收益: 449.12 平均盈利: 224.56 typeA: 224.56 胜率: 100.00%
趋势多且增强-L3-1-5 总交易次数: 3 盈利: 249.49671596066776 亏损: 0 最大盈利: 171.23 最大亏损: 15.27 总收益: 249.50 平均盈利: 83.17 typeA: 83.17 胜率: 100.00%
趋势空且增强-L1-1-2 总交易次数: 1 盈利: 327.36368038740926 亏损: 0 最大盈利: 327.36 最大亏损: 327.36 总收益: 327.36 平均盈利: 327.36 typeA: 327.36 胜率: 100.00%
趋势多且增强-L1-3-9 总交易次数: 1 盈利: 155.10563665855594 亏损: 0 最大盈利: 155.11 最大亏损: 155.11 总收益: 155.11 平均盈利: 155.11 typeA: 155.11 胜率: 100.00%
趋势多且增强-R-1-2-2 总交易次数: 1 盈利: 51.47107618423972 亏损: 0 最大盈利: 51.47 最大亏损: 51.47 总收益: 51.47 平均盈利: 51.47 typeA: 51.47 胜率: 100.00%
趋势空且增强-L2-3-3 总交易次数: 9 盈利: 810.2884942371273 亏损: -11.571291866029426 最大盈利: 471.97 最大亏损: -11.57 总收益: 798.72 平均盈利: 88.75 typeA: 78.89 胜率: 88.89%
趋势空且增强-L-4-2-3 总交易次数: 5 盈利: 644.4166631228422 亏损: -9.217194103700713 最大盈利: 512.12 最大亏损: -9.22 总收益: 635.20 平均盈利: 127.04 typeA: 101.63 胜率: 80.00%
趋势空且增强-L2-3-5 总交易次数: 3 盈利: 339.6956301911009 亏损: -22.299012312271326 最大盈利: 319.45 最大亏损: -22.30 总收益: 317.40 平均盈利: 105.80 typeA: 70.54 胜率: 66.67%
趋势多且增强-L1-3-1 总交易次数: 3 盈利: 1072.2067843606028 亏损: -20.672338659472878 最大盈利: 1053.58 最大亏损: -20.67 总收益: 1051.53 平均盈利: 350.51 typeA: 233.69 胜率: 66.67%
趋势多且增强-R-1-1-2 总交易次数: 3 盈利: 263.97879320142175 亏损: -23.099504062466167 最大盈利: 231.10 最大亏损: -23.10 总收益: 240.88 平均盈利: 80.29 typeA: 53.53 胜率: 66.67%
趋势多且增强-L3-1-4-3 总交易次数: 13 盈利: 676.7513412825805 亏损: -517.5063413903141 最大盈利: 329.88 最大亏损: -179.55 总收益: 159.24 平均盈利: 12.25 typeA: 6.60 胜率: 53.85%
趋势多且增强-R-3-1 总交易次数: 2 盈利: 23.50167807759373 亏损: -49.06437659033196 最大盈利: 23.50 最大亏损: -49.06 总收益: -25.56 平均盈利: -12.78 typeA: -6.39 胜率: 50.00%
趋势空且增强-L2-3-4 总交易次数: 8 盈利: 448.8135630337047 亏损: -604.3836076311109 最大盈利: 359.10 最大亏损: -330.42 总收益: -155.57 平均盈利: -19.45 typeA: -9.72 胜率: 50.00%
趋势多且增强-L3-1-3 总交易次数: 2 盈利: 28.753288078065186 亏损: -4.555072834141611 最大盈利: 28.75 最大亏损: -4.56 总收益: 24.20 平均盈利: 12.10 typeA: 6.05 胜率: 50.00%
趋势多且增强-L1-3-4 总交易次数: 3 盈利: 455.9141395232737 亏损: -689.4566199948298 最大盈利: 455.91 最大亏损: -610.81 总收益: -233.54 平均盈利: -77.85 typeA: -25.95 胜率: 33.33%
趋势多且增强-11 总交易次数: 4 盈利: 23.806413183758202 亏损: -74.77038960190664 最大盈利: 23.81 最大亏损: -41.94 总收益: -50.96 平均盈利: -12.74 typeA: -3.19 胜率: 25.00%
趋势多且增强-L3-1-4-1 总交易次数: 1 盈利: 0 亏损: -107.60872008090756 最大盈利: -107.61 最大亏损: -107.61 总收益: -107.61 平均盈利: -107.61 typeA: 0.00 胜率: 0.00%
趋势空且增强-L3-1-6 总交易次数: 1 盈利: 0 亏损: -69.00011164452421 最大盈利: -69.00 最大亏损: -69.00 总收益: -69.00 平均盈利: -69.00 typeA: 0.00 胜率: 0.00%
趋势空且增强-2 总交易次数: 1 盈利: 0 亏损: -36.874476987448006 最大盈利: -36.87 最大亏损: -36.87 总收益: -36.87 平均盈利: -36.87 typeA: 0.00 胜率: 0.00%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     93
      胜率:          63.44%
      总收益:        356.99 USDT
      期末余额:      10168.99 USDT
      盈亏比:        1.08
      最大单笔盈利:  568.78
      最大单笔亏损:  -897.70
      手续费:       373.8272822949675
      =============================
    
profit: 168.99118361262117
maxDrawdown 13.8%
startTime: 2023-12-17 00:00:00
趋势多且增强-R-2-1 总交易次数: 1 盈利: 76.2537232307858 亏损: 0 最大盈利: 76.25 最大亏损: 76.25 总收益: 76.25 平均盈利: 76.25 typeA: 76.25 胜率: 100.00%
趋势多且增强-L1-3-1 总交易次数: 1 盈利: 118.09284709447027 亏损: 0 最大盈利: 118.09 最大亏损: 118.09 总收益: 118.09 平均盈利: 118.09 typeA: 118.09 胜率: 100.00%
趋势多且增强-R-2-2 总交易次数: 1 盈利: 228.32596319343378 亏损: 0 最大盈利: 228.33 最大亏损: 228.33 总收益: 228.33 平均盈利: 228.33 typeA: 228.33 胜率: 100.00%
趋势空且增强-L2-2-3 总交易次数: 1 盈利: 74.82027649769451 亏损: 0 最大盈利: 74.82 最大亏损: 74.82 总收益: 74.82 平均盈利: 74.82 typeA: 74.82 胜率: 100.00%
趋势多且增强-L3-1-4-1 总交易次数: 1 盈利: 39.72682433286923 亏损: 0 最大盈利: 39.73 最大亏损: 39.73 总收益: 39.73 平均盈利: 39.73 typeA: 39.73 胜率: 100.00%
趋势多且增强-L3-1-5 总交易次数: 6 盈利: 442.6397790255561 亏损: -5.297130922282319 最大盈利: 229.34 最大亏损: -5.30 总收益: 437.34 平均盈利: 72.89 typeA: 60.74 胜率: 83.33%
趋势空且增强-L-4-2-3 总交易次数: 5 盈利: 669.6446293200123 亏损: -80.50530335171729 最大盈利: 568.78 最大亏损: -80.51 总收益: 589.14 平均盈利: 117.83 typeA: 94.26 胜率: 80.00%
趋势空且增强-L2-3-4 总交易次数: 18 盈利: 282.5613397706026 亏损: -195.20366118787854 最大盈利: 53.54 最大亏损: -69.70 总收益: 87.36 平均盈利: 4.85 typeA: 3.50 胜率: 72.22%
趋势空且增强-L2-3-3 总交易次数: 10 盈利: 626.5324149402793 亏损: -67.24415022714919 最大盈利: 233.42 最大亏损: -28.74 总收益: 559.29 平均盈利: 55.93 typeA: 39.15 胜率: 70.00%
趋势多且增强-L3-1-4-3 总交易次数: 13 盈利: 393.45462402302616 亏损: -381.81410043794637 最大盈利: 144.09 最大亏损: -323.96 总收益: 11.64 平均盈利: 0.90 typeA: 0.62 胜率: 69.23%
趋势空且增强-11 总交易次数: 3 盈利: 572.5696196083584 亏损: -897.701492537314 最大盈利: 327.08 最大亏损: -897.70 总收益: -325.13 平均盈利: -108.38 typeA: -72.26 胜率: 66.67%
趋势多且增强-R-1-1-2 总交易次数: 3 盈利: 471.0348306998088 亏损: -172.06335510908326 最大盈利: 279.89 最大亏损: -172.06 总收益: 298.97 平均盈利: 99.66 typeA: 66.44 胜率: 66.67%
趋势空且增强-L3-1-6 总交易次数: 2 盈利: 96.1634307659488 亏损: -21.90695360119337 最大盈利: 96.16 最大亏损: -21.91 总收益: 74.26 平均盈利: 37.13 typeA: 18.56 胜率: 50.00%
趋势多且增强-L1-3-2 总交易次数: 2 盈利: 24.908170954892906 亏损: -157.5963645418328 最大盈利: 24.91 最大亏损: -157.60 总收益: -132.69 平均盈利: -66.34 typeA: -33.17 胜率: 50.00%
趋势多且增强-R-3-1 总交易次数: 7 盈利: 329.05669608071014 亏损: -1201.575514800339 最大盈利: 240.02 最大亏损: -837.68 总收益: -872.52 平均盈利: -124.65 typeA: -53.42 胜率: 42.86%
趋势空且增强-L2-3-5 总交易次数: 7 盈利: 63.87201005554945 亏损: -512.2580238191762 最大盈利: 45.14 最大亏损: -173.75 总收益: -448.39 平均盈利: -64.06 typeA: -27.45 胜率: 42.86%
趋势多且增强-L1-3-4 总交易次数: 6 盈利: 28.97612105242299 亏损: -286.9360704938489 最大盈利: 15.90 最大亏损: -90.25 总收益: -257.96 平均盈利: -42.99 typeA: -14.33 胜率: 33.33%
趋势多且增强-11 总交易次数: 6 盈利: 205.63912096333624 亏损: -407.179116967372 最大盈利: 142.18 最大亏损: -298.36 总收益: -201.54 平均盈利: -33.59 typeA: -11.20 胜率: 33.33%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     46
      胜率:          50.00%
      总收益:        1665.08 USDT
      期末余额:      11573.08 USDT
      盈亏比:        2.51
      最大单笔盈利:  867.50
      最大单笔亏损:  -253.43
      手续费:       184.17472578678152
      =============================
    
profit: 1573.0821692908576
maxDrawdown 3.8%
startTime: 2024-01-16 00:00:00
趋势空且增强-11 总交易次数: 1 盈利: 195.01660059464746 亏损: 0 最大盈利: 195.02 最大亏损: 195.02 总收益: 195.02 平均盈利: 195.02 typeA: 195.02 胜率: 100.00%
趋势多且增强-L3-1-4-1 总交易次数: 1 盈利: 149.72981714143535 亏损: 0 最大盈利: 149.73 最大亏损: 149.73 总收益: 149.73 平均盈利: 149.73 typeA: 149.73 胜率: 100.00%
趋势多且增强-L3-1-5 总交易次数: 3 盈利: 438.54674870189586 亏损: 0 最大盈利: 400.73 最大亏损: 18.21 总收益: 438.55 平均盈利: 146.18 typeA: 146.18 胜率: 100.00%
趋势空且增强-L3-1-6 总交易次数: 6 盈利: 634.974799535526 亏损: -41.450758042647706 最大盈利: 163.28 最大亏损: -41.45 总收益: 593.52 平均盈利: 98.92 typeA: 82.43 胜率: 83.33%
趋势多且增强-L3-1-3 总交易次数: 4 盈利: 979.2148962512549 亏损: -9.365009208101979 最大盈利: 867.50 最大亏损: -9.37 总收益: 969.85 平均盈利: 242.46 typeA: 181.85 胜率: 75.00%
趋势多且增强-L3-1-4-3 总交易次数: 9 盈利: 218.8542660959629 亏损: -109.74534989791852 最大盈利: 203.48 最大亏损: -30.96 总收益: 109.11 平均盈利: 12.12 typeA: 5.39 胜率: 44.44%
趋势空且增强-L2-3-5 总交易次数: 8 盈利: 31.23960924738506 亏损: -109.63386269205786 最大盈利: 16.47 最大亏损: -53.43 总收益: -78.39 平均盈利: -9.80 typeA: -3.67 胜率: 37.50%
趋势空且增强-L2-3-4 总交易次数: 4 盈利: 17.185421994886347 亏损: -216.77978665312727 最大盈利: 17.19 最大亏损: -201.43 总收益: -199.59 平均盈利: -49.90 typeA: -12.47 胜率: 25.00%
趋势空且增强-L2-3-3 总交易次数: 4 盈利: 102.43653289722117 亏损: -217.08621350063933 最大盈利: 102.44 最大亏损: -177.36 总收益: -114.65 平均盈利: -28.66 typeA: -7.17 胜率: 25.00%
趋势多且增强-R-3-1 总交易次数: 5 盈利: 1.869195046438128 亏损: -349.5668180278339 最大盈利: 1.87 最大亏损: -253.43 总收益: -347.70 平均盈利: -69.54 typeA: -13.91 胜率: 20.00%
趋势多且增强-L1-3-4 总交易次数: 1 盈利: 0 亏损: -50.35792019347008 最大盈利: -50.36 最大亏损: -50.36 总收益: -50.36 平均盈利: -50.36 typeA: 0.00 胜率: 0.00%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     81
      胜率:          54.32%
      总收益:        5201.10 USDT
      期末余额:      15037.10 USDT
      盈亏比:        1.73
      最大单笔盈利:  2533.05
      最大单笔亏损:  -643.03
      手续费:       326.24322838728784
      =============================
    
profit: 5037.101782394111
maxDrawdown 15.8%
startTime: 2024-02-15 00:00:00
趋势多且增强-R-3-1 总交易次数: 2 盈利: 107.96723280232678 亏损: 0 最大盈利: 103.96 最大亏损: 4.00 总收益: 107.97 平均盈利: 53.98 typeA: 53.98 胜率: 100.00%
趋势多且增强-R-2-1 总交易次数: 1 盈利: 169.65994992249873 亏损: 0 最大盈利: 169.66 最大亏损: 169.66 总收益: 169.66 平均盈利: 169.66 typeA: 169.66 胜率: 100.00%
趋势多且增强-L1-3-2 总交易次数: 1 盈利: 880.2755136409572 亏损: 0 最大盈利: 880.28 最大亏损: 880.28 总收益: 880.28 平均盈利: 880.28 typeA: 880.28 胜率: 100.00%
趋势空且增强-L1-1-2 总交易次数: 1 盈利: 182.87507270729665 亏损: 0 最大盈利: 182.88 最大亏损: 182.88 总收益: 182.88 平均盈利: 182.88 typeA: 182.88 胜率: 100.00%
趋势空且增强-L3-1-6 总交易次数: 2 盈利: 2734.3351506929275 亏损: 0 最大盈利: 2533.05 最大亏损: 201.29 总收益: 2734.34 平均盈利: 1367.17 typeA: 1367.17 胜率: 100.00%
趋势多且增强-R-1-2-2 总交易次数: 1 盈利: 133.77988868274568 亏损: 0 最大盈利: 133.78 最大亏损: 133.78 总收益: 133.78 平均盈利: 133.78 typeA: 133.78 胜率: 100.00%
趋势多且增强-L1-1-6 总交易次数: 1 盈利: 361.6097066463914 亏损: 0 最大盈利: 361.61 最大亏损: 361.61 总收益: 361.61 平均盈利: 361.61 typeA: 361.61 胜率: 100.00%
趋势多且增强-L3-1-5 总交易次数: 1 盈利: 71.81919683054258 亏损: 0 最大盈利: 71.82 最大亏损: 71.82 总收益: 71.82 平均盈利: 71.82 typeA: 71.82 胜率: 100.00%
趋势空且增强-L2-2-3 总交易次数: 1 盈利: 562.1186420053541 亏损: 0 最大盈利: 562.12 最大亏损: 562.12 总收益: 562.12 平均盈利: 562.12 typeA: 562.12 胜率: 100.00%
趋势多且增强-L3-1-3 总交易次数: 4 盈利: 514.0236868968142 亏损: -155.3061508973691 最大盈利: 429.86 最大亏损: -155.31 总收益: 358.72 平均盈利: 89.68 typeA: 67.26 胜率: 75.00%
趋势多且增强-L3-1-4-3 总交易次数: 4 盈利: 184.51247672017098 亏损: -29.545999041685928 最大盈利: 138.64 最大亏损: -29.55 总收益: 154.97 平均盈利: 38.74 typeA: 29.06 胜率: 75.00%
趋势多且增强-11 总交易次数: 9 盈利: 1704.437273282099 亏损: -370.20013795993395 最大盈利: 489.36 最大亏损: -229.51 总收益: 1334.24 平均盈利: 148.25 typeA: 98.84 胜率: 66.67%
趋势空且增强-11 总交易次数: 3 盈利: 122.66411383132433 亏损: -639.3749050584846 最大盈利: 73.89 最大亏损: -639.37 总收益: -516.71 平均盈利: -172.24 typeA: -114.83 胜率: 66.67%
趋势多且增强-L3-1-4-1 总交易次数: 9 盈利: 1207.470343003698 亏损: -816.4753469105573 最大盈利: 603.27 最大亏损: -439.62 总收益: 390.99 平均盈利: 43.44 typeA: 28.96 胜率: 66.67%
趋势空且增强-L2-3-5 总交易次数: 2 盈利: 15.939734545019416 亏损: -6.65317515701307 最大盈利: 15.94 最大亏损: -6.65 总收益: 9.29 平均盈利: 4.64 typeA: 2.32 胜率: 50.00%
趋势空且增强-L-4-2-3 总交易次数: 4 盈利: 90.5127627681079 亏损: -386.9595803515416 最大盈利: 53.16 最大亏损: -301.40 总收益: -296.45 平均盈利: -74.11 typeA: -37.06 胜率: 50.00%
趋势空且增强-L2-3-4 总交易次数: 11 盈利: 606.2375009815837 亏损: -777.1429723126961 最大盈利: 463.16 最大亏损: -428.73 总收益: -170.91 平均盈利: -15.54 typeA: -7.06 胜率: 45.45%
趋势空且增强-L2-3-3 总交易次数: 7 盈利: 627.658528503478 亏损: -995.1935878246463 最大盈利: 443.73 最大亏损: -412.65 总收益: -367.54 平均盈利: -52.51 typeA: -15.00 胜率: 28.57%
趋势多且增强-L1-3-4 总交易次数: 4 盈利: 47.96675964667594 亏损: -195.24038722987035 最大盈利: 47.97 最大亏损: -142.90 总收益: -147.27 平均盈利: -36.82 typeA: -9.20 胜率: 25.00%
趋势多且增强-R-1-1-2 总交易次数: 4 盈利: 548.6220033691853 亏损: -406.4286434681884 最大盈利: 548.62 最大亏损: -275.00 总收益: 142.19 平均盈利: 35.55 typeA: 8.89 胜率: 25.00%
趋势空且增强-2 总交易次数: 6 盈利: 1485.8050852131703 亏损: -1622.8061130654826 最大盈利: 1485.81 最大亏损: -643.03 总收益: -137.00 平均盈利: -22.83 typeA: -3.81 胜率: 16.67%
趋势多且增强-L1-3-1 总交易次数: 1 盈利: 0 亏损: -482.6199580064103 最大盈利: -482.62 最大亏损: -482.62 总收益: -482.62 平均盈利: -482.62 typeA: 0.00 胜率: 0.00%
趋势多且增强-L1-2-5 总交易次数: 2 盈利: 0 亏损: -275.24188301437835 最大盈利: -130.17 最大亏损: -145.07 总收益: -275.24 平均盈利: -137.62 typeA: 0.00 胜率: 0.00%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     92
      胜率:          53.26%
      总收益:        1561.17 USDT
      期末余额:      11377.17 USDT
      盈亏比:        1.20
      最大单笔盈利:  993.07
      最大单笔亏损:  -865.30
      手续费:       367.8581090391806
      =============================
    
profit: 1377.1716830895402
maxDrawdown 16.1%
startTime: 2024-03-16 00:00:00
趋势空且增强-L2-2-3 总交易次数: 2 盈利: 331.21703696883856 亏损: 0 最大盈利: 179.23 最大亏损: 151.99 总收益: 331.22 平均盈利: 165.61 typeA: 165.61 胜率: 100.00%
趋势多且增强-L1-2-2 总交易次数: 1 盈利: 37.65109176277439 亏损: 0 最大盈利: 37.65 最大亏损: 37.65 总收益: 37.65 平均盈利: 37.65 typeA: 37.65 胜率: 100.00%
趋势多且增强-R-1-1-1 总交易次数: 3 盈利: 380.6255500725343 亏损: 0 最大盈利: 279.12 最大亏损: 4.96 总收益: 380.63 平均盈利: 126.88 typeA: 126.88 胜率: 100.00%
趋势空且增强-L2-1-3 总交易次数: 1 盈利: 37.755889481338585 亏损: 0 最大盈利: 37.76 最大亏损: 37.76 总收益: 37.76 平均盈利: 37.76 typeA: 37.76 胜率: 100.00%
趋势空且增强-L-4-2-3 总交易次数: 1 盈利: 27.243969637335983 亏损: 0 最大盈利: 27.24 最大亏损: 27.24 总收益: 27.24 平均盈利: 27.24 typeA: 27.24 胜率: 100.00%
趋势多且增强-L3-1-4-1 总交易次数: 8 盈利: 899.2363425053403 亏损: -64.2867711476688 最大盈利: 639.21 最大亏损: -64.29 总收益: 834.95 平均盈利: 104.37 typeA: 91.32 胜率: 87.50%
趋势多且增强-L1-1-6 总交易次数: 3 盈利: 527.9179292561093 亏损: -110.87864724532386 最大盈利: 458.04 最大亏损: -110.88 总收益: 417.04 平均盈利: 139.01 typeA: 92.68 胜率: 66.67%
趋势多且增强-11 总交易次数: 8 盈利: 2406.5757286738976 亏损: -660.5356030692269 最大盈利: 993.07 最大亏损: -336.23 总收益: 1746.04 平均盈利: 218.26 typeA: 136.41 胜率: 62.50%
趋势空且增强-11 总交易次数: 5 盈利: 674.2928839304774 亏损: -50.27387869126431 最大盈利: 253.32 最大亏损: -36.49 总收益: 624.02 平均盈利: 124.80 typeA: 74.88 胜率: 60.00%
趋势空且增强-L2-3-3 总交易次数: 7 盈利: 332.4178398050664 亏损: -405.8259156007564 最大盈利: 98.28 最大亏损: -176.70 总收益: -73.41 平均盈利: -10.49 typeA: -5.99 胜率: 57.14%
趋势多且增强-R-1-1-2 总交易次数: 10 盈利: 550.5315699957883 亏损: -1769.6074920252545 最大盈利: 230.69 最大亏损: -865.30 总收益: -1219.08 平均盈利: -121.91 typeA: -60.95 胜率: 50.00%
趋势空且增强-L2-3-4 总交易次数: 2 盈利: 62.4850613271836 亏损: -49.54326260677846 最大盈利: 62.49 最大亏损: -49.54 总收益: 12.94 平均盈利: 6.47 typeA: 3.24 胜率: 50.00%
趋势空且增强-L2-3-5 总交易次数: 2 盈利: 717.9680592524018 亏损: -146.9897001602207 最大盈利: 717.97 最大亏损: -146.99 总收益: 570.98 平均盈利: 285.49 typeA: 142.74 胜率: 50.00%
趋势多且增强-L1-2-5 总交易次数: 8 盈利: 887.4949832667334 亏损: -856.129751640945 最大盈利: 283.45 最大亏损: -289.11 总收益: 31.37 平均盈利: 3.92 typeA: 1.96 胜率: 50.00%
趋势空且增强-L1-1-2 总交易次数: 2 盈利: 151.95377769705794 亏损: -21.214380460138305 最大盈利: 151.95 最大亏损: -21.21 总收益: 130.74 平均盈利: 65.37 typeA: 32.68 胜率: 50.00%
趋势多且增强-L1-3-9 总交易次数: 2 盈利: 578.4952543038565 亏损: -418.0905473706848 最大盈利: 578.50 最大亏损: -418.09 总收益: 160.40 平均盈利: 80.20 typeA: 40.10 胜率: 50.00%
趋势空且增强-2 总交易次数: 11 盈利: 730.5234632009058 亏损: -1230.5230972089123 最大盈利: 475.16 最大亏损: -400.57 总收益: -500.00 平均盈利: -45.45 typeA: -20.66 胜率: 45.45%
趋势多且增强-L3-1-5 总交易次数: 5 盈利: 69.57640019434163 亏损: -176.62619304081352 最大盈利: 43.91 最大亏损: -157.27 总收益: -107.05 平均盈利: -21.41 typeA: -8.56 胜率: 40.00%
趋势多且增强-R-1-2-2 总交易次数: 3 盈利: 0 亏损: -252.28200264419405 最大盈利: -77.29 最大亏损: -88.52 总收益: -252.28 平均盈利: -84.09 typeA: 0.00 胜率: 0.00%
趋势多且增强-L3-1-3 总交易次数: 5 盈利: 0 亏损: -1438.2583174160704 最大盈利: -8.56 最大亏损: -695.46 总收益: -1438.26 平均盈利: -287.65 typeA: 0.00 胜率: 0.00%
趋势多且增强-L3-1-4-3 总交易次数: 1 盈利: 0 亏损: -136.86032065313873 最大盈利: -136.86 最大亏损: -136.86 总收益: -136.86 平均盈利: -136.86 typeA: 0.00 胜率: 0.00%
趋势多且增强-L1-3-4 总交易次数: 2 盈利: 0 亏损: -54.86526726105333 最大盈利: -14.91 最大亏损: -39.95 总收益: -54.87 平均盈利: -27.43 typeA: 0.00 胜率: 0.00%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     87
      胜率:          52.87%
      总收益:        1679.57 USDT
      期末余额:      11505.57 USDT
      盈亏比:        1.40
      最大单笔盈利:  778.29
      最大单笔亏损:  -443.63
      手续费:       347.47793145937226
      =============================
    
profit: 1505.5694318615315
maxDrawdown 8.7%
startTime: 2024-04-15 00:00:00
趋势多且增强-11 总交易次数: 4 盈利: 325.77404395082755 亏损: 0 最大盈利: 152.12 最大亏损: 17.65 总收益: 325.77 平均盈利: 81.44 typeA: 81.44 胜率: 100.00%
趋势空且增强-L2-3-3 总交易次数: 4 盈利: 391.5987990948789 亏损: 0 最大盈利: 180.44 最大亏损: 29.58 总收益: 391.60 平均盈利: 97.90 typeA: 97.90 胜率: 100.00%
趋势空且增强-L2-3-5 总交易次数: 4 盈利: 228.80524355731188 亏损: 0 最大盈利: 130.69 最大亏损: 23.09 总收益: 228.81 平均盈利: 57.20 typeA: 57.20 胜率: 100.00%
趋势空且增强-L2-1-3 总交易次数: 1 盈利: 97.80946441100829 亏损: 0 最大盈利: 97.81 最大亏损: 97.81 总收益: 97.81 平均盈利: 97.81 typeA: 97.81 胜率: 100.00%
趋势多且增强-L1-2-1 总交易次数: 1 盈利: 766.7169887009416 亏损: 0 最大盈利: 766.72 最大亏损: 766.72 总收益: 766.72 平均盈利: 766.72 typeA: 766.72 胜率: 100.00%
趋势空且增强-2 总交易次数: 8 盈利: 317.7100942066237 亏损: -264.80364312070174 最大盈利: 159.95 最大亏损: -207.23 总收益: 52.91 平均盈利: 6.61 typeA: 4.96 胜率: 75.00%
趋势空且增强-11 总交易次数: 8 盈利: 849.9495738446402 亏损: -430.72734760042744 最大盈利: 361.82 最大亏损: -290.06 总收益: 419.22 平均盈利: 52.40 typeA: 39.30 胜率: 75.00%
趋势空且增强-L2-3-4 总交易次数: 6 盈利: 659.3098376051614 亏损: -234.6899792401706 最大盈利: 506.21 最大亏损: -133.60 总收益: 424.62 平均盈利: 70.77 typeA: 47.18 胜率: 66.67%
趋势多且增强-L3-1-5 总交易次数: 5 盈利: 135.57784197142905 亏损: -445.9479743482118 最大盈利: 50.80 最大亏损: -390.73 总收益: -310.37 平均盈利: -62.07 typeA: -37.24 胜率: 60.00%
趋势多且增强-R-1-1-2 总交易次数: 10 盈利: 987.4357831148507 亏损: -525.1746585410045 最大盈利: 778.29 最大亏损: -204.38 总收益: 462.26 平均盈利: 46.23 typeA: 23.11 胜率: 50.00%
趋势多且增强-L1-3-4 总交易次数: 5 盈利: 187.22585603961267 亏损: -165.95604218749332 最大盈利: 166.60 最大亏损: -86.43 总收益: 21.27 平均盈利: 4.25 typeA: 1.70 胜率: 40.00%
趋势空且增强-L-4-2-3 总交易次数: 3 盈利: 262.60987341772085 亏损: -49.119193067792594 最大盈利: 262.61 最大亏损: -42.51 总收益: 213.49 平均盈利: 71.16 typeA: 23.72 胜率: 33.33%
趋势空且增强-L3-1-6 总交易次数: 3 盈利: 399.05625535843666 亏损: -69.36760623066728 最大盈利: 399.06 最大亏损: -37.58 总收益: 329.69 平均盈利: 109.90 typeA: 36.63 胜率: 33.33%
趋势多且增强-R-1-2-2 总交易次数: 3 盈利: 20.616711437861373 亏损: -260.64003953715616 最大盈利: 20.62 最大亏损: -248.06 总收益: -240.02 平均盈利: -80.01 typeA: -26.67 胜率: 33.33%
趋势多且增强-L3-1-4-3 总交易次数: 7 盈利: 43.00073845590789 亏损: -522.240819106059 最大盈利: 25.68 最大亏损: -443.63 总收益: -479.24 平均盈利: -68.46 typeA: -19.56 胜率: 28.57%
趋势多且增强-L3-1-4-1 总交易次数: 6 盈利: 242.285956528442 亏损: -390.63464215655847 最大盈利: 242.29 最大亏损: -244.37 总收益: -148.35 平均盈利: -24.72 typeA: -4.12 胜率: 16.67%
趋势多且增强-L1-2-5 总交易次数: 4 盈利: 0 亏损: -466.7083337270791 最大盈利: -14.50 最大亏损: -216.74 总收益: -466.71 平均盈利: -116.68 typeA: 0.00 胜率: 0.00%
趋势多且增强-L1-3-1 总交易次数: 1 盈利: 0 亏损: -40.1979295045606 最大盈利: -40.20 最大亏损: -40.20 总收益: -40.20 平均盈利: -40.20 typeA: 0.00 胜率: 0.00%
趋势多且增强-L1-3-2 总交易次数: 1 盈利: 0 亏损: -60.70189484921401 最大盈利: -60.70 最大亏损: -60.70 总收益: -60.70 平均盈利: -60.70 typeA: 0.00 胜率: 0.00%
趋势多且增强-R-2-1 总交易次数: 1 盈利: 0 亏损: -96.50676640598265 最大盈利: -96.51 最大亏损: -96.51 总收益: -96.51 平均盈利: -96.51 typeA: 0.00 胜率: 0.00%
趋势多且增强-R-2-2 总交易次数: 1 盈利: 0 亏损: -162.39204076012112 最大盈利: -162.39 最大亏损: -162.39 总收益: -162.39 平均盈利: -162.39 typeA: 0.00 胜率: 0.00%
趋势多且增强-R-3-1 总交易次数: 1 盈利: 0 亏损: -50.104719450931434 最大盈利: -50.10 最大亏损: -50.10 总收益: -50.10 平均盈利: -50.10 typeA: 0.00 胜率: 0.00%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     94
      胜率:          53.19%
      总收益:        -186.82 USDT
      期末余额:      9625.18 USDT
      盈亏比:        0.96
      最大单笔盈利:  467.95
      最大单笔亏损:  -572.47
      手续费:       376.38105290764264
      =============================
    
profit: -374.822710117367
maxDrawdown 14.4%
startTime: 2024-05-15 00:00:00
趋势多且增强-L3-1-3 总交易次数: 2 盈利: 185.90625913646616 亏损: 0 最大盈利: 171.22 最大亏损: 14.69 总收益: 185.91 平均盈利: 92.95 typeA: 92.95 胜率: 100.00%
趋势多且增强-L1-2-1 总交易次数: 1 盈利: 273.2024276606193 亏损: 0 最大盈利: 273.20 最大亏损: 273.20 总收益: 273.20 平均盈利: 273.20 typeA: 273.20 胜率: 100.00%
趋势多且增强-R-1-1-1 总交易次数: 1 盈利: 38.04539385847891 亏损: 0 最大盈利: 38.05 最大亏损: 38.05 总收益: 38.05 平均盈利: 38.05 typeA: 38.05 胜率: 100.00%
趋势空且增强-L2-3-3 总交易次数: 8 盈利: 739.1058811323564 亏损: -188.50046449900512 最大盈利: 467.95 最大亏损: -188.50 总收益: 550.61 平均盈利: 68.83 typeA: 60.22 胜率: 87.50%
趋势多且增强-R-1-1-2 总交易次数: 4 盈利: 274.1629863864641 亏损: -572.4718553660738 最大盈利: 167.91 最大亏损: -572.47 总收益: -298.31 平均盈利: -74.58 typeA: -55.93 胜率: 75.00%
趋势空且增强-L2-3-5 总交易次数: 7 盈利: 231.46211680426188 亏损: -80.80721914274528 最大盈利: 115.72 最大亏损: -52.72 总收益: 150.65 平均盈利: 21.52 typeA: 15.37 胜率: 71.43%
趋势多且增强-11 总交易次数: 9 盈利: 392.13121213104006 亏损: -215.72523244556086 最大盈利: 135.42 最大亏损: -151.13 总收益: 176.41 平均盈利: 19.60 typeA: 13.07 胜率: 66.67%
趋势多且增强-R-2-1 总交易次数: 5 盈利: 497.6515882022246 亏损: -59.38661324733617 最大盈利: 226.27 最大亏损: -36.75 总收益: 438.26 平均盈利: 87.65 typeA: 52.59 胜率: 60.00%
趋势多且增强-L3-1-4-3 总交易次数: 12 盈利: 583.4832428353293 亏损: -367.2538677728697 最大盈利: 443.08 最大亏损: -186.22 总收益: 216.23 平均盈利: 18.02 typeA: 10.51 胜率: 58.33%
趋势空且增强-L-4-2-3 总交易次数: 7 盈利: 155.69767761223136 亏损: -118.27078136429128 最大盈利: 101.55 最大亏损: -69.76 总收益: 37.43 平均盈利: 5.35 typeA: 3.06 胜率: 57.14%
趋势空且增强-11 总交易次数: 4 盈利: 310.72963390942056 亏损: -715.4922357250817 最大盈利: 240.59 最大亏损: -532.71 总收益: -404.76 平均盈利: -101.19 typeA: -50.60 胜率: 50.00%
趋势多且增强-L3-1-5 总交易次数: 4 盈利: 260.1216016157327 亏损: -133.56674352242416 最大盈利: 236.05 最大亏损: -109.14 总收益: 126.55 平均盈利: 31.64 typeA: 15.82 胜率: 50.00%
趋势空且增强-L2-1-3 总交易次数: 2 盈利: 59.78474697077769 亏损: -4.455683771175085 最大盈利: 59.78 最大亏损: -4.46 总收益: 55.33 平均盈利: 27.66 typeA: 13.83 胜率: 50.00%
趋势多且增强-L1-3-9 总交易次数: 2 盈利: 118.75025793530325 亏损: -46.21250149396383 最大盈利: 118.75 最大亏损: -46.21 总收益: 72.54 平均盈利: 36.27 typeA: 18.13 胜率: 50.00%
趋势多且增强-L1-2-5 总交易次数: 2 盈利: 20.141240157480265 亏损: -77.20773058673738 最大盈利: 20.14 最大亏损: -77.21 总收益: -57.07 平均盈利: -28.53 typeA: -14.27 胜率: 50.00%
趋势多且增强-L1-3-4 总交易次数: 6 盈利: 328.29109949922895 亏损: -475.5216911195414 最大盈利: 165.69 最大亏损: -176.85 总收益: -147.23 平均盈利: -24.54 typeA: -8.18 胜率: 33.33%
趋势多且增强-L3-1-4-1 总交易次数: 3 盈利: 21.221971123666616 亏损: -114.6949835420686 最大盈利: 21.22 最大亏损: -64.50 总收益: -93.47 平均盈利: -31.16 typeA: -10.38 胜率: 33.33%
趋势空且增强-L2-3-4 总交易次数: 7 盈利: 14.349302150132669 亏损: -669.4213794006221 最大盈利: 14.35 最大亏损: -201.24 总收益: -655.07 平均盈利: -93.58 typeA: -13.37 胜率: 14.29%
趋势空且增强-2 总交易次数: 3 盈利: 0 亏损: -171.38141975075604 最大盈利: -37.83 最大亏损: -93.63 总收益: -171.38 平均盈利: -57.13 typeA: 0.00 胜率: 0.00%
趋势空且增强-L3-1-6 总交易次数: 3 盈利: 0 亏损: -596.8436432562388 最大盈利: -41.97 最大亏损: -386.36 总收益: -596.84 平均盈利: -198.95 typeA: 0.00 胜率: 0.00%
趋势多且增强-R-3-1 总交易次数: 1 盈利: 0 亏损: -9.531707985207436 最大盈利: -9.53 最大亏损: -9.53 总收益: -9.53 平均盈利: -9.53 typeA: 0.00 胜率: 0.00%
趋势多且增强-R-1-2-2 总交易次数: 1 盈利: 0 亏损: -74.31559524688232 最大盈利: -74.32 最大亏损: -74.32 总收益: -74.32 平均盈利: -74.32 typeA: 0.00 胜率: 0.00%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     76
      胜率:          51.32%
      总收益:        -419.27 USDT
      期末余额:      9428.73 USDT
      盈亏比:        0.92
      最大单笔盈利:  666.95
      最大单笔亏损:  -912.30
      手续费:       304.0979105760923
      =============================
    
profit: -571.2711652610487
maxDrawdown 20.2%
startTime: 2024-06-14 00:00:00
趋势多且增强-R-1-1-1 总交易次数: 1 盈利: 38.04539385847891 亏损: 0 最大盈利: 38.05 最大亏损: 38.05 总收益: 38.05 平均盈利: 38.05 typeA: 38.05 胜率: 100.00%
趋势空且增强-11 总交易次数: 3 盈利: 522.1760228487443 亏损: 0 最大盈利: 374.46 最大亏损: 13.57 总收益: 522.18 平均盈利: 174.06 typeA: 174.06 胜率: 100.00%
趋势多且增强-R-3-1 总交易次数: 2 盈利: 125.84840180266018 亏损: 0 最大盈利: 113.99 最大亏损: 11.86 总收益: 125.85 平均盈利: 62.92 typeA: 62.92 胜率: 100.00%
趋势多且增强-L1-3-1 总交易次数: 1 盈利: 229.50688952303267 亏损: 0 最大盈利: 229.51 最大亏损: 229.51 总收益: 229.51 平均盈利: 229.51 typeA: 229.51 胜率: 100.00%
趋势多且增强-L1-3-2 总交易次数: 2 盈利: 812.8080526122019 亏损: 0 最大盈利: 666.95 最大亏损: 145.85 总收益: 812.81 平均盈利: 406.40 typeA: 406.40 胜率: 100.00%
趋势多且增强-R-2-2 总交易次数: 1 盈利: 33.37922318645124 亏损: 0 最大盈利: 33.38 最大亏损: 33.38 总收益: 33.38 平均盈利: 33.38 typeA: 33.38 胜率: 100.00%
趋势多且增强-R-1-2-2 总交易次数: 1 盈利: 297.8647987965399 亏损: 0 最大盈利: 297.86 最大亏损: 297.86 总收益: 297.86 平均盈利: 297.86 typeA: 297.86 胜率: 100.00%
趋势空且增强-L3-1-6 总交易次数: 1 盈利: 201.43050847457624 亏损: 0 最大盈利: 201.43 最大亏损: 201.43 总收益: 201.43 平均盈利: 201.43 typeA: 201.43 胜率: 100.00%
趋势多且增强-R-1-1-2 总交易次数: 9 盈利: 669.0753623492126 亏损: -500.44975650772585 最大盈利: 337.76 最大亏损: -441.88 总收益: 168.63 平均盈利: 18.74 typeA: 14.57 胜率: 77.78%
趋势空且增强-L2-3-5 总交易次数: 4 盈利: 597.47215712174 亏损: -560.8650514330764 最大盈利: 351.91 最大亏损: -497.48 总收益: 36.61 平均盈利: 9.15 typeA: 4.58 胜率: 50.00%
趋势多且增强-R-2-1 总交易次数: 4 盈利: 322.1077062516905 亏损: -959.8859194146589 最大盈利: 212.65 最大亏损: -912.30 总收益: -637.78 平均盈利: -159.44 typeA: -79.72 胜率: 50.00%
趋势多且增强-L3-1-4-3 总交易次数: 8 盈利: 91.1409768126714 亏损: -458.46837944882213 最大盈利: 55.07 最大亏损: -352.68 总收益: -367.33 平均盈利: -45.92 typeA: -22.96 胜率: 50.00%
趋势多且增强-L3-1-4-1 总交易次数: 2 盈利: 160.39746609274653 亏损: -37.56741373176784 最大盈利: 160.40 最大亏损: -37.57 总收益: 122.83 平均盈利: 61.42 typeA: 30.71 胜率: 50.00%
趋势空且增强-L2-3-4 总交易次数: 8 盈利: 52.928802482533825 亏损: -75.60361843990697 最大盈利: 24.99 最大亏损: -35.17 总收益: -22.67 平均盈利: -2.83 typeA: -1.06 胜率: 37.50%
趋势空且增强-L-4-2-3 总交易次数: 8 盈利: 697.3485984816455 亏损: -533.9474544411946 最大盈利: 491.90 最大亏损: -204.96 总收益: 163.40 平均盈利: 20.43 typeA: 7.66 胜率: 37.50%
趋势空且增强-L2-3-3 总交易次数: 9 盈利: 146.68445183916964 亏损: -1492.0631571208899 最大盈利: 63.56 最大亏损: -575.08 总收益: -1345.38 平均盈利: -149.49 typeA: -49.82 胜率: 33.33%
趋势多且增强-11 总交易次数: 4 盈利: 21.309242298085135 亏损: -200.21112106911406 最大盈利: 21.31 最大亏损: -98.36 总收益: -178.90 平均盈利: -44.73 typeA: -11.18 胜率: 25.00%
趋势多且增强-L1-3-4 总交易次数: 6 盈利: 23.560993425857248 亏损: -290.44018159001774 最大盈利: 23.56 最大亏损: -211.33 总收益: -266.88 平均盈利: -44.48 typeA: -7.41 胜率: 16.67%
趋势多且增强-L3-1-5 总交易次数: 2 盈利: 0 亏损: -352.8541603219124 最大盈利: -92.99 最大亏损: -259.86 总收益: -352.85 平均盈利: -176.43 typeA: 0.00 胜率: 0.00%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     80
      胜率:          55.00%
      总收益:        2080.36 USDT
      期末余额:      11920.36 USDT
      盈亏比:        1.40
      最大单笔盈利:  699.01
      最大单笔亏损:  -682.62
      手续费:       320.1599502554841
      =============================
    
profit: 1920.3636752098646
maxDrawdown 11.6%
startTime: 2024-07-14 00:00:00
趋势空且增强-L2-2-3 总交易次数: 1 盈利: 367.857787631642 亏损: 0 最大盈利: 367.86 最大亏损: 367.86 总收益: 367.86 平均盈利: 367.86 typeA: 367.86 胜率: 100.00%
趋势多且增强-R-1-1-1 总交易次数: 1 盈利: 63.54208481709222 亏损: 0 最大盈利: 63.54 最大亏损: 63.54 总收益: 63.54 平均盈利: 63.54 typeA: 63.54 胜率: 100.00%
趋势多且增强-11 总交易次数: 6 盈利: 535.6953019787265 亏损: -6.734349843735995 最大盈利: 228.78 最大亏损: -6.73 总收益: 528.96 平均盈利: 88.16 typeA: 73.46 胜率: 83.33%
趋势空且增强-11 总交易次数: 4 盈利: 555.3702489735834 亏损: -257.09787310742604 最大盈利: 421.46 最大亏损: -257.10 总收益: 298.27 平均盈利: 74.57 typeA: 55.93 胜率: 75.00%
趋势多且增强-L3-1-4-1 总交易次数: 3 盈利: 610.9190376673139 亏损: -24.8806577386003 最大盈利: 465.44 最大亏损: -24.88 总收益: 586.04 平均盈利: 195.35 typeA: 130.24 胜率: 66.67%
趋势多且增强-L3-1-3 总交易次数: 3 盈利: 890.4029782053215 亏损: -223.6266005121646 最大盈利: 699.01 最大亏损: -223.63 总收益: 666.78 平均盈利: 222.26 typeA: 148.18 胜率: 66.67%
趋势多且增强-L3-1-5 总交易次数: 3 盈利: 51.15141379225797 亏损: -192.2942598187314 最大盈利: 25.66 最大亏损: -192.29 总收益: -141.14 平均盈利: -47.05 typeA: -31.37 胜率: 66.67%
趋势空且增强-L-4-2-3 总交易次数: 8 盈利: 305.8106503093135 亏损: -212.4677336511921 最大盈利: 254.52 最大亏损: -132.13 总收益: 93.34 平均盈利: 11.67 typeA: 5.83 胜率: 50.00%
趋势空且增强-L2-3-3 总交易次数: 10 盈利: 866.8666541560677 亏损: -855.5067147718929 最大盈利: 442.61 最大亏损: -430.48 总收益: 11.36 平均盈利: 1.14 typeA: 0.57 胜率: 50.00%
趋势空且增强-L2-3-5 总交易次数: 4 盈利: 523.7836580682961 亏损: -843.0321674479104 最大盈利: 299.46 最大亏损: -572.57 总收益: -319.25 平均盈利: -79.81 typeA: -39.91 胜率: 50.00%
趋势空且增强-2 总交易次数: 2 盈利: 83.32863501483716 亏损: -275.4649523661998 最大盈利: 83.33 最大亏损: -275.46 总收益: -192.14 平均盈利: -96.07 typeA: -48.03 胜率: 50.00%
趋势多且增强-L1-2-5 总交易次数: 2 盈利: 197.87924071082347 亏损: -160.11318346216652 最大盈利: 197.88 最大亏损: -160.11 总收益: 37.77 平均盈利: 18.88 typeA: 9.44 胜率: 50.00%
趋势多且增强-R-1-2-2 总交易次数: 2 盈利: 250.91630231105506 亏损: -335.34631931166354 最大盈利: 250.92 最大亏损: -335.35 总收益: -84.43 平均盈利: -42.22 typeA: -21.11 胜率: 50.00%
趋势多且增强-L1-3-1 总交易次数: 2 盈利: 368.92595455248096 亏损: -32.31924278625225 最大盈利: 368.93 最大亏损: -32.32 总收益: 336.61 平均盈利: 168.30 typeA: 84.15 胜率: 50.00%
趋势多且增强-L3-1-4-3 总交易次数: 4 盈利: 23.59710000586543 亏损: -307.16218254563165 最大盈利: 20.22 最大亏损: -298.52 总收益: -283.57 平均盈利: -70.89 typeA: -35.45 胜率: 50.00%
趋势多且增强-R-2-1 总交易次数: 2 盈利: 20.168514412416283 亏损: -119.42186026575311 最大盈利: 20.17 最大亏损: -119.42 总收益: -99.25 平均盈利: -49.63 typeA: -24.81 胜率: 50.00%
趋势空且增强-L2-3-4 总交易次数: 2 盈利: 214.0897424060575 亏损: -96.99598550866529 最大盈利: 214.09 最大亏损: -97.00 总收益: 117.09 平均盈利: 58.55 typeA: 29.27 胜率: 50.00%
趋势多且增强-R-1-1-2 总交易次数: 13 盈利: 960.9130604741792 亏损: -1020.5385626466131 最大盈利: 440.01 最大亏损: -682.62 总收益: -59.63 平均盈利: -4.59 typeA: -2.12 胜率: 46.15%
趋势多且增强-L1-3-4 总交易次数: 5 盈利: 63.575710165263615 亏损: -187.41605620854196 最大盈利: 63.57 最大亏损: -76.72 总收益: -123.84 平均盈利: -24.77 typeA: -9.91 胜率: 40.00%
趋势空且增强-L3-1-6 总交易次数: 3 盈利: 339.61608300907875 亏损: -63.627781458671976 最大盈利: 339.62 最大亏损: -40.72 总收益: 275.99 平均盈利: 92.00 typeA: 30.66 胜率: 33.33%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     69
      胜率:          43.48%
      总收益:        -2600.56 USDT
      期末余额:      7261.44 USDT
      盈亏比:        0.45
      最大单笔盈利:  425.59
      最大单笔亏损:  -624.36
      手续费:       276.1142833211276
      =============================
    
profit: -2738.5617926316663
maxDrawdown 30.0%
startTime: 2024-08-13 00:00:00
趋势空且增强-L2-1-3 总交易次数: 1 盈利: 4.493600445186479 亏损: 0 最大盈利: 4.49 最大亏损: 4.49 总收益: 4.49 平均盈利: 4.49 typeA: 4.49 胜率: 100.00%
趋势多且增强-L3-1-4-1 总交易次数: 1 盈利: 79.86693961105479 亏损: 0 最大盈利: 79.87 最大亏损: 79.87 总收益: 79.87 平均盈利: 79.87 typeA: 79.87 胜率: 100.00%
趋势多且增强-R-1-2-2 总交易次数: 1 盈利: 270.8760626398223 亏损: 0 最大盈利: 270.88 最大亏损: 270.88 总收益: 270.88 平均盈利: 270.88 typeA: 270.88 胜率: 100.00%
趋势多且增强-L1-3-2 总交易次数: 1 盈利: 48.55748194014493 亏损: 0 最大盈利: 48.56 最大亏损: 48.56 总收益: 48.56 平均盈利: 48.56 typeA: 48.56 胜率: 100.00%
趋势多且增强-R-2-1 总交易次数: 4 盈利: 124.56639571233308 亏损: -302.12757973733596 最大盈利: 83.98 最大亏损: -302.13 总收益: -177.56 平均盈利: -44.39 typeA: -33.29 胜率: 75.00%
趋势空且增强-L-4-2-3 总交易次数: 3 盈利: 339.5901406820638 亏损: -3.9731702505431175 最大盈利: 323.72 最大亏损: -3.97 总收益: 335.62 平均盈利: 111.87 typeA: 74.59 胜率: 66.67%
趋势多且增强-11 总交易次数: 5 盈利: 263.8465982734775 亏损: -331.5357649519924 最大盈利: 190.11 最大亏损: -202.85 总收益: -67.69 平均盈利: -13.54 typeA: -8.12 胜率: 60.00%
趋势多且增强-L3-1-5 总交易次数: 5 盈利: 79.01540957334781 亏损: -207.6235152109553 最大盈利: 31.77 最大亏损: -184.64 总收益: -128.61 平均盈利: -25.72 typeA: -15.43 胜率: 60.00%
趋势空且增强-L2-3-3 总交易次数: 9 盈利: 119.25896187319256 亏损: -203.04983631852355 最大盈利: 47.76 最大亏损: -92.61 总收益: -83.79 平均盈利: -9.31 typeA: -4.14 胜率: 44.44%
趋势多且增强-L1-3-4 总交易次数: 5 盈利: 12.167595530470159 亏损: -281.3363669650936 最大盈利: 6.34 最大亏损: -102.45 总收益: -269.17 平均盈利: -53.83 typeA: -21.53 胜率: 40.00%
趋势空且增强-L3-1-6 总交易次数: 5 盈利: 489.9549057768612 亏损: -763.5319251990601 最大盈利: 425.59 最大亏损: -624.36 总收益: -273.58 平均盈利: -54.72 typeA: -21.89 胜率: 40.00%
趋势多且增强-L3-1-4-3 总交易次数: 8 盈利: 30.345351347181406 亏损: -192.2176939859263 最大盈利: 19.95 最大亏损: -122.93 总收益: -161.87 平均盈利: -20.23 typeA: -7.59 胜率: 37.50%
趋势空且增强-11 总交易次数: 6 盈利: 126.12785629889093 亏损: -796.7916888575851 最大盈利: 90.14 最大亏损: -321.92 总收益: -670.66 平均盈利: -111.78 typeA: -37.26 胜率: 33.33%
趋势多且增强-R-3-1 总交易次数: 3 盈利: 117.1251063829783 亏损: -421.765041803524 最大盈利: 117.13 最大亏损: -404.84 总收益: -304.64 平均盈利: -101.55 typeA: -33.85 胜率: 33.33%
趋势空且增强-L2-3-4 总交易次数: 4 盈利: 39.24088541666725 亏损: -550.6917681228789 最大盈利: 39.24 最大亏损: -410.92 总收益: -511.45 平均盈利: -127.86 typeA: -31.97 胜率: 25.00%
趋势多且增强-L3-1-3 总交易次数: 4 盈利: 0 亏损: -119.70400759520064 最大盈利: -4.01 最大亏损: -54.81 总收益: -119.70 平均盈利: -29.93 typeA: 0.00 胜率: 0.00%
趋势空且增强-L2-2-3 总交易次数: 1 盈利: 0 亏损: -375.86340562990296 最大盈利: -375.86 最大亏损: -375.86 总收益: -375.86 平均盈利: -375.86 typeA: 0.00 胜率: 0.00%
趋势多且增强-R-3-2 总交易次数: 1 盈利: 0 亏损: -157.60303183425972 最大盈利: -157.60 最大亏损: -157.60 总收益: -157.60 平均盈利: -157.60 typeA: 0.00 胜率: 0.00%
趋势空且增强-L2-3-5 总交易次数: 1 盈利: 0 亏损: -2 最大盈利: -2.00 最大亏损: -2.00 总收益: -2.00 平均盈利: -2.00 typeA: 0.00 胜率: 0.00%
趋势多且增强-L1-3-1 总交易次数: 1 盈利: 0 亏损: -35.78028767255556 最大盈利: -35.78 最大亏损: -35.78 总收益: -35.78 平均盈利: -35.78 typeA: 0.00 胜率: 0.00%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     69
      胜率:          56.52%
      总收益:        1593.76 USDT
      期末余额:      11455.76 USDT
      盈亏比:        1.61
      最大单笔盈利:  549.79
      最大单笔亏损:  -283.67
      手续费:       276.1855363782016
      =============================
    
profit: 1455.7581004523345
maxDrawdown 6.1%
startTime: 2024-09-12 00:00:00
趋势多且增强-L3-1-4-1 总交易次数: 2 盈利: 330.0609379857893 亏损: 0 最大盈利: 215.37 最大亏损: 114.69 总收益: 330.06 平均盈利: 165.03 typeA: 165.03 胜率: 100.00%
趋势多且增强-R-1-2-2 总交易次数: 2 盈利: 166.3889253467245 亏损: 0 最大盈利: 154.48 最大亏损: 11.91 总收益: 166.39 平均盈利: 83.19 typeA: 83.19 胜率: 100.00%
趋势空且增强-L2-3-5 总交易次数: 1 盈利: 6.465111905210338 亏损: 0 最大盈利: 6.47 最大亏损: 6.47 总收益: 6.47 平均盈利: 6.47 typeA: 6.47 胜率: 100.00%
趋势多且增强-R-3-1 总交易次数: 1 盈利: 244.54442525427012 亏损: 0 最大盈利: 244.54 最大亏损: 244.54 总收益: 244.54 平均盈利: 244.54 typeA: 244.54 胜率: 100.00%
趋势多且增强-R-2-2 总交易次数: 1 盈利: 6.538730890768029 亏损: 0 最大盈利: 6.54 最大亏损: 6.54 总收益: 6.54 平均盈利: 6.54 typeA: 6.54 胜率: 100.00%
趋势多且增强-L3-1-4-3 总交易次数: 6 盈利: 153.8051010242243 亏损: -34.33379067032642 最大盈利: 78.09 最大亏损: -34.33 总收益: 119.47 平均盈利: 19.91 typeA: 16.59 胜率: 83.33%
趋势多且增强-L1-3-4 总交易次数: 7 盈利: 531.3141309862011 亏损: -221.62973371913563 最大盈利: 396.08 最大亏损: -206.06 总收益: 309.68 平均盈利: 44.24 typeA: 31.60 胜率: 71.43%
趋势空且增强-11 总交易次数: 6 盈利: 859.5751677403825 亏损: -159.4044365841094 最大盈利: 368.09 最大亏损: -158.35 总收益: 700.17 平均盈利: 116.70 typeA: 77.80 胜率: 66.67%
趋势多且增强-L3-1-3 总交易次数: 3 盈利: 16.823921460135466 亏损: -223.17844685147747 最大盈利: 12.86 最大亏损: -223.18 总收益: -206.35 平均盈利: -68.78 typeA: -45.86 胜率: 66.67%
趋势多且增强-R-1-1-2 总交易次数: 3 盈利: 362.138886945022 亏损: -240.62869541632793 最大盈利: 197.55 最大亏损: -240.63 总收益: 121.51 平均盈利: 40.50 typeA: 27.00 胜率: 66.67%
趋势空且增强-L2-3-3 总交易次数: 6 盈利: 136.26444807299885 亏损: -143.83342172450557 最大盈利: 67.94 最大亏损: -75.45 总收益: -7.57 平均盈利: -1.26 typeA: -0.63 胜率: 50.00%
趋势空且增强-L2-2-3 总交易次数: 2 盈利: 14.030357311209908 亏损: -254.3306811566083 最大盈利: 14.03 最大亏损: -254.33 总收益: -240.30 平均盈利: -120.15 typeA: -60.08 胜率: 50.00%
趋势空且增强-L3-1-6 总交易次数: 2 盈利: 113.05594336839943 亏损: -207.76926179911226 最大盈利: 113.06 最大亏损: -207.77 总收益: -94.71 平均盈利: -47.36 typeA: -23.68 胜率: 50.00%
趋势多且增强-L3-1-5 总交易次数: 2 盈利: 29.848185844147423 亏损: -150.42261528742944 最大盈利: 29.85 最大亏损: -150.42 总收益: -120.57 平均盈利: -60.29 typeA: -30.14 胜率: 50.00%
趋势多且增强-L1-3-2 总交易次数: 2 盈利: 233.57439703153867 亏损: -32.53921480549878 最大盈利: 233.57 最大亏损: -32.54 总收益: 201.04 平均盈利: 100.52 typeA: 50.26 胜率: 50.00%
趋势空且增强-L-4-2-3 总交易次数: 7 盈利: 67.26324480055172 亏损: -386.7486626614174 最大盈利: 39.78 最大亏损: -283.67 总收益: -319.49 平均盈利: -45.64 typeA: -19.56 胜率: 42.86%
趋势空且增强-L2-3-4 总交易次数: 7 盈利: 403.7183329784614 亏损: -108.07484316576868 最大盈利: 227.18 最大亏损: -42.83 总收益: 295.64 平均盈利: 42.23 typeA: 18.10 胜率: 42.86%
趋势多且增强-11 总交易次数: 6 盈利: 549.7878979168545 亏损: -310.4539852355084 最大盈利: 549.79 最大亏损: -144.48 总收益: 239.33 平均盈利: 39.89 typeA: 6.65 胜率: 16.67%
趋势多且增强-L1-3-1 总交易次数: 1 盈利: 0 亏损: -39.03323910712597 最大盈利: -39.03 最大亏损: -39.03 总收益: -39.03 平均盈利: -39.03 typeA: 0.00 胜率: 0.00%
趋势多且增强-L1-3-9 总交易次数: 2 盈利: 0 亏损: -119.05901822619822 最大盈利: -50.31 最大亏损: -68.75 总收益: -119.06 平均盈利: -59.53 typeA: 0.00 胜率: 0.00%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     63
      胜率:          65.08%
      总收益:        3373.32 USDT
      期末余额:      13245.32 USDT
      盈亏比:        2.03
      最大单笔盈利:  905.14
      最大单笔亏损:  -470.12
      手续费:       255.198446566127
      =============================
    
profit: 3245.316994910665
maxDrawdown 8.7%
startTime: 2024-10-12 00:00:00
趋势多且增强-R-3-1 总交易次数: 2 盈利: 366.5844276776031 亏损: 0 最大盈利: 193.05 最大亏损: 173.54 总收益: 366.58 平均盈利: 183.29 typeA: 183.29 胜率: 100.00%
趋势多且增强-L1-3-2 总交易次数: 1 盈利: 176.95455730298082 亏损: 0 最大盈利: 176.95 最大亏损: 176.95 总收益: 176.95 平均盈利: 176.95 typeA: 176.95 胜率: 100.00%
趋势多且增强-R-2-1 总交易次数: 1 盈利: 276.97688014881743 亏损: 0 最大盈利: 276.98 最大亏损: 276.98 总收益: 276.98 平均盈利: 276.98 typeA: 276.98 胜率: 100.00%
趋势多且增强-L1-3-1 总交易次数: 2 盈利: 876.5065026351251 亏损: 0 最大盈利: 783.20 最大亏损: 93.30 总收益: 876.51 平均盈利: 438.25 typeA: 438.25 胜率: 100.00%
趋势多且增强-L3-1-5 总交易次数: 2 盈利: 113.99600049924223 亏损: 0 最大盈利: 76.15 最大亏损: 37.85 总收益: 114.00 平均盈利: 57.00 typeA: 57.00 胜率: 100.00%
趋势空且增强-L2-3-5 总交易次数: 2 盈利: 293.7768018730741 亏损: 0 最大盈利: 193.68 最大亏损: 100.10 总收益: 293.78 平均盈利: 146.89 typeA: 146.89 胜率: 100.00%
趋势多且增强-L1-2-5 总交易次数: 2 盈利: 445.7666626220116 亏损: 0 最大盈利: 305.99 最大亏损: 139.78 总收益: 445.77 平均盈利: 222.88 typeA: 222.88 胜率: 100.00%
趋势空且增强-L2-1-3 总交易次数: 2 盈利: 50.974041148164574 亏损: 0 最大盈利: 31.24 最大亏损: 19.74 总收益: 50.97 平均盈利: 25.49 typeA: 25.49 胜率: 100.00%
趋势多且增强-L1-2-2 总交易次数: 1 盈利: 149.56589976814678 亏损: 0 最大盈利: 149.57 最大亏损: 149.57 总收益: 149.57 平均盈利: 149.57 typeA: 149.57 胜率: 100.00%
趋势多且增强-L1-3-4 总交易次数: 10 盈利: 2028.9015847125393 亏损: -189.30833461130814 最大盈利: 905.14 最大亏损: -131.63 总收益: 1839.59 平均盈利: 183.96 typeA: 147.17 胜率: 80.00%
趋势多且增强-R-1-1-2 总交易次数: 4 盈利: 305.9556132981625 亏损: -106.11151387332748 最大盈利: 258.26 最大亏损: -106.11 总收益: 199.84 平均盈利: 49.96 typeA: 37.47 胜率: 75.00%
趋势多且增强-L3-1-4-1 总交易次数: 7 盈利: 699.2762803955223 亏损: -24.679646302303368 最大盈利: 414.76 最大亏损: -19.94 总收益: 674.60 平均盈利: 96.37 typeA: 68.84 胜率: 71.43%
趋势空且增强-L-4-2-3 总交易次数: 5 盈利: 76.4032764864518 亏损: -79.28513814617818 最大盈利: 33.17 最大亏损: -51.00 总收益: -2.88 平均盈利: -0.58 typeA: -0.35 胜率: 60.00%
趋势空且增强-2 总交易次数: 6 盈利: 175.7690380646018 亏损: -831.254219668085 最大盈利: 68.95 最大亏损: -459.12 总收益: -655.49 平均盈利: -109.25 typeA: -54.62 胜率: 50.00%
趋势多且增强-11 总交易次数: 2 盈利: 144.4076742364904 亏损: -179.91032646770452 最大盈利: 144.41 最大亏损: -179.91 总收益: -35.50 平均盈利: -17.75 typeA: -8.88 胜率: 50.00%
趋势空且增强-11 总交易次数: 2 盈利: 438.9735468778115 亏损: -144.15097843165202 最大盈利: 438.97 最大亏损: -144.15 总收益: 294.82 平均盈利: 147.41 typeA: 73.71 胜率: 50.00%
趋势多且增强-L3-1-3 总交易次数: 3 盈利: 1.0402919264090382 亏损: -103.4083855860662 最大盈利: 1.04 最大亏损: -62.60 总收益: -102.37 平均盈利: -34.12 typeA: -11.37 胜率: 33.33%
趋势空且增强-L2-3-4 总交易次数: 3 盈利: 17.805940594058853 亏损: -441.02668953228095 最大盈利: 17.81 最大亏损: -426.40 总收益: -423.22 平均盈利: -141.07 typeA: -47.02 胜率: 33.33%
趋势空且增强-L2-3-3 总交易次数: 1 盈利: 0 亏损: -152.8810284610243 最大盈利: -152.88 最大亏损: -152.88 总收益: -152.88 平均盈利: -152.88 typeA: 0.00 胜率: 0.00%
趋势空且增强-L3-1-6 总交易次数: 2 盈利: 0 亏损: -229.09630911988984 最大盈利: -71.04 最大亏损: -158.06 总收益: -229.10 平均盈利: -114.55 typeA: 0.00 胜率: 0.00%
趋势多且增强-L1-1-6 总交易次数: 1 盈利: 0 亏损: -149.38327316486155 最大盈利: -149.38 最大亏损: -149.38 总收益: -149.38 平均盈利: -149.38 typeA: 0.00 胜率: 0.00%
趋势多且增强-L1-2-1 总交易次数: 1 盈利: 0 亏损: -165.7060339889244 最大盈利: -165.71 最大亏损: -165.71 总收益: -165.71 平均盈利: -165.71 typeA: 0.00 胜率: 0.00%
趋势空且增强-L1-1-2 总交易次数: 1 盈利: 0 亏损: -470.11614800294035 最大盈利: -470.12 最大亏损: -470.12 总收益: -470.12 平均盈利: -470.12 typeA: 0.00 胜率: 0.00%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     2
      胜率:          100.00%
      总收益:        366.72 USDT
      期末余额:      10360.72 USDT
      盈亏比:        Infinity
      最大单笔盈利:  328.88
      最大单笔亏损:  37.85
      手续费:       9.941809292762867
      =============================
    
profit: 360.72391650915597
maxDrawdown 0.0%
startTime: 2024-11-11 00:00:00
趋势空且增强-L1-1-2 总交易次数: 1 盈利: 328.87579291999134 亏损: 0 最大盈利: 328.88 最大亏损: 328.88 总收益: 328.88 平均盈利: 328.88 typeA: 328.88 胜率: 100.00%
趋势多且增强-L3-1-5 总交易次数: 1 盈利: 37.84812358916549 亏损: 0 最大盈利: 37.85 最大亏损: 37.85 总收益: 37.85 平均盈利: 37.85 typeA: 37.85 胜率: 100.00%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     91
      胜率:          52.75%
      总收益:        4879.78 USDT
      期末余额:      14697.78 USDT
      盈亏比:        2.16
      最大单笔盈利:  1261.70
      最大单笔亏损:  -296.53
      手续费:       364.7044668122697
      =============================
    
profit: 4697.780014477195
maxDrawdown 7.1%
startTime: 2024-12-11 00:00:00
趋势空且增强-L2-2-3 总交易次数: 3 盈利: 181.98283563091005 亏损: 0 最大盈利: 108.24 最大亏损: 32.26 总收益: 181.98 平均盈利: 60.66 typeA: 60.66 胜率: 100.00%
趋势多且增强-L1-3-9 总交易次数: 1 盈利: 3.4008897362568633 亏损: 0 最大盈利: 3.40 最大亏损: 3.40 总收益: 3.40 平均盈利: 3.40 typeA: 3.40 胜率: 100.00%
趋势多且增强-L1-3-4 总交易次数: 2 盈利: 97.16348595120563 亏损: 0 最大盈利: 83.34 最大亏损: 13.82 总收益: 97.16 平均盈利: 48.58 typeA: 48.58 胜率: 100.00%
趋势空且增强-L2-3-4 总交易次数: 3 盈利: 569.3932602236483 亏损: 0 最大盈利: 544.56 最大亏损: 3.64 总收益: 569.39 平均盈利: 189.80 typeA: 189.80 胜率: 100.00%
趋势多且增强-L3-1-4-1 总交易次数: 7 盈利: 87.18604789879416 亏损: -53.93028063465843 最大盈利: 23.76 最大亏损: -53.93 总收益: 33.26 平均盈利: 4.75 typeA: 4.07 胜率: 85.71%
趋势多且增强-L1-1-6 总交易次数: 4 盈利: 927.1492773839566 亏损: -103.54296524942816 最大盈利: 577.65 最大亏损: -103.54 总收益: 823.61 平均盈利: 205.90 typeA: 154.43 胜率: 75.00%
趋势空且增强-L2-1-3 总交易次数: 5 盈利: 273.28785387544093 亏损: -161.2647265364075 最大盈利: 126.44 最大亏损: -158.06 总收益: 112.02 平均盈利: 22.40 typeA: 13.44 胜率: 60.00%
趋势空且增强-2 总交易次数: 12 盈利: 497.40960648324256 亏损: -267.89885441248816 最大盈利: 276.70 最大亏损: -109.85 总收益: 229.51 平均盈利: 19.13 typeA: 9.56 胜率: 50.00%
趋势多且增强-R-1-1-2 总交易次数: 16 盈利: 2433.7534968542 亏损: -656.9721596382337 最大盈利: 920.53 最大亏损: -162.10 总收益: 1776.78 平均盈利: 111.05 typeA: 55.52 胜率: 50.00%
趋势多且增强-R-1-2-2 总交易次数: 6 盈利: 326.3675281041075 亏损: -125.10384946655637 最大盈利: 178.97 最大亏损: -84.35 总收益: 201.26 平均盈利: 33.54 typeA: 16.77 胜率: 50.00%
趋势空且增强-L-4-2-3 总交易次数: 2 盈利: 7.1431723616193565 亏损: -50.49683574194723 最大盈利: 7.14 最大亏损: -50.50 总收益: -43.35 平均盈利: -21.68 typeA: -10.84 胜率: 50.00%
趋势多且增强-L3-1-3 总交易次数: 2 盈利: 245.11034566110774 亏损: -191.91299019607962 最大盈利: 245.11 最大亏损: -191.91 总收益: 53.20 平均盈利: 26.60 typeA: 13.30 胜率: 50.00%
趋势空且增强-L3-1-6 总交易次数: 3 盈利: 277.2983868872895 亏损: -257.5297156581373 最大盈利: 277.30 最大亏损: -175.00 总收益: 19.77 平均盈利: 6.59 typeA: 2.20 胜率: 33.33%
趋势多且增强-L3-1-5 总交易次数: 3 盈利: 574.2620608670112 亏损: -219.07047017607147 最大盈利: 574.26 最大亏损: -132.34 总收益: 355.19 平均盈利: 118.40 typeA: 39.46 胜率: 33.33%
趋势多且增强-11 总交易次数: 6 盈利: 1426.0244724967636 亏损: -308.79210920478397 最大盈利: 1261.70 最大亏损: -192.02 总收益: 1117.23 平均盈利: 186.21 typeA: 62.06 胜率: 33.33%
趋势空且增强-11 总交易次数: 7 盈利: 876.1158880954604 亏损: -946.5265894848385 最大盈利: 750.81 最大亏损: -296.53 总收益: -70.41 平均盈利: -10.06 typeA: -2.87 胜率: 28.57%
趋势多且增强-L1-2-5 总交易次数: 4 盈利: 165.59924800250735 亏损: -316.04837347854306 最大盈利: 165.60 最大亏损: -205.28 总收益: -150.45 平均盈利: -37.61 typeA: -9.40 胜率: 25.00%
趋势空且增强-L2-3-3 总交易次数: 4 盈利: 120.58015679913409 亏损: -427.26521351080436 最大盈利: 120.58 最大亏损: -295.16 总收益: -306.69 平均盈利: -76.67 typeA: -19.17 胜率: 25.00%
趋势多且增强-R-1-1-1 总交易次数: 1 盈利: 0 亏损: -123.09286544648366 最大盈利: -123.09 最大亏损: -123.09 总收益: -123.09 平均盈利: -123.09 typeA: 0.00 胜率: 0.00%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     93
      胜率:          49.46%
      总收益:        2494.08 USDT
      期末余额:      12306.08 USDT
      盈亏比:        1.42
      最大单笔盈利:  1134.96
      最大单笔亏损:  -537.07
      手续费:       373.8290576626494
      =============================
    
profit: 2306.0753950447615
maxDrawdown 12.6%
startTime: 2025-01-10 00:00:00
趋势多且增强-L1-3-9 总交易次数: 1 盈利: 117.75445425961813 亏损: 0 最大盈利: 117.75 最大亏损: 117.75 总收益: 117.75 平均盈利: 117.75 typeA: 117.75 胜率: 100.00%
趋势空且增强-L2-3-4 总交易次数: 4 盈利: 611.1290989501385 亏损: 0 最大盈利: 493.16 最大亏损: 28.14 总收益: 611.13 平均盈利: 152.78 typeA: 152.78 胜率: 100.00%
趋势多且增强-L3-1-4-3 总交易次数: 2 盈利: 148.43350591266798 亏损: 0 最大盈利: 129.14 最大亏损: 19.30 总收益: 148.43 平均盈利: 74.22 typeA: 74.22 胜率: 100.00%
趋势空且增强-L-4-2-3 总交易次数: 1 盈利: 8.637192342753057 亏损: 0 最大盈利: 8.64 最大亏损: 8.64 总收益: 8.64 平均盈利: 8.64 typeA: 8.64 胜率: 100.00%
趋势空且增强-L2-1-3 总交易次数: 6 盈利: 1723.7728028860552 亏损: -210.05916785924717 最大盈利: 982.63 最大亏损: -180.29 总收益: 1513.71 平均盈利: 252.29 typeA: 168.20 胜率: 66.67%
趋势空且增强-11 总交易次数: 3 盈利: 393.5034504751798 亏损: -72.32656249999876 最大盈利: 344.93 最大亏损: -72.33 总收益: 321.18 平均盈利: 107.06 typeA: 71.38 胜率: 66.67%
趋势空且增强-L2-3-5 总交易次数: 5 盈利: 613.826239032687 亏损: -435.0295631217349 最大盈利: 587.95 最大亏损: -318.61 总收益: 178.80 平均盈利: 35.76 typeA: 21.46 胜率: 60.00%
趋势空且增强-L2-3-3 总交易次数: 5 盈利: 205.39671133840466 亏损: -49.195876695630716 最大盈利: 119.28 最大亏损: -27.91 总收益: 156.20 平均盈利: 31.24 typeA: 18.74 胜率: 60.00%
趋势多且增强-L3-1-4-1 总交易次数: 11 盈利: 1421.320017946046 亏损: -1091.8607380194608 最大盈利: 1134.96 最大亏损: -457.89 总收益: 329.46 平均盈利: 29.95 typeA: 16.34 胜率: 54.55%
趋势多且增强-11 总交易次数: 6 盈利: 846.2932411712693 亏损: -475.3455549490021 最大盈利: 808.88 最大亏损: -202.53 总收益: 370.95 平均盈利: 61.82 typeA: 30.91 胜率: 50.00%
趋势空且增强-L1-1-2 总交易次数: 4 盈利: 285.63114459072887 亏损: -545.8197443967216 最大盈利: 144.53 最大亏损: -537.07 总收益: -260.19 平均盈利: -65.05 typeA: -32.52 胜率: 50.00%
趋势多且增强-R-1-1-1 总交易次数: 2 盈利: 111.74160847037534 亏损: -306.7556727294261 最大盈利: 111.74 最大亏损: -306.76 总收益: -195.01 平均盈利: -97.51 typeA: -48.75 胜率: 50.00%
趋势空且增强-L3-1-6 总交易次数: 2 盈利: 260.5859241236362 亏损: -109.8085555929806 最大盈利: 260.59 最大亏损: -109.81 总收益: 150.78 平均盈利: 75.39 typeA: 37.69 胜率: 50.00%
趋势多且增强-L1-3-4 总交易次数: 2 盈利: 153.14205820960177 亏损: -128.25607046809915 最大盈利: 153.14 最大亏损: -128.26 总收益: 24.89 平均盈利: 12.44 typeA: 6.22 胜率: 50.00%
趋势多且增强-R-1-1-2 总交易次数: 15 盈利: 1294.5408287902583 亏损: -599.1713334155859 最大盈利: 470.07 最大亏损: -179.88 总收益: 695.37 平均盈利: 46.36 typeA: 21.64 胜率: 46.67%
趋势多且增强-L3-1-5 总交易次数: 5 盈利: 124.63569907012995 亏损: -619.2668904885024 最大盈利: 65.90 最大亏损: -395.22 总收益: -494.63 平均盈利: -98.93 typeA: -39.57 胜率: 40.00%
趋势多且增强-R-1-2-2 总交易次数: 3 盈利: 3.5967656663042598 亏损: -58.49484676836917 最大盈利: 3.60 最大亏损: -50.57 总收益: -54.90 平均盈利: -18.30 typeA: -6.10 胜率: 33.33%
趋势多且增强-L1-2-5 总交易次数: 4 盈利: 141.51567349472376 亏损: -101.69355108332 最大盈利: 141.52 最大亏损: -66.69 总收益: 39.82 平均盈利: 9.96 typeA: 2.49 胜率: 25.00%
趋势空且增强-2 总交易次数: 9 盈利: 11.057441253263587 亏损: -1001.6390034821062 最大盈利: 11.06 最大亏损: -283.16 总收益: -990.58 平均盈利: -110.06 typeA: -12.23 胜率: 11.11%
趋势多且增强-L1-2-2 总交易次数: 1 盈利: 0 亏损: -50.630554941410125 最大盈利: -50.63 最大亏损: -50.63 总收益: -50.63 平均盈利: -50.63 typeA: 0.00 胜率: 0.00%
趋势多且增强-L3-1-3 总交易次数: 1 盈利: 0 亏损: -23.617600808715967 最大盈利: -23.62 最大亏损: -23.62 总收益: -23.62 平均盈利: -23.62 typeA: 0.00 胜率: 0.00%
趋势多且增强-L1-1-6 总交易次数: 1 盈利: 0 亏损: -103.46717561877122 最大盈利: -103.47 最大亏损: -103.47 总收益: -103.47 平均盈利: -103.47 typeA: 0.00 胜率: 0.00%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     94
      胜率:          53.19%
      总收益:        -2989.88 USDT
      期末余额:      6820.12 USDT
      盈亏比:        0.61
      最大单笔盈利:  419.16
      最大单笔亏损:  -856.23
      手续费:       377.3322180566067
      =============================
    
profit: -3179.8806378845047
maxDrawdown 34.5%
startTime: 2025-02-09 00:00:00
趋势空且增强-L2-2-3 总交易次数: 2 盈利: 152.2839505542278 亏损: 0 最大盈利: 99.59 最大亏损: 52.69 总收益: 152.28 平均盈利: 76.14 typeA: 76.14 胜率: 100.00%
趋势空且增强-L1-1-2 总交易次数: 1 盈利: 82.71732463612868 亏损: 0 最大盈利: 82.72 最大亏损: 82.72 总收益: 82.72 平均盈利: 82.72 typeA: 82.72 胜率: 100.00%
趋势空且增强-L2-3-5 总交易次数: 5 盈利: 792.5209489369815 亏损: -70.21518621088683 最大盈利: 419.16 最大亏损: -70.22 总收益: 722.31 平均盈利: 144.46 typeA: 115.57 胜率: 80.00%
趋势多且增强-L3-1-5 总交易次数: 4 盈利: 147.05939551292835 亏损: -387.574144189858 最大盈利: 59.51 最大亏损: -387.57 总收益: -240.51 平均盈利: -60.13 typeA: -45.10 胜率: 75.00%
趋势空且增强-2 总交易次数: 7 盈利: 153.01400366752793 亏损: -71.19730276993482 最大盈利: 66.19 最大亏损: -58.59 总收益: 81.82 平均盈利: 11.69 typeA: 8.35 胜率: 71.43%
趋势多且增强-R-1-1-2 总交易次数: 17 盈利: 1174.9746023772973 亏损: -914.9266067262031 最大盈利: 380.79 最大亏损: -328.81 总收益: 260.05 平均盈利: 15.30 typeA: 9.90 胜率: 64.71%
趋势多且增强-L1-3-4 总交易次数: 6 盈利: 104.48750242046776 亏损: -146.9610178873842 最大盈利: 58.05 最大亏损: -121.08 总收益: -42.47 平均盈利: -7.08 typeA: -3.54 胜率: 50.00%
趋势空且增强-L2-1-3 总交易次数: 2 盈利: 102.63770752786037 亏损: -9.200287953927912 最大盈利: 102.64 最大亏损: -9.20 总收益: 93.44 平均盈利: 46.72 typeA: 23.36 胜率: 50.00%
趋势空且增强-L2-3-3 总交易次数: 2 盈利: 81.80757006645571 亏损: -53.449449676613035 最大盈利: 81.81 最大亏损: -53.45 总收益: 28.36 平均盈利: 14.18 typeA: 7.09 胜率: 50.00%
趋势多且增强-L1-3-9 总交易次数: 2 盈利: 74.03491212861483 亏损: -42.13996693694485 最大盈利: 74.03 最大亏损: -42.14 总收益: 31.89 平均盈利: 15.95 typeA: 7.97 胜率: 50.00%
趋势多且增强-L1-1-6 总交易次数: 4 盈利: 257.3050499973985 亏损: -242.76230569770667 最大盈利: 202.95 最大亏损: -197.32 总收益: 14.54 平均盈利: 3.64 typeA: 1.82 胜率: 50.00%
趋势空且增强-L3-1-6 总交易次数: 2 盈利: 260.1511260182081 亏损: -346.2842489397384 最大盈利: 260.15 最大亏损: -346.28 总收益: -86.13 平均盈利: -43.07 typeA: -21.53 胜率: 50.00%
趋势多且增强-L3-1-4-1 总交易次数: 11 盈利: 256.467619692965 亏损: -2083.320068687471 最大盈利: 169.78 最大亏损: -856.23 总收益: -1826.85 平均盈利: -166.08 typeA: -75.48 胜率: 45.45%
趋势多且增强-L1-2-5 总交易次数: 7 盈利: 283.57609959051393 亏损: -676.0440351022318 最大盈利: 139.31 最大亏损: -341.13 总收益: -392.47 平均盈利: -56.07 typeA: -24.03 胜率: 42.86%
趋势空且增强-L2-3-4 总交易次数: 7 盈利: 483.00247970988266 亏损: -593.4980191978086 最大盈利: 224.07 最大亏损: -270.90 总收益: -110.50 平均盈利: -15.79 typeA: -6.77 胜率: 42.86%
趋势空且增强-11 总交易次数: 5 盈利: 202.5251268230813 亏损: -940.5831726618353 最大盈利: 138.72 最大亏损: -676.98 总收益: -738.06 平均盈利: -147.61 typeA: -59.04 胜率: 40.00%
趋势多且增强-R-1-2-2 总交易次数: 5 盈利: 58.928072471067125 亏损: -828.4722895512244 最大盈利: 33.34 最大亏损: -531.37 总收益: -769.54 平均盈利: -153.91 typeA: -61.56 胜率: 40.00%
趋势多且增强-L3-1-3 总交易次数: 1 盈利: 0 亏损: -16.536202384412473 最大盈利: -16.54 最大亏损: -16.54 总收益: -16.54 平均盈利: -16.54 typeA: 0.00 胜率: 0.00%
趋势多且增强-11 总交易次数: 1 盈利: 0 亏损: -188.47835781277638 最大盈利: -188.48 最大亏损: -188.48 总收益: -188.48 平均盈利: -188.48 typeA: 0.00 胜率: 0.00%
趋势空且增强-L-4-2-3 总交易次数: 2 盈利: 0 亏损: -27.998285830837617 最大盈利: -9.05 最大亏损: -18.94 总收益: -28.00 平均盈利: -14.00 typeA: 0.00 胜率: 0.00%
趋势多且增强-R-1-1-1 总交易次数: 1 盈利: 0 亏损: -17.733181798312682 最大盈利: -17.73 最大亏损: -17.73 总收益: -17.73 平均盈利: -17.73 typeA: 0.00 胜率: 0.00%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     91
      胜率:          52.75%
      总收益:        646.43 USDT
      期末余额:      10462.43 USDT
      盈亏比:        1.12
      最大单笔盈利:  915.95
      最大单笔亏损:  -478.64
      手续费:       366.57842139522
      =============================
    
profit: 462.4293205052127
maxDrawdown 12.7%
startTime: 2025-03-11 00:00:00
趋势空且增强-L2-1-3 总交易次数: 2 盈利: 56.810692694657796 亏损: 0 最大盈利: 30.82 最大亏损: 25.99 总收益: 56.81 平均盈利: 28.41 typeA: 28.41 胜率: 100.00%
趋势多且增强-R-2-1 总交易次数: 1 盈利: 74.47472769550858 亏损: 0 最大盈利: 74.47 最大亏损: 74.47 总收益: 74.47 平均盈利: 74.47 typeA: 74.47 胜率: 100.00%
趋势空且增强-L2-3-3 总交易次数: 1 盈利: 86.75114085792524 亏损: 0 最大盈利: 86.75 最大亏损: 86.75 总收益: 86.75 平均盈利: 86.75 typeA: 86.75 胜率: 100.00%
趋势空且增强-L2-3-5 总交易次数: 2 盈利: 44.62193378599292 亏损: 0 最大盈利: 28.80 最大亏损: 15.82 总收益: 44.62 平均盈利: 22.31 typeA: 22.31 胜率: 100.00%
趋势多且增强-L3-1-4-1 总交易次数: 6 盈利: 1102.180235201983 亏损: -11.346108903949139 最大盈利: 915.95 最大亏损: -11.35 总收益: 1090.83 平均盈利: 181.81 typeA: 151.50 胜率: 83.33%
趋势多且增强-L3-1-4-3 总交易次数: 4 盈利: 313.446541032874 亏损: -2 最大盈利: 242.61 最大亏损: -2.00 总收益: 311.45 平均盈利: 77.86 typeA: 58.40 胜率: 75.00%
趋势多且增强-L3-1-5 总交易次数: 7 盈利: 777.5271898171078 亏损: -209.81987826009072 最大盈利: 411.99 最大亏损: -144.94 总收益: 567.71 平均盈利: 81.10 typeA: 57.93 胜率: 71.43%
趋势多且增强-R-1-2-2 总交易次数: 9 盈利: 602.9704717251237 亏损: -940.8221828636877 最大盈利: 261.12 最大亏损: -478.64 总收益: -337.85 平均盈利: -37.54 typeA: -25.03 胜率: 66.67%
趋势多且增强-R-1-1-2 总交易次数: 6 盈利: 588.9071814733627 亏损: -65.35598334363125 最大盈利: 424.68 最大亏损: -36.68 总收益: 523.55 平均盈利: 87.26 typeA: 58.18 胜率: 66.67%
趋势空且增强-L2-2-3 总交易次数: 2 盈利: 86.99514136861332 亏损: -185.08399770393416 最大盈利: 87.00 最大亏损: -185.08 总收益: -98.09 平均盈利: -49.04 typeA: -24.52 胜率: 50.00%
趋势多且增强-L1-1-6 总交易次数: 2 盈利: 55.583873290137774 亏损: -197.31662366384174 最大盈利: 55.58 最大亏损: -197.32 总收益: -141.73 平均盈利: -70.87 typeA: -35.43 胜率: 50.00%
趋势空且增强-11 总交易次数: 8 盈利: 863.8437933517655 亏损: -642.0446884502066 最大盈利: 292.83 最大亏损: -350.94 总收益: 221.80 平均盈利: 27.72 typeA: 13.86 胜率: 50.00%
趋势空且增强-L2-3-4 总交易次数: 6 盈利: 134.74370958632454 亏损: -302.2160704388059 最大盈利: 80.21 最大亏损: -230.69 总收益: -167.47 平均盈利: -27.91 typeA: -13.96 胜率: 50.00%
趋势多且增强-L3-1-3 总交易次数: 2 盈利: 31.008047320999264 亏损: -153.25662272441906 最大盈利: 31.01 最大亏损: -153.26 总收益: -122.25 平均盈利: -61.12 typeA: -30.56 胜率: 50.00%
趋势空且增强-2 总交易次数: 9 盈利: 186.29413602155597 亏损: -547.4272553793357 最大盈利: 97.74 最大亏损: -233.83 总收益: -361.13 平均盈利: -40.13 typeA: -17.83 胜率: 44.44%
趋势多且增强-L1-3-4 总交易次数: 5 盈利: 702.6370918931193 亏损: -141.66263327335636 最大盈利: 407.75 最大亏损: -79.69 总收益: 560.97 平均盈利: 112.19 typeA: 44.88 胜率: 40.00%
趋势空且增强-L-4-2-3 总交易次数: 8 盈利: 236.08474032150968 亏损: -793.6029679785454 最大盈利: 194.12 最大亏损: -324.94 总收益: -557.52 平均盈利: -69.69 typeA: -26.13 胜率: 37.50%
趋势空且增强-L3-1-6 总交易次数: 2 盈利: 0 亏损: -337.5262350607288 最大盈利: -10.55 最大亏损: -326.98 总收益: -337.53 平均盈利: -168.76 typeA: 0.00 胜率: 0.00%
趋势多且增强-L1-2-5 总交易次数: 4 盈利: 0 亏损: -173.2945861756943 最大盈利: -25.74 最大亏损: -72.36 总收益: -173.29 平均盈利: -43.32 typeA: 0.00 胜率: 0.00%
趋势多且增强-L1-3-2 总交易次数: 1 盈利: 0 亏损: -25.95080338883983 最大盈利: -25.95 最大亏损: -25.95 总收益: -25.95 平均盈利: -25.95 typeA: 0.00 胜率: 0.00%
趋势多且增强-11 总交易次数: 3 盈利: 0 亏损: -512.6648539180545 最大盈利: -106.85 最大亏损: -271.20 总收益: -512.66 平均盈利: -170.89 typeA: 0.00 胜率: 0.00%
趋势多且增强-R-2-2 总交易次数: 1 盈利: 0 亏损: -57.05983540622498 最大盈利: -57.06 最大亏损: -57.06 总收益: -57.06 平均盈利: -57.06 typeA: 0.00 胜率: 0.00%
tradeNumTotal 3901
profitTotal 173396.87468350198
maxLossTotal -2061.77
winRateTotal 2992.9200000000005
period month 53
avgRate 56.47
maxDrawdownTotal 34.5
趋势空且增强-L2-1-3 总交易次数: 67 盈利: 9076.716191995756 亏损: -1529.8398031870045 最大盈利: 1220.97 最大亏损: -673.69 总收益: 7546.88 平均盈利: 112.64 typeA: 87.42 胜率: 77.61%
趋势多且增强-R-1-1-1 总交易次数: 34 盈利: 4907.429210512164 亏损: -1682.5991224617235 最大盈利: 1148.20 最大亏损: -694.30 总收益: 3224.83 平均盈利: 94.85 typeA: 66.95 胜率: 70.59%
趋势空且增强-L2-2-3 总交易次数: 37 盈利: 3841.5974671037648 亏损: -1707.3428063229749 最大盈利: 1142.40 最大亏损: -375.86 总收益: 2134.25 平均盈利: 57.68 typeA: 38.98 胜率: 67.57%
趋势多且增强-L3-1-5 总交易次数: 203 盈利: 12092.009654797055 亏损: -7128.534423673521 最大盈利: 1373.52 最大亏损: -395.22 总收益: 4963.48 平均盈利: 24.45 typeA: 16.38 胜率: 67.00%
趋势多且增强-R-2-2 总交易次数: 23 盈利: 2065.323624484191 亏损: -767.6799062384537 最大盈利: 369.72 最大亏损: -277.05 总收益: 1297.64 平均盈利: 56.42 typeA: 36.80 胜率: 65.22%
趋势空且增强-L1-1-2 总交易次数: 37 盈利: 6171.886933348584 亏损: -3768.569829967331 最大盈利: 2068.45 最大亏损: -808.06 总收益: 2403.32 平均盈利: 64.95 typeA: 42.13 胜率: 64.86%
趋势空且增强-11 总交易次数: 162 盈利: 19445.478498454362 亏损: -13192.231385022344 最大盈利: 892.06 最大亏损: -897.70 总收益: 6253.25 平均盈利: 38.60 typeA: 25.02 胜率: 64.81%
趋势多且增强-L3-1-4-1 总交易次数: 199 盈利: 20565.89067675627 亏损: -12879.562782224652 最大盈利: 1855.48 最大亏损: -1830.26 总收益: 7686.33 平均盈利: 38.62 typeA: 24.46 胜率: 63.32%
趋势空且增强-L-4-2-3 总交易次数: 152 盈利: 6195.090813764246 亏损: -5159.136609023309 最大盈利: 568.78 最大亏损: -590.13 总收益: 1035.95 平均盈利: 6.82 typeA: 4.17 胜率: 61.18%
趋势多且增强-R-1-2-2 总交易次数: 72 盈利: 7413.508445869265 亏损: -4792.24720589423 最大盈利: 1403.49 最大亏损: -830.33 总收益: 2621.26 平均盈利: 36.41 typeA: 22.25 胜率: 61.11%
趋势多且增强-L3-1-4-3 总交易次数: 373 盈利: 16353.38823423628 亏损: -13385.562619487626 最大盈利: 2081.23 最大亏损: -521.42 总收益: 2967.83 平均盈利: 7.96 typeA: 4.80 胜率: 60.32%
趋势空且增强-L2-3-3 总交易次数: 375 盈利: 21748.29293198653 亏损: -17451.27231641494 最大盈利: 1862.45 最大亏损: -774.78 总收益: 4297.02 平均盈利: 11.46 typeA: 6.84 胜率: 59.73%
趋势多且增强-R-2-1 总交易次数: 88 盈利: 7429.779535403549 亏损: -4996.536565567239 最大盈利: 1699.60 最大亏损: -912.30 总收益: 2433.24 平均盈利: 27.65 typeA: 16.34 胜率: 59.09%
趋势多且增强-R-3-1 总交易次数: 136 盈利: 8368.29203923189 亏损: -6946.908067631695 最大盈利: 1253.97 最大亏损: -837.68 总收益: 1421.38 平均盈利: 10.45 typeA: 6.15 胜率: 58.82%
趋势空且增强-L2-3-4 总交易次数: 334 盈利: 17889.041751263583 亏损: -14630.898062021874 最大盈利: 1020.85 最大亏损: -647.04 总收益: 3258.14 平均盈利: 9.75 typeA: 5.64 胜率: 57.78%
趋势空且增强-L2-3-5 总交易次数: 196 盈利: 12705.027995188673 亏损: -7838.376420824306 最大盈利: 1298.29 最大亏损: -633.58 总收益: 4866.65 平均盈利: 24.83 typeA: 14.19 胜率: 57.14%
趋势多且增强-L1-2-1 总交易次数: 7 盈利: 1859.604771694 亏损: -350.4566031446385 最大盈利: 766.72 最大亏损: -165.71 总收益: 1509.15 平均盈利: 215.59 typeA: 123.19 胜率: 57.14%
趋势多且增强-R-1-1-2 总交易次数: 261 盈利: 31856.349556815832 亏损: -20717.266333926524 最大盈利: 2358.53 最大亏损: -2061.77 总收益: 11139.08 平均盈利: 42.68 typeA: 24.20 胜率: 56.70%
趋势空且增强-2 总交易次数: 200 盈利: 30892.008822511783 亏损: -16213.758213292116 最大盈利: 4403.10 最大亏损: -818.35 总收益: 14678.25 平均盈利: 73.39 typeA: 40.00 胜率: 54.50%
趋势多且增强-R-3-2 总交易次数: 27 盈利: 1440.7887485268834 亏损: -566.2214381222441 最大盈利: 266.93 最大亏损: -157.60 总收益: 874.57 平均盈利: 32.39 typeA: 16.79 胜率: 51.85%
趋势多且增强-L3-1-3 总交易次数: 133 盈利: 12858.911398938828 亏损: -6374.742812669993 最大盈利: 2591.16 最大亏损: -695.46 总收益: 6484.17 平均盈利: 48.75 typeA: 24.56 胜率: 50.38%
趋势多且增强-11 总交易次数: 212 盈利: 26407.899679590453 亏损: -17300.4204439692 最大盈利: 2423.17 最大亏损: -907.40 总收益: 9107.48 平均盈利: 42.96 typeA: 21.08 胜率: 49.06%
趋势多且增强-L1-3-9 总交易次数: 34 盈利: 4504.662928826276 亏损: -2576.536609655994 最大盈利: 1115.35 最大亏损: -462.86 总收益: 1928.13 平均盈利: 56.71 typeA: 26.69 胜率: 47.06%
趋势多且增强-L1-1-6 总交易次数: 56 盈利: 17036.94718852432 亏损: -4842.990263642759 最大盈利: 8558.15 最大亏损: -381.66 总收益: 12193.96 平均盈利: 217.75 typeA: 101.10 胜率: 46.43%
趋势多且增强-L1-2-2 总交易次数: 11 盈利: 10463.568812160125 亏损: -731.8088541712134 最大盈利: 7106.66 最大亏损: -315.45 总收益: 9731.76 平均盈利: 884.71 typeA: 402.10 胜率: 45.45%
趋势多且增强-L1-3-4 总交易次数: 190 盈利: 13272.260748972361 亏损: -11868.150711910703 最大盈利: 905.14 最大亏损: -610.81 总收益: 1404.11 平均盈利: 7.39 typeA: 3.11 胜率: 42.11%
趋势多且增强-L1-3-2 总交易次数: 32 盈利: 3452.6893903046007 亏损: -1313.820727792057 最大盈利: 880.28 最大亏损: -296.01 总收益: 2138.87 平均盈利: 66.84 typeA: 27.16 胜率: 40.63%
趋势多且增强-L1-3-1 总交易次数: 41 盈利: 46747.01393121207 亏损: -2341.8041698191405 最大盈利: 41166.13 最大亏损: -482.62 总收益: 44405.21 平均盈利: 1083.05 typeA: 422.61 胜率: 39.02%
趋势空且增强-L3-1-6 总交易次数: 127 盈利: 16412.917819586226 亏损: -10920.347641760676 最大盈利: 2533.05 最大亏损: -727.25 总收益: 5492.57 平均盈利: 43.25 typeA: 16.01 胜率: 37.01%
趋势多且增强-L1-2-5 总交易次数: 82 盈利: 7496.068981625502 亏损: -5751.949350342932 最大盈利: 1183.30 最大亏损: -341.13 总收益: 1744.12 平均盈利: 21.27 typeA: 7.26 胜率: 34.15%


















*/
