/*


      ========== 回测结果 ==========
      总交易次数:     36
      盈利次数:       13
      亏损次数:       23
      胜率:          36.11%
      总收益:        188.68 USDT
      期末余额:      1181.48 USDT
      盈亏比:        1.63
      最大单笔盈利:  215.85
      最大单笔亏损:  -36.95
      手续费:       14.472926264280666
      =============================
    
profit: 181.48138795154182
maxDrawdown 9.7%
startTime: 2021-01-01 00:00:00
趋势多且增强 总交易次数: 23 盈利: 471.6680403781276 亏损: -196.03128113208845 最大盈利: 215.85 最大亏损: -36.95 总收益: 275.64 平均盈利: 11.98 typeA: 4.69 胜率: 39.13%
趋势空且增强 总交易次数: 13 盈利: 18.237352747435306 亏损: -105.19272404193109 最大盈利: 10.17 最大亏损: -25.82 总收益: -86.96 平均盈利: -6.69 typeA: -2.06 胜率: 30.77%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     47
      盈利次数:       11
      亏损次数:       36
      胜率:          23.40%
      总收益:        -333.45 USDT
      期末余额:      656.95 USDT
      盈亏比:        0.44
      最大单笔盈利:  97.36
      最大单笔亏损:  -64.39
      手续费:       18.9800602593559
      =============================
    
profit: -343.053818220023
maxDrawdown 35.9%
startTime: 2021-01-31 00:00:00
趋势空且增强 总交易次数: 22 盈利: 133.18174585918553 亏损: -249.79171073477337 最大盈利: 53.87 最大亏损: -41.11 总收益: -116.61 平均盈利: -5.30 typeA: -1.20 胜率: 22.73%
趋势多且增强 总交易次数: 25 盈利: 126.78476676313488 亏损: -343.628620107568 最大盈利: 97.36 最大亏损: -64.39 总收益: -216.84 平均盈利: -8.67 typeA: -2.08 胜率: 24.00%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     43
      盈利次数:       14
      亏损次数:       29
      胜率:          32.56%
      总收益:        -46.53 USDT
      期末余额:      944.87 USDT
      盈亏比:        0.72
      最大单笔盈利:  32.88
      最大单笔亏损:  -17.88
      手续费:       17.21420432974367
      =============================
    
profit: -55.13201903177719
maxDrawdown 5.7%
startTime: 2021-03-02 00:00:00
趋势多且增强 总交易次数: 27 盈利: 98.26710102829995 亏损: -87.11849440351587 最大盈利: 32.88 最大亏损: -17.88 总收益: 11.15 平均盈利: 0.41 typeA: 0.17 胜率: 40.74%
趋势空且增强 总交易次数: 16 盈利: 20.62691816444489 亏损: -78.3075438210041 最大盈利: 11.17 最大亏损: -16.03 总收益: -57.68 平均盈利: -3.61 typeA: -0.68 胜率: 18.75%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     47
      盈利次数:       16
      亏损次数:       31
      胜率:          34.04%
      总收益:        520.97 USDT
      期末余额:      1511.37 USDT
      盈亏比:        2.26
      最大单笔盈利:  182.61
      最大单笔亏损:  -55.10
      手续费:       19.062628459774235
      =============================
    
profit: 511.3735918305906
maxDrawdown 7.8%
startTime: 2021-04-01 00:00:00
趋势多且增强 总交易次数: 36 盈利: 687.5708376759626 亏损: -273.0659359470741 最大盈利: 182.61 最大亏损: -55.10 总收益: 414.50 平均盈利: 11.51 typeA: 4.48 胜率: 38.89%
趋势空且增强 总交易次数: 11 盈利: 247.25848982042362 亏损: -140.78979971871968 最大盈利: 130.77 最大亏损: -29.16 总收益: 106.47 平均盈利: 9.68 typeA: 1.76 胜率: 18.18%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     39
      盈利次数:       10
      亏损次数:       29
      胜率:          25.64%
      总收益:        -93.86 USDT
      期末余额:      898.34 USDT
      盈亏比:        0.78
      最大单笔盈利:  105.75
      最大单笔亏损:  -44.25
      手续费:       15.630812183460279
      =============================
    
profit: -101.6616670073455
maxDrawdown 18.8%
startTime: 2021-05-01 00:00:00
趋势多且增强 总交易次数: 21 盈利: 193.3329810413157 亏损: -163.52475280877619 最大盈利: 40.69 最大亏损: -39.02 总收益: 29.81 平均盈利: 1.42 typeA: 0.47 胜率: 33.33%
趋势空且增强 总交易次数: 18 盈利: 133.20786061005376 亏损: -256.8777558499371 最大盈利: 105.75 最大亏损: -44.25 总收益: -123.67 平均盈利: -6.87 typeA: -1.15 胜率: 16.67%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     40
      盈利次数:       14
      亏损次数:       26
      胜率:          35.00%
      总收益:        136.54 USDT
      期末余额:      1128.54 USDT
      盈亏比:        1.45
      最大单笔盈利:  149.91
      最大单笔亏损:  -47.97
      手续费:       16.002726642648
      =============================
    
profit: 128.53755159125876
maxDrawdown 9.9%
startTime: 2021-05-31 00:00:00
趋势多且增强 总交易次数: 19 盈利: 232.6953344396026 亏损: -157.42440605176733 最大盈利: 96.61 最大亏损: -47.97 总收益: 75.27 平均盈利: 3.96 typeA: 1.46 胜率: 36.84%
趋势空且增强 总交易次数: 21 盈利: 210.61803501442748 亏损: -149.35141181100158 最大盈利: 149.91 最大亏损: -22.89 总收益: 61.27 平均盈利: 2.92 typeA: 0.97 胜率: 33.33%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     36
      盈利次数:       10
      亏损次数:       26
      胜率:          27.78%
      总收益:        -15.39 USDT
      期末余额:      977.41 USDT
      盈亏比:        0.92
      最大单笔盈利:  73.49
      最大单笔亏损:  -29.41
      手续费:       14.39129787663715
      =============================
    
profit: -22.589111601428954
maxDrawdown 7.2%
startTime: 2021-06-30 00:00:00
趋势空且增强 总交易次数: 20 盈利: 134.1482538234378 亏损: -120.48832099842872 最大盈利: 73.49 最大亏损: -29.41 总收益: 13.66 平均盈利: 0.68 typeA: 0.17 胜率: 25.00%
趋势多且增强 总交易次数: 16 盈利: 35.17343957683259 亏损: -64.22248400326886 最大盈利: 15.34 最大亏损: -12.37 总收益: -29.05 平均盈利: -1.82 typeA: -0.57 胜率: 31.25%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     50
      盈利次数:       15
      亏损次数:       35
      胜率:          30.00%
      总收益:        -26.92 USDT
      期末余额:      963.08 USDT
      盈亏比:        0.90
      最大单笔盈利:  76.63
      最大单笔亏损:  -24.09
      手续费:       20.027896199716437
      =============================
    
profit: -36.921282534437864
maxDrawdown 9.6%
startTime: 2021-07-30 00:00:00
趋势多且增强 总交易次数: 30 盈利: 204.53228762117877 亏损: -149.25074025863665 最大盈利: 76.63 最大亏损: -24.09 总收益: 55.28 平均盈利: 1.84 typeA: 0.68 胜率: 36.67%
趋势空且增强 总交易次数: 20 盈利: 50.793938556455736 亏损: -132.99676845343328 最大盈利: 34.67 最大亏损: -23.89 总收益: -82.20 平均盈利: -4.11 typeA: -0.82 胜率: 20.00%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     40
      盈利次数:       9
      亏损次数:       31
      胜率:          22.50%
      总收益:        -72.56 USDT
      期末余额:      919.44 USDT
      盈亏比:        0.69
      最大单笔盈利:  94.84
      最大单笔亏损:  -24.86
      手续费:       16.003801680181123
      =============================
    
profit: -80.55708472988124
maxDrawdown 10.6%
startTime: 2021-08-29 00:00:00
趋势空且增强 总交易次数: 25 盈利: 129.12717890026374 亏损: -175.9163770463374 最大盈利: 94.84 最大亏损: -24.86 总收益: -46.79 平均盈利: -1.87 typeA: -0.37 胜率: 20.00%
趋势多且增强 总交易次数: 15 盈利: 31.541274423918516 亏损: -57.3091610077245 最大盈利: 12.91 最大亏损: -15.33 总收益: -25.77 平均盈利: -1.72 typeA: -0.46 胜率: 26.67%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     43
      盈利次数:       11
      亏损次数:       32
      胜率:          25.58%
      总收益:        -100.63 USDT
      期末余额:      890.77 USDT
      盈亏比:        0.72
      最大单笔盈利:  95.37
      最大单笔亏损:  -74.80
      手续费:       17.280143745684764
      =============================
    
profit: -109.230039264178
maxDrawdown 22.1%
startTime: 2021-09-28 00:00:00
趋势多且增强 总交易次数: 18 盈利: 223.31012208579244 亏损: -72.5565825163989 最大盈利: 95.37 最大亏损: -27.75 总收益: 150.75 平均盈利: 8.38 typeA: 4.65 胜率: 55.56%
趋势空且增强 总交易次数: 25 盈利: 29.45586146754706 亏损: -280.8394403011165 最大盈利: 29.46 最大亏损: -74.80 总收益: -251.38 平均盈利: -10.06 typeA: -0.40 胜率: 4.00%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     40
      盈利次数:       14
      亏损次数:       26
      胜率:          35.00%
      总收益:        196.38 USDT
      期末余额:      1188.38 USDT
      盈亏比:        2.22
      最大单笔盈利:  70.01
      最大单笔亏损:  -16.05
      手续费:       16.02573257419219
      =============================
    
profit: 188.38338503682212
maxDrawdown 5.5%
startTime: 2021-10-28 00:00:00
趋势多且增强 总交易次数: 17 盈利: 209.44803893320224 亏损: -46.345351846041716 最大盈利: 70.01 最大亏损: -10.83 总收益: 163.10 平均盈利: 9.59 typeA: 4.52 胜率: 47.06%
趋势空且增强 总交易次数: 23 盈利: 147.30958393308768 亏损: -114.02888598342433 最大盈利: 60.58 最大亏损: -16.05 总收益: 33.28 平均盈利: 1.45 typeA: 0.38 胜率: 26.09%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     52
      盈利次数:       11
      亏损次数:       41
      胜率:          21.15%
      总收益:        33.54 USDT
      期末余额:      1023.14 USDT
      盈亏比:        1.14
      最大单笔盈利:  173.39
      最大单笔亏损:  -28.77
      手续费:       20.747827287399065
      =============================
    
profit: 23.141891500845645
maxDrawdown 10.5%
startTime: 2021-11-27 00:00:00
趋势空且增强 总交易次数: 20 盈利: 234.8658256198423 亏损: -86.45870939527049 最大盈利: 173.39 最大亏损: -22.17 总收益: 148.41 平均盈利: 7.42 typeA: 2.23 胜率: 30.00%
趋势多且增强 总交易次数: 32 盈利: 31.054838004107584 亏损: -145.92006272783152 最大盈利: 17.27 最大亏损: -28.77 总收益: -114.87 平均盈利: -3.59 typeA: -0.56 胜率: 15.63%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     44
      盈利次数:       10
      亏损次数:       34
      胜率:          22.73%
      总收益:        -17.31 USDT
      期末余额:      973.89 USDT
      盈亏比:        0.91
      最大单笔盈利:  85.51
      最大单笔亏损:  -42.13
      手续费:       17.590652985726734
      =============================
    
profit: -26.108895800452842
maxDrawdown 9.5%
startTime: 2021-12-27 00:00:00
趋势空且增强 总交易次数: 20 盈利: 128.90396073134184 亏损: -113.79172477271828 最大盈利: 85.51 最大亏损: -42.13 总收益: 15.11 平均盈利: 0.76 typeA: 0.19 胜率: 25.00%
趋势多且增强 总交易次数: 24 盈利: 44.8868258912766 亏损: -77.30795765035107 最大盈利: 19.24 最大亏损: -23.63 总收益: -32.42 平均盈利: -1.35 typeA: -0.28 胜率: 20.83%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     45
      盈利次数:       13
      亏损次数:       32
      胜率:          28.89%
      总收益:        -18.27 USDT
      期末余额:      972.73 USDT
      盈亏比:        0.88
      最大单笔盈利:  41.91
      最大单笔亏损:  -14.10
      手续费:       17.98420333109164
      =============================
    
profit: -27.271826905619037
maxDrawdown 5.7%
startTime: 2022-01-26 00:00:00
趋势空且增强 总交易次数: 18 盈利: 91.30901251496311 亏损: -60.054182459268254 最大盈利: 41.91 最大亏损: -9.70 总收益: 31.25 平均盈利: 1.74 typeA: 0.58 胜率: 33.33%
趋势多且增强 总交易次数: 27 盈利: 46.15057662642629 亏损: -95.67723358773841 最大盈利: 17.27 最大亏损: -14.10 总收益: -49.53 平均盈利: -1.83 typeA: -0.48 胜率: 25.93%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     44
      盈利次数:       13
      亏损次数:       31
      胜率:          29.55%
      总收益:        -41.10 USDT
      期末余额:      950.10 USDT
      盈亏比:        0.76
      最大单笔盈利:  28.40
      最大单笔亏损:  -35.68
      手续费:       17.60622880400481
      =============================
    
profit: -49.89856578981801
maxDrawdown 11.1%
startTime: 2022-02-25 00:00:00
趋势多且增强 总交易次数: 22 盈利: 63.27581355890575 亏损: -68.24985720804851 最大盈利: 25.47 最大亏损: -14.10 总收益: -4.97 平均盈利: -0.23 typeA: -0.07 胜率: 31.82%
趋势空且增强 总交易次数: 22 盈利: 66.36082848702523 亏损: -102.48535062769848 最大盈利: 28.40 最大亏损: -35.68 总收益: -36.12 平均盈利: -1.64 typeA: -0.45 胜率: 27.27%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     59
      盈利次数:       21
      亏损次数:       38
      胜率:          35.59%
      总收益:        44.33 USDT
      期末余额:      1032.53 USDT
      盈亏比:        1.21
      最大单笔盈利:  41.85
      最大单笔亏损:  -15.67
      手续费:       23.580556359851684
      =============================
    
profit: 32.534568847489254
maxDrawdown 7.7%
startTime: 2022-03-27 00:00:00
趋势空且增强 总交易次数: 18 盈利: 141.6595538452337 亏损: -68.57755753825815 最大盈利: 41.85 最大亏损: -11.89 总收益: 73.08 平均盈利: 4.06 typeA: 1.80 胜率: 44.44%
趋势多且增强 总交易次数: 41 盈利: 112.20158165915434 亏损: -140.9490091186378 最大盈利: 34.95 最大亏损: -15.67 总收益: -28.75 平均盈利: -0.70 typeA: -0.22 胜率: 31.71%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     36
      盈利次数:       12
      亏损次数:       24
      胜率:          33.33%
      总收益:        -3.76 USDT
      期末余额:      989.04 USDT
      盈亏比:        0.98
      最大单笔盈利:  82.15
      最大单笔亏损:  -38.65
      手续费:       14.372655384911926
      =============================
    
profit: -10.958148732278005
maxDrawdown 7.9%
startTime: 2022-04-26 00:00:00
趋势空且增强 总交易次数: 23 盈利: 166.0865250313859 亏损: -100.60372022668052 最大盈利: 82.15 最大亏损: -19.85 总收益: 65.48 平均盈利: 2.85 typeA: 1.11 胜率: 39.13%
趋势多且增强 总交易次数: 13 盈利: 18.36869189219692 亏损: -87.60964542917897 最大盈利: 9.58 最大亏损: -38.65 总收益: -69.24 平均盈利: -5.33 typeA: -1.23 胜率: 23.08%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     37
      盈利次数:       10
      亏损次数:       27
      胜率:          27.03%
      总收益:        -79.37 USDT
      期末余额:      913.23 USDT
      盈亏比:        0.49
      最大单笔盈利:  15.60
      最大单笔亏损:  -15.16
      手续费:       14.801248614971742
      =============================
    
profit: -86.77074852339081
maxDrawdown 8.7%
startTime: 2022-05-26 00:00:00
趋势多且增强 总交易次数: 22 盈利: 60.14329698465916 亏损: -97.39993686698723 最大盈利: 15.60 最大亏损: -15.16 总收益: -37.26 平均盈利: -1.69 typeA: -0.54 胜率: 31.82%
趋势空且增强 总交易次数: 15 盈利: 16.86379955561437 亏损: -58.977908196675585 最大盈利: 8.04 最大亏损: -14.71 总收益: -42.11 平均盈利: -2.81 typeA: -0.56 胜率: 20.00%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     41
      盈利次数:       13
      亏损次数:       28
      胜率:          31.71%
      总收益:        -16.13 USDT
      期末余额:      975.67 USDT
      盈亏比:        0.90
      最大单笔盈利:  56.56
      最大单笔亏损:  -12.76
      手续费:       16.3960244262226
      =============================
    
profit: -24.33348311738507
maxDrawdown 7.2%
startTime: 2022-06-25 00:00:00
趋势空且增强 总交易次数: 17 盈利: 83.69579517163073 亏损: -81.12439603271272 最大盈利: 56.56 最大亏损: -12.76 总收益: 2.57 平均盈利: 0.15 typeA: 0.05 胜率: 35.29%
趋势多且增强 总交易次数: 24 盈利: 61.92130608312981 亏损: -80.62618833943098 最大盈利: 20.83 最大亏损: -11.01 总收益: -18.70 平均盈利: -0.78 typeA: -0.23 胜率: 29.17%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     44
      盈利次数:       16
      亏损次数:       28
      胜率:          36.36%
      总收益:        28.32 USDT
      期末余额:      1019.52 USDT
      盈亏比:        1.22
      最大单笔盈利:  62.94
      最大单笔亏损:  -9.78
      手续费:       17.58948204463277
      =============================
    
profit: 19.522079776093392
maxDrawdown 7.9%
startTime: 2022-07-25 00:00:00
趋势空且增强 总交易次数: 20 盈利: 102.1920538329563 亏损: -61.3324143706826 最大盈利: 62.94 最大亏损: -6.78 总收益: 40.86 平均盈利: 2.04 typeA: 0.72 胜率: 35.00%
趋势多且增强 总交易次数: 24 盈利: 52.86657183181295 亏损: -65.40413151799098 最大盈利: 18.81 最大亏损: -9.78 总收益: -12.54 平均盈利: -0.52 typeA: -0.20 胜率: 37.50%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     40
      盈利次数:       12
      亏损次数:       28
      胜率:          30.00%
      总收益:        36.46 USDT
      期末余额:      1028.26 USDT
      盈亏比:        1.30
      最大单笔盈利:  79.29
      最大单笔亏损:  -14.33
      手续费:       16.192951588742183
      =============================
    
profit: 28.260681666530445
maxDrawdown 4.5%
startTime: 2022-08-24 00:00:00
趋势空且增强 总交易次数: 13 盈利: 85.30039875487003 亏损: -48.04458441377711 最大盈利: 79.29 最大亏损: -14.33 总收益: 37.26 平均盈利: 2.87 typeA: 1.10 胜率: 38.46%
趋势多且增强 总交易次数: 27 盈利: 72.41513669799802 亏损: -73.21026937255901 最大盈利: 22.56 最大亏损: -8.78 总收益: -0.80 平均盈利: -0.03 typeA: -0.01 胜率: 25.93%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     46
      盈利次数:       13
      亏损次数:       33
      胜率:          28.26%
      总收益:        -48.72 USDT
      期末余额:      942.08 USDT
      盈亏比:        0.59
      最大单笔盈利:  20.63
      最大单笔亏损:  -14.33
      手续费:       18.402243187502012
      =============================
    
profit: -57.91905611248774
maxDrawdown 8.0%
startTime: 2022-09-23 00:00:00
趋势多且增强 总交易次数: 22 盈利: 35.600085358680026 亏损: -54.1476929785629 最大盈利: 16.58 最大亏损: -12.60 总收益: -18.55 平均盈利: -0.84 typeA: -0.23 胜率: 27.27%
趋势空且增强 总交易次数: 24 盈利: 34.45053158510978 亏损: -64.62198007771255 最大盈利: 20.63 最大亏损: -14.33 总收益: -30.17 平均盈利: -1.26 typeA: -0.37 胜率: 29.17%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     42
      盈利次数:       8
      亏损次数:       34
      胜率:          19.05%
      总收益:        -183.57 USDT
      期末余额:      807.83 USDT
      盈亏比:        0.47
      最大单笔盈利:  52.77
      最大单笔亏损:  -35.69
      手续费:       17.030522619668275
      =============================
    
profit: -192.17272663022402
maxDrawdown 24.4%
startTime: 2022-10-23 00:00:00
趋势多且增强 总交易次数: 20 盈利: 93.67546423027225 亏损: -108.93776415425339 最大盈利: 38.45 最大亏损: -22.44 总收益: -15.26 平均盈利: -0.76 typeA: -0.19 胜率: 25.00%
趋势空且增强 总交易次数: 22 盈利: 69.08806569840768 亏损: -237.39849240464832 最大盈利: 52.77 最大亏损: -35.69 总收益: -168.31 平均盈利: -7.65 typeA: -1.04 胜率: 13.64%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     45
      盈利次数:       11
      亏损次数:       34
      胜率:          24.44%
      总收益:        -131.25 USDT
      期末余额:      859.75 USDT
      盈亏比:        0.27
      最大单笔盈利:  16.24
      最大单笔亏损:  -12.82
      手续费:       18.0013128660327
      =============================
    
profit: -140.25114788151814
maxDrawdown 14.7%
startTime: 2022-11-22 00:00:00
趋势多且增强 总交易次数: 25 盈利: 33.24945227203993 亏损: -96.08063614751438 最大盈利: 16.24 最大亏损: -12.82 总收益: -62.83 平均盈利: -2.51 typeA: -0.60 胜率: 24.00%
趋势空且增强 总交易次数: 20 盈利: 14.274011172979701 亏损: -82.69397517902141 最大盈利: 6.58 最大亏损: -11.51 总收益: -68.42 平均盈利: -3.42 typeA: -0.86 胜率: 25.00%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     42
      盈利次数:       7
      亏损次数:       35
      胜率:          16.67%
      总收益:        -77.26 USDT
      期末余额:      914.34 USDT
      盈亏比:        0.44
      最大单笔盈利:  24.48
      最大单笔亏损:  -16.11
      手续费:       16.796886540111174
      =============================
    
profit: -85.66490808813467
maxDrawdown 10.3%
startTime: 2022-12-22 00:00:00
趋势空且增强 总交易次数: 18 盈利: 32.10472233731013 亏损: -62.36041346149811 最大盈利: 24.48 最大亏损: -8.16 总收益: -30.26 平均盈利: -1.68 typeA: -0.28 胜率: 16.67%
趋势多且增强 总交易次数: 24 盈利: 29.23920624399701 亏损: -76.24842320794174 最大盈利: 14.71 最大亏损: -16.11 总收益: -47.01 平均盈利: -1.96 typeA: -0.33 胜率: 16.67%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     45
      盈利次数:       10
      亏损次数:       35
      胜率:          22.22%
      总收益:        -78.54 USDT
      期末余额:      912.46 USDT
      盈亏比:        0.47
      最大单笔盈利:  28.40
      最大单笔亏损:  -16.11
      手续费:       17.98999857705795
      =============================
    
profit: -87.54419228760878
maxDrawdown 9.2%
startTime: 2023-01-21 00:00:00
趋势空且增强 总交易次数: 14 盈利: 37.799462545450105 亏损: -50.374956753538015 最大盈利: 28.40 最大亏损: -6.12 总收益: -12.58 平均盈利: -0.90 typeA: -0.13 胜率: 14.29%
趋势多且增强 总交易次数: 31 盈利: 30.628116448839418 亏损: -96.59681452835824 最大盈利: 9.08 最大亏损: -16.11 总收益: -65.97 平均盈利: -2.13 typeA: -0.55 胜率: 25.81%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     37
      盈利次数:       10
      亏损次数:       27
      胜率:          27.03%
      总收益:        -40.21 USDT
      期末余额:      952.39 USDT
      盈亏比:        0.65
      最大单笔盈利:  19.44
      最大单笔亏损:  -15.20
      手续费:       14.800119161888361
      =============================
    
profit: -47.61365586866941
maxDrawdown 6.6%
startTime: 2023-02-20 00:00:00
趋势多且增强 总交易次数: 15 盈利: 21.70497019773817 亏损: -40.81061205748031 最大盈利: 19.44 最大亏损: -7.65 总收益: -19.11 平均盈利: -1.27 typeA: -0.25 胜率: 20.00%
趋势空且增强 总交易次数: 22 盈利: 54.13322898746762 亏损: -75.24124299639332 最大盈利: 18.77 最大亏损: -15.20 总收益: -21.11 平均盈利: -0.96 typeA: -0.31 胜率: 31.82%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     46
      盈利次数:       12
      亏损次数:       34
      胜率:          26.09%
      总收益:        -90.44 USDT
      期末余额:      900.36 USDT
      盈亏比:        0.52
      最大单笔盈利:  25.58
      最大单笔亏损:  -20.21
      手续费:       18.390497401918164
      =============================
    
profit: -99.6434593958395
maxDrawdown 11.0%
startTime: 2023-03-22 00:00:00
趋势空且增强 总交易次数: 17 盈利: 46.662426842952264 亏损: -66.93578663251094 最大盈利: 25.58 最大亏损: -8.36 总收益: -20.27 平均盈利: -1.19 typeA: -0.21 胜率: 17.65%
趋势多且增强 总交易次数: 29 盈利: 51.43892573233287 亏损: -121.6090253386114 最大盈利: 19.93 最大亏损: -20.21 总收益: -70.17 平均盈利: -2.42 typeA: -0.75 胜率: 31.03%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     41
      盈利次数:       7
      亏损次数:       34
      胜率:          17.07%
      总收益:        -28.02 USDT
      期末余额:      963.78 USDT
      盈亏比:        0.70
      最大单笔盈利:  27.76
      最大单笔亏损:  -8.80
      手续费:       16.39352305715338
      =============================
    
profit: -36.217001516222126
maxDrawdown 5.8%
startTime: 2023-04-21 00:00:00
趋势空且增强 总交易次数: 17 盈利: 51.58279702519528 亏损: -48.700923014628515 最大盈利: 27.76 最大亏损: -8.80 总收益: 2.88 平均盈利: 0.17 typeA: 0.03 胜率: 17.65%
趋势多且增强 总交易次数: 24 盈利: 15.063933116873466 亏损: -45.9628086436606 最大盈利: 9.88 最大亏损: -5.16 总收益: -30.90 平均盈利: -1.29 typeA: -0.21 胜率: 16.67%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     52
      盈利次数:       11
      亏损次数:       41
      胜率:          21.15%
      总收益:        -23.04 USDT
      期末余额:      966.56 USDT
      盈亏比:        0.72
      最大单笔盈利:  32.59
      最大单笔亏损:  -5.52
      手续费:       20.8079800143426
      =============================
    
profit: -33.44182444043031
maxDrawdown 4.0%
startTime: 2023-05-21 00:00:00
趋势多且增强 总交易次数: 31 盈利: 45.308437639379 亏损: -37.878050618604604 最大盈利: 32.59 最大亏损: -5.52 总收益: 7.43 平均盈利: 0.24 typeA: 0.05 胜率: 22.58%
趋势空且增强 总交易次数: 21 盈利: 14.020797843873764 亏损: -44.49300930507575 最大盈利: 5.01 最大亏损: -4.56 总收益: -30.47 平均盈利: -1.45 typeA: -0.28 胜率: 19.05%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     54
      盈利次数:       8
      亏损次数:       46
      胜率:          14.81%
      总收益:        -107.48 USDT
      期末余额:      881.72 USDT
      盈亏比:        0.30
      最大单笔盈利:  16.90
      最大单笔亏损:  -8.07
      手续费:       21.60641219096066
      =============================
    
profit: -118.2841295557447
maxDrawdown 12.1%
startTime: 2023-06-20 00:00:00
趋势多且增强 总交易次数: 22 盈利: 23.675239061393356 亏损: -60.37715866580774 最大盈利: 16.90 最大亏损: -7.21 总收益: -36.70 平均盈利: -1.67 typeA: -0.15 胜率: 9.09%
趋势空且增强 总交易次数: 32 盈利: 22.489929139740013 亏损: -93.27213909106783 最大盈利: 9.14 最大亏损: -8.07 总收益: -70.78 平均盈利: -2.21 typeA: -0.41 胜率: 18.75%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     49
      盈利次数:       15
      亏损次数:       34
      胜率:          30.61%
      总收益:        116.89 USDT
      期末余额:      1107.09 USDT
      盈亏比:        2.02
      最大单笔盈利:  84.43
      最大单笔亏损:  -12.54
      手续费:       19.58006464837545
      =============================
    
profit: 107.08645454444081
maxDrawdown 7.8%
startTime: 2023-07-20 00:00:00
趋势空且增强 总交易次数: 23 盈利: 163.82453007459145 亏损: -55.23025708913704 最大盈利: 84.43 最大亏损: -12.18 总收益: 108.59 平均盈利: 4.72 typeA: 1.64 胜率: 34.78%
趋势多且增强 总交易次数: 26 盈利: 67.74610656215124 亏损: -59.45392500316254 最大盈利: 39.68 最大亏损: -12.54 总收益: 8.29 平均盈利: 0.32 typeA: 0.09 胜率: 26.92%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     55
      盈利次数:       10
      亏损次数:       45
      胜率:          18.18%
      总收益:        -60.83 USDT
      期末余额:      928.17 USDT
      盈亏比:        0.40
      最大单笔盈利:  13.16
      最大单笔亏损:  -7.39
      手续费:       21.997350508910777
      =============================
    
profit: -71.82834650079133
maxDrawdown 8.2%
startTime: 2023-08-19 00:00:00
趋势空且增强 总交易次数: 22 盈利: 19.015984801899368 亏损: -41.71141342887884 最大盈利: 13.16 最大亏损: -6.57 总收益: -22.70 平均盈利: -1.03 typeA: -0.14 胜率: 13.64%
趋势多且增强 总交易次数: 33 盈利: 21.949898781468157 亏损: -60.08281665527725 最大盈利: 11.12 最大亏损: -7.39 总收益: -38.13 平均盈利: -1.16 typeA: -0.25 胜率: 21.21%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     42
      盈利次数:       11
      亏损次数:       31
      胜率:          26.19%
      总收益:        -20.71 USDT
      期末余额:      970.69 USDT
      盈亏比:        0.68
      最大单笔盈利:  11.12
      最大单笔亏损:  -6.89
      手续费:       17.004798231607076
      =============================
    
profit: -29.31447572772879
maxDrawdown 3.7%
startTime: 2023-09-18 00:00:00
趋势多且增强 总交易次数: 23 盈利: 32.630723496225706 亏损: -31.39115137461223 最大盈利: 11.12 最大亏损: -5.49 总收益: 1.24 平均盈利: 0.05 typeA: 0.01 胜率: 26.09%
趋势空且增强 总交易次数: 19 盈利: 10.643363940986122 亏损: -32.5974117903264 最大盈利: 4.91 最大亏损: -6.89 总收益: -21.95 平均盈利: -1.16 typeA: -0.30 胜率: 26.32%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     48
      盈利次数:       18
      亏损次数:       30
      胜率:          37.50%
      总收益:        41.48 USDT
      期末余额:      1031.88 USDT
      盈亏比:        1.32
      最大单笔盈利:  41.19
      最大单笔亏损:  -15.92
      手续费:       19.21555197161635
      =============================
    
profit: 31.88370379630942
maxDrawdown 4.5%
startTime: 2023-10-18 00:00:00
趋势多且增强 总交易次数: 32 盈利: 146.66243124386736 亏损: -88.64576023039005 最大盈利: 41.19 最大亏损: -15.92 总收益: 58.02 平均盈利: 1.81 typeA: 0.85 胜率: 46.88%
趋势空且增强 总交易次数: 16 盈利: 24.077752556000362 亏损: -40.610719773166046 最大盈利: 19.84 最大亏损: -8.32 总收益: -16.53 平均盈利: -1.03 typeA: -0.19 胜率: 18.75%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     49
      盈利次数:       11
      亏损次数:       38
      胜率:          22.45%
      总收益:        -77.60 USDT
      期末余额:      912.60 USDT
      盈亏比:        0.63
      最大单笔盈利:  69.76
      最大单笔亏损:  -33.12
      手续费:       19.60191206688773
      =============================
    
profit: -87.39600799681045
maxDrawdown 11.5%
startTime: 2023-11-17 00:00:00
趋势多且增强 总交易次数: 34 盈利: 102.61790934314166 亏损: -138.52896671257184 最大盈利: 69.76 最大亏损: -33.12 总收益: -35.91 平均盈利: -1.06 typeA: -0.25 胜率: 23.53%
趋势空且增强 总交易次数: 15 盈利: 27.467628623793424 亏损: -69.152579251171 最大盈利: 16.98 最大亏损: -9.60 总收益: -41.68 平均盈利: -2.78 typeA: -0.56 胜率: 20.00%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     48
      盈利次数:       15
      亏损次数:       33
      胜率:          31.25%
      总收益:        -37.74 USDT
      期末余额:      952.66 USDT
      盈亏比:        0.75
      最大单笔盈利:  29.93
      最大单笔亏损:  -12.45
      手续费:       19.185918817475162
      =============================
    
profit: -47.3378955615766
maxDrawdown 8.0%
startTime: 2023-12-17 00:00:00
趋势空且增强 总交易次数: 21 盈利: 80.82543478283148 亏损: -63.894241449234165 最大盈利: 29.93 最大亏损: -12.45 总收益: 16.93 平均盈利: 0.81 typeA: 0.31 胜率: 38.10%
趋势多且增强 总交易次数: 27 盈利: 30.483860834340994 亏损: -85.15294972951283 最大盈利: 14.19 最大亏损: -10.96 总收益: -54.67 平均盈利: -2.02 typeA: -0.53 胜率: 25.93%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     39
      盈利次数:       12
      亏损次数:       27
      胜率:          30.77%
      总收益:        29.25 USDT
      期末余额:      1021.45 USDT
      盈亏比:        1.36
      最大单笔盈利:  40.65
      最大单笔亏损:  -10.87
      手续费:       15.593549931489457
      =============================
    
profit: 21.45263869785606
maxDrawdown 3.2%
startTime: 2024-01-16 00:00:00
趋势空且增强 总交易次数: 16 盈利: 66.46436222487043 亏损: -35.00916698074487 最大盈利: 40.65 最大亏损: -5.63 总收益: 31.46 平均盈利: 1.97 typeA: 0.49 胜率: 25.00%
趋势多且增强 总交易次数: 23 盈利: 44.82114096057729 亏损: -47.02369750684518 最大盈利: 14.68 最大亏损: -10.87 总收益: -2.20 平均盈利: -0.10 typeA: -0.03 胜率: 34.78%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     48
      盈利次数:       14
      亏损次数:       34
      胜率:          29.17%
      总收益:        -30.82 USDT
      期末余额:      959.58 USDT
      盈亏比:        0.90
      最大单笔盈利:  119.60
      最大单笔亏损:  -46.99
      手续费:       19.229354119626233
      =============================
    
profit: -40.416541243442225
maxDrawdown 12.4%
startTime: 2024-02-15 00:00:00
趋势多且增强 总交易次数: 25 盈利: 238.0045286456412 亏损: -180.2253814830284 最大盈利: 119.60 最大亏损: -28.06 总收益: 57.78 平均盈利: 2.31 typeA: 0.92 胜率: 40.00%
趋势空且增强 总交易次数: 23 盈利: 36.0223551073706 亏损: -124.61804351342302 最大盈利: 23.37 最大亏损: -46.99 总收益: -88.60 平均盈利: -3.85 typeA: -0.67 胜率: 17.39%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     41
      盈利次数:       13
      亏损次数:       28
      胜率:          31.71%
      总收益:        -76.02 USDT
      期末余额:      915.78 USDT
      盈亏比:        0.67
      最大单笔盈利:  47.61
      最大单笔亏损:  -22.56
      手续费:       16.400029548361807
      =============================
    
profit: -84.21745531603005
maxDrawdown 13.9%
startTime: 2024-03-16 00:00:00
趋势空且增强 总交易次数: 16 盈利: 71.2521269730548 亏损: -108.44150727818575 最大盈利: 47.61 最大亏损: -20.65 总收益: -37.19 平均盈利: -2.32 typeA: -0.44 胜率: 18.75%
趋势多且增强 总交易次数: 25 盈利: 80.07348019536603 亏损: -118.90155520626331 最大盈利: 41.34 最大亏损: -22.56 总收益: -38.83 平均盈利: -1.55 typeA: -0.62 胜率: 40.00%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     36
      盈利次数:       13
      亏损次数:       23
      胜率:          36.11%
      总收益:        70.33 USDT
      期末余额:      1063.13 USDT
      盈亏比:        1.61
      最大单笔盈利:  55.85
      最大单笔亏损:  -13.59
      手续费:       14.415795568286605
      =============================
    
profit: 63.12975992862289
maxDrawdown 6.1%
startTime: 2024-04-15 00:00:00
趋势多且增强 总交易次数: 23 盈利: 142.96552650531146 亏损: -69.31948038001708 最大盈利: 55.85 最大亏损: -13.59 总收益: 73.65 平均盈利: 3.20 typeA: 1.39 胜率: 43.48%
趋势空且增强 总交易次数: 13 盈利: 43.15677660132788 亏损: -46.47306279799744 最大盈利: 31.04 最大亏损: -9.05 总收益: -3.32 平均盈利: -0.26 typeA: -0.06 胜率: 23.08%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     30
      盈利次数:       10
      亏损次数:       20
      胜率:          33.33%
      总收益:        -12.90 USDT
      期末余额:      981.10 USDT
      盈亏比:        0.85
      最大单笔盈利:  19.61
      最大单笔亏损:  -9.71
      手续费:       12.002369576178323
      =============================
    
profit: -18.89981023153655
maxDrawdown 2.9%
startTime: 2024-05-15 00:00:00
趋势多且增强 总交易次数: 12 盈利: 31.012701951937885 亏损: -30.937976877828063 最大盈利: 13.73 最大亏损: -8.72 总收益: 0.07 平均盈利: 0.01 typeA: 0.00 胜率: 33.33%
趋势空且增强 总交易次数: 18 盈利: 43.24777287670226 亏损: -56.22230818234729 最大盈利: 19.61 最大亏损: -9.71 总收益: -12.97 平均盈利: -0.72 typeA: -0.24 胜率: 33.33%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     44
      盈利次数:       13
      亏损次数:       31
      胜率:          29.55%
      总收益:        -39.15 USDT
      期末余额:      952.05 USDT
      盈亏比:        0.76
      最大单笔盈利:  37.75
      最大单笔亏损:  -29.81
      手续费:       17.591725017945993
      =============================
    
profit: -47.94538320764309
maxDrawdown 6.3%
startTime: 2024-06-14 00:00:00
趋势空且增强 总交易次数: 17 盈利: 71.51008992094043 亏损: -69.39836175558246 最大盈利: 37.75 最大亏损: -11.40 总收益: 2.11 平均盈利: 0.12 typeA: 0.04 胜率: 35.29%
趋势多且增强 总交易次数: 27 盈利: 55.749986569524026 亏损: -97.00709794252309 最大盈利: 15.57 最大亏损: -29.81 总收益: -41.26 平均盈利: -1.53 typeA: -0.40 胜率: 25.93%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     45
      盈利次数:       12
      亏损次数:       33
      胜率:          26.67%
      总收益:        -73.11 USDT
      期末余额:      917.89 USDT
      盈亏比:        0.54
      最大单笔盈利:  16.01
      最大单笔亏损:  -13.79
      手续费:       18.00804982250434
      =============================
    
profit: -82.11494152891419
maxDrawdown 8.2%
startTime: 2024-07-14 00:00:00
趋势多且增强 总交易次数: 26 盈利: 47.623730536672696 亏损: -64.75023435106914 最大盈利: 11.18 最大亏损: -10.21 总收益: -17.13 平均盈利: -0.66 typeA: -0.23 胜率: 34.62%
趋势空且增强 总交易次数: 19 盈利: 39.16815160147777 亏损: -95.15658931599307 最大盈利: 16.01 最大亏损: -13.79 总收益: -55.99 平均盈利: -2.95 typeA: -0.47 胜率: 15.79%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     42
      盈利次数:       10
      亏损次数:       32
      胜率:          23.81%
      总收益:        41.91 USDT
      期末余额:      1033.31 USDT
      盈亏比:        1.35
      最大单笔盈利:  53.98
      最大单笔亏损:  -9.61
      手续费:       16.977310082829263
      =============================
    
profit: 33.312886377163295
maxDrawdown 3.5%
startTime: 2024-08-13 00:00:00
趋势空且增强 总交易次数: 18 盈利: 122.43892655331919 亏损: -44.15266141827128 最大盈利: 53.98 最大亏损: -9.61 总收益: 78.29 平均盈利: 4.35 typeA: 1.45 胜率: 33.33%
趋势多且增强 总交易次数: 24 盈利: 39.10974368312594 亏损: -75.4831224410085 最大盈利: 19.03 最大亏损: -8.04 总收益: -36.37 平均盈利: -1.52 typeA: -0.25 胜率: 16.67%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     45
      盈利次数:       11
      亏损次数:       34
      胜率:          24.44%
      总收益:        -17.43 USDT
      期末余额:      973.57 USDT
      盈亏比:        0.86
      最大单笔盈利:  34.53
      最大单笔亏损:  -14.67
      手续费:       17.993831787622664
      =============================
    
profit: -26.427952869212845
maxDrawdown 6.0%
startTime: 2024-09-12 00:00:00
趋势空且增强 总交易次数: 10 盈利: 48.0584932832773 亏损: -38.85278218667857 最大盈利: 34.53 最大亏损: -14.67 总收益: 9.21 平均盈利: 0.92 typeA: 0.18 胜率: 20.00%
趋势多且增强 总交易次数: 35 盈利: 63.191902988335016 亏损: -89.82556695414439 最大盈利: 12.34 最大亏损: -7.96 总收益: -26.63 平均盈利: -0.76 typeA: -0.20 胜率: 25.71%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     49
      盈利次数:       19
      亏损次数:       30
      胜率:          38.78%
      总收益:        160.23 USDT
      期末余额:      1150.43 USDT
      盈亏比:        1.81
      最大单笔盈利:  73.00
      最大单笔亏损:  -33.27
      手续费:       19.639846581087983
      =============================
    
profit: 150.43036848176848
maxDrawdown 7.1%
startTime: 2024-10-12 00:00:00
趋势多且增强 总交易次数: 34 盈利: 309.6369105953936 亏损: -131.822280656009 最大盈利: 73.00 最大亏损: -33.27 总收益: 177.81 平均盈利: 5.23 typeA: 2.31 胜率: 44.12%
趋势空且增强 总交易次数: 15 盈利: 47.79133115365705 亏损: -65.37559261127093 最大盈利: 24.16 最大亏损: -11.81 总收益: -17.58 平均盈利: -1.17 typeA: -0.31 胜率: 26.67%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     34
      盈利次数:       13
      亏损次数:       21
      胜率:          38.24%
      总收益:        -38.32 USDT
      期末余额:      954.88 USDT
      盈亏比:        0.84
      最大单笔盈利:  72.70
      最大单笔亏损:  -33.88
      手续费:       13.59449619664745
      =============================
    
profit: -45.118122593707994
maxDrawdown 16.5%
startTime: 2024-11-11 00:00:00
趋势空且增强 总交易次数: 15 盈利: 133.90833189113474 亏损: -138.91103716926912 最大盈利: 72.70 最大亏损: -33.88 总收益: -5.00 平均盈利: -0.33 typeA: -0.13 胜率: 40.00%
趋势多且增强 总交易次数: 19 盈利: 65.34582584349417 亏损: -98.66124315906632 最大盈利: 42.78 最大亏损: -33.27 总收益: -33.32 平均盈利: -1.75 typeA: -0.65 胜率: 36.84%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     44
      盈利次数:       9
      亏损次数:       35
      胜率:          20.45%
      总收益:        -92.02 USDT
      期末余额:      899.18 USDT
      盈亏比:        0.44
      最大单笔盈利:  33.51
      最大单笔亏损:  -14.59
      手续费:       17.61201795940667
      =============================
    
profit: -100.81546638882651
maxDrawdown 10.1%
startTime: 2024-12-11 00:00:00
趋势多且增强 总交易次数: 20 盈利: 36.4610122130612 亏损: -52.0155265459248 最大盈利: 12.35 最大亏损: -7.10 总收益: -15.55 平均盈利: -0.78 typeA: -0.23 胜率: 30.00%
趋势空且增强 总交易次数: 24 盈利: 36.83096922461806 亏损: -113.29192128057853 最大盈利: 33.51 最大亏损: -14.59 总收益: -76.46 平均盈利: -3.19 typeA: -0.40 胜率: 12.50%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     37
      盈利次数:       12
      亏损次数:       25
      胜率:          32.43%
      总收益:        -51.51 USDT
      期末余额:      941.09 USDT
      盈亏比:        0.73
      最大单笔盈利:  38.16
      最大单笔亏损:  -27.16
      手续费:       14.794818046912424
      =============================
    
profit: -58.907691559858335
maxDrawdown 8.2%
startTime: 2025-01-10 00:00:00
趋势空且增强 总交易次数: 17 盈利: 95.11022006679565 亏损: -107.61359441515805 最大盈利: 38.16 最大亏损: -27.16 总收益: -12.50 平均盈利: -0.74 typeA: -0.26 胜率: 35.29%
趋势多且增强 总交易次数: 20 盈利: 44.756951789682205 亏损: -83.76126900117626 最大盈利: 14.31 最大亏损: -14.50 总收益: -39.00 平均盈利: -1.95 typeA: -0.59 胜率: 30.00%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     48
      盈利次数:       11
      亏损次数:       37
      胜率:          22.92%
      总收益:        13.39 USDT
      期末余额:      1003.79 USDT
      盈亏比:        1.08
      最大单笔盈利:  59.38
      最大单笔亏损:  -12.51
      手续费:       19.174997063162483
      =============================
    
profit: 3.785378741235263
maxDrawdown 4.5%
startTime: 2025-02-09 00:00:00
趋势空且增强 总交易次数: 20 盈利: 138.99589046519276 亏损: -68.99356296322541 最大盈利: 59.38 最大亏损: -10.61 总收益: 70.00 平均盈利: 3.50 typeA: 1.23 胜率: 35.00%
趋势多且增强 总交易次数: 28 盈利: 37.115257741305165 亏损: -93.73220650203464 最大盈利: 30.33 最大亏损: -12.51 总收益: -56.62 平均盈利: -2.02 typeA: -0.29 胜率: 14.29%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     37
      盈利次数:       12
      亏损次数:       25
      胜率:          32.43%
      总收益:        12.18 USDT
      期末余额:      1004.78 USDT
      盈亏比:        1.09
      最大单笔盈利:  71.32
      最大单笔亏损:  -11.83
      手续费:       14.792754172108307
      =============================
    
profit: 4.783498197192671
maxDrawdown 5.8%
startTime: 2025-03-11 00:00:00
趋势空且增强 总交易次数: 15 盈利: 90.67706498345606 亏损: -65.76878853041379 最大盈利: 71.32 最大亏损: -11.09 总收益: 24.91 平均盈利: 1.66 typeA: 0.44 胜率: 26.67%
趋势多且增强 总交易次数: 22 盈利: 57.07052530362129 亏损: -69.79530355946939 最大盈利: 19.12 最大亏损: -11.83 总收益: -12.72 平均盈利: -0.58 typeA: -0.21 胜率: 36.36%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     45
      盈利次数:       13
      亏损次数:       32
      胜率:          28.89%
      总收益:        -27.27 USDT
      期末余额:      963.73 USDT
      盈亏比:        0.82
      最大单笔盈利:  36.97
      最大单笔亏损:  -22.91
      手续费:       18.016324230840166
      =============================
    
profit: -36.27009492641969
maxDrawdown 5.1%
startTime: 2025-04-10 00:00:00
趋势多且增强 总交易次数: 25 盈利: 110.0786094952822 亏损: -83.40125448098604 最大盈利: 36.97 最大亏损: -22.91 总收益: 26.68 平均盈利: 1.07 typeA: 0.38 胜率: 36.00%
趋势空且增强 总交易次数: 20 盈利: 10.079636610892122 亏损: -64.02708655160602 最大盈利: 4.19 最大亏损: -7.21 总收益: -53.95 平均盈利: -2.70 typeA: -0.54 胜率: 20.00%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     43
      盈利次数:       15
      亏损次数:       28
      胜率:          34.88%
      总收益:        54.19 USDT
      期末余额:      1045.39 USDT
      盈亏比:        1.43
      最大单笔盈利:  49.36
      最大单笔亏损:  -13.39
      手续费:       17.412618394408735
      =============================
    
profit: 45.38583728168669
maxDrawdown 4.0%
startTime: 2025-05-10 00:00:00
趋势多且增强 总交易次数: 21 盈利: 103.6749352394939 亏损: -44.94231042233703 最大盈利: 49.36 最大亏损: -7.20 总收益: 58.73 平均盈利: 2.80 typeA: 1.07 胜率: 38.10%
趋势空且增强 总交易次数: 22 盈利: 76.11248348364099 亏损: -80.65927101910926 最大盈利: 25.94 最大亏损: -13.39 总收益: -4.55 平均盈利: -0.21 typeA: -0.07 胜率: 31.82%

          ========== 回测结果 ==========
          总交易次数:     2351
    盈利次数:       657
    亏损次数:       1694
          胜率:          27.95%
          总收益:        -604.16 USDT
          盈亏比:        0.94
    rw:        0.0146
    rl:        0.0060
    carry:        -2.99
          =============================

tradeNumTotal 2351
profitTotal -1075.7633144399463
maxLossTotal -74.8
winRateTotal 1521.5000000000005
period month 54
avgRate 28.18
maxDrawdownTotal 35.9
趋势多且增强 总交易次数: 1330 盈利: 5365.9763940176035 亏损: -5176.342165417656 最大盈利: 215.85 最大亏损: -64.39 总收益: 189.63 平均盈利: 0.14 typeA: 0.04 胜率: 30.08%
趋势空且增强 总交易次数: 1021 盈利: 4244.488623421947 亏损: -5038.286166461715 最大盈利: 173.39 最大亏损: -74.80 总收益: -793.80 平均盈利: -0.78 typeA: -0.20 胜率: 25.17%

    #######################################################



    
          ========== 回测结果 ==========
          总交易次数:     40
    盈利次数:       17
    亏损次数:       23
          胜率:          42.50%
          总收益:        148.52 USDT
          盈亏比:        2.56
    rw:        0.0143
    rl:        0.0042
    carry:        62.16
          =============================

tradeNumTotal 40
profitTotal 140.51913598381952
maxLossTotal -7.2
winRateTotal 42.5
period month 1
avgRate 42.50
maxDrawdownTotal 1.6
趋势多且增强 总交易次数: 20 盈利: 162.74168264873404 亏损: -42.0006080678844 最大盈利: 49.36 最大亏损: -7.20 总收益: 120.74 平均盈利: 6.04 typeA: 2.72 胜率: 45.00%
趋势空且增强 总交易次数: 20 盈利: 81.27633206408274 亏损: -53.49827066111112 最大盈利: 25.94 最大亏损: -6.50 总收益: 27.78 平均盈利: 1.39 typeA: 0.56 胜率: 40.00%

###############################################################



          ========== 回测结果 ==========
          总交易次数:     1205
    盈利次数:       585
    亏损次数:       620
          胜率:          48.55%
          总收益:        5819.38 USDT
          盈亏比:        1.27
    rw:        0.0457
    rl:        0.0354
    carry:        2.43
          =============================

tradeNumTotal 1205
profitTotal 5570.78365479359
maxLossTotal -280.24
winRateTotal 2639.8399999999997
period month 54
avgRate 48.89
maxDrawdownTotal 61.6
趋势多且增强 总交易次数: 841 盈利: 21602.077285492815 亏损: -15752.45226067992 最大盈利: 1658.09 最大亏损: -280.24 总收益: 5849.63 平均盈利: 6.96 typeA: 3.50 胜率: 50.30%
趋势空且增强 总交易次数: 364 盈利: 5846.694000475439 亏损: -5876.935370494675 最大盈利: 286.01 最大亏损: -195.24 总收益: -30.24 平均盈利: -0.08 typeA: -0.04 胜率: 44.51%

        ========== 回测结果 ==========
          总交易次数:     2437
    盈利次数:       846
    亏损次数:       1591
          胜率:          34.71%
          总收益:        4957.77 USDT
          盈亏比:        1.17
    rw:        0.0406
    rl:        0.0185
    carry:        2.64
          =============================

tradeNumTotal 2437
profitTotal 4464.172042917134
maxLossTotal -325.64
winRateTotal 1902.1700000000003
period month 54
avgRate 35.23
maxDrawdownTotal 55
趋势多且增强 总交易次数: 1205 盈利: 19081.360963187246 亏损: -13752.730012972503 最大盈利: 793.69 最大亏损: -265.71 总收益: 5328.63 平均盈利: 4.42 typeA: 1.44 胜率: 32.61%
趋势空且增强 总交易次数: 1232 盈利: 15387.935056931057 亏损: -15758.793964228636 最大盈利: 303.92 最大亏损: -325.64 总收益: -370.86 平均盈利: -0.30 typeA: -0.11 胜率: 36.77%



       ========== 回测结果 ==========
          总交易次数:     3242
    盈利次数:       1185
    亏损次数:       2057
          胜率:          36.55%
          总收益:        7022.16 USDT
          盈亏比:        1.22
    rw:        0.0328
    rl:        0.0157
    carry:        3.96
          =============================

tradeNumTotal 3242
profitTotal 6366.962095066783
maxLossTotal -337.84
winRateTotal 1992.8000000000002
period month 54
avgRate 36.90
maxDrawdownTotal 67.5
趋势多且增强-R-2-3 总交易次数: 186 盈利: 2621.6301461740313 亏损: -1356.79998288693 最大盈利: 474.60 最大亏损: -56.66 总收益: 1264.83 平均盈利: 6.80 typeA: 2.34 胜率: 34.41%
趋势多且增强-L-1 总交易次数: 960 盈利: 14534.51552453407 亏损: -11095.44559839191 最大盈利: 793.69 最大亏损: -113.58 总收益: 3439.07 平均盈利: 3.58 typeA: 1.22 胜率: 34.17%
趋势多且增强-R-2-2 总交易次数: 172 盈利: 2131.135434065479 亏损: -1387.7911413533088 最大盈利: 435.57 最大亏损: -57.30 总收益: 743.34 平均盈利: 4.32 typeA: 1.13 胜率: 26.16%
趋势多且增强-R-2-4 总交易次数: 284 盈利: 3051.4289201629 亏损: -2020.4835441674832 最大盈利: 686.95 最大亏损: -193.76 总收益: 1030.95 平均盈利: 3.63 typeA: 1.10 胜率: 30.28%
趋势多且增强-R-2-1 总交易次数: 199 盈利: 2676.3093421072426 亏损: -2254.3821971866096 最大盈利: 444.78 最大亏损: -170.11 总收益: 421.93 平均盈利: 2.12 typeA: 0.71 胜率: 33.67%
趋势空且增强-R-1-2 总交易次数: 230 盈利: 2834.172484120026 亏损: -2575.4561233174845 最大盈利: 214.51 最大亏损: -108.09 总收益: 258.72 平均盈利: 1.12 typeA: 0.45 胜率: 40.00%
趋势空且增强-R-1-4 总交易次数: 740 盈利: 5635.933544523791 亏损: -5493.890317925748 最大盈利: 213.76 最大亏损: -201.35 总收益: 142.04 平均盈利: 0.19 typeA: 0.08 胜率: 40.41%
趋势空且增强-R-1-1 总交易次数: 165 盈利: 2959.8537791432923 亏损: -3031.3340192209107 最大盈利: 303.92 最大亏损: -337.84 总收益: -71.48 平均盈利: -0.43 typeA: -0.20 胜率: 45.45%
趋势空且增强-R-1-3 总交易次数: 295 盈利: 2757.0844606581763 亏损: -2909.176168548746 最大盈利: 120.78 最大亏损: -161.94 总收益: -152.09 平均盈利: -0.52 typeA: -0.22 胜率: 43.05%
趋势空且增强-L-1-4 总交易次数: 11 盈利: 8.786821000849905 亏损: -63.92926842383875 最大盈利: 6.04 最大亏损: -20.39 总收益: -55.14 平均盈利: -5.01 typeA: -0.91 胜率: 18.18%






          ========== 回测结果 ==========
          总交易次数:     2999
    盈利次数:       1030
    亏损次数:       1969
          胜率:          34.34%
          总收益:        8976.07 USDT
          盈亏比:        1.33
    rw:        0.0350
    rl:        0.0140
    carry:        5.78
          =============================

tradeNumTotal 2999
profitTotal 8369.267576298756
maxLossTotal -145.68
winRateTotal 1876.5200000000002
period month 54
avgRate 34.75
maxDrawdownTotal 50
趋势多且增强-R-2-4 总交易次数: 297 盈利: 8074.527530632577 亏损: -1820.4398946348251 最大盈利: 4757.46 最大亏损: -145.68 总收益: 6254.09 平均盈利: 21.06 typeA: 5.81 胜率: 27.61%
趋势多且增强-L-1-1 总交易次数: 86 盈利: 2588.1351060308 亏损: -1588.4110516721423 最大盈利: 1020.65 最大亏损: -113.58 总收益: 999.72 平均盈利: 11.62 typeA: 4.05 胜率: 34.88%
趋势空且增强-R-1-1 总交易次数: 78 盈利: 1472.0769086351197 亏损: -988.9650168299946 最大盈利: 172.68 最大亏损: -93.99 总收益: 483.11 平均盈利: 6.19 typeA: 3.02 胜率: 48.72%
趋势多且增强-R-2-3 总交易次数: 193 盈利: 2310.258435483477 亏损: -1362.2974157138922 最大盈利: 508.99 最大亏损: -49.52 总收益: 947.96 平均盈利: 4.91 typeA: 1.45 胜率: 29.53%
趋势多且增强-R-2-1 总交易次数: 200 盈利: 2593.382485554726 亏损: -1719.7936807000765 最大盈利: 679.36 最大亏损: -98.88 总收益: 873.59 平均盈利: 4.37 typeA: 1.33 胜率: 30.50%
趋势多且增强-R-2-2 总交易次数: 177 盈利: 1968.5922991058542 亏损: -1429.9792730179881 最大盈利: 810.14 最大亏损: -72.15 总收益: 538.61 平均盈利: 3.04 typeA: 0.79 胜率: 25.99%
趋势空且增强-R-1-4 总交易次数: 271 盈利: 2610.504215615683 亏损: -2447.9641623402454 最大盈利: 165.56 最大亏损: -121.14 总收益: 162.54 平均盈利: 0.60 typeA: 0.27 胜率: 44.65%
趋势多且增强-L-1-4 总交易次数: 447 盈利: 3742.6321826218714 亏损: -3735.175491206892 最大盈利: 286.81 最大亏损: -55.25 总收益: 7.46 平均盈利: 0.02 typeA: 0.00 胜率: 29.75%
趋势空且增强-R-1-5 总交易次数: 699 盈利: 5017.753888094353 亏损: -5196.216407565444 最大盈利: 234.45 最大亏损: -128.89 总收益: -178.46 平均盈利: -0.26 typeA: -0.10 胜率: 38.05%
趋势空且增强-R-1-2 总交易次数: 69 盈利: 956.3050070840507 亏损: -986.422281056954 最大盈利: 247.33 最大亏损: -96.26 总收益: -30.12 平均盈利: -0.44 typeA: -0.20 胜率: 46.38%
趋势多且增强-L-1-3 总交易次数: 158 盈利: 1682.4420209938642 亏损: -1824.4651782741084 最大盈利: 271.88 最大亏损: -61.50 总收益: -142.02 平均盈利: -0.90 typeA: -0.31 胜率: 34.18%
趋势多且增强-L-1-2 总交易次数: 113 盈利: 1518.8975565732312 亏损: -1751.1551477945843 最大盈利: 236.07 最大亏损: -71.79 总收益: -232.26 平均盈利: -2.06 typeA: -0.62 胜率: 30.09%
趋势空且增强-R-1-3 总交易次数: 211 盈利: 1953.4577784784808 亏损: -2661.612837798065 最大盈利: 142.70 最大亏损: -105.61 总收益: -708.16 平均盈利: -3.36 typeA: -1.21 胜率: 36.02%


  ========== 回测结果 ==========
          总交易次数:     3019
    盈利次数:       1051
    亏损次数:       1968
          胜率:          34.81%
          总收益:        9099.86 USDT
          盈亏比:        1.33
    rw:        0.0347
    rl:        0.0141
    carry:        5.85
          =============================

tradeNumTotal 3019
profitTotal 8488.656230039105
maxLossTotal -145.68
winRateTotal 1900.5900000000001
period month 54
avgRate 35.20
maxDrawdownTotal 49.9
趋势多且增强-R-2-4 总交易次数: 299 盈利: 8056.367195671696 亏损: -1822.059144128735 最大盈利: 4757.46 最大亏损: -145.68 总收益: 6234.31 平均盈利: 20.85 typeA: 5.72 胜率: 27.42%
趋势多且增强-L-1-1 总交易次数: 88 盈利: 2578.2083642153552 亏损: -1598.4305290337559 最大盈利: 1020.65 最大亏损: -113.58 总收益: 979.78 平均盈利: 11.13 typeA: 3.92 胜率: 35.23%
趋势空且增强-R-1-1 总交易次数: 77 盈利: 1390.835603535622 亏损: -1079.7804044531906 最大盈利: 172.68 最大亏损: -118.63 总收益: 311.06 平均盈利: 4.04 typeA: 1.99 胜率: 49.35%
趋势多且增强-R-2-3 总交易次数: 191 盈利: 2276.466380304942 亏损: -1335.4221984218284 最大盈利: 508.99 最大亏损: -49.52 总收益: 941.04 平均盈利: 4.93 typeA: 1.47 胜率: 29.84%
趋势多且增强-R-2-1 总交易次数: 201 盈利: 2585.1422899077584 亏损: -1722.4204418165348 最大盈利: 679.36 最大亏损: -98.88 总收益: 862.72 平均盈利: 4.29 typeA: 1.32 胜率: 30.85%
趋势多且增强-R-2-2 总交易次数: 177 盈利: 1976.2902897161828 亏损: -1429.9792730179881 最大盈利: 810.14 最大亏损: -72.15 总收益: 546.31 平均盈利: 3.09 typeA: 0.80 胜率: 25.99%
趋势空且增强-R-1-4 总交易次数: 268 盈利: 2633.442567931855 亏损: -2384.727453794628 最大盈利: 165.56 最大亏损: -121.14 总收益: 248.72 平均盈利: 0.93 typeA: 0.43 胜率: 45.90%
趋势空且增强-R-1-2 总交易次数: 66 盈利: 1000.3127614518974 亏损: -947.2162956573882 最大盈利: 247.33 最大亏损: -96.26 总收益: 53.10 平均盈利: 0.80 typeA: 0.40 胜率: 50.00%
趋势多且增强-L-1-4 总交易次数: 456 盈利: 3778.5234831505572 亏损: -3769.29739733899 最大盈利: 286.81 最大亏损: -55.25 总收益: 9.23 平均盈利: 0.02 typeA: 0.01 胜率: 29.61%
趋势空且增强-R-1-5 总交易次数: 719 盈利: 5407.369218950802 亏损: -5457.585040019188 最大盈利: 234.45 最大亏损: -128.89 总收益: -50.22 平均盈利: -0.07 typeA: -0.03 胜率: 39.22%
趋势多且增强-L-1-3 总交易次数: 157 盈利: 1714.793001708991 亏损: -1755.967647565472 最大盈利: 271.88 最大亏损: -61.50 总收益: -41.17 平均盈利: -0.26 typeA: -0.09 胜率: 35.67%
趋势多且增强-L-1-2 总交易次数: 113 盈利: 1518.8975565732312 亏损: -1751.1551477945843 最大盈利: 236.07 最大亏损: -71.79 总收益: -232.26 平均盈利: -2.06 typeA: -0.62 胜率: 30.09%
趋势空且增强-R-1-3 总交易次数: 207 盈利: 1937.7486341966364 亏损: -2700.5001442340194 最大盈利: 142.70 最大亏损: -105.61 总收益: -762.75 平均盈利: -3.68 typeA: -1.28 胜率: 34.78%



          ========== 回测结果 ==========
          总交易次数:     2956
    盈利次数:       1021
    亏损次数:       1935
          胜率:          34.54%
          总收益:        10065.16 USDT
          盈亏比:        1.39
    rw:        0.0348
    rl:        0.0134
    carry:        7.07
          =============================

tradeNumTotal 2956
profitTotal 9467.156453730406
maxLossTotal -145.68
winRateTotal 1883.7699999999998
period month 54
avgRate 34.88
maxDrawdownTotal 40.9
趋势多且增强-R-2-4 总交易次数: 764 盈利: 11898.583150934983 亏损: -5570.389381502672 最大盈利: 4757.46 最大亏损: -145.68 总收益: 6328.19 平均盈利: 8.28 typeA: 2.36 胜率: 28.53%
趋势多且增强-R-2-2 总交易次数: 284 盈利: 4721.16910792824 亏损: -2612.5872849808297 最大盈利: 989.88 最大亏损: -116.52 总收益: 2108.58 平均盈利: 7.42 typeA: 1.99 胜率: 26.76%
趋势空且增强-R-1-1 总交易次数: 77 盈利: 1428.1594010481945 亏损: -1155.6191660694617 最大盈利: 172.68 最大亏损: -135.54 总收益: 272.54 平均盈利: 3.54 typeA: 1.79 胜率: 50.65%
趋势多且增强-R-2-3 总交易次数: 305 盈利: 3365.178865091521 亏损: -2506.1737182839097 最大盈利: 508.99 最大亏损: -49.54 总收益: 859.01 平均盈利: 2.82 typeA: 0.76 胜率: 26.89%
趋势多且增强-R-2-1 总交易次数: 273 盈利: 2951.9236006249853 亏损: -2520.138140507619 最大盈利: 444.78 最大亏损: -98.88 总收益: 431.79 平均盈利: 1.58 typeA: 0.52 胜率: 32.60%
趋势空且增强-R-1-4 总交易次数: 270 盈利: 2775.6619078500307 亏损: -2537.8952443137864 最大盈利: 165.56 最大亏损: -121.14 总收益: 237.77 平均盈利: 0.88 typeA: 0.42 胜率: 47.41%
趋势空且增强-R-1-3 总交易次数: 200 盈利: 2366.052878807637 亏损: -2334.249912805089 最大盈利: 265.88 最大亏损: -83.11 总收益: 31.80 平均盈利: 0.16 typeA: 0.06 胜率: 35.50%
趋势空且增强-R-1-2 总交易次数: 67 盈利: 965.3525340692657 亏损: -979.4964722721015 最大盈利: 213.34 最大亏损: -96.26 总收益: -14.14 平均盈利: -0.21 typeA: -0.10 胜率: 49.25%
趋势空且增强-R-1-5 总交易次数: 716 盈利: 5418.899216964715 亏损: -5609.274888853585 最大盈利: 281.25 最大亏损: -128.89 总收益: -190.38 平均盈利: -0.27 typeA: -0.11 胜率: 39.80%


  ========== 回测结果 ==========
          总交易次数:     2346
    盈利次数:       777
    亏损次数:       1569
          胜率:          33.12%
          总收益:        10431.80 USDT
          盈亏比:        1.49
    rw:        0.0399
    rl:        0.0135
    carry:        7.75
          =============================

tradeNumTotal 2346
profitTotal 9957.60360318948
maxLossTotal -145.68
winRateTotal 1785.36
period month 54
avgRate 33.06
maxDrawdownTotal 39.5
趋势多且增强-R-2-4 总交易次数: 762 盈利: 11928.12543009484 亏损: -5568.140051084525 最大盈利: 4757.46 最大亏损: -145.68 总收益: 6359.99 平均盈利: 8.35 typeA: 2.38 胜率: 28.48%
趋势多且增强-R-2-2 总交易次数: 283 盈利: 4721.16910792824 亏损: -2558.2026380933166 最大盈利: 989.88 最大亏损: -116.52 总收益: 2162.97 平均盈利: 7.64 typeA: 2.05 胜率: 26.86%
趋势空且增强-R-1-1 总交易次数: 78 盈利: 1433.0270309975283 亏损: -1155.6191660694617 最大盈利: 172.68 最大亏损: -135.54 总收益: 277.41 平均盈利: 3.56 typeA: 1.82 胜率: 51.28%
趋势多且增强-R-2-3 总交易次数: 305 盈利: 3365.178865091521 亏损: -2506.1737182839097 最大盈利: 508.99 最大亏损: -49.54 总收益: 859.01 平均盈利: 2.82 typeA: 0.76 胜率: 26.89%
趋势多且增强-R-2-1 总交易次数: 273 盈利: 2951.9236006249853 亏损: -2520.138140507619 最大盈利: 444.78 最大亏损: -98.88 总收益: 431.79 平均盈利: 1.58 typeA: 0.52 胜率: 32.60%
趋势空且增强-R-1-4 总交易次数: 343 盈利: 3539.54428622326 亏损: -3162.2963619323623 最大盈利: 165.56 最大亏损: -121.14 总收益: 377.25 平均盈利: 1.10 typeA: 0.50 胜率: 45.19%
趋势空且增强-R-1-3 总交易次数: 232 盈利: 2653.8149173356837 亏损: -2605.355313510181 最大盈利: 265.88 最大亏损: -83.11 总收益: 48.46 平均盈利: 0.21 typeA: 0.08 胜率: 36.64%
趋势空且增强-R-1-2 总交易次数: 70 盈利: 955.3940309939862 亏损: -1040.4482766191006 最大盈利: 213.34 最大亏损: -96.26 总收益: -85.05 平均盈利: -1.22 typeA: -0.57 胜率: 47.14%


     ========== 回测结果 ==========
          总交易次数:     2828
    盈利次数:       1080
    亏损次数:       1748
          胜率:          38.19%
          总收益:        12781.84 USDT
          盈亏比:        1.45
    rw:        0.0378
    rl:        0.0161
    carry:        7.33
          =============================

tradeNumTotal 2828
profitTotal 12208.64237101109
maxLossTotal -177.68
winRateTotal 2068.8599999999997
period month 54
avgRate 38.31
maxDrawdownTotal 43.7
趋势多且增强-L-2-4 总交易次数: 178 盈利: 3016.2561458106793 亏损: -1051.7610914451377 最大盈利: 1003.61 最大亏损: -54.69 总收益: 1964.50 平均盈利: 11.04 typeA: 4.09 胜率: 37.08%
趋势多且增强-L-2-2 总交易次数: 511 盈利: 10104.790946525687 亏损: -4179.102939779114 最大盈利: 4176.39 最大亏损: -100.52 总收益: 5925.69 平均盈利: 11.60 typeA: 3.68 胜率: 31.70%
趋势多且增强-L-2-1 总交易次数: 501 盈利: 8964.512986239013 亏损: -5371.356023177453 最大盈利: 1634.88 最大亏损: -93.73 总收益: 3593.16 平均盈利: 7.17 typeA: 2.45 胜率: 34.13%
趋势空且增强-R-2-1 总交易次数: 159 盈利: 2040.2066960092354 亏损: -1414.449684551384 最大盈利: 204.45 最大亏损: -83.73 总收益: 625.76 平均盈利: 3.94 typeA: 1.76 胜率: 44.65%
趋势空且增强-R-2-2 总交易次数: 75 盈利: 852.8815860034215 亏损: -622.4404598022227 最大盈利: 98.43 最大亏损: -77.48 总收益: 230.44 平均盈利: 3.07 typeA: 1.35 胜率: 44.00%
趋势空且增强-R-1-1 总交易次数: 63 盈利: 1171.168537280068 亏损: -1011.8072063975405 最大盈利: 172.68 最大亏损: -135.54 总收益: 159.36 平均盈利: 2.53 typeA: 1.24 胜率: 49.21%
趋势空且增强-R-1-3 总交易次数: 157 盈利: 2382.676322541856 亏损: -2103.919232768042 最大盈利: 265.88 最大亏损: -105.61 总收益: 278.76 平均盈利: 1.78 typeA: 0.71 胜率: 40.13%
趋势空且增强-R-3-2 总交易次数: 54 盈利: 368.6891984697081 亏损: -245.78110879529055 最大盈利: 178.00 最大亏损: -38.22 总收益: 122.91 平均盈利: 2.28 typeA: 0.63 胜率: 27.78%
趋势空且增强-R-3-1 总交易次数: 49 盈利: 613.7917097332653 亏损: -514.0947707039668 最大盈利: 359.44 最大亏损: -107.67 总收益: 99.70 平均盈利: 2.03 typeA: 0.62 胜率: 30.61%
趋势空且增强-R-3-3 总交易次数: 105 盈利: 694.5878140239303 亏损: -539.8659767092713 最大盈利: 123.26 最大亏损: -42.61 总收益: 154.72 平均盈利: 1.47 typeA: 0.52 胜率: 35.24%
趋势空且增强-R-3-5 总交易次数: 303 盈利: 3742.9410718499607 亏损: -3612.3262344982604 最大盈利: 218.05 最大亏损: -177.68 总收益: 130.61 平均盈利: 0.43 typeA: 0.19 胜率: 44.88%
趋势多且增强-L-2-3 总交易次数: 131 盈利: 1142.7453061814297 亏损: -1092.5178693666574 最大盈利: 98.93 最大亏损: -39.53 总收益: 50.23 平均盈利: 0.38 typeA: 0.13 胜率: 33.59%
趋势空且增强-R-1-4 总交易次数: 211 盈利: 2704.003666755437 亏损: -2667.538812941415 最大盈利: 150.20 最大亏损: -105.93 总收益: 36.46 平均盈利: 0.17 typeA: 0.08 胜率: 44.08%
趋势空且增强-R-2-3 总交易次数: 55 盈利: 477.3693682682691 亏损: -487.529083562488 最大盈利: 77.00 最大亏损: -44.11 总收益: -10.16 平均盈利: -0.18 typeA: -0.07 胜率: 36.36%
趋势空且增强-R-2-4 总交易次数: 113 盈利: 995.2500164162673 亏损: -1036.215656407208 最大盈利: 141.18 最大亏损: -72.05 总收益: -40.97 平均盈利: -0.36 typeA: -0.15 胜率: 41.59%
趋势空且增强-R-3-4 总交易次数: 113 盈利: 1297.9501672752826 亏损: -1575.327759292472 最大盈利: 251.42 最大亏损: -143.92 总收益: -277.38 平均盈利: -2.45 typeA: -1.17 胜率: 47.79%
趋势空且增强-R-1-2 总交易次数: 50 盈利: 504.42753830598235 亏损: -766.3727964803791 最大盈利: 110.84 最大亏损: -96.26 总收益: -261.95 平均盈利: -5.24 typeA: -2.31 胜率: 44.00%


if (adx < 30) {
			if (emaFast < emaSlow) {
				marketType = rsi < 45 && rsi > 35 ? '趋势多且增强-L-3-1' : '';
			}

			if (emaFast > emaSlow) {
				if (rsi > 55 && rsi < 65) {
					if (adxPlusDI > adxMinusDI) {
						if (macd > 0) {
							marketType =
								rsi > 60
									? '趋势空且增强-L-3-2-1'
									: '趋势空且增强-L-3-3-1';
						} else {
							marketType =
								rsi > 60
									? '趋势多且增强-L-3-2-2'
									: '趋势多且增强-L-3-3-2';
						}
					} else {
						marketType =
							rsi > 60
								? '趋势多且增强-L-3-2'
								: '趋势多且增强-L-3-3';
					}
				} else {
					marketType = '趋势多';
				}
			}
		} else if (adx > 30) {
			if (emaFast < emaSlow) {
				marketType = rsi < 25 ? '趋势多且增强-R-2-1' : '趋势空';
			}

			if (emaFast > emaSlow) {
				marketType = rsi > 55 ? '趋势多且增强-R-2-2' : '趋势多';
			}
		} else {
			// marketType = '趋势多趋势空';
		}
      


             if (adx < 10) {
      if (rsi < 45) {
        marketType = "趋势多且增强-L-1-1";
      }
      if (rsi > 55) {
        marketType = "趋势空且增强-L-1-1";
      }
    } else if (adx < 20) {
      if (rsi < 40) {
        marketType = "趋势多且增强-L-2-1";
      }
      if (rsi > 60) {
        marketType = "趋势空且增强-L-2-1";
      }
    }
    // else if (adx < 20) {
    //   if (rsi < 35) {
    //     marketType = "趋势多且增强-L-3-1";
    //   }
    //   if (rsi > 65) {
    //     marketType = "趋势空且增强-L-3-1";
    //   }
    // }
    else if (adx > 30) {
      if (adxPlusDI > adxMinusDI) {
        // marketType = emaFast > emaSlow ? "趋势多且增强-R-2-1" : "趋势空";
        marketType = "趋势多且增强-R-2-1";
      }
      if (adxPlusDI < adxMinusDI) {
        // marketType = emaFast < emaSlow ? "趋势空且增强-R-2-1" : "趋势多";
        marketType =
          emaFast > emaSlow
            ? "趋势多"
            : macd < lastMacd && lastMacd > lastLastMacd
            ? "趋势空且增强-R-2-1"
            : "趋势空";
      }
    } else {
      marketType = "趋势多趋势空";
    }



    
      ========== 回测结果 ==========
      总交易次数:     20
      盈利次数:       16
      亏损次数:       4
      胜率:          80.00%
      总收益:        520.61 USDT
      期末余额:      1516.61 USDT
      盈亏比:        6.10
      最大单笔盈利:  160.21
      最大单笔亏损:  -64.26
      手续费:       7.932913148137489
      =============================
    
profit: 516.609003456178
maxDrawdown 5.2%
startTime: 2021-01-01 00:00:00
趋势空且增强-R-1-1 总交易次数: 12 盈利: 465.57799526991334 亏损: -37.90390969388145 最大盈利: 160.21 最大亏损: -31.18 总收益: 427.67 平均盈利: 35.64 typeA: 26.73 胜率: 75.00%
趋势多且增强-R-1-1 总交易次数: 8 盈利: 157.19301931641274 亏损: -64.25810143626575 最大盈利: 54.03 最大亏损: -64.26 总收益: 92.93 平均盈利: 11.62 typeA: 10.16 胜率: 87.50%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     19
      盈利次数:       14
      亏损次数:       5
      胜率:          73.68%
      总收益:        587.81 USDT
      期末余额:      1583.81 USDT
      盈亏比:        6.49
      最大单笔盈利:  113.02
      最大单笔亏损:  -44.46
      手续费:       7.862807328767578
      =============================
    
profit: 583.8095376470228
maxDrawdown 5.2%
startTime: 2021-01-31 00:00:00
趋势多且增强-R-1-1 总交易次数: 12 盈利: 517.162725747809 亏损: -66.79880223985529 最大盈利: 113.02 最大亏损: -44.46 总收益: 450.36 平均盈利: 37.53 typeA: 25.02 胜率: 66.67%
趋势空且增强-R-1-1 总交易次数: 7 盈利: 177.65104831752961 亏损: -40.20543417845991 最大盈利: 66.13 最大亏损: -40.21 总收益: 137.45 平均盈利: 19.64 typeA: 16.83 胜率: 85.71%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     14
      盈利次数:       9
      亏损次数:       5
      胜率:          64.29%
      总收益:        -26.01 USDT
      期末余额:      971.19 USDT
      盈亏比:        0.74
      最大单笔盈利:  15.01
      最大单笔亏损:  -67.15
      手续费:       5.595687798234066
      =============================
    
profit: -28.81474597671786
maxDrawdown 8.3%
startTime: 2021-03-02 00:00:00
趋势空且增强-R-1-1 总交易次数: 5 盈利: 27.003712511959783 亏损: -28.832902991297374 最大盈利: 15.01 最大亏损: -19.86 总收益: -1.83 平均盈利: -0.37 typeA: -0.22 胜率: 60.00%
趋势多且增强-R-1-1 总交易次数: 9 盈利: 45.28519908535669 亏损: -69.47075458273615 最大盈利: 9.61 最大亏损: -67.15 总收益: -24.19 平均盈利: -2.69 typeA: -1.79 胜率: 66.67%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     18
      盈利次数:       13
      亏损次数:       5
      胜率:          72.22%
      总收益:        65.62 USDT
      期末余额:      1062.02 USDT
      盈亏比:        1.16
      最大单笔盈利:  119.09
      最大单笔亏损:  -178.41
      手续费:       7.2066458314652655
      =============================
    
profit: 62.02092806297924
maxDrawdown 25.5%
startTime: 2021-04-01 00:00:00
趋势多且增强-R-1-1 总交易次数: 11 盈利: 404.66847686862326 亏损: -355.6503569313635 最大盈利: 119.09 最大亏损: -178.41 总收益: 49.02 平均盈利: 4.46 typeA: 3.65 胜率: 81.82%
趋势空且增强-R-1-1 总交易次数: 7 盈利: 71.31065068856964 亏损: -54.70784256284911 最大盈利: 30.82 最大亏损: -34.95 总收益: 16.60 平均盈利: 2.37 typeA: 1.36 胜率: 57.14%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     24
      盈利次数:       18
      亏损次数:       6
      胜率:          75.00%
      总收益:        455.59 USDT
      期末余额:      1450.79 USDT
      盈亏比:        2.63
      最大单笔盈利:  141.74
      最大单笔亏损:  -129.41
      手续费:       9.675816623907107
      =============================
    
profit: 450.78778713815086
maxDrawdown 14.5%
startTime: 2021-05-01 00:00:00
趋势多且增强-R-1-1 总交易次数: 13 盈利: 546.4977769365591 亏损: -129.40836996009082 最大盈利: 141.74 最大亏损: -129.41 总收益: 417.09 平均盈利: 32.08 typeA: 29.62 胜率: 92.31%
趋势空且增强-R-1-1 总交易次数: 11 盈利: 188.61428110337582 亏损: -150.11590094169233 最大盈利: 66.50 最大亏损: -56.22 总收益: 38.50 平均盈利: 3.50 typeA: 1.91 胜率: 54.55%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     13
      盈利次数:       6
      亏损次数:       7
      胜率:          46.15%
      总收益:        -298.31 USDT
      期末余额:      698.89 USDT
      盈亏比:        0.26
      最大单笔盈利:  58.13
      最大单笔亏损:  -258.47
      手续费:       5.335810389668572
      =============================
    
profit: -301.1121017980021
maxDrawdown 31.7%
startTime: 2021-05-31 00:00:00
趋势空且增强-R-1-1 总交易次数: 9 盈利: 86.2653920336997 亏损: -75.47699473326682 最大盈利: 58.13 最大亏损: -27.32 总收益: 10.79 平均盈利: 1.20 typeA: 0.53 胜率: 44.44%
趋势多且增强-R-1-1 总交易次数: 4 盈利: 16.172658311206753 亏损: -325.27315740964116 最大盈利: 13.20 最大亏损: -258.47 总收益: -309.10 平均盈利: -77.28 typeA: -38.64 胜率: 50.00%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     22
      盈利次数:       16
      亏损次数:       6
      胜率:          72.73%
      总收益:        155.13 USDT
      期末余额:      1150.53 USDT
      盈亏比:        3.19
      最大单笔盈利:  33.13
      最大单笔亏损:  -24.12
      手续费:       8.983460722864926
      =============================
    
profit: 150.5325583985616
maxDrawdown 2.8%
startTime: 2021-06-30 00:00:00
趋势空且增强-R-1-1 总交易次数: 14 盈利: 177.6732612590294 亏损: -59.34283762015029 最大盈利: 33.13 最大亏损: -24.12 总收益: 118.33 平均盈利: 8.45 typeA: 5.43 胜率: 64.29%
趋势多且增强-R-1-1 总交易次数: 8 盈利: 48.41010911865823 亏损: -11.607974358974383 最大盈利: 12.61 最大亏损: -11.61 总收益: 36.80 平均盈利: 4.60 typeA: 4.03 胜率: 87.50%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     22
      盈利次数:       17
      亏损次数:       5
      胜率:          77.27%
      总收益:        260.21 USDT
      期末余额:      1255.61 USDT
      盈亏比:        4.99
      最大单笔盈利:  79.96
      最大单笔亏损:  -40.10
      手续费:       9.035256712783337
      =============================
    
profit: 255.60503260322594
maxDrawdown 3.8%
startTime: 2021-07-30 00:00:00
趋势多且增强-R-1-1 总交易次数: 12 盈利: 220.55995332311102 亏损: -2.5421190920890764 最大盈利: 79.96 最大亏损: -2.54 总收益: 218.02 平均盈利: 18.17 typeA: 16.65 胜率: 91.67%
趋势空且增强-R-1-1 总交易次数: 10 盈利: 104.8374992160436 亏损: -62.65030084383835 最大盈利: 39.18 最大亏损: -40.10 总收益: 42.19 平均盈利: 4.22 typeA: 2.53 胜率: 60.00%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     20
      盈利次数:       11
      亏损次数:       9
      胜率:          55.00%
      总收益:        -0.52 USDT
      期末余额:      995.48 USDT
      盈亏比:        1.00
      最大单笔盈利:  24.14
      最大单笔亏损:  -34.31
      手续费:       7.98067929696926
      =============================
    
profit: -4.5228497783608645
maxDrawdown 6.8%
startTime: 2021-08-29 00:00:00
趋势空且增强-R-1-1 总交易次数: 8 盈利: 54.63249369978629 亏损: -6.19181522915913 最大盈利: 12.15 最大亏损: -6.19 总收益: 48.44 平均盈利: 6.06 typeA: 5.30 胜率: 87.50%
趋势多且增强-R-1-1 总交易次数: 12 盈利: 50.5181230233093 亏损: -99.48165127229652 最大盈利: 24.14 最大亏损: -34.31 总收益: -48.96 平均盈利: -4.08 typeA: -1.36 胜率: 33.33%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     21
      盈利次数:       15
      亏损次数:       6
      胜率:          71.43%
      总收益:        227.11 USDT
      期末余额:      1222.71 USDT
      盈亏比:        4.12
      最大单笔盈利:  75.48
      最大单笔亏损:  -29.19
      手续费:       8.592276304082784
      =============================
    
profit: 222.71006460312765
maxDrawdown 4.3%
startTime: 2021-09-28 00:00:00
趋势空且增强-R-1-1 总交易次数: 8 盈利: 171.15890143016117 亏损: -37.77149910146334 最大盈利: 75.48 最大亏损: -29.19 总收益: 133.39 平均盈利: 16.67 typeA: 12.51 胜率: 75.00%
趋势多且增强-R-1-1 总交易次数: 13 盈利: 128.8276132234619 亏损: -35.10495094903114 最大盈利: 35.12 最大亏损: -21.38 总收益: 93.72 平均盈利: 7.21 typeA: 4.99 胜率: 69.23%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     4
      盈利次数:       3
      亏损次数:       1
      胜率:          75.00%
      总收益:        13.12 USDT
      期末余额:      1012.32 USDT
      盈亏比:        4.44
      最大单笔盈利:  9.46
      最大单笔亏损:  -3.81
      手续费:       1.5972172126055226
      =============================
    
profit: 12.316719759781904
maxDrawdown 0.4%
startTime: 2021-10-28 00:00:00
趋势空且增强-R-1-1 总交易次数: 4 盈利: 16.926817902372672 亏损: -3.810098142590648 最大盈利: 9.46 最大亏损: -3.81 总收益: 13.12 平均盈利: 3.28 typeA: 2.46 胜率: 75.00%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     24
      盈利次数:       18
      亏损次数:       6
      胜率:          75.00%
      总收益:        120.26 USDT
      期末余额:      1115.46 USDT
      盈亏比:        1.86
      最大单笔盈利:  78.74
      最大单笔亏损:  -72.43
      手续费:       9.61540772075457
      =============================
    
profit: 115.46106238482366
maxDrawdown 6.6%
startTime: 2021-11-27 00:00:00
趋势多且增强-R-1-1 总交易次数: 14 盈利: 175.84648732159835 亏损: -77.60916188977755 最大盈利: 78.74 最大亏损: -72.43 总收益: 98.24 平均盈利: 7.02 typeA: 5.51 胜率: 78.57%
趋势空且增强-R-1-1 总交易次数: 10 盈利: 83.92726138552796 亏损: -61.90352443252412 最大盈利: 17.63 最大亏损: -35.13 总收益: 22.02 平均盈利: 2.20 typeA: 1.54 胜率: 70.00%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     17
      盈利次数:       10
      亏损次数:       7
      胜率:          58.82%
      总收益:        24.64 USDT
      期末余额:      1021.04 USDT
      盈亏比:        1.20
      最大单笔盈利:  42.62
      最大单笔亏损:  -78.56
      手续费:       6.969383383070621
      =============================
    
profit: 21.038513233310482
maxDrawdown 7.3%
startTime: 2021-12-27 00:00:00
趋势空且增强-R-1-1 总交易次数: 9 盈利: 116.18072105403557 亏损: -27.41712132426601 最大盈利: 42.62 最大亏损: -14.19 总收益: 88.76 平均盈利: 9.86 typeA: 6.58 胜率: 66.67%
趋势多且增强-R-1-1 总交易次数: 8 盈利: 33.16036915624823 亏损: -97.28545565270642 最大盈利: 13.66 最大亏损: -78.56 总收益: -64.13 平均盈利: -8.02 typeA: -4.01 胜率: 50.00%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     20
      盈利次数:       14
      亏损次数:       6
      胜率:          70.00%
      总收益:        99.96 USDT
      期末余额:      1095.76 USDT
      盈亏比:        1.49
      最大单笔盈利:  59.00
      最大单笔亏损:  -126.61
      手续费:       8.143408127586861
      =============================
    
profit: 95.75777395041905
maxDrawdown 10.4%
startTime: 2022-01-26 00:00:00
趋势空且增强-R-1-1 总交易次数: 9 盈利: 209.04498334093785 亏损: -17.37602521466728 最大盈利: 59.00 最大亏损: -13.33 总收益: 191.67 平均盈利: 21.30 typeA: 16.56 胜率: 77.78%
趋势多且增强-R-1-1 总交易次数: 11 盈利: 95.57507161185197 亏损: -187.28625578770277 最大盈利: 19.90 最大亏损: -126.61 总收益: -91.71 平均盈利: -8.34 typeA: -5.31 胜率: 63.64%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     12
      盈利次数:       8
      亏损次数:       4
      胜率:          66.67%
      总收益:        33.10 USDT
      期末余额:      1030.50 USDT
      盈亏比:        2.00
      最大单笔盈利:  14.13
      最大单笔亏损:  -13.53
      手续费:       4.994003354771465
      =============================
    
profit: 30.4995738926184
maxDrawdown 2.2%
startTime: 2022-02-25 00:00:00
趋势空且增强-R-1-1 总交易次数: 6 盈利: 40.10690221077343 亏损: -8.561952835396935 最大盈利: 12.83 最大亏损: -8.56 总收益: 31.54 平均盈利: 5.26 typeA: 4.38 胜率: 83.33%
趋势多且增强-R-1-1 总交易次数: 6 盈利: 26.19758228633703 亏损: -24.64295776909425 最大盈利: 14.13 最大亏损: -13.53 总收益: 1.55 平均盈利: 0.26 typeA: 0.13 胜率: 50.00%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     22
      盈利次数:       13
      亏损次数:       9
      胜率:          59.09%
      总收益:        -167.01 USDT
      期末余额:      828.39 USDT
      盈亏比:        0.51
      最大单笔盈利:  39.82
      最大单笔亏损:  -95.23
      手续费:       8.962496006822942
      =============================
    
profit: -171.61074525129334
maxDrawdown 27.8%
startTime: 2022-03-27 00:00:00
趋势空且增强-R-1-1 总交易次数: 13 盈利: 99.30223544939668 亏损: -89.46388995732148 最大盈利: 39.82 最大亏损: -68.99 总收益: 9.84 平均盈利: 0.76 typeA: 0.52 胜率: 69.23%
趋势多且增强-R-1-1 总交易次数: 9 盈利: 77.37523366096781 亏损: -254.2243244043353 最大盈利: 30.59 最大亏损: -95.23 总收益: -176.85 平均盈利: -19.65 typeA: -8.73 胜率: 44.44%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     20
      盈利次数:       13
      亏损次数:       7
      胜率:          65.00%
      总收益:        140.08 USDT
      期末余额:      1135.88 USDT
      盈亏比:        3.11
      最大单笔盈利:  63.72
      最大单笔亏损:  -25.90
      手续费:       8.210456031410128
      =============================
    
profit: 135.879796911624
maxDrawdown 4.1%
startTime: 2022-04-26 00:00:00
趋势多且增强-R-1-1 总交易次数: 10 盈利: 136.01786103854633 亏损: -39.85229308270776 最大盈利: 63.72 最大亏损: -25.90 总收益: 96.17 平均盈利: 9.62 typeA: 6.73 胜率: 70.00%
趋势空且增强-R-1-1 总交易次数: 10 盈利: 70.5041874441407 亏损: -26.589958488354213 最大盈利: 51.52 最大亏损: -13.82 总收益: 43.91 平均盈利: 4.39 typeA: 2.63 胜率: 60.00%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     27
      盈利次数:       16
      亏损次数:       11
      胜率:          59.26%
      总收益:        187.72 USDT
      期末余额:      1182.32 USDT
      盈亏比:        3.09
      最大单笔盈利:  88.05
      最大单笔亏损:  -46.52
      手续费:       10.793297092457754
      =============================
    
profit: 182.32374010487706
maxDrawdown 5.3%
startTime: 2022-05-26 00:00:00
趋势空且增强-R-1-1 总交易次数: 15 盈利: 134.81951934529914 亏损: -24.481068733532297 最大盈利: 75.18 最大亏损: -11.81 总收益: 110.34 平均盈利: 7.36 typeA: 4.41 胜率: 60.00%
趋势多且增强-R-1-1 总交易次数: 12 盈利: 142.60930024066167 亏损: -65.22401074755021 最大盈利: 88.05 最大亏损: -46.52 总收益: 77.39 平均盈利: 6.45 typeA: 3.76 胜率: 58.33%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     13
      盈利次数:       7
      亏损次数:       6
      胜率:          53.85%
      总收益:        71.13 USDT
      期末余额:      1068.33 USDT
      盈亏比:        1.84
      最大单笔盈利:  83.99
      最大单笔亏损:  -35.76
      手续费:       5.382159843559527
      =============================
    
profit: 68.32690754661826
maxDrawdown 3.8%
startTime: 2022-06-25 00:00:00
趋势空且增强-R-1-1 总交易次数: 6 盈利: 105.84875221366501 亏损: -25.577536432426744 最大盈利: 83.99 最大亏损: -17.89 总收益: 80.27 平均盈利: 13.38 typeA: 6.69 胜率: 50.00%
趋势多且增强-R-1-1 总交易次数: 7 盈利: 49.47206498009704 亏损: -58.61637321471636 最大盈利: 26.43 最大亏损: -35.76 总收益: -9.14 平均盈利: -1.31 typeA: -0.75 胜率: 57.14%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     0
      盈利次数:       0
      亏损次数:       0
      胜率:          NaN%
      总收益:        0.00 USDT
      期末余额:      999.80 USDT
      盈亏比:        NaN
      最大单笔盈利:  -Infinity
      最大单笔亏损:  Infinity
      手续费:       0.2
      =============================
    
profit: -0.20000000000004547
maxDrawdown 0.0%
startTime: 2022-07-25 00:00:00
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     19
      盈利次数:       12
      亏损次数:       7
      胜率:          63.16%
      总收益:        143.70 USDT
      期末余额:      1139.90 USDT
      盈亏比:        5.30
      最大单笔盈利:  81.35
      最大单笔亏损:  -10.19
      手续费:       7.591905286947407
      =============================
    
profit: 139.90446965518663
maxDrawdown 1.3%
startTime: 2022-08-24 00:00:00
趋势多且增强-R-1-1 总交易次数: 7 盈利: 59.62554486693281 亏损: -7.524842308326908 最大盈利: 39.61 最大亏损: -3.83 总收益: 52.10 平均盈利: 7.44 typeA: 5.32 胜率: 71.43%
趋势空且增强-R-1-1 总交易次数: 12 盈利: 117.50160600455607 亏损: -25.897838907974617 最大盈利: 81.35 最大亏损: -10.19 总收益: 91.60 平均盈利: 7.63 typeA: 4.45 胜率: 58.33%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     19
      盈利次数:       15
      亏损次数:       4
      胜率:          78.95%
      总收益:        89.92 USDT
      期末余额:      1086.12 USDT
      盈亏比:        3.44
      最大单笔盈利:  39.61
      最大单笔亏损:  -26.16
      手续费:       7.605818061525575
      =============================
    
profit: 86.1185078236224
maxDrawdown 2.9%
startTime: 2022-09-23 00:00:00
趋势多且增强-R-1-1 总交易次数: 11 盈利: 85.35389226043075 亏损: -26.158856967276034 最大盈利: 39.61 最大亏损: -26.16 总收益: 59.20 平均盈利: 5.38 typeA: 4.89 胜率: 90.91%
趋势空且增强-R-1-1 总交易次数: 8 盈利: 41.433185658744335 亏损: -10.709713128275702 最大盈利: 20.21 最大亏损: -4.88 总收益: 30.72 平均盈利: 3.84 typeA: 2.40 胜率: 62.50%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     23
      盈利次数:       12
      亏损次数:       11
      胜率:          52.17%
      总收益:        342.07 USDT
      期末余额:      1337.47 USDT
      盈亏比:        2.22
      最大单笔盈利:  286.55
      最大单笔亏损:  -77.32
      手续费:       9.171032177235476
      =============================
    
profit: 337.4727859272807
maxDrawdown 10.8%
startTime: 2022-10-23 00:00:00
趋势空且增强-R-1-1 总交易次数: 12 盈利: 381.5655464676463 亏损: -138.17493221088492 最大盈利: 286.55 最大亏损: -45.78 总收益: 243.39 平均盈利: 20.28 typeA: 10.14 胜率: 50.00%
趋势多且增强-R-1-1 总交易次数: 11 盈利: 241.05098979867745 亏损: -142.3688181281567 最大盈利: 130.62 最大亏损: -77.32 总收益: 98.68 平均盈利: 8.97 typeA: 4.89 胜率: 54.55%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     31
      盈利次数:       17
      亏损次数:       14
      胜率:          54.84%
      总收益:        126.82 USDT
      期末余额:      1120.62 USDT
      盈亏比:        1.74
      最大单笔盈利:  82.70
      最大单笔亏损:  -57.68
      手续费:       12.361863675018679
      =============================
    
profit: 120.6219471401007
maxDrawdown 8.3%
startTime: 2022-11-22 00:00:00
趋势空且增强-R-1-1 总交易次数: 19 盈利: 226.28981034065768 亏损: -68.22472593622906 最大盈利: 82.70 最大亏损: -22.79 总收益: 158.07 平均盈利: 8.32 typeA: 4.38 胜率: 52.63%
趋势多且增强-R-1-1 总交易次数: 12 盈利: 71.08188179662501 亏损: -102.32501906095112 最大盈利: 14.95 最大亏损: -57.68 总收益: -31.24 平均盈利: -2.60 typeA: -1.52 胜率: 58.33%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     18
      盈利次数:       11
      亏损次数:       7
      胜率:          61.11%
      总收益:        -9.91 USDT
      期末余额:      986.49 USDT
      盈亏比:        0.88
      最大单笔盈利:  20.00
      最大单笔亏损:  -48.75
      手续费:       7.215861328560612
      =============================
    
profit: -13.506962500585018
maxDrawdown 4.7%
startTime: 2022-12-22 00:00:00
趋势多且增强-R-1-1 总交易次数: 7 盈利: 39.73068652835948 亏损: -4.63021726700959 最大盈利: 20.00 最大亏损: -4.63 总收益: 35.10 平均盈利: 5.01 typeA: 4.30 胜率: 85.71%
趋势空且增强-R-1-1 总交易次数: 11 盈利: 35.38153596047002 亏损: -80.38896772240403 最大盈利: 11.59 最大亏损: -48.75 总收益: -45.01 平均盈利: -4.09 typeA: -1.86 胜率: 45.45%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     24
      盈利次数:       15
      亏损次数:       9
      胜率:          62.50%
      总收益:        210.18 USDT
      期末余额:      1205.38 USDT
      盈亏比:        3.64
      最大单笔盈利:  55.03
      最大单笔亏损:  -44.22
      手续费:       9.596501679298214
      =============================
    
profit: 205.3753323499227
maxDrawdown 6.5%
startTime: 2023-01-21 00:00:00
趋势多且增强-R-1-1 总交易次数: 11 盈利: 146.90490880474033 亏损: -50.384541567643794 最大盈利: 45.81 最大亏损: -44.22 总收益: 96.52 平均盈利: 8.77 typeA: 5.58 胜率: 63.64%
趋势空且增强-R-1-1 总交易次数: 13 盈利: 142.8584979285211 亏损: -29.203532815693496 最大盈利: 55.03 最大亏损: -19.17 总收益: 113.65 平均盈利: 8.74 typeA: 5.38 胜率: 61.54%
Loaded 3000 15m candles
[
  {
    timestamp: '2023-03-15 08:15:00',
    open: 0.07439,
    high: 0.07459,
    low: 0.07384,
    close: 0.07396,
    volume: 91287685,
    lower: 0.07371329685109528,
    middle: 0.0743404999999999,
    upper: 0.07496770314890454,
    emaSlope: -0.0000030797650010905285,
    macd: -0.00018160632441889535,
    macdHistogram: 0.000020147229068878458,
    atr: 0.0006506269296136557,
    adx: 27.51202599987231,
    adxPlusDI: 14.740412697427171,
    adxMinusDI: 27.93988003096349,
    rsi: 39.25655047439398,
    emaSlow: 0.07454862525548321,
    emaFast: 0.07447737971174505,
    marketType: ''
  },
  {
    timestamp: '2023-03-15 08:30:00',
    open: 0.07396,
    high: 0.07424,
    low: 0.07369,
    close: 0.07411,
    volume: 78033827,
    lower: 0.07372164755965473,
    middle: 0.0743439999999999,
    upper: 0.07496635244034507,
    emaSlope: -0.0000071158526481068796,
    macd: -0.00019264874124617914,
    macdHistogram: 0.000007283849793275724,
    atr: 0.0006434392917841085,
    adx: 28.54229944024703,
    adxPlusDI: 13.761721035478248,
    adxMinusDI: 26.23235271955641,
    rsi: 42.45197212282476,
    emaSlow: 0.0745314242650721,
    emaFast: 0.07443145724777692,
    marketType: ''
  },
  {
    timestamp: '2023-03-15 08:45:00',
    open: 0.0741,
    high: 0.07475,
    low: 0.07409,
    close: 0.07471,
    volume: 69393830,
    lower: 0.07373363008880457,
    middle: 0.0743354999999999,
    upper: 0.07493736991119523,
    emaSlope: -0.00000809170156386707,
    macd: -0.00015416354313760317,
    macdHistogram: 0.00003661523832148135,
    atr: 0.0006446221995138146,
    adx: 26.19103542814173,
    adxPlusDI: 15.529767823673668,
    adxMinusDI: 25.067309571958827,
    rsi: 53.35712006385146,
    emaSlow: 0.07453842723506927,
    emaFast: 0.0744662750918048,
    marketType: ''
  }
]

      ========== 回测结果 ==========
      总交易次数:     23
      盈利次数:       13
      亏损次数:       10
      胜率:          56.52%
      总收益:        14.66 USDT
      期末余额:      1010.06 USDT
      盈亏比:        1.17
      最大单笔盈利:  28.60
      最大单笔亏损:  -19.50
      手续费:       9.200022898915785
      =============================
    
profit: 10.064621766957544
maxDrawdown 2.9%
startTime: 2023-02-20 00:00:00
趋势多且增强-R-1-1 总交易次数: 9 盈利: 41.060532959837154 亏损: -33.172901251364785 最大盈利: 25.81 最大亏损: -18.56 总收益: 7.89 平均盈利: 0.88 typeA: 0.39 胜率: 44.44%
趋势空且增强-R-1-1 总交易次数: 14 盈利: 59.0022491476643 亏损: -52.225259089177726 最大盈利: 28.60 最大亏损: -19.50 总收益: 6.78 平均盈利: 0.48 typeA: 0.31 胜率: 64.29%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     24
      盈利次数:       18
      亏损次数:       6
      胜率:          75.00%
      总收益:        109.38 USDT
      期末余额:      1104.58 USDT
      盈亏比:        3.13
      最大单笔盈利:  28.34
      最大单笔亏损:  -23.58
      手续费:       9.607387879094995
      =============================
    
profit: 104.57715903696408
maxDrawdown 2.2%
startTime: 2023-03-22 00:00:00
趋势多且增强-R-1-1 总交易次数: 10 盈利: 77.44728374987737 亏损: -3.9004249485950147 最大盈利: 21.36 最大亏损: -3.90 总收益: 73.55 平均盈利: 7.35 typeA: 6.62 胜率: 90.00%
趋势空且增强-R-1-1 总交易次数: 14 盈利: 83.29989763280814 亏损: -47.469597397125725 最大盈利: 28.34 最大亏损: -23.58 总收益: 35.83 平均盈利: 2.56 typeA: 1.65 胜率: 64.29%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     16
      盈利次数:       11
      亏损次数:       5
      胜率:          68.75%
      总收益:        63.20 USDT
      期末余额:      1059.80 USDT
      盈亏比:        2.54
      最大单笔盈利:  30.52
      最大单笔亏损:  -19.85
      手续费:       6.590644928033941
      =============================
    
profit: 59.80033327861156
maxDrawdown 2.5%
startTime: 2023-04-21 00:00:00
趋势空且增强-R-1-1 总交易次数: 9 盈利: 69.6782629698884 亏损: -14.883777317610777 最大盈利: 30.52 最大亏损: -6.54 总收益: 54.79 平均盈利: 6.09 typeA: 4.06 胜率: 66.67%
趋势多且增强-R-1-1 总交易次数: 7 盈利: 34.431648741043546 亏损: -26.025801114708425 最大盈利: 15.66 最大亏损: -19.85 总收益: 8.41 平均盈利: 1.20 typeA: 0.86 胜率: 71.43%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     16
      盈利次数:       8
      亏损次数:       8
      胜率:          50.00%
      总收益:        -90.42 USDT
      期末余额:      906.18 USDT
      盈亏比:        0.33
      最大单笔盈利:  18.15
      最大单笔亏损:  -97.46
      手续费:       6.581737214938299
      =============================
    
profit: -93.82001860207117
maxDrawdown 10.3%
startTime: 2023-05-21 00:00:00
趋势空且增强-R-1-1 总交易次数: 6 盈利: 11.66816693944348 亏损: -10.829937414358078 最大盈利: 11.67 最大亏损: -4.06 总收益: 0.84 平均盈利: 0.14 typeA: 0.02 胜率: 16.67%
趋势多且增强-R-1-1 总交易次数: 10 盈利: 33.8479605446794 亏损: -125.1062086718353 最大盈利: 18.15 最大亏损: -97.46 总收益: -91.26 平均盈利: -9.13 typeA: -6.39 胜率: 70.00%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     17
      盈利次数:       7
      亏损次数:       10
      胜率:          41.18%
      总收益:        -9.81 USDT
      期末余额:      986.59 USDT
      盈亏比:        0.85
      最大单笔盈利:  20.44
      最大单笔亏损:  -14.28
      手续费:       7.001888282102061
      =============================
    
profit: -13.413848110432923
maxDrawdown 3.0%
startTime: 2023-06-20 00:00:00
趋势多且增强-R-1-1 总交易次数: 9 盈利: 33.90849722500956 亏损: -34.19407482909799 最大盈利: 20.44 最大亏损: -9.65 总收益: -0.29 平均盈利: -0.03 typeA: -0.01 胜率: 44.44%
趋势空且增强-R-1-1 总交易次数: 8 盈利: 22.95778564729804 亏损: -32.48605615364173 最大盈利: 18.79 最大亏损: -14.28 总收益: -9.53 平均盈利: -1.19 typeA: -0.45 胜率: 37.50%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     20
      盈利次数:       13
      亏损次数:       7
      胜率:          65.00%
      总收益:        69.89 USDT
      期末余额:      1065.69 USDT
      盈亏比:        2.27
      最大单笔盈利:  57.49
      最大单笔亏损:  -13.14
      手续费:       8.215201580625429
      =============================
    
profit: 65.69455821152587
maxDrawdown 2.3%
startTime: 2023-07-20 00:00:00
趋势多且增强-R-1-1 总交易次数: 9 盈利: 98.14219484924155 亏损: -24.998355155891446 最大盈利: 57.49 最大亏损: -13.14 总收益: 73.14 平均盈利: 8.13 typeA: 4.52 胜率: 55.56%
趋势空且增强-R-1-1 总交易次数: 11 盈利: 26.859359226945568 亏损: -30.108640708768476 最大盈利: 8.32 最大亏损: -10.97 总收益: -3.25 平均盈利: -0.30 typeA: -0.21 胜率: 72.73%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     28
      盈利次数:       18
      亏损次数:       10
      胜率:          64.29%
      总收益:        27.88 USDT
      期末余额:      1022.08 USDT
      盈亏比:        1.68
      最大单笔盈利:  22.87
      最大单笔亏损:  -10.82
      手续费:       11.408063373692874
      =============================
    
profit: 22.08262724052679
maxDrawdown 1.6%
startTime: 2023-08-19 00:00:00
趋势多且增强-R-1-1 总交易次数: 13 盈利: 43.73882112184463 亏损: -9.442422338446146 最大盈利: 22.87 最大亏损: -4.92 总收益: 34.30 平均盈利: 2.64 typeA: 1.83 胜率: 69.23%
趋势空且增强-R-1-1 总交易次数: 15 盈利: 25.275486342074917 亏损: -31.689257884945626 最大盈利: 6.55 最大亏损: -10.82 总收益: -6.41 平均盈利: -0.43 typeA: -0.26 胜率: 60.00%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     22
      盈利次数:       10
      亏损次数:       12
      胜率:          45.45%
      总收益:        6.85 USDT
      期末余额:      1002.45 USDT
      盈亏比:        1.23
      最大单笔盈利:  10.31
      最大单笔亏损:  -7.11
      手续费:       8.80520452351663
      =============================
    
profit: 2.4474334520007233
maxDrawdown 2.6%
startTime: 2023-09-18 00:00:00
趋势多且增强-R-1-1 总交易次数: 9 盈利: 24.96743355276786 亏损: -8.133533298995497 最大盈利: 10.31 最大亏损: -3.82 总收益: 16.83 平均盈利: 1.87 typeA: 1.04 胜率: 55.56%
趋势空且增强-R-1-1 总交易次数: 13 盈利: 11.240982401022567 亏损: -21.227449202793256 最大盈利: 3.97 最大亏损: -7.11 总收益: -9.99 平均盈利: -0.77 typeA: -0.30 胜率: 38.46%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     23
      盈利次数:       18
      亏损次数:       5
      胜率:          78.26%
      总收益:        209.14 USDT
      期末余额:      1204.54 USDT
      盈亏比:        5.41
      最大单笔盈利:  40.53
      最大单笔亏损:  -15.60
      手续费:       9.213467886116407
      =============================
    
profit: 204.53814741147153
maxDrawdown 2.0%
startTime: 2023-10-18 00:00:00
趋势多且增强-R-1-1 总交易次数: 9 盈利: 138.7174138352208 亏损: 0 最大盈利: 40.53 最大亏损: 4.13 总收益: 138.72 平均盈利: 15.41 typeA: 15.41 胜率: 100.00%
趋势空且增强-R-1-1 总交易次数: 14 盈利: 117.80078249842755 亏损: -47.38004892217588 最大盈利: 32.88 最大亏损: -15.60 总收益: 70.42 平均盈利: 5.03 typeA: 3.23 胜率: 64.29%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     20
      盈利次数:       15
      亏损次数:       5
      胜率:          75.00%
      总收益:        78.83 USDT
      期末余额:      1074.83 USDT
      盈亏比:        1.93
      最大单笔盈利:  26.21
      最大单笔亏损:  -28.53
      手续费:       8.016307354198032
      =============================
    
profit: 74.83449245565498
maxDrawdown 3.7%
startTime: 2023-11-17 00:00:00
趋势多且增强-R-1-1 总交易次数: 11 盈利: 100.71068324343163 亏损: -20.733336600514832 最大盈利: 26.21 最大亏损: -10.49 总收益: 79.98 平均盈利: 7.27 typeA: 5.95 胜率: 81.82%
趋势空且增强-R-1-1 总交易次数: 9 盈利: 63.04871459747689 亏损: -64.19156878473795 最大盈利: 20.06 最大亏损: -28.53 总收益: -1.14 平均盈利: -0.13 typeA: -0.08 胜率: 66.67%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     22
      盈利次数:       19
      亏损次数:       3
      胜率:          86.36%
      总收益:        162.39 USDT
      期末余额:      1157.99 USDT
      盈亏比:        6.69
      最大单笔盈利:  25.15
      最大单笔亏损:  -19.89
      手续费:       8.810328611536049
      =============================
    
profit: 157.98819953469024
maxDrawdown 1.8%
startTime: 2023-12-17 00:00:00
趋势多且增强-R-1-1 总交易次数: 10 盈利: 107.19894875464792 亏损: 0 最大盈利: 20.81 最大亏损: 6.73 总收益: 107.20 平均盈利: 10.72 typeA: 10.72 胜率: 100.00%
趋势空且增强-R-1-1 总交易次数: 12 盈利: 83.74340195915545 亏损: -28.554151179111763 最大盈利: 25.15 最大亏损: -19.89 总收益: 55.19 平均盈利: 4.60 typeA: 3.45 胜率: 75.00%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     21
      盈利次数:       9
      亏损次数:       12
      胜率:          42.86%
      总收益:        -59.57 USDT
      期末余额:      936.03 USDT
      盈亏比:        0.43
      最大单笔盈利:  12.82
      最大单笔亏损:  -27.96
      手续费:       8.606235143792953
      =============================
    
profit: -63.973426881133946
maxDrawdown 7.1%
startTime: 2024-01-16 00:00:00
趋势多且增强-R-1-1 总交易次数: 9 盈利: 33.039850954695716 亏损: -46.93316819371303 最大盈利: 12.82 最大亏损: -27.96 总收益: -13.89 平均盈利: -1.54 typeA: -0.86 胜率: 55.56%
趋势空且增强-R-1-1 总交易次数: 12 盈利: 12.21114696871372 亏损: -57.89125661082959 最大盈利: 4.83 最大亏损: -11.37 总收益: -45.68 平均盈利: -3.81 typeA: -1.27 胜率: 33.33%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     6
      盈利次数:       4
      亏损次数:       2
      胜率:          66.67%
      总收益:        39.49 USDT
      期末余额:      1038.09 USDT
      盈亏比:        5.20
      最大单笔盈利:  17.21
      最大单笔亏损:  -8.38
      手续费:       2.59692148168425
      =============================
    
profit: 38.093640315926905
maxDrawdown 0.8%
startTime: 2024-02-15 00:00:00
趋势空且增强-R-1-1 总交易次数: 2 盈利: 27.647185003518754 亏损: 0 最大盈利: 17.21 最大亏损: 10.44 总收益: 27.65 平均盈利: 13.82 typeA: 13.82 胜率: 100.00%
趋势多且增强-R-1-1 总交易次数: 4 盈利: 21.239617228727173 亏损: -9.39316191631869 最大盈利: 13.28 最大亏损: -8.38 总收益: 11.85 平均盈利: 2.96 typeA: 1.48 胜率: 50.00%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     21
      盈利次数:       12
      亏损次数:       9
      胜率:          57.14%
      总收益:        75.41 USDT
      期末余额:      1071.21 USDT
      盈亏比:        1.28
      最大单笔盈利:  106.52
      最大单笔亏损:  -111.47
      手续费:       8.369215734841182
      =============================
    
profit: 71.20573680225766
maxDrawdown 15.3%
startTime: 2024-03-16 00:00:00
趋势空且增强-R-1-1 总交易次数: 11 盈利: 185.21425666897593 亏损: -70.6427678755427 最大盈利: 106.52 最大亏损: -25.33 总收益: 114.57 平均盈利: 10.42 typeA: 5.68 胜率: 54.55%
趋势多且增强-R-1-1 总交易次数: 10 盈利: 159.44478939076106 亏损: -198.61054138193546 最大盈利: 62.04 最大亏损: -111.47 总收益: -39.17 平均盈利: -3.92 typeA: -2.35 胜率: 60.00%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     18
      盈利次数:       11
      亏损次数:       7
      胜率:          61.11%
      总收益:        69.22 USDT
      期末余额:      1065.42 USDT
      盈亏比:        2.07
      最大单笔盈利:  29.96
      最大单笔亏损:  -26.10
      手续费:       7.394999541355502
      =============================
    
profit: 65.41570868709209
maxDrawdown 2.5%
startTime: 2024-04-15 00:00:00
趋势空且增强-R-1-1 总交易次数: 11 盈利: 67.59030462479235 亏损: -20.874022599171294 最大盈利: 19.96 最大亏损: -7.14 总收益: 46.72 平均盈利: 4.25 typeA: 2.70 胜率: 63.64%
趋势多且增强-R-1-1 总交易次数: 7 盈利: 66.4080190170091 亏损: -43.908592355536996 最大盈利: 29.96 最大亏损: -26.10 总收益: 22.50 平均盈利: 3.21 typeA: 1.84 胜率: 57.14%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     19
      盈利次数:       12
      亏损次数:       7
      胜率:          63.16%
      总收益:        117.47 USDT
      期末余额:      1113.67 USDT
      盈亏比:        3.54
      最大单笔盈利:  54.72
      最大单笔亏损:  -15.40
      手续费:       7.578771831265838
      =============================
    
profit: 113.66588389469075
maxDrawdown 2.3%
startTime: 2024-05-15 00:00:00
趋势空且增强-R-1-1 总交易次数: 9 盈利: 112.61703018138711 亏损: -0.7015419330576941 最大盈利: 54.72 最大亏损: -0.70 总收益: 111.92 平均盈利: 12.44 typeA: 11.05 胜率: 88.89%
趋势多且增强-R-1-1 总交易次数: 10 盈利: 51.09676628209825 亏损: -45.54637063573597 最大盈利: 31.97 最大亏损: -15.40 总收益: 5.55 平均盈利: 0.56 typeA: 0.22 胜率: 40.00%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     15
      盈利次数:       8
      亏损次数:       7
      胜率:          53.33%
      总收益:        -45.50 USDT
      期末余额:      951.30 USDT
      盈亏比:        0.39
      最大单笔盈利:  8.36
      最大单笔亏损:  -18.29
      手续费:       6.196056315292725
      =============================
    
profit: -48.7005860611456
maxDrawdown 5.9%
startTime: 2024-06-14 00:00:00
趋势空且增强-R-1-1 总交易次数: 8 盈利: 17.18752565788394 亏损: -30.182857373239305 最大盈利: 8.17 最大亏损: -18.29 总收益: -13.00 平均盈利: -1.62 typeA: -1.02 胜率: 62.50%
趋势多且增强-R-1-1 总交易次数: 7 盈利: 11.769714769421427 亏损: -44.27496911521094 最大盈利: 8.36 最大亏损: -14.49 总收益: -32.51 平均盈利: -4.64 typeA: -1.99 胜率: 42.86%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     13
      盈利次数:       10
      亏损次数:       3
      胜率:          76.92%
      总收益:        96.47 USDT
      期末余额:      1093.87 USDT
      盈亏比:        2.22
      最大单笔盈利:  63.59
      最大单笔亏损:  -53.08
      手续费:       5.186311320256146
      =============================
    
profit: 93.86997334040393
maxDrawdown 6.0%
startTime: 2024-07-14 00:00:00
趋势空且增强-R-1-1 总交易次数: 6 盈利: 95.70670685547026 亏损: -13.14011519716428 最大盈利: 63.59 最大亏损: -13.14 总收益: 82.57 平均盈利: 13.76 typeA: 11.47 胜率: 83.33%
趋势多且增强-R-1-1 总交易次数: 7 盈利: 79.67232082921268 亏损: -65.76893914711407 最大盈利: 40.92 最大亏损: -53.08 总收益: 13.90 平均盈利: 1.99 typeA: 1.42 胜率: 71.43%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     30
      盈利次数:       21
      亏损次数:       9
      胜率:          70.00%
      总收益:        88.28 USDT
      期末余额:      1082.28 USDT
      盈亏比:        1.89
      最大单笔盈利:  49.56
      最大单笔亏损:  -27.97
      手续费:       11.988071953628019
      =============================
    
profit: 82.27569662085352
maxDrawdown 3.0%
startTime: 2024-08-13 00:00:00
趋势空且增强-R-1-1 总交易次数: 13 盈利: 91.71076397196732 亏损: -17.343373354736613 最大盈利: 49.56 最大亏损: -8.69 总收益: 74.37 平均盈利: 5.72 typeA: 4.40 胜率: 76.92%
趋势多且增强-R-1-1 总交易次数: 17 盈利: 95.943255367407 亏损: -82.03494936378283 最大盈利: 17.29 最大亏损: -27.97 总收益: 13.91 平均盈利: 0.82 typeA: 0.53 胜率: 64.71%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     27
      盈利次数:       21
      亏损次数:       6
      胜率:          77.78%
      总收益:        264.31 USDT
      期末余额:      1258.71 USDT
      盈亏比:        6.22
      最大单笔盈利:  87.44
      最大单笔亏损:  -28.10
      手续费:       10.98543411964138
      =============================
    
profit: 258.71050218131654
maxDrawdown 3.2%
startTime: 2024-09-12 00:00:00
趋势空且增强-R-1-1 总交易次数: 11 盈利: 186.80623904279756 亏损: -17.70931746196367 最大盈利: 87.44 最大亏损: -14.87 总收益: 169.10 平均盈利: 15.37 typeA: 12.58 胜率: 81.82%
趋势多且增强-R-1-1 总交易次数: 16 盈利: 128.16596792958592 亏损: -32.95238732910185 最大盈利: 33.13 最大亏损: -28.10 总收益: 95.21 平均盈利: 5.95 typeA: 4.46 胜率: 75.00%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     27
      盈利次数:       19
      亏损次数:       8
      胜率:          70.37%
      总收益:        408.23 USDT
      期末余额:      1402.83 USDT
      盈亏比:        7.07
      最大单笔盈利:  84.27
      最大单笔亏损:  -36.08
      手续费:       10.88292570270516
      =============================
    
profit: 402.83499604059034
maxDrawdown 3.4%
startTime: 2024-10-12 00:00:00
趋势多且增强-R-1-1 总交易次数: 17 盈利: 446.7673695606874 亏损: -36.076986569669806 最大盈利: 84.27 最大亏损: -36.08 总收益: 410.69 平均盈利: 24.16 typeA: 22.74 胜率: 94.12%
趋势空且增强-R-1-1 总交易次数: 10 盈利: 28.68648262494085 亏损: -31.14186957536677 最大盈利: 11.52 最大亏损: -10.29 总收益: -2.46 平均盈利: -0.25 typeA: -0.07 胜率: 30.00%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     24
      盈利次数:       16
      亏损次数:       8
      胜率:          66.67%
      总收益:        261.23 USDT
      期末余额:      1256.43 USDT
      盈亏比:        2.57
      最大单笔盈利:  125.31
      最大单笔亏损:  -44.51
      手续费:       9.614248713963086
      =============================
    
profit: 256.4311502389487
maxDrawdown 4.7%
startTime: 2024-11-11 00:00:00
趋势空且增强-R-1-1 总交易次数: 9 盈利: 127.34423515684043 亏损: -31.723840405183815 最大盈利: 52.03 最大亏损: -20.21 总收益: 95.62 平均盈利: 10.62 typeA: 8.26 胜率: 77.78%
趋势多且增强-R-1-1 总交易次数: 15 盈利: 300.0071220829176 亏损: -134.39636659562373 最大盈利: 125.31 最大亏损: -44.51 总收益: 165.61 平均盈利: 11.04 typeA: 6.62 胜率: 60.00%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     17
      盈利次数:       12
      亏损次数:       5
      胜率:          70.59%
      总收益:        139.13 USDT
      期末余额:      1135.73 USDT
      盈亏比:        2.99
      最大单笔盈利:  31.89
      最大单笔亏损:  -30.44
      手续费:       6.815520623900141
      =============================
    
profit: 135.72963368994806
maxDrawdown 2.9%
startTime: 2024-12-11 00:00:00
趋势多且增强-R-1-1 总交易次数: 8 盈利: 108.45212207988791 亏损: 0 最大盈利: 19.49 最大亏损: 6.75 总收益: 108.45 平均盈利: 13.56 typeA: 13.56 胜率: 100.00%
趋势空且增强-R-1-1 总交易次数: 9 盈利: 100.64887875354249 亏损: -69.97136714348196 最大盈利: 31.89 最大亏损: -30.44 总收益: 30.68 平均盈利: 3.41 typeA: 1.51 胜率: 44.44%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     22
      盈利次数:       10
      亏损次数:       12
      胜率:          45.45%
      总收益:        -26.78 USDT
      期末余额:      968.62 USDT
      盈亏比:        0.84
      最大单笔盈利:  58.17
      最大单笔亏损:  -58.79
      手续费:       8.979115373827327
      =============================
    
profit: -31.38236822426802
maxDrawdown 12.6%
startTime: 2025-01-10 00:00:00
趋势空且增强-R-1-1 总交易次数: 11 盈利: 94.62829639733744 亏损: -55.81015540307177 最大盈利: 58.17 最大亏损: -18.02 总收益: 38.82 平均盈利: 3.53 typeA: 1.60 胜率: 45.45%
趋势多且增强-R-1-1 总交易次数: 11 盈利: 49.18643168165891 亏损: -114.78694090019137 最大盈利: 28.01 最大亏损: -58.79 总收益: -65.60 平均盈利: -5.96 typeA: -2.71 胜率: 45.45%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     24
      盈利次数:       16
      亏损次数:       8
      胜率:          66.67%
      总收益:        204.75 USDT
      期末余额:      1199.95 USDT
      盈亏比:        2.23
      最大单笔盈利:  68.11
      最大单笔亏损:  -58.55
      手续费:       9.614126788759501
      =============================
    
profit: 199.9499509562404
maxDrawdown 5.1%
startTime: 2025-02-09 00:00:00
趋势多且增强-R-1-1 总交易次数: 13 盈利: 248.07718755211533 亏损: -110.60619658301664 最大盈利: 68.11 最大亏损: -58.55 总收益: 137.47 平均盈利: 10.57 typeA: 7.32 胜率: 69.23%
趋势空且增强-R-1-1 总交易次数: 11 盈利: 122.74085474053271 亏损: -55.46189475338993 最大盈利: 50.32 最大亏损: -34.14 总收益: 67.28 平均盈利: 6.12 typeA: 3.89 胜率: 63.64%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     23
      盈利次数:       14
      亏损次数:       9
      胜率:          60.87%
      总收益:        -97.97 USDT
      期末余额:      897.43 USDT
      盈亏比:        0.68
      最大单笔盈利:  68.11
      最大单笔亏损:  -175.09
      手续费:       9.184735416947431
      =============================
    
profit: -102.57364313486937
maxDrawdown 21.0%
startTime: 2025-03-11 00:00:00
趋势空且增强-R-1-1 总交易次数: 7 盈利: 14.969734516098203 亏损: -24.904437342874566 最大盈利: 5.73 最大亏损: -11.42 总收益: -9.93 平均盈利: -1.42 typeA: -0.81 胜率: 57.14%
趋势多且增强-R-1-1 总交易次数: 16 盈利: 194.9315724252697 亏损: -282.9705127333618 最大盈利: 68.11 最大亏损: -175.09 总收益: -88.04 平均盈利: -5.50 typeA: -3.44 胜率: 62.50%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     18
      盈利次数:       11
      亏损次数:       7
      胜率:          61.11%
      总收益:        52.64 USDT
      期末余额:      1048.84 USDT
      盈亏比:        1.91
      最大单笔盈利:  29.93
      最大单笔亏损:  -23.08
      手续费:       7.387074044888169
      =============================
    
profit: 48.836727331878365
maxDrawdown 2.2%
startTime: 2025-04-10 00:00:00
趋势空且增强-R-1-1 总交易次数: 7 盈利: 59.03887382566351 亏损: 0 最大盈利: 13.63 最大亏损: 3.22 总收益: 59.04 平均盈利: 8.43 typeA: 8.43 胜率: 100.00%
趋势多且增强-R-1-1 总交易次数: 11 盈利: 51.57519150328726 亏损: -57.977337997071345 最大盈利: 29.93 最大亏损: -23.08 总收益: -6.40 平均盈利: -0.58 typeA: -0.21 胜率: 36.36%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     25
      盈利次数:       14
      亏损次数:       11
      胜率:          56.00%
      总收益:        -94.00 USDT
      期末余额:      901.00 USDT
      盈亏比:        0.62
      最大单笔盈利:  26.16
      最大单笔亏损:  -106.08
      手续费:       9.987628393805128
      =============================
    
profit: -99.00099723171127
maxDrawdown 14.4%
startTime: 2025-05-10 00:00:00
趋势空且增强-R-1-1 总交易次数: 9 盈利: 45.747103311546454 亏损: -61.12748777710074 最大盈利: 26.16 最大亏损: -25.40 总收益: -15.38 平均盈利: -1.71 typeA: -0.76 胜率: 44.44%
趋势多且增强-R-1-1 总交易次数: 16 盈利: 108.24613379603312 亏损: -186.86674656218884 最大盈利: 24.40 最大亏损: -106.08 总收益: -78.62 平均盈利: -4.91 typeA: -3.07 胜率: 62.50%

     

          ========== 回测结果 ==========
          总交易次数:     1205
    盈利次数:       733
    亏损次数:       472
          胜率:          60.83%
          总收益:        2484.27 USDT
          盈亏比:        1.26
    rw:        0.0166
    rl:        0.0205
    carry:        6.03
          =============================

tradeNumTotal 1205
profitTotal 2242.4673871646846
maxLossTotal -243.63
winRateTotal 3304.9900000000002
period month 54
avgRate 61.20
maxDrawdownTotal 30.2
趋势多且增强-R-1-1 总交易次数: 604 盈利: 6717.978006937594 亏损: -4658.536606641958 最大盈利: 141.74 最大亏损: -178.41 总收益: 2059.44 平均盈利: 3.41 typeA: 2.12 胜率: 62.09%
趋势空且增强-R-1-1 总交易次数: 601 盈利: 5459.723160839028 亏损: -5034.897173969928 最大盈利: 122.99 最大亏损: -243.63 总收益: 424.83 平均盈利: 0.71 typeA: 0.42 胜率: 59.57%


       ========== 回测结果 ==========
          总交易次数:     1139
    盈利次数:       678
    亏损次数:       461
          胜率:          59.53%
          总收益:        1618.87 USDT
          盈亏比:        1.19
    rw:        0.0151
    rl:        0.0186
    carry:        5.09
          =============================

tradeNumTotal 1139
profitTotal 1389.6727048282078
maxLossTotal -164.85
winRateTotal 3264.1400000000003
period month 54
avgRate 60.45
maxDrawdownTotal 25.1
趋势多且增强-R-1-1 总交易次数: 560 盈利: 5169.461848521699 亏损: -4057.803575763158 最大盈利: 209.14 最大亏损: -164.85 总收益: 1111.66 平均盈利: 1.99 typeA: 1.19 胜率: 59.82%
趋势空且增强-R-1-1 总交易次数: 579 盈利: 5046.4637017694295 亏损: -4539.24926969971 最大盈利: 159.61 最大亏损: -118.71 总收益: 507.21 平均盈利: 0.88 typeA: 0.52 胜率: 59.24%


          ========== 回测结果 ==========
          总交易次数:     1968
    盈利次数:       1225
    亏损次数:       743
          胜率:          62.25%
          总收益:        3188.26 USDT
          盈亏比:        1.23
    rw:        0.0141
    rl:        0.0189
    carry:        6.08
          =============================

tradeNumTotal 1968
profitTotal 2793.0564811961567
maxLossTotal -162.42
winRateTotal 3364.190000000001
period month 54
avgRate 62.30
maxDrawdownTotal 32
趋势多且增强-R-1-1 总交易次数: 970 盈利: 9441.342199426244 亏损: -6663.258240195902 最大盈利: 557.92 最大亏损: -162.42 总收益: 2778.08 平均盈利: 2.86 typeA: 1.81 胜率: 63.30%
趋势空且增强-R-1-1 总交易次数: 998 盈利: 7815.682045494817 亏损: -7405.5095235289145 最大盈利: 182.35 最大亏损: -141.58 总收益: 410.17 平均盈利: 0.41 typeA: 0.25 胜率: 61.22%

    ========== 回测结果 ==========
          总交易次数:     2413
    盈利次数:       1490
    亏损次数:       923
          胜率:          61.75%
          总收益:        3897.45 USDT
          盈亏比:        1.24
    rw:        0.0136
    rl:        0.0177
    carry:        6.72
          =============================

tradeNumTotal 2413
profitTotal 3412.0528848457034
maxLossTotal -166.68
winRateTotal 3341.6299999999983
period month 54
avgRate 61.88
maxDrawdownTotal 34.2
趋势多且增强-R-1-1 总交易次数: 1169 盈利: 10632.581393902195 亏损: -7762.178872945427 最大盈利: 557.92 最大亏损: -163.03 总收益: 2870.40 平均盈利: 2.46 typeA: 1.54 胜率: 62.79%
趋势空且增强-R-1-1 总交易次数: 1244 盈利: 9616.132905014058 亏损: -8589.082541125012 最大盈利: 182.35 最大亏损: -166.68 总收益: 1027.05 平均盈利: 0.83 typeA: 0.50 胜率: 60.77%



          ========== 回测结果 ==========
          总交易次数:     2527
    盈利次数:       1565
    亏损次数:       962
          胜率:          61.93%
          总收益:        4254.56 USDT
          盈亏比:        1.25
    rw:        0.0136
    rl:        0.0176
    carry:        7.06
          =============================

tradeNumTotal 2527
profitTotal 3746.3555746357415
maxLossTotal -166.68
winRateTotal 3349.7799999999997
period month 54
avgRate 62.03
maxDrawdownTotal 27.7
趋势多且增强-R-1-1 总交易次数: 1216 盈利: 11008.957471020603 亏损: -8018.772476088547 最大盈利: 557.92 最大亏损: -163.03 总收益: 2990.18 平均盈利: 2.46 typeA: 1.56 胜率: 63.57%
趋势空且增强-R-1-1 总交易次数: 1311 盈利: 10210.823877045035 亏损: -8946.453297341219 最大盈利: 182.35 最大亏损: -166.68 总收益: 1264.37 平均盈利: 0.96 typeA: 0.58 胜率: 60.41%


   ========== 回测结果 ==========
          总交易次数:     2528
    盈利次数:       1570
    亏损次数:       958
          胜率:          62.10%
          总收益:        4431.04 USDT
          盈亏比:        1.27
    rw:        0.0134
    rl:        0.0174
    carry:        7.50
          =============================

tradeNumTotal 2528
profitTotal 3922.6397642277116
maxLossTotal -166.68
winRateTotal 3359.39
period month 54
avgRate 62.21
maxDrawdownTotal 27.7
趋势多且增强-R-1-1 总交易次数: 1216 盈利: 10946.121897162553 亏损: -7836.979707196431 最大盈利: 557.92 最大亏损: -163.03 总收益: 3109.14 平均盈利: 2.56 typeA: 1.63 胜率: 63.82%
趋势空且增强-R-1-1 总交易次数: 1312 盈利: 10167.102108283836 亏损: -8845.204534022108 最大盈利: 182.35 最大亏损: -166.68 总收益: 1321.90 平均盈利: 1.01 typeA: 0.61 胜率: 60.52%


     ========== 回测结果 ==========
          总交易次数:     4122
    盈利次数:       2149
    亏损次数:       1973
          胜率:          52.13%
          总收益:        5353.07 USDT
          盈亏比:        1.21
    rw:        0.0146
    rl:        0.0132
    carry:        6.71
          =============================

tradeNumTotal 4122
profitTotal 4524.265746277396
maxLossTotal -204.89
winRateTotal 2806.8900000000003
period month 54
avgRate 51.98
maxDrawdownTotal 28.8
趋势多且增强-R-1-1 总交易次数: 1998 盈利: 17394.649693767977 亏损: -12251.325309854012 最大盈利: 1886.10 最大亏损: -164.85 总收益: 5143.32 平均盈利: 2.57 typeA: 1.42 胜率: 55.26%
趋势空且增强-R-1-1 总交易次数: 2124 盈利: 13989.389534846005 亏损: -13779.648172482366 最大盈利: 206.78 最大亏损: -204.89 总收益: 209.74 平均盈利: 0.10 typeA: 0.05 胜率: 49.20%


          ========== 回测结果 ==========
          总交易次数:     2566
    盈利次数:       1600
    亏损次数:       966
          胜率:          62.35%
          总收益:        5594.13 USDT
          盈亏比:        1.33
    rw:        0.0140
    rl:        0.0176
    carry:        8.64
          =============================

tradeNumTotal 2566
profitTotal 5078.3289947938065
maxLossTotal -163.03
winRateTotal 3370.5499999999997
period month 54
avgRate 62.42
maxDrawdownTotal 33.2
趋势多且增强-R-1-1 总交易次数: 1496 盈利: 14536.376285234533 亏损: -9525.906047178898 最大盈利: 1948.85 最大亏损: -163.03 总收益: 5010.47 平均盈利: 3.35 typeA: 2.08 胜率: 61.97%
趋势空且增强-R-1-1 总交易次数: 1070 盈利: 7993.938368487789 亏损: -7410.279611749518 最大盈利: 182.35 最大亏损: -141.58 总收益: 583.66 平均盈利: 0.55 typeA: 0.34 胜率: 62.90%


 ========== 回测结果 ==========
          总交易次数:     1903
    盈利次数:       1248
    亏损次数:       655
          胜率:          65.58%
          总收益:        3296.54 USDT
          盈亏比:        1.31
    rw:        0.0111
    rl:        0.0161
    carry:        9.78
          =============================

tradeNumTotal 1903
profitTotal 2914.7376780499917
maxLossTotal -167.58
winRateTotal 3550.5
period month 54
avgRate 65.75
maxDrawdownTotal 24.5
趋势空且增强-R-1-1 总交易次数: 1000 盈利: 7395.561736076022 亏损: -5489.708922997578 最大盈利: 159.61 最大亏损: -167.58 总收益: 1905.85 平均盈利: 1.91 typeA: 1.24 胜率: 65.20%
趋势多且增强-R-1-1 总交易次数: 903 盈利: 6428.212791479585 亏损: -5037.527926507953 最大盈利: 163.50 最大亏损: -164.85 总收益: 1390.68 平均盈利: 1.54 typeA: 1.02 胜率: 66.00%


  ========== 回测结果 ==========
          总交易次数:     2369
    盈利次数:       1571
    亏损次数:       798
          胜率:          66.31%
          总收益:        4536.93 USDT
          盈亏比:        1.36
    rw:        0.0109
    rl:        0.0157
    carry:        11.21
          =============================

tradeNumTotal 2369
profitTotal 4061.7284189760762
maxLossTotal -166.68
winRateTotal 3582.72
period month 54
avgRate 66.35
maxDrawdownTotal 22.9
趋势多且增强-R-1-1 总交易次数: 1130 盈利: 8585.780748781997 亏损: -6076.921969928373 最大盈利: 299.86 最大亏损: -164.85 总收益: 2508.86 平均盈利: 2.22 typeA: 1.49 胜率: 67.17%
趋势空且增强-R-1-1 总交易次数: 1239 盈利: 8501.558408932775 亏损: -6473.4887688102135 最大盈利: 159.61 最大亏损: -166.68 总收益: 2028.07 平均盈利: 1.64 typeA: 1.07 胜率: 65.54%


          ========== 回测结果 ==========
          总交易次数:     2710
    盈利次数:       1721
    亏损次数:       989
          胜率:          63.51%
          总收益:        5985.51 USDT
          盈亏比:        1.40
    rw:        0.0121
    rl:        0.0152
    carry:        11.77
          =============================

tradeNumTotal 2710
profitTotal 5441.512297392558
maxLossTotal -164.85
winRateTotal 3433.2199999999993
period month 54
avgRate 63.58
maxDrawdownTotal 25.1
趋势多且增强-R-1-1 总交易次数: 1543 盈利: 13386.507764929866 亏损: -8866.22647544105 最大盈利: 1886.10 最大亏损: -164.85 总收益: 4520.28 平均盈利: 2.93 typeA: 1.81 胜率: 61.76%
趋势空且增强-R-1-1 总交易次数: 1167 盈利: 7569.997716268461 亏损: -6104.7667083646 最大盈利: 159.61 最大亏损: -158.57 总收益: 1465.23 平均盈利: 1.26 typeA: 0.83 胜率: 65.81%


     ========== 回测结果 ==========
          总交易次数:     2470
    盈利次数:       1635
    亏损次数:       835
          胜率:          66.19%
          总收益:        5118.62 USDT
          盈亏比:        1.38
    rw:        0.0114
    rl:        0.0162
    carry:        11.23
          =============================

tradeNumTotal 2470
profitTotal 4623.015538940668
maxLossTotal -166.68
winRateTotal 3576.8799999999997
period month 54
avgRate 66.24
maxDrawdownTotal 22.9
趋势多且增强-R-1-1 总交易次数: 1222 盈利: 10082.001924973238 亏损: -6865.578186333973 最大盈利: 238.29 最大亏损: -164.85 总收益: 3216.42 平均盈利: 2.63 typeA: 1.77 胜率: 67.35%
趋势空且增强-R-1-1 总交易次数: 1248 盈利: 8521.417051352275 亏损: -6619.225251050753 最大盈利: 159.61 最大亏损: -166.68 总收益: 1902.19 平均盈利: 1.52 typeA: 0.99 胜率: 65.06%


     ========== 回测结果 ==========
          总交易次数:     2304
    盈利次数:       1537
    亏损次数:       767
          胜率:          66.71%
          总收益:        5179.37 USDT
          盈亏比:        1.41
    rw:        0.0115
    rl:        0.0164
    carry:        11.82
          =============================

tradeNumTotal 2304
profitTotal 4716.974523865414
maxLossTotal -164.85
winRateTotal 3607.55
period month 54
avgRate 66.81
maxDrawdownTotal 25.8
趋势多且增强-R-1-1 总交易次数: 1221 盈利: 10305.524762813448 亏损: -6915.872670131536 最大盈利: 238.29 最大亏损: -164.85 总收益: 3389.65 平均盈利: 2.78 typeA: 1.85 胜率: 66.67%
趋势空且增强-R-1-1 总交易次数: 1083 盈利: 7402.331359828246 亏损: -5612.60892864463 最大盈利: 159.61 最大亏损: -158.57 总收益: 1789.72 平均盈利: 1.65 typeA: 1.10 胜率: 66.76%


    ========== 回测结果 ==========
          总交易次数:     2521
    盈利次数:       1639
    亏损次数:       882
          胜率:          65.01%
          总收益:        6577.18 USDT
          盈亏比:        1.49
    rw:        0.0122
    rl:        0.0152
    carry:        13.97
          =============================

tradeNumTotal 2521
profitTotal 6071.381786098182
maxLossTotal -164.85
winRateTotal 3510.209999999999
period month 54
avgRate 65.00
maxDrawdownTotal 20.4
趋势多且增强-R-1-1 总交易次数: 1248 盈利: 10923.064782117804 亏损: -6736.282576626485 最大盈利: 238.29 最大亏损: -164.85 总收益: 4186.78 平均盈利: 3.35 typeA: 2.20 胜率: 65.63%
趋势空且增强-R-1-1 总交易次数: 1273 盈利: 9097.637100973006 亏损: -6707.23752036603 最大盈利: 182.35 最大亏损: -141.58 总收益: 2390.40 平均盈利: 1.88 typeA: 1.21 胜率: 64.41%


     ========== 回测结果 ==========
          总交易次数:     2439
    盈利次数:       1581
    亏损次数:       858
          胜率:          64.82%
          总收益:        6686.57 USDT
          盈亏比:        1.52
    rw:        0.0124
    rl:        0.0151
    carry:        14.60
          =============================

tradeNumTotal 2439
profitTotal 6197.172332247272
maxLossTotal -164.85
winRateTotal 3543.67
period month 55
avgRate 64.43
maxDrawdownTotal 19.2
趋势多且增强-L-1-1 总交易次数: 1217 盈利: 10737.451443318645 亏损: -6619.57138603063 最大盈利: 286.28 最大亏损: -164.85 总收益: 4117.88 平均盈利: 3.38 typeA: 2.20 胜率: 65.16%
趋势空且增强-R-1-1 总交易次数: 1222 盈利: 8885.461695803704 亏损: -6316.769420844337 最大盈利: 179.31 最大亏损: -141.58 总收益: 2568.69 平均盈利: 2.10 typeA: 1.36 胜率: 64.48%

     ========== 回测结果 ==========
          总交易次数:     2537
    盈利次数:       1652
    亏损次数:       885
          胜率:          65.12%
          总收益:        6446.52 USDT
          盈亏比:        1.48
    rw:        0.0121
    rl:        0.0152
    carry:        13.80
          =============================

tradeNumTotal 2537
profitTotal 5937.516309755019
maxLossTotal -164.85
winRateTotal 3562.0299999999997
period month 55
avgRate 64.76
maxDrawdownTotal 18.9
趋势多且增强-L-1-1 总交易次数: 1257 盈利: 10713.406200773268 亏损: -6749.026178276759 最大盈利: 182.78 最大亏损: -164.85 总收益: 3964.38 平均盈利: 3.15 typeA: 2.07 胜率: 65.79%
趋势空且增强-R-1-1 总交易次数: 1280 盈利: 9218.14191866831 亏损: -6736.0056314096755 最大盈利: 216.38 最大亏损: -141.58 总收益: 2482.14 平均盈利: 1.94 typeA: 1.25 胜率: 64.45%

    ========== 回测结果 ==========
          总交易次数:     2543
    盈利次数:       1632
    亏损次数:       911
          胜率:          64.18%
          总收益:        6059.93 USDT
          盈亏比:        1.45
    rw:        0.0120
    rl:        0.0148
    carry:        13.37
          =============================

tradeNumTotal 2543
profitTotal 5549.730421015212
maxLossTotal -164.85
winRateTotal 3512.7599999999993
period month 55
avgRate 63.87
maxDrawdownTotal 18.3
趋势多且增强-L-1-1 总交易次数: 1261 盈利: 10398.003485973033 亏损: -6829.838046643337 最大盈利: 182.78 最大亏损: -164.85 总收益: 3568.17 平均盈利: 2.83 typeA: 1.82 胜率: 64.31%
趋势空且增强-R-1-1 总交易次数: 1282 盈利: 9177.02944979588 亏损: -6685.264468110244 最大盈利: 216.38 最大亏损: -141.58 总收益: 2491.76 平均盈利: 1.94 typeA: 1.24 胜率: 64.04%



          ========== 回测结果 ==========
          总交易次数:     2522
    盈利次数:       1615
    亏损次数:       907
          胜率:          64.04%
          总收益:        6317.08 USDT
          盈亏比:        1.47
    rw:        0.0122
    rl:        0.0148
    carry:        13.79
    最大连续盈利:  568.2512391437641
    最大连续亏损:  -186.75075201196714
    最大连盈次数:  16
    最大连亏次数:  6
          =============================

tradeNumTotal 2522
profitTotal 5811.077335842518
maxLossTotal -164.85
winRateTotal 3500.2199999999993
period month 55
avgRate 63.64
maxDrawdownTotal 18.3
趋势多且增强-L-1-1 总交易次数: 1252 盈利: 10543.295806547585 亏损: -6786.646923395391 最大盈利: 182.78 最大亏损: -164.85 总收益: 3756.65 平均盈利: 3.00 typeA: 1.92 胜率: 64.06%
趋势空且增强-R-1-1 总交易次数: 1270 盈利: 9217.813750215322 亏损: -6657.385297524885 最大盈利: 195.95 最大亏损: -141.58 总收益: 2560.43 平均盈利: 2.02 typeA: 1.29 胜率: 64.02%


          ========== 回测结果 ==========
          总交易次数:     2497
    盈利次数:       1643
    亏损次数:       854
          胜率:          65.80%
          总收益:        6447.76 USDT
          盈亏比:        1.48
    rw:        0.0121
    rl:        0.0157
    carry:        13.62
    最大连续盈利:  568.2512391437641
    最大连续亏损:  -199.06795090968146
    最大连盈次数:  16
    最大连亏次数:  7
          =============================

tradeNumTotal 2497
profitTotal 5946.56428326407
maxLossTotal -164.85
winRateTotal 3592.5599999999995
period month 55
avgRate 65.32
maxDrawdownTotal 19.5
趋势多且增强-L-1-1 总交易次数: 1241 盈利: 10580.814790500903 亏损: -6969.934797757143 最大盈利: 182.78 最大亏损: -164.85 总收益: 3610.88 平均盈利: 2.91 typeA: 1.93 胜率: 66.24%
趋势空且增强-R-1-1 总交易次数: 1256 盈利: 9238.248903349386 亏损: -6401.364612828962 最大盈利: 195.95 最大亏损: -141.58 总收益: 2836.88 平均盈利: 2.26 typeA: 1.48 胜率: 65.37%


          ========== 回测结果 ==========
          总交易次数:     2964
    盈利次数:       1833
    亏损次数:       1131
          胜率:          61.84%
          总收益:        6773.89 USDT
          盈亏比:        1.45
    rw:        0.0120
    rl:        0.0134
    carry:        14.31
    最大连续盈利:  353.18294424928655
    最大连续亏损:  -204.89020778072492
    最大连盈次数:  13
    最大连亏次数:  6
          =============================

tradeNumTotal 2964
profitTotal 6179.28740673295
maxLossTotal -204.89
winRateTotal 3388.489999999999
period month 55
avgRate 61.61
maxDrawdownTotal 20.5
趋势多且增强-L-1-1 总交易次数: 1243 盈利: 10539.100770034469 亏损: -6695.061334615157 最大盈利: 182.78 最大亏损: -164.85 总收益: 3844.04 平均盈利: 3.09 typeA: 2.04 胜率: 65.89%
趋势空且增强-R-1-1 总交易次数: 1721 盈利: 11404.956676023881 亏损: -8475.108704710112 最大盈利: 219.55 最大亏损: -204.89 总收益: 2929.85 平均盈利: 1.70 typeA: 1.00 胜率: 58.92%

      ========== 回测结果 ==========
          总交易次数:     2512
    盈利次数:       1656
    亏损次数:       856
          胜率:          65.92%
          总收益:        6965.62 USDT
          盈亏比:        1.52
    rw:        0.0122
    rl:        0.0156
    carry:        14.42
    最大连续盈利:  554.4463985182837
    最大连续亏损:  -199.06795090968146
    最大连盈次数:  16
    最大连亏次数:  6
          =============================

tradeNumTotal 2512
profitTotal 6461.220469234807
maxLossTotal -164.85
winRateTotal 3600.71
period month 55
avgRate 65.47
maxDrawdownTotal 22.9
趋势多且增强-L-1-1 总交易次数: 1296 盈利: 11282.56776968436 亏损: -7297.130439161182 最大盈利: 285.08 最大亏损: -164.85 总收益: 3985.44 平均盈利: 3.08 typeA: 2.02 胜率: 65.82%
趋势空且增强-R-1-1 总交易次数: 1216 盈利: 9016.785552345014 亏损: -6036.602413633272 最大盈利: 195.95 最大亏损: -141.58 总收益: 2980.18 平均盈利: 2.45 typeA: 1.62 胜率: 66.04%

*/
