/*


      ========== 回测结果 ==========
      总交易次数:     36
      盈利次数:       13
      亏损次数:       23
      胜率:          36.11%
      总收益:        188.68 USDT
      期末余额:      1181.48 USDT
      盈亏比:        1.63
      最大单笔盈利:  215.85
      最大单笔亏损:  -36.95
      手续费:       14.472926264280666
      =============================
    
profit: 181.48138795154182
maxDrawdown 9.7%
startTime: 2021-01-01 00:00:00
趋势多且增强 总交易次数: 23 盈利: 471.6680403781276 亏损: -196.03128113208845 最大盈利: 215.85 最大亏损: -36.95 总收益: 275.64 平均盈利: 11.98 typeA: 4.69 胜率: 39.13%
趋势空且增强 总交易次数: 13 盈利: 18.237352747435306 亏损: -105.19272404193109 最大盈利: 10.17 最大亏损: -25.82 总收益: -86.96 平均盈利: -6.69 typeA: -2.06 胜率: 30.77%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     47
      盈利次数:       11
      亏损次数:       36
      胜率:          23.40%
      总收益:        -333.45 USDT
      期末余额:      656.95 USDT
      盈亏比:        0.44
      最大单笔盈利:  97.36
      最大单笔亏损:  -64.39
      手续费:       18.9800602593559
      =============================
    
profit: -343.053818220023
maxDrawdown 35.9%
startTime: 2021-01-31 00:00:00
趋势空且增强 总交易次数: 22 盈利: 133.18174585918553 亏损: -249.79171073477337 最大盈利: 53.87 最大亏损: -41.11 总收益: -116.61 平均盈利: -5.30 typeA: -1.20 胜率: 22.73%
趋势多且增强 总交易次数: 25 盈利: 126.78476676313488 亏损: -343.628620107568 最大盈利: 97.36 最大亏损: -64.39 总收益: -216.84 平均盈利: -8.67 typeA: -2.08 胜率: 24.00%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     43
      盈利次数:       14
      亏损次数:       29
      胜率:          32.56%
      总收益:        -46.53 USDT
      期末余额:      944.87 USDT
      盈亏比:        0.72
      最大单笔盈利:  32.88
      最大单笔亏损:  -17.88
      手续费:       17.21420432974367
      =============================
    
profit: -55.13201903177719
maxDrawdown 5.7%
startTime: 2021-03-02 00:00:00
趋势多且增强 总交易次数: 27 盈利: 98.26710102829995 亏损: -87.11849440351587 最大盈利: 32.88 最大亏损: -17.88 总收益: 11.15 平均盈利: 0.41 typeA: 0.17 胜率: 40.74%
趋势空且增强 总交易次数: 16 盈利: 20.62691816444489 亏损: -78.3075438210041 最大盈利: 11.17 最大亏损: -16.03 总收益: -57.68 平均盈利: -3.61 typeA: -0.68 胜率: 18.75%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     47
      盈利次数:       16
      亏损次数:       31
      胜率:          34.04%
      总收益:        520.97 USDT
      期末余额:      1511.37 USDT
      盈亏比:        2.26
      最大单笔盈利:  182.61
      最大单笔亏损:  -55.10
      手续费:       19.062628459774235
      =============================
    
profit: 511.3735918305906
maxDrawdown 7.8%
startTime: 2021-04-01 00:00:00
趋势多且增强 总交易次数: 36 盈利: 687.5708376759626 亏损: -273.0659359470741 最大盈利: 182.61 最大亏损: -55.10 总收益: 414.50 平均盈利: 11.51 typeA: 4.48 胜率: 38.89%
趋势空且增强 总交易次数: 11 盈利: 247.25848982042362 亏损: -140.78979971871968 最大盈利: 130.77 最大亏损: -29.16 总收益: 106.47 平均盈利: 9.68 typeA: 1.76 胜率: 18.18%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     39
      盈利次数:       10
      亏损次数:       29
      胜率:          25.64%
      总收益:        -93.86 USDT
      期末余额:      898.34 USDT
      盈亏比:        0.78
      最大单笔盈利:  105.75
      最大单笔亏损:  -44.25
      手续费:       15.630812183460279
      =============================
    
profit: -101.6616670073455
maxDrawdown 18.8%
startTime: 2021-05-01 00:00:00
趋势多且增强 总交易次数: 21 盈利: 193.3329810413157 亏损: -163.52475280877619 最大盈利: 40.69 最大亏损: -39.02 总收益: 29.81 平均盈利: 1.42 typeA: 0.47 胜率: 33.33%
趋势空且增强 总交易次数: 18 盈利: 133.20786061005376 亏损: -256.8777558499371 最大盈利: 105.75 最大亏损: -44.25 总收益: -123.67 平均盈利: -6.87 typeA: -1.15 胜率: 16.67%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     40
      盈利次数:       14
      亏损次数:       26
      胜率:          35.00%
      总收益:        136.54 USDT
      期末余额:      1128.54 USDT
      盈亏比:        1.45
      最大单笔盈利:  149.91
      最大单笔亏损:  -47.97
      手续费:       16.002726642648
      =============================
    
profit: 128.53755159125876
maxDrawdown 9.9%
startTime: 2021-05-31 00:00:00
趋势多且增强 总交易次数: 19 盈利: 232.6953344396026 亏损: -157.42440605176733 最大盈利: 96.61 最大亏损: -47.97 总收益: 75.27 平均盈利: 3.96 typeA: 1.46 胜率: 36.84%
趋势空且增强 总交易次数: 21 盈利: 210.61803501442748 亏损: -149.35141181100158 最大盈利: 149.91 最大亏损: -22.89 总收益: 61.27 平均盈利: 2.92 typeA: 0.97 胜率: 33.33%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     36
      盈利次数:       10
      亏损次数:       26
      胜率:          27.78%
      总收益:        -15.39 USDT
      期末余额:      977.41 USDT
      盈亏比:        0.92
      最大单笔盈利:  73.49
      最大单笔亏损:  -29.41
      手续费:       14.39129787663715
      =============================
    
profit: -22.589111601428954
maxDrawdown 7.2%
startTime: 2021-06-30 00:00:00
趋势空且增强 总交易次数: 20 盈利: 134.1482538234378 亏损: -120.48832099842872 最大盈利: 73.49 最大亏损: -29.41 总收益: 13.66 平均盈利: 0.68 typeA: 0.17 胜率: 25.00%
趋势多且增强 总交易次数: 16 盈利: 35.17343957683259 亏损: -64.22248400326886 最大盈利: 15.34 最大亏损: -12.37 总收益: -29.05 平均盈利: -1.82 typeA: -0.57 胜率: 31.25%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     50
      盈利次数:       15
      亏损次数:       35
      胜率:          30.00%
      总收益:        -26.92 USDT
      期末余额:      963.08 USDT
      盈亏比:        0.90
      最大单笔盈利:  76.63
      最大单笔亏损:  -24.09
      手续费:       20.027896199716437
      =============================
    
profit: -36.921282534437864
maxDrawdown 9.6%
startTime: 2021-07-30 00:00:00
趋势多且增强 总交易次数: 30 盈利: 204.53228762117877 亏损: -149.25074025863665 最大盈利: 76.63 最大亏损: -24.09 总收益: 55.28 平均盈利: 1.84 typeA: 0.68 胜率: 36.67%
趋势空且增强 总交易次数: 20 盈利: 50.793938556455736 亏损: -132.99676845343328 最大盈利: 34.67 最大亏损: -23.89 总收益: -82.20 平均盈利: -4.11 typeA: -0.82 胜率: 20.00%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     40
      盈利次数:       9
      亏损次数:       31
      胜率:          22.50%
      总收益:        -72.56 USDT
      期末余额:      919.44 USDT
      盈亏比:        0.69
      最大单笔盈利:  94.84
      最大单笔亏损:  -24.86
      手续费:       16.003801680181123
      =============================
    
profit: -80.55708472988124
maxDrawdown 10.6%
startTime: 2021-08-29 00:00:00
趋势空且增强 总交易次数: 25 盈利: 129.12717890026374 亏损: -175.9163770463374 最大盈利: 94.84 最大亏损: -24.86 总收益: -46.79 平均盈利: -1.87 typeA: -0.37 胜率: 20.00%
趋势多且增强 总交易次数: 15 盈利: 31.541274423918516 亏损: -57.3091610077245 最大盈利: 12.91 最大亏损: -15.33 总收益: -25.77 平均盈利: -1.72 typeA: -0.46 胜率: 26.67%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     43
      盈利次数:       11
      亏损次数:       32
      胜率:          25.58%
      总收益:        -100.63 USDT
      期末余额:      890.77 USDT
      盈亏比:        0.72
      最大单笔盈利:  95.37
      最大单笔亏损:  -74.80
      手续费:       17.280143745684764
      =============================
    
profit: -109.230039264178
maxDrawdown 22.1%
startTime: 2021-09-28 00:00:00
趋势多且增强 总交易次数: 18 盈利: 223.31012208579244 亏损: -72.5565825163989 最大盈利: 95.37 最大亏损: -27.75 总收益: 150.75 平均盈利: 8.38 typeA: 4.65 胜率: 55.56%
趋势空且增强 总交易次数: 25 盈利: 29.45586146754706 亏损: -280.8394403011165 最大盈利: 29.46 最大亏损: -74.80 总收益: -251.38 平均盈利: -10.06 typeA: -0.40 胜率: 4.00%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     40
      盈利次数:       14
      亏损次数:       26
      胜率:          35.00%
      总收益:        196.38 USDT
      期末余额:      1188.38 USDT
      盈亏比:        2.22
      最大单笔盈利:  70.01
      最大单笔亏损:  -16.05
      手续费:       16.02573257419219
      =============================
    
profit: 188.38338503682212
maxDrawdown 5.5%
startTime: 2021-10-28 00:00:00
趋势多且增强 总交易次数: 17 盈利: 209.44803893320224 亏损: -46.345351846041716 最大盈利: 70.01 最大亏损: -10.83 总收益: 163.10 平均盈利: 9.59 typeA: 4.52 胜率: 47.06%
趋势空且增强 总交易次数: 23 盈利: 147.30958393308768 亏损: -114.02888598342433 最大盈利: 60.58 最大亏损: -16.05 总收益: 33.28 平均盈利: 1.45 typeA: 0.38 胜率: 26.09%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     52
      盈利次数:       11
      亏损次数:       41
      胜率:          21.15%
      总收益:        33.54 USDT
      期末余额:      1023.14 USDT
      盈亏比:        1.14
      最大单笔盈利:  173.39
      最大单笔亏损:  -28.77
      手续费:       20.747827287399065
      =============================
    
profit: 23.141891500845645
maxDrawdown 10.5%
startTime: 2021-11-27 00:00:00
趋势空且增强 总交易次数: 20 盈利: 234.8658256198423 亏损: -86.45870939527049 最大盈利: 173.39 最大亏损: -22.17 总收益: 148.41 平均盈利: 7.42 typeA: 2.23 胜率: 30.00%
趋势多且增强 总交易次数: 32 盈利: 31.054838004107584 亏损: -145.92006272783152 最大盈利: 17.27 最大亏损: -28.77 总收益: -114.87 平均盈利: -3.59 typeA: -0.56 胜率: 15.63%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     44
      盈利次数:       10
      亏损次数:       34
      胜率:          22.73%
      总收益:        -17.31 USDT
      期末余额:      973.89 USDT
      盈亏比:        0.91
      最大单笔盈利:  85.51
      最大单笔亏损:  -42.13
      手续费:       17.590652985726734
      =============================
    
profit: -26.108895800452842
maxDrawdown 9.5%
startTime: 2021-12-27 00:00:00
趋势空且增强 总交易次数: 20 盈利: 128.90396073134184 亏损: -113.79172477271828 最大盈利: 85.51 最大亏损: -42.13 总收益: 15.11 平均盈利: 0.76 typeA: 0.19 胜率: 25.00%
趋势多且增强 总交易次数: 24 盈利: 44.8868258912766 亏损: -77.30795765035107 最大盈利: 19.24 最大亏损: -23.63 总收益: -32.42 平均盈利: -1.35 typeA: -0.28 胜率: 20.83%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     45
      盈利次数:       13
      亏损次数:       32
      胜率:          28.89%
      总收益:        -18.27 USDT
      期末余额:      972.73 USDT
      盈亏比:        0.88
      最大单笔盈利:  41.91
      最大单笔亏损:  -14.10
      手续费:       17.98420333109164
      =============================
    
profit: -27.271826905619037
maxDrawdown 5.7%
startTime: 2022-01-26 00:00:00
趋势空且增强 总交易次数: 18 盈利: 91.30901251496311 亏损: -60.054182459268254 最大盈利: 41.91 最大亏损: -9.70 总收益: 31.25 平均盈利: 1.74 typeA: 0.58 胜率: 33.33%
趋势多且增强 总交易次数: 27 盈利: 46.15057662642629 亏损: -95.67723358773841 最大盈利: 17.27 最大亏损: -14.10 总收益: -49.53 平均盈利: -1.83 typeA: -0.48 胜率: 25.93%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     44
      盈利次数:       13
      亏损次数:       31
      胜率:          29.55%
      总收益:        -41.10 USDT
      期末余额:      950.10 USDT
      盈亏比:        0.76
      最大单笔盈利:  28.40
      最大单笔亏损:  -35.68
      手续费:       17.60622880400481
      =============================
    
profit: -49.89856578981801
maxDrawdown 11.1%
startTime: 2022-02-25 00:00:00
趋势多且增强 总交易次数: 22 盈利: 63.27581355890575 亏损: -68.24985720804851 最大盈利: 25.47 最大亏损: -14.10 总收益: -4.97 平均盈利: -0.23 typeA: -0.07 胜率: 31.82%
趋势空且增强 总交易次数: 22 盈利: 66.36082848702523 亏损: -102.48535062769848 最大盈利: 28.40 最大亏损: -35.68 总收益: -36.12 平均盈利: -1.64 typeA: -0.45 胜率: 27.27%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     59
      盈利次数:       21
      亏损次数:       38
      胜率:          35.59%
      总收益:        44.33 USDT
      期末余额:      1032.53 USDT
      盈亏比:        1.21
      最大单笔盈利:  41.85
      最大单笔亏损:  -15.67
      手续费:       23.580556359851684
      =============================
    
profit: 32.534568847489254
maxDrawdown 7.7%
startTime: 2022-03-27 00:00:00
趋势空且增强 总交易次数: 18 盈利: 141.6595538452337 亏损: -68.57755753825815 最大盈利: 41.85 最大亏损: -11.89 总收益: 73.08 平均盈利: 4.06 typeA: 1.80 胜率: 44.44%
趋势多且增强 总交易次数: 41 盈利: 112.20158165915434 亏损: -140.9490091186378 最大盈利: 34.95 最大亏损: -15.67 总收益: -28.75 平均盈利: -0.70 typeA: -0.22 胜率: 31.71%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     36
      盈利次数:       12
      亏损次数:       24
      胜率:          33.33%
      总收益:        -3.76 USDT
      期末余额:      989.04 USDT
      盈亏比:        0.98
      最大单笔盈利:  82.15
      最大单笔亏损:  -38.65
      手续费:       14.372655384911926
      =============================
    
profit: -10.958148732278005
maxDrawdown 7.9%
startTime: 2022-04-26 00:00:00
趋势空且增强 总交易次数: 23 盈利: 166.0865250313859 亏损: -100.60372022668052 最大盈利: 82.15 最大亏损: -19.85 总收益: 65.48 平均盈利: 2.85 typeA: 1.11 胜率: 39.13%
趋势多且增强 总交易次数: 13 盈利: 18.36869189219692 亏损: -87.60964542917897 最大盈利: 9.58 最大亏损: -38.65 总收益: -69.24 平均盈利: -5.33 typeA: -1.23 胜率: 23.08%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     37
      盈利次数:       10
      亏损次数:       27
      胜率:          27.03%
      总收益:        -79.37 USDT
      期末余额:      913.23 USDT
      盈亏比:        0.49
      最大单笔盈利:  15.60
      最大单笔亏损:  -15.16
      手续费:       14.801248614971742
      =============================
    
profit: -86.77074852339081
maxDrawdown 8.7%
startTime: 2022-05-26 00:00:00
趋势多且增强 总交易次数: 22 盈利: 60.14329698465916 亏损: -97.39993686698723 最大盈利: 15.60 最大亏损: -15.16 总收益: -37.26 平均盈利: -1.69 typeA: -0.54 胜率: 31.82%
趋势空且增强 总交易次数: 15 盈利: 16.86379955561437 亏损: -58.977908196675585 最大盈利: 8.04 最大亏损: -14.71 总收益: -42.11 平均盈利: -2.81 typeA: -0.56 胜率: 20.00%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     41
      盈利次数:       13
      亏损次数:       28
      胜率:          31.71%
      总收益:        -16.13 USDT
      期末余额:      975.67 USDT
      盈亏比:        0.90
      最大单笔盈利:  56.56
      最大单笔亏损:  -12.76
      手续费:       16.3960244262226
      =============================
    
profit: -24.33348311738507
maxDrawdown 7.2%
startTime: 2022-06-25 00:00:00
趋势空且增强 总交易次数: 17 盈利: 83.69579517163073 亏损: -81.12439603271272 最大盈利: 56.56 最大亏损: -12.76 总收益: 2.57 平均盈利: 0.15 typeA: 0.05 胜率: 35.29%
趋势多且增强 总交易次数: 24 盈利: 61.92130608312981 亏损: -80.62618833943098 最大盈利: 20.83 最大亏损: -11.01 总收益: -18.70 平均盈利: -0.78 typeA: -0.23 胜率: 29.17%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     44
      盈利次数:       16
      亏损次数:       28
      胜率:          36.36%
      总收益:        28.32 USDT
      期末余额:      1019.52 USDT
      盈亏比:        1.22
      最大单笔盈利:  62.94
      最大单笔亏损:  -9.78
      手续费:       17.58948204463277
      =============================
    
profit: 19.522079776093392
maxDrawdown 7.9%
startTime: 2022-07-25 00:00:00
趋势空且增强 总交易次数: 20 盈利: 102.1920538329563 亏损: -61.3324143706826 最大盈利: 62.94 最大亏损: -6.78 总收益: 40.86 平均盈利: 2.04 typeA: 0.72 胜率: 35.00%
趋势多且增强 总交易次数: 24 盈利: 52.86657183181295 亏损: -65.40413151799098 最大盈利: 18.81 最大亏损: -9.78 总收益: -12.54 平均盈利: -0.52 typeA: -0.20 胜率: 37.50%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     40
      盈利次数:       12
      亏损次数:       28
      胜率:          30.00%
      总收益:        36.46 USDT
      期末余额:      1028.26 USDT
      盈亏比:        1.30
      最大单笔盈利:  79.29
      最大单笔亏损:  -14.33
      手续费:       16.192951588742183
      =============================
    
profit: 28.260681666530445
maxDrawdown 4.5%
startTime: 2022-08-24 00:00:00
趋势空且增强 总交易次数: 13 盈利: 85.30039875487003 亏损: -48.04458441377711 最大盈利: 79.29 最大亏损: -14.33 总收益: 37.26 平均盈利: 2.87 typeA: 1.10 胜率: 38.46%
趋势多且增强 总交易次数: 27 盈利: 72.41513669799802 亏损: -73.21026937255901 最大盈利: 22.56 最大亏损: -8.78 总收益: -0.80 平均盈利: -0.03 typeA: -0.01 胜率: 25.93%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     46
      盈利次数:       13
      亏损次数:       33
      胜率:          28.26%
      总收益:        -48.72 USDT
      期末余额:      942.08 USDT
      盈亏比:        0.59
      最大单笔盈利:  20.63
      最大单笔亏损:  -14.33
      手续费:       18.402243187502012
      =============================
    
profit: -57.91905611248774
maxDrawdown 8.0%
startTime: 2022-09-23 00:00:00
趋势多且增强 总交易次数: 22 盈利: 35.600085358680026 亏损: -54.1476929785629 最大盈利: 16.58 最大亏损: -12.60 总收益: -18.55 平均盈利: -0.84 typeA: -0.23 胜率: 27.27%
趋势空且增强 总交易次数: 24 盈利: 34.45053158510978 亏损: -64.62198007771255 最大盈利: 20.63 最大亏损: -14.33 总收益: -30.17 平均盈利: -1.26 typeA: -0.37 胜率: 29.17%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     42
      盈利次数:       8
      亏损次数:       34
      胜率:          19.05%
      总收益:        -183.57 USDT
      期末余额:      807.83 USDT
      盈亏比:        0.47
      最大单笔盈利:  52.77
      最大单笔亏损:  -35.69
      手续费:       17.030522619668275
      =============================
    
profit: -192.17272663022402
maxDrawdown 24.4%
startTime: 2022-10-23 00:00:00
趋势多且增强 总交易次数: 20 盈利: 93.67546423027225 亏损: -108.93776415425339 最大盈利: 38.45 最大亏损: -22.44 总收益: -15.26 平均盈利: -0.76 typeA: -0.19 胜率: 25.00%
趋势空且增强 总交易次数: 22 盈利: 69.08806569840768 亏损: -237.39849240464832 最大盈利: 52.77 最大亏损: -35.69 总收益: -168.31 平均盈利: -7.65 typeA: -1.04 胜率: 13.64%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     45
      盈利次数:       11
      亏损次数:       34
      胜率:          24.44%
      总收益:        -131.25 USDT
      期末余额:      859.75 USDT
      盈亏比:        0.27
      最大单笔盈利:  16.24
      最大单笔亏损:  -12.82
      手续费:       18.0013128660327
      =============================
    
profit: -140.25114788151814
maxDrawdown 14.7%
startTime: 2022-11-22 00:00:00
趋势多且增强 总交易次数: 25 盈利: 33.24945227203993 亏损: -96.08063614751438 最大盈利: 16.24 最大亏损: -12.82 总收益: -62.83 平均盈利: -2.51 typeA: -0.60 胜率: 24.00%
趋势空且增强 总交易次数: 20 盈利: 14.274011172979701 亏损: -82.69397517902141 最大盈利: 6.58 最大亏损: -11.51 总收益: -68.42 平均盈利: -3.42 typeA: -0.86 胜率: 25.00%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     42
      盈利次数:       7
      亏损次数:       35
      胜率:          16.67%
      总收益:        -77.26 USDT
      期末余额:      914.34 USDT
      盈亏比:        0.44
      最大单笔盈利:  24.48
      最大单笔亏损:  -16.11
      手续费:       16.796886540111174
      =============================
    
profit: -85.66490808813467
maxDrawdown 10.3%
startTime: 2022-12-22 00:00:00
趋势空且增强 总交易次数: 18 盈利: 32.10472233731013 亏损: -62.36041346149811 最大盈利: 24.48 最大亏损: -8.16 总收益: -30.26 平均盈利: -1.68 typeA: -0.28 胜率: 16.67%
趋势多且增强 总交易次数: 24 盈利: 29.23920624399701 亏损: -76.24842320794174 最大盈利: 14.71 最大亏损: -16.11 总收益: -47.01 平均盈利: -1.96 typeA: -0.33 胜率: 16.67%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     45
      盈利次数:       10
      亏损次数:       35
      胜率:          22.22%
      总收益:        -78.54 USDT
      期末余额:      912.46 USDT
      盈亏比:        0.47
      最大单笔盈利:  28.40
      最大单笔亏损:  -16.11
      手续费:       17.98999857705795
      =============================
    
profit: -87.54419228760878
maxDrawdown 9.2%
startTime: 2023-01-21 00:00:00
趋势空且增强 总交易次数: 14 盈利: 37.799462545450105 亏损: -50.374956753538015 最大盈利: 28.40 最大亏损: -6.12 总收益: -12.58 平均盈利: -0.90 typeA: -0.13 胜率: 14.29%
趋势多且增强 总交易次数: 31 盈利: 30.628116448839418 亏损: -96.59681452835824 最大盈利: 9.08 最大亏损: -16.11 总收益: -65.97 平均盈利: -2.13 typeA: -0.55 胜率: 25.81%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     37
      盈利次数:       10
      亏损次数:       27
      胜率:          27.03%
      总收益:        -40.21 USDT
      期末余额:      952.39 USDT
      盈亏比:        0.65
      最大单笔盈利:  19.44
      最大单笔亏损:  -15.20
      手续费:       14.800119161888361
      =============================
    
profit: -47.61365586866941
maxDrawdown 6.6%
startTime: 2023-02-20 00:00:00
趋势多且增强 总交易次数: 15 盈利: 21.70497019773817 亏损: -40.81061205748031 最大盈利: 19.44 最大亏损: -7.65 总收益: -19.11 平均盈利: -1.27 typeA: -0.25 胜率: 20.00%
趋势空且增强 总交易次数: 22 盈利: 54.13322898746762 亏损: -75.24124299639332 最大盈利: 18.77 最大亏损: -15.20 总收益: -21.11 平均盈利: -0.96 typeA: -0.31 胜率: 31.82%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     46
      盈利次数:       12
      亏损次数:       34
      胜率:          26.09%
      总收益:        -90.44 USDT
      期末余额:      900.36 USDT
      盈亏比:        0.52
      最大单笔盈利:  25.58
      最大单笔亏损:  -20.21
      手续费:       18.390497401918164
      =============================
    
profit: -99.6434593958395
maxDrawdown 11.0%
startTime: 2023-03-22 00:00:00
趋势空且增强 总交易次数: 17 盈利: 46.662426842952264 亏损: -66.93578663251094 最大盈利: 25.58 最大亏损: -8.36 总收益: -20.27 平均盈利: -1.19 typeA: -0.21 胜率: 17.65%
趋势多且增强 总交易次数: 29 盈利: 51.43892573233287 亏损: -121.6090253386114 最大盈利: 19.93 最大亏损: -20.21 总收益: -70.17 平均盈利: -2.42 typeA: -0.75 胜率: 31.03%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     41
      盈利次数:       7
      亏损次数:       34
      胜率:          17.07%
      总收益:        -28.02 USDT
      期末余额:      963.78 USDT
      盈亏比:        0.70
      最大单笔盈利:  27.76
      最大单笔亏损:  -8.80
      手续费:       16.39352305715338
      =============================
    
profit: -36.217001516222126
maxDrawdown 5.8%
startTime: 2023-04-21 00:00:00
趋势空且增强 总交易次数: 17 盈利: 51.58279702519528 亏损: -48.700923014628515 最大盈利: 27.76 最大亏损: -8.80 总收益: 2.88 平均盈利: 0.17 typeA: 0.03 胜率: 17.65%
趋势多且增强 总交易次数: 24 盈利: 15.063933116873466 亏损: -45.9628086436606 最大盈利: 9.88 最大亏损: -5.16 总收益: -30.90 平均盈利: -1.29 typeA: -0.21 胜率: 16.67%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     52
      盈利次数:       11
      亏损次数:       41
      胜率:          21.15%
      总收益:        -23.04 USDT
      期末余额:      966.56 USDT
      盈亏比:        0.72
      最大单笔盈利:  32.59
      最大单笔亏损:  -5.52
      手续费:       20.8079800143426
      =============================
    
profit: -33.44182444043031
maxDrawdown 4.0%
startTime: 2023-05-21 00:00:00
趋势多且增强 总交易次数: 31 盈利: 45.308437639379 亏损: -37.878050618604604 最大盈利: 32.59 最大亏损: -5.52 总收益: 7.43 平均盈利: 0.24 typeA: 0.05 胜率: 22.58%
趋势空且增强 总交易次数: 21 盈利: 14.020797843873764 亏损: -44.49300930507575 最大盈利: 5.01 最大亏损: -4.56 总收益: -30.47 平均盈利: -1.45 typeA: -0.28 胜率: 19.05%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     54
      盈利次数:       8
      亏损次数:       46
      胜率:          14.81%
      总收益:        -107.48 USDT
      期末余额:      881.72 USDT
      盈亏比:        0.30
      最大单笔盈利:  16.90
      最大单笔亏损:  -8.07
      手续费:       21.60641219096066
      =============================
    
profit: -118.2841295557447
maxDrawdown 12.1%
startTime: 2023-06-20 00:00:00
趋势多且增强 总交易次数: 22 盈利: 23.675239061393356 亏损: -60.37715866580774 最大盈利: 16.90 最大亏损: -7.21 总收益: -36.70 平均盈利: -1.67 typeA: -0.15 胜率: 9.09%
趋势空且增强 总交易次数: 32 盈利: 22.489929139740013 亏损: -93.27213909106783 最大盈利: 9.14 最大亏损: -8.07 总收益: -70.78 平均盈利: -2.21 typeA: -0.41 胜率: 18.75%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     49
      盈利次数:       15
      亏损次数:       34
      胜率:          30.61%
      总收益:        116.89 USDT
      期末余额:      1107.09 USDT
      盈亏比:        2.02
      最大单笔盈利:  84.43
      最大单笔亏损:  -12.54
      手续费:       19.58006464837545
      =============================
    
profit: 107.08645454444081
maxDrawdown 7.8%
startTime: 2023-07-20 00:00:00
趋势空且增强 总交易次数: 23 盈利: 163.82453007459145 亏损: -55.23025708913704 最大盈利: 84.43 最大亏损: -12.18 总收益: 108.59 平均盈利: 4.72 typeA: 1.64 胜率: 34.78%
趋势多且增强 总交易次数: 26 盈利: 67.74610656215124 亏损: -59.45392500316254 最大盈利: 39.68 最大亏损: -12.54 总收益: 8.29 平均盈利: 0.32 typeA: 0.09 胜率: 26.92%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     55
      盈利次数:       10
      亏损次数:       45
      胜率:          18.18%
      总收益:        -60.83 USDT
      期末余额:      928.17 USDT
      盈亏比:        0.40
      最大单笔盈利:  13.16
      最大单笔亏损:  -7.39
      手续费:       21.997350508910777
      =============================
    
profit: -71.82834650079133
maxDrawdown 8.2%
startTime: 2023-08-19 00:00:00
趋势空且增强 总交易次数: 22 盈利: 19.015984801899368 亏损: -41.71141342887884 最大盈利: 13.16 最大亏损: -6.57 总收益: -22.70 平均盈利: -1.03 typeA: -0.14 胜率: 13.64%
趋势多且增强 总交易次数: 33 盈利: 21.949898781468157 亏损: -60.08281665527725 最大盈利: 11.12 最大亏损: -7.39 总收益: -38.13 平均盈利: -1.16 typeA: -0.25 胜率: 21.21%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     42
      盈利次数:       11
      亏损次数:       31
      胜率:          26.19%
      总收益:        -20.71 USDT
      期末余额:      970.69 USDT
      盈亏比:        0.68
      最大单笔盈利:  11.12
      最大单笔亏损:  -6.89
      手续费:       17.004798231607076
      =============================
    
profit: -29.31447572772879
maxDrawdown 3.7%
startTime: 2023-09-18 00:00:00
趋势多且增强 总交易次数: 23 盈利: 32.630723496225706 亏损: -31.39115137461223 最大盈利: 11.12 最大亏损: -5.49 总收益: 1.24 平均盈利: 0.05 typeA: 0.01 胜率: 26.09%
趋势空且增强 总交易次数: 19 盈利: 10.643363940986122 亏损: -32.5974117903264 最大盈利: 4.91 最大亏损: -6.89 总收益: -21.95 平均盈利: -1.16 typeA: -0.30 胜率: 26.32%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     48
      盈利次数:       18
      亏损次数:       30
      胜率:          37.50%
      总收益:        41.48 USDT
      期末余额:      1031.88 USDT
      盈亏比:        1.32
      最大单笔盈利:  41.19
      最大单笔亏损:  -15.92
      手续费:       19.21555197161635
      =============================
    
profit: 31.88370379630942
maxDrawdown 4.5%
startTime: 2023-10-18 00:00:00
趋势多且增强 总交易次数: 32 盈利: 146.66243124386736 亏损: -88.64576023039005 最大盈利: 41.19 最大亏损: -15.92 总收益: 58.02 平均盈利: 1.81 typeA: 0.85 胜率: 46.88%
趋势空且增强 总交易次数: 16 盈利: 24.077752556000362 亏损: -40.610719773166046 最大盈利: 19.84 最大亏损: -8.32 总收益: -16.53 平均盈利: -1.03 typeA: -0.19 胜率: 18.75%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     49
      盈利次数:       11
      亏损次数:       38
      胜率:          22.45%
      总收益:        -77.60 USDT
      期末余额:      912.60 USDT
      盈亏比:        0.63
      最大单笔盈利:  69.76
      最大单笔亏损:  -33.12
      手续费:       19.60191206688773
      =============================
    
profit: -87.39600799681045
maxDrawdown 11.5%
startTime: 2023-11-17 00:00:00
趋势多且增强 总交易次数: 34 盈利: 102.61790934314166 亏损: -138.52896671257184 最大盈利: 69.76 最大亏损: -33.12 总收益: -35.91 平均盈利: -1.06 typeA: -0.25 胜率: 23.53%
趋势空且增强 总交易次数: 15 盈利: 27.467628623793424 亏损: -69.152579251171 最大盈利: 16.98 最大亏损: -9.60 总收益: -41.68 平均盈利: -2.78 typeA: -0.56 胜率: 20.00%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     48
      盈利次数:       15
      亏损次数:       33
      胜率:          31.25%
      总收益:        -37.74 USDT
      期末余额:      952.66 USDT
      盈亏比:        0.75
      最大单笔盈利:  29.93
      最大单笔亏损:  -12.45
      手续费:       19.185918817475162
      =============================
    
profit: -47.3378955615766
maxDrawdown 8.0%
startTime: 2023-12-17 00:00:00
趋势空且增强 总交易次数: 21 盈利: 80.82543478283148 亏损: -63.894241449234165 最大盈利: 29.93 最大亏损: -12.45 总收益: 16.93 平均盈利: 0.81 typeA: 0.31 胜率: 38.10%
趋势多且增强 总交易次数: 27 盈利: 30.483860834340994 亏损: -85.15294972951283 最大盈利: 14.19 最大亏损: -10.96 总收益: -54.67 平均盈利: -2.02 typeA: -0.53 胜率: 25.93%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     39
      盈利次数:       12
      亏损次数:       27
      胜率:          30.77%
      总收益:        29.25 USDT
      期末余额:      1021.45 USDT
      盈亏比:        1.36
      最大单笔盈利:  40.65
      最大单笔亏损:  -10.87
      手续费:       15.593549931489457
      =============================
    
profit: 21.45263869785606
maxDrawdown 3.2%
startTime: 2024-01-16 00:00:00
趋势空且增强 总交易次数: 16 盈利: 66.46436222487043 亏损: -35.00916698074487 最大盈利: 40.65 最大亏损: -5.63 总收益: 31.46 平均盈利: 1.97 typeA: 0.49 胜率: 25.00%
趋势多且增强 总交易次数: 23 盈利: 44.82114096057729 亏损: -47.02369750684518 最大盈利: 14.68 最大亏损: -10.87 总收益: -2.20 平均盈利: -0.10 typeA: -0.03 胜率: 34.78%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     48
      盈利次数:       14
      亏损次数:       34
      胜率:          29.17%
      总收益:        -30.82 USDT
      期末余额:      959.58 USDT
      盈亏比:        0.90
      最大单笔盈利:  119.60
      最大单笔亏损:  -46.99
      手续费:       19.229354119626233
      =============================
    
profit: -40.416541243442225
maxDrawdown 12.4%
startTime: 2024-02-15 00:00:00
趋势多且增强 总交易次数: 25 盈利: 238.0045286456412 亏损: -180.2253814830284 最大盈利: 119.60 最大亏损: -28.06 总收益: 57.78 平均盈利: 2.31 typeA: 0.92 胜率: 40.00%
趋势空且增强 总交易次数: 23 盈利: 36.0223551073706 亏损: -124.61804351342302 最大盈利: 23.37 最大亏损: -46.99 总收益: -88.60 平均盈利: -3.85 typeA: -0.67 胜率: 17.39%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     41
      盈利次数:       13
      亏损次数:       28
      胜率:          31.71%
      总收益:        -76.02 USDT
      期末余额:      915.78 USDT
      盈亏比:        0.67
      最大单笔盈利:  47.61
      最大单笔亏损:  -22.56
      手续费:       16.400029548361807
      =============================
    
profit: -84.21745531603005
maxDrawdown 13.9%
startTime: 2024-03-16 00:00:00
趋势空且增强 总交易次数: 16 盈利: 71.2521269730548 亏损: -108.44150727818575 最大盈利: 47.61 最大亏损: -20.65 总收益: -37.19 平均盈利: -2.32 typeA: -0.44 胜率: 18.75%
趋势多且增强 总交易次数: 25 盈利: 80.07348019536603 亏损: -118.90155520626331 最大盈利: 41.34 最大亏损: -22.56 总收益: -38.83 平均盈利: -1.55 typeA: -0.62 胜率: 40.00%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     36
      盈利次数:       13
      亏损次数:       23
      胜率:          36.11%
      总收益:        70.33 USDT
      期末余额:      1063.13 USDT
      盈亏比:        1.61
      最大单笔盈利:  55.85
      最大单笔亏损:  -13.59
      手续费:       14.415795568286605
      =============================
    
profit: 63.12975992862289
maxDrawdown 6.1%
startTime: 2024-04-15 00:00:00
趋势多且增强 总交易次数: 23 盈利: 142.96552650531146 亏损: -69.31948038001708 最大盈利: 55.85 最大亏损: -13.59 总收益: 73.65 平均盈利: 3.20 typeA: 1.39 胜率: 43.48%
趋势空且增强 总交易次数: 13 盈利: 43.15677660132788 亏损: -46.47306279799744 最大盈利: 31.04 最大亏损: -9.05 总收益: -3.32 平均盈利: -0.26 typeA: -0.06 胜率: 23.08%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     30
      盈利次数:       10
      亏损次数:       20
      胜率:          33.33%
      总收益:        -12.90 USDT
      期末余额:      981.10 USDT
      盈亏比:        0.85
      最大单笔盈利:  19.61
      最大单笔亏损:  -9.71
      手续费:       12.002369576178323
      =============================
    
profit: -18.89981023153655
maxDrawdown 2.9%
startTime: 2024-05-15 00:00:00
趋势多且增强 总交易次数: 12 盈利: 31.012701951937885 亏损: -30.937976877828063 最大盈利: 13.73 最大亏损: -8.72 总收益: 0.07 平均盈利: 0.01 typeA: 0.00 胜率: 33.33%
趋势空且增强 总交易次数: 18 盈利: 43.24777287670226 亏损: -56.22230818234729 最大盈利: 19.61 最大亏损: -9.71 总收益: -12.97 平均盈利: -0.72 typeA: -0.24 胜率: 33.33%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     44
      盈利次数:       13
      亏损次数:       31
      胜率:          29.55%
      总收益:        -39.15 USDT
      期末余额:      952.05 USDT
      盈亏比:        0.76
      最大单笔盈利:  37.75
      最大单笔亏损:  -29.81
      手续费:       17.591725017945993
      =============================
    
profit: -47.94538320764309
maxDrawdown 6.3%
startTime: 2024-06-14 00:00:00
趋势空且增强 总交易次数: 17 盈利: 71.51008992094043 亏损: -69.39836175558246 最大盈利: 37.75 最大亏损: -11.40 总收益: 2.11 平均盈利: 0.12 typeA: 0.04 胜率: 35.29%
趋势多且增强 总交易次数: 27 盈利: 55.749986569524026 亏损: -97.00709794252309 最大盈利: 15.57 最大亏损: -29.81 总收益: -41.26 平均盈利: -1.53 typeA: -0.40 胜率: 25.93%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     45
      盈利次数:       12
      亏损次数:       33
      胜率:          26.67%
      总收益:        -73.11 USDT
      期末余额:      917.89 USDT
      盈亏比:        0.54
      最大单笔盈利:  16.01
      最大单笔亏损:  -13.79
      手续费:       18.00804982250434
      =============================
    
profit: -82.11494152891419
maxDrawdown 8.2%
startTime: 2024-07-14 00:00:00
趋势多且增强 总交易次数: 26 盈利: 47.623730536672696 亏损: -64.75023435106914 最大盈利: 11.18 最大亏损: -10.21 总收益: -17.13 平均盈利: -0.66 typeA: -0.23 胜率: 34.62%
趋势空且增强 总交易次数: 19 盈利: 39.16815160147777 亏损: -95.15658931599307 最大盈利: 16.01 最大亏损: -13.79 总收益: -55.99 平均盈利: -2.95 typeA: -0.47 胜率: 15.79%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     42
      盈利次数:       10
      亏损次数:       32
      胜率:          23.81%
      总收益:        41.91 USDT
      期末余额:      1033.31 USDT
      盈亏比:        1.35
      最大单笔盈利:  53.98
      最大单笔亏损:  -9.61
      手续费:       16.977310082829263
      =============================
    
profit: 33.312886377163295
maxDrawdown 3.5%
startTime: 2024-08-13 00:00:00
趋势空且增强 总交易次数: 18 盈利: 122.43892655331919 亏损: -44.15266141827128 最大盈利: 53.98 最大亏损: -9.61 总收益: 78.29 平均盈利: 4.35 typeA: 1.45 胜率: 33.33%
趋势多且增强 总交易次数: 24 盈利: 39.10974368312594 亏损: -75.4831224410085 最大盈利: 19.03 最大亏损: -8.04 总收益: -36.37 平均盈利: -1.52 typeA: -0.25 胜率: 16.67%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     45
      盈利次数:       11
      亏损次数:       34
      胜率:          24.44%
      总收益:        -17.43 USDT
      期末余额:      973.57 USDT
      盈亏比:        0.86
      最大单笔盈利:  34.53
      最大单笔亏损:  -14.67
      手续费:       17.993831787622664
      =============================
    
profit: -26.427952869212845
maxDrawdown 6.0%
startTime: 2024-09-12 00:00:00
趋势空且增强 总交易次数: 10 盈利: 48.0584932832773 亏损: -38.85278218667857 最大盈利: 34.53 最大亏损: -14.67 总收益: 9.21 平均盈利: 0.92 typeA: 0.18 胜率: 20.00%
趋势多且增强 总交易次数: 35 盈利: 63.191902988335016 亏损: -89.82556695414439 最大盈利: 12.34 最大亏损: -7.96 总收益: -26.63 平均盈利: -0.76 typeA: -0.20 胜率: 25.71%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     49
      盈利次数:       19
      亏损次数:       30
      胜率:          38.78%
      总收益:        160.23 USDT
      期末余额:      1150.43 USDT
      盈亏比:        1.81
      最大单笔盈利:  73.00
      最大单笔亏损:  -33.27
      手续费:       19.639846581087983
      =============================
    
profit: 150.43036848176848
maxDrawdown 7.1%
startTime: 2024-10-12 00:00:00
趋势多且增强 总交易次数: 34 盈利: 309.6369105953936 亏损: -131.822280656009 最大盈利: 73.00 最大亏损: -33.27 总收益: 177.81 平均盈利: 5.23 typeA: 2.31 胜率: 44.12%
趋势空且增强 总交易次数: 15 盈利: 47.79133115365705 亏损: -65.37559261127093 最大盈利: 24.16 最大亏损: -11.81 总收益: -17.58 平均盈利: -1.17 typeA: -0.31 胜率: 26.67%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     34
      盈利次数:       13
      亏损次数:       21
      胜率:          38.24%
      总收益:        -38.32 USDT
      期末余额:      954.88 USDT
      盈亏比:        0.84
      最大单笔盈利:  72.70
      最大单笔亏损:  -33.88
      手续费:       13.59449619664745
      =============================
    
profit: -45.118122593707994
maxDrawdown 16.5%
startTime: 2024-11-11 00:00:00
趋势空且增强 总交易次数: 15 盈利: 133.90833189113474 亏损: -138.91103716926912 最大盈利: 72.70 最大亏损: -33.88 总收益: -5.00 平均盈利: -0.33 typeA: -0.13 胜率: 40.00%
趋势多且增强 总交易次数: 19 盈利: 65.34582584349417 亏损: -98.66124315906632 最大盈利: 42.78 最大亏损: -33.27 总收益: -33.32 平均盈利: -1.75 typeA: -0.65 胜率: 36.84%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     44
      盈利次数:       9
      亏损次数:       35
      胜率:          20.45%
      总收益:        -92.02 USDT
      期末余额:      899.18 USDT
      盈亏比:        0.44
      最大单笔盈利:  33.51
      最大单笔亏损:  -14.59
      手续费:       17.61201795940667
      =============================
    
profit: -100.81546638882651
maxDrawdown 10.1%
startTime: 2024-12-11 00:00:00
趋势多且增强 总交易次数: 20 盈利: 36.4610122130612 亏损: -52.0155265459248 最大盈利: 12.35 最大亏损: -7.10 总收益: -15.55 平均盈利: -0.78 typeA: -0.23 胜率: 30.00%
趋势空且增强 总交易次数: 24 盈利: 36.83096922461806 亏损: -113.29192128057853 最大盈利: 33.51 最大亏损: -14.59 总收益: -76.46 平均盈利: -3.19 typeA: -0.40 胜率: 12.50%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     37
      盈利次数:       12
      亏损次数:       25
      胜率:          32.43%
      总收益:        -51.51 USDT
      期末余额:      941.09 USDT
      盈亏比:        0.73
      最大单笔盈利:  38.16
      最大单笔亏损:  -27.16
      手续费:       14.794818046912424
      =============================
    
profit: -58.907691559858335
maxDrawdown 8.2%
startTime: 2025-01-10 00:00:00
趋势空且增强 总交易次数: 17 盈利: 95.11022006679565 亏损: -107.61359441515805 最大盈利: 38.16 最大亏损: -27.16 总收益: -12.50 平均盈利: -0.74 typeA: -0.26 胜率: 35.29%
趋势多且增强 总交易次数: 20 盈利: 44.756951789682205 亏损: -83.76126900117626 最大盈利: 14.31 最大亏损: -14.50 总收益: -39.00 平均盈利: -1.95 typeA: -0.59 胜率: 30.00%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     48
      盈利次数:       11
      亏损次数:       37
      胜率:          22.92%
      总收益:        13.39 USDT
      期末余额:      1003.79 USDT
      盈亏比:        1.08
      最大单笔盈利:  59.38
      最大单笔亏损:  -12.51
      手续费:       19.174997063162483
      =============================
    
profit: 3.785378741235263
maxDrawdown 4.5%
startTime: 2025-02-09 00:00:00
趋势空且增强 总交易次数: 20 盈利: 138.99589046519276 亏损: -68.99356296322541 最大盈利: 59.38 最大亏损: -10.61 总收益: 70.00 平均盈利: 3.50 typeA: 1.23 胜率: 35.00%
趋势多且增强 总交易次数: 28 盈利: 37.115257741305165 亏损: -93.73220650203464 最大盈利: 30.33 最大亏损: -12.51 总收益: -56.62 平均盈利: -2.02 typeA: -0.29 胜率: 14.29%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     37
      盈利次数:       12
      亏损次数:       25
      胜率:          32.43%
      总收益:        12.18 USDT
      期末余额:      1004.78 USDT
      盈亏比:        1.09
      最大单笔盈利:  71.32
      最大单笔亏损:  -11.83
      手续费:       14.792754172108307
      =============================
    
profit: 4.783498197192671
maxDrawdown 5.8%
startTime: 2025-03-11 00:00:00
趋势空且增强 总交易次数: 15 盈利: 90.67706498345606 亏损: -65.76878853041379 最大盈利: 71.32 最大亏损: -11.09 总收益: 24.91 平均盈利: 1.66 typeA: 0.44 胜率: 26.67%
趋势多且增强 总交易次数: 22 盈利: 57.07052530362129 亏损: -69.79530355946939 最大盈利: 19.12 最大亏损: -11.83 总收益: -12.72 平均盈利: -0.58 typeA: -0.21 胜率: 36.36%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     45
      盈利次数:       13
      亏损次数:       32
      胜率:          28.89%
      总收益:        -27.27 USDT
      期末余额:      963.73 USDT
      盈亏比:        0.82
      最大单笔盈利:  36.97
      最大单笔亏损:  -22.91
      手续费:       18.016324230840166
      =============================
    
profit: -36.27009492641969
maxDrawdown 5.1%
startTime: 2025-04-10 00:00:00
趋势多且增强 总交易次数: 25 盈利: 110.0786094952822 亏损: -83.40125448098604 最大盈利: 36.97 最大亏损: -22.91 总收益: 26.68 平均盈利: 1.07 typeA: 0.38 胜率: 36.00%
趋势空且增强 总交易次数: 20 盈利: 10.079636610892122 亏损: -64.02708655160602 最大盈利: 4.19 最大亏损: -7.21 总收益: -53.95 平均盈利: -2.70 typeA: -0.54 胜率: 20.00%
Loaded 3000 15m candles
[]

      ========== 回测结果 ==========
      总交易次数:     43
      盈利次数:       15
      亏损次数:       28
      胜率:          34.88%
      总收益:        54.19 USDT
      期末余额:      1045.39 USDT
      盈亏比:        1.43
      最大单笔盈利:  49.36
      最大单笔亏损:  -13.39
      手续费:       17.412618394408735
      =============================
    
profit: 45.38583728168669
maxDrawdown 4.0%
startTime: 2025-05-10 00:00:00
趋势多且增强 总交易次数: 21 盈利: 103.6749352394939 亏损: -44.94231042233703 最大盈利: 49.36 最大亏损: -7.20 总收益: 58.73 平均盈利: 2.80 typeA: 1.07 胜率: 38.10%
趋势空且增强 总交易次数: 22 盈利: 76.11248348364099 亏损: -80.65927101910926 最大盈利: 25.94 最大亏损: -13.39 总收益: -4.55 平均盈利: -0.21 typeA: -0.07 胜率: 31.82%

          ========== 回测结果 ==========
          总交易次数:     2351
    盈利次数:       657
    亏损次数:       1694
          胜率:          27.95%
          总收益:        -604.16 USDT
          盈亏比:        0.94
    rw:        0.0146
    rl:        0.0060
    carry:        -2.99
          =============================

tradeNumTotal 2351
profitTotal -1075.7633144399463
maxLossTotal -74.8
winRateTotal 1521.5000000000005
period month 54
avgRate 28.18
maxDrawdownTotal 35.9
趋势多且增强 总交易次数: 1330 盈利: 5365.9763940176035 亏损: -5176.342165417656 最大盈利: 215.85 最大亏损: -64.39 总收益: 189.63 平均盈利: 0.14 typeA: 0.04 胜率: 30.08%
趋势空且增强 总交易次数: 1021 盈利: 4244.488623421947 亏损: -5038.286166461715 最大盈利: 173.39 最大亏损: -74.80 总收益: -793.80 平均盈利: -0.78 typeA: -0.20 胜率: 25.17%

    #######################################################



    
          ========== 回测结果 ==========
          总交易次数:     40
    盈利次数:       17
    亏损次数:       23
          胜率:          42.50%
          总收益:        148.52 USDT
          盈亏比:        2.56
    rw:        0.0143
    rl:        0.0042
    carry:        62.16
          =============================

tradeNumTotal 40
profitTotal 140.51913598381952
maxLossTotal -7.2
winRateTotal 42.5
period month 1
avgRate 42.50
maxDrawdownTotal 1.6
趋势多且增强 总交易次数: 20 盈利: 162.74168264873404 亏损: -42.0006080678844 最大盈利: 49.36 最大亏损: -7.20 总收益: 120.74 平均盈利: 6.04 typeA: 2.72 胜率: 45.00%
趋势空且增强 总交易次数: 20 盈利: 81.27633206408274 亏损: -53.49827066111112 最大盈利: 25.94 最大亏损: -6.50 总收益: 27.78 平均盈利: 1.39 typeA: 0.56 胜率: 40.00%

###############################################################



          ========== 回测结果 ==========
          总交易次数:     1205
    盈利次数:       585
    亏损次数:       620
          胜率:          48.55%
          总收益:        5819.38 USDT
          盈亏比:        1.27
    rw:        0.0457
    rl:        0.0354
    carry:        2.43
          =============================

tradeNumTotal 1205
profitTotal 5570.78365479359
maxLossTotal -280.24
winRateTotal 2639.8399999999997
period month 54
avgRate 48.89
maxDrawdownTotal 61.6
趋势多且增强 总交易次数: 841 盈利: 21602.077285492815 亏损: -15752.45226067992 最大盈利: 1658.09 最大亏损: -280.24 总收益: 5849.63 平均盈利: 6.96 typeA: 3.50 胜率: 50.30%
趋势空且增强 总交易次数: 364 盈利: 5846.694000475439 亏损: -5876.935370494675 最大盈利: 286.01 最大亏损: -195.24 总收益: -30.24 平均盈利: -0.08 typeA: -0.04 胜率: 44.51%

        ========== 回测结果 ==========
          总交易次数:     2437
    盈利次数:       846
    亏损次数:       1591
          胜率:          34.71%
          总收益:        4957.77 USDT
          盈亏比:        1.17
    rw:        0.0406
    rl:        0.0185
    carry:        2.64
          =============================

tradeNumTotal 2437
profitTotal 4464.172042917134
maxLossTotal -325.64
winRateTotal 1902.1700000000003
period month 54
avgRate 35.23
maxDrawdownTotal 55
趋势多且增强 总交易次数: 1205 盈利: 19081.360963187246 亏损: -13752.730012972503 最大盈利: 793.69 最大亏损: -265.71 总收益: 5328.63 平均盈利: 4.42 typeA: 1.44 胜率: 32.61%
趋势空且增强 总交易次数: 1232 盈利: 15387.935056931057 亏损: -15758.793964228636 最大盈利: 303.92 最大亏损: -325.64 总收益: -370.86 平均盈利: -0.30 typeA: -0.11 胜率: 36.77%



       ========== 回测结果 ==========
          总交易次数:     3242
    盈利次数:       1185
    亏损次数:       2057
          胜率:          36.55%
          总收益:        7022.16 USDT
          盈亏比:        1.22
    rw:        0.0328
    rl:        0.0157
    carry:        3.96
          =============================

tradeNumTotal 3242
profitTotal 6366.962095066783
maxLossTotal -337.84
winRateTotal 1992.8000000000002
period month 54
avgRate 36.90
maxDrawdownTotal 67.5
趋势多且增强-R-2-3 总交易次数: 186 盈利: 2621.6301461740313 亏损: -1356.79998288693 最大盈利: 474.60 最大亏损: -56.66 总收益: 1264.83 平均盈利: 6.80 typeA: 2.34 胜率: 34.41%
趋势多且增强-L-1 总交易次数: 960 盈利: 14534.51552453407 亏损: -11095.44559839191 最大盈利: 793.69 最大亏损: -113.58 总收益: 3439.07 平均盈利: 3.58 typeA: 1.22 胜率: 34.17%
趋势多且增强-R-2-2 总交易次数: 172 盈利: 2131.135434065479 亏损: -1387.7911413533088 最大盈利: 435.57 最大亏损: -57.30 总收益: 743.34 平均盈利: 4.32 typeA: 1.13 胜率: 26.16%
趋势多且增强-R-2-4 总交易次数: 284 盈利: 3051.4289201629 亏损: -2020.4835441674832 最大盈利: 686.95 最大亏损: -193.76 总收益: 1030.95 平均盈利: 3.63 typeA: 1.10 胜率: 30.28%
趋势多且增强-R-2-1 总交易次数: 199 盈利: 2676.3093421072426 亏损: -2254.3821971866096 最大盈利: 444.78 最大亏损: -170.11 总收益: 421.93 平均盈利: 2.12 typeA: 0.71 胜率: 33.67%
趋势空且增强-R-1-2 总交易次数: 230 盈利: 2834.172484120026 亏损: -2575.4561233174845 最大盈利: 214.51 最大亏损: -108.09 总收益: 258.72 平均盈利: 1.12 typeA: 0.45 胜率: 40.00%
趋势空且增强-R-1-4 总交易次数: 740 盈利: 5635.933544523791 亏损: -5493.890317925748 最大盈利: 213.76 最大亏损: -201.35 总收益: 142.04 平均盈利: 0.19 typeA: 0.08 胜率: 40.41%
趋势空且增强-R-1-1 总交易次数: 165 盈利: 2959.8537791432923 亏损: -3031.3340192209107 最大盈利: 303.92 最大亏损: -337.84 总收益: -71.48 平均盈利: -0.43 typeA: -0.20 胜率: 45.45%
趋势空且增强-R-1-3 总交易次数: 295 盈利: 2757.0844606581763 亏损: -2909.176168548746 最大盈利: 120.78 最大亏损: -161.94 总收益: -152.09 平均盈利: -0.52 typeA: -0.22 胜率: 43.05%
趋势空且增强-L-1-4 总交易次数: 11 盈利: 8.786821000849905 亏损: -63.92926842383875 最大盈利: 6.04 最大亏损: -20.39 总收益: -55.14 平均盈利: -5.01 typeA: -0.91 胜率: 18.18%

*/
